// Семенихин 23.04.2019 +++++
Процедура ЗапланироватьЗвонкиПриглашенияНаТО(Параметры = Неопределено)  Экспорт
	//ТекущаяДата = Дата(2018, 5, 30);
	ТекущаяДата = НачалоДня(ТекущаяДата());
	ДатаТО = ТекущаяДата + 1209600; // 3600 * 24 * 14
	
	ЗапросПриглашения = Новый Запрос();
	ЗапросПриглашения.УстановитьПараметр("Владелец", Перечисления.ДополнительнаяИнформацияАвтомобилей.Хозяин);
	ЗапросПриглашения.УстановитьПараметр("ПустаяСсылка", Документы.ЗаказНаряд.ПустаяСсылка());
	ЗапросПриглашения.УстановитьПараметр("ДатаТО", ДатаТО);
	ЗапросПриглашения.Текст = "ВЫБРАТЬ
	                          |	ИсторияТехОбслуживания.Автомобиль,
	                          |	ИсторияТехОбслуживания.НомерТО,
	                          |	АвтомобилиСрезПоследних.Значение КАК Владелец,
	                          |	ИсторияТехОбслуживания.ДатаТО,
	                          |	ИсторияТехОбслуживания.ПодразделениеТО КАК ПодразделениеТО
	                          |ИЗ
	                          |	РегистрСведений.ИсторияТехОбслуживания КАК ИсторияТехОбслуживания
	                          |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.Автомобили.СрезПоследних(, ВидЗначения = &Владелец) КАК АвтомобилиСрезПоследних
	                          |		ПО ИсторияТехОбслуживания.Автомобиль = АвтомобилиСрезПоследних.Автомобиль
	                          |ГДЕ
	                          |	ИсторияТехОбслуживания.ЗаказНарядТО = &ПустаяСсылка
	                          |	И ИсторияТехОбслуживания.ДатаТО = &ДатаТО
	                          |ИТОГИ ПО
	                          |	ПодразделениеТО";
	
	мДолжности = Новый Массив();
	мДолжности.Добавить(Справочники.Должности.МастерПриемщик);
	мДолжности.Добавить(Справочники.Должности.ОператорСервисБюро);
	ГруппаМКЦ = Справочники.Сотрудники.НайтиПоКоду("ЦБ0002711");
	Если обЗначениеНеЗаполнено(ГруппаМКЦ) Тогда
		ГруппаМКЦ = Справочники.Сотрудники.ПустаяСсылка();
	КонецЕсли;
	ЗапросСотрудники = Новый Запрос();
	ЗапросСотрудники.УстановитьПараметр("ТекущаяДата", ТекущаяДата);
	ЗапросСотрудники.УстановитьПараметр("СписокДолжностей", мДолжности);
	ЗапросСотрудники.УстановитьПараметр("ГруппаМКЦ", ГруппаМКЦ);
	ЗапросСотрудники.Текст = "ВЫБРАТЬ
	                         |	Сотрудники.Ссылка КАК Сотрудник
	                         |ИЗ
	                         |	Справочник.Сотрудники КАК Сотрудники
	                         |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ГрафикРаботКалендарный КАК ГрафикРаботКалендарный
	                         |		ПО Сотрудники.ГрафикРаботы = ГрафикРаботКалендарный.График
	                         |ГДЕ
	                         |	Сотрудники.Подразделение В ИЕРАРХИИ(&ГруппаПодразделений)
	                         |	И Сотрудники.Должность В(&СписокДолжностей)
	                         |	И ГрафикРаботКалендарный.Дата = &ТекущаяДата
	                         |	И ГрафикРаботКалендарный.ВидДня = ЗНАЧЕНИЕ(Перечисление.ВидДня.Рабочий)
	                         |	И Сотрудники.Родитель <> &ГруппаМКЦ";
	
	ПриглашенияПоПодразделениям = ЗапросПриглашения.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	ГСЧ = Новый ГенераторСлучайныхЧисел(255);
	Пока ПриглашенияПоПодразделениям.Следующий() Цикл
		Подразделение = ПриглашенияПоПодразделениям.ПодразделениеТО;
		Если обЗначениеНеЗаполнено(Подразделение) Тогда
			Продолжить;
		ИначеЕсли Подразделение.Родитель = Справочники.ПодразделенияКомпании.ОсновноеПодразделение Тогда
			ГруппаПодразделений = Подразделение;
		Иначе
			ГруппаПодразделений = Подразделение.Родитель;
		КонецЕсли;
		
		ЗапросСотрудники.УстановитьПараметр("ГруппаПодразделений", ГруппаПодразделений);
		СписокСотрудников = ЗапросСотрудники.Выполнить().Выгрузить();
		
		ПриглашенияПоАвтомобилям = ПриглашенияПоПодразделениям.Выбрать();
		Пока ПриглашенияПоАвтомобилям.Следующий() Цикл
			ПредставлениеТелефона = ПриглашенияПоАвтомобилям.Владелец.ОсновнойТелефон;
			Если ЗначениеЗаполнено(ПредставлениеТелефона) Тогда
				РабочийЛистСервиса = НайтиРабочийЛистСервиса(Подразделение, ПредставлениеТелефона);
			Иначе
				Продолжить;
			КонецЕсли;

			Если ЗначениеЗаполнено(РабочийЛистСервиса) Тогда
				РабочийЛистНайден = Истина;
			Иначе
				РабочийЛистНайден = Ложь;	
				РабочийЛистСервиса = СоздатьРабочийЛистСервиса(ПриглашенияПоАвтомобилям, СписокСотрудников, ТекущаяДата);
			КонецЕсли;
			
			Если обЗначениеНеЗаполнено(РабочийЛистСервиса) Тогда
				Продолжить;
			КонецЕсли;
	
			СобытиеОбъект = Документы.Событие.СоздатьДокумент();
			СобытиеОбъект.Заполнить(РабочийЛистСервиса);
			СобытиеОбъект.ДокументОснование = РабочийЛистСервиса;
			
		 	СобытиеОбъект.Автор = СобытиеОбъект.ПодразделениеКомпании.РуководительСервиса;
			Если РабочийЛистНайден Тогда
				КоличествоСотрудников = СписокСотрудников.Количество();
				Если КоличествоСотрудников = 0 Тогда
					СобытиеОбъект.Продавец = СобытиеОбъект.Автор.Сотрудник;
				ИначеЕсли КоличествоСотрудников = 1 Тогда
					СобытиеОбъект.Продавец = СписокСотрудников[0].Сотрудник;
				Иначе
					Индекс = ГСЧ.СлучайноеЧисло(0, КоличествоСотрудников - 1);
					СобытиеОбъект.Продавец = СписокСотрудников[Индекс].Сотрудник;
				КонецЕсли;
			КонецЕсли;
			
			СобытиеОбъект.ВидСобытия = Перечисления.ВидыСобытий.ТелефонныйЗвонок;
			СобытиеОбъект.ТипСообщения = Перечисления.ТипыСообщений.Исходящее;
			СобытиеОбъект.Состояние = Перечисления.СостоянияСобытий.Запланировано;
			СобытиеОбъект.Приоритет = Перечисления.Важность.Высокая;
			
			СобытиеОбъект.ДатаНачала = ТекущаяДата + 36000;
			СобытиеОбъект.ДатаОкончания = СобытиеОбъект.ДатаНачала + 900;
			СобытиеОбъект.ОбработкаРеквизита("ДатаНачала");
			СобытиеОбъект.Содержание = "Пригласить клиента на ТО-" + ПриглашенияПоАвтомобилям.НомерТО +
			", запланированное на " + Формат(ПриглашенияПоАвтомобилям.ДатаТО, "ДЛФ=ДД");
			СобытиеОбъект.ИсточникИнформации = Справочники.ИсточникиИнформации.ЛичныйВизит;
			СобытиеОбъект.Комментарий = "Звонок создан автоматически по даным о запланированном ТО";
			СобытиеОбъект.ВторичныйКонтакт = РабочийЛистНайден;
			
			НовСтрока = СобытиеОбъект.Автомобили.Добавить();
			НовСтрока.Автомобиль = ПриглашенияПоАвтомобилям.Автомобиль;
			НовСтрока.Количество = 1;
		 	 
		    НайдМен = Справочники.Пользователи.НайтиПоРеквизиту("Сотрудник", СобытиеОбъект.Продавец);
		    Если НайдМен <> Неопределено Тогда
		    	НовСтрока = СобытиеОбъект.Пользователи.Добавить();
		     	НовСтрока.Пользователь =  НайдМен;
		    	НовСтрока.Ответственный=Истина;
		  	КонецЕсли; 
		 	
			Попытка
				СобытиеОбъект.Записать(РежимЗаписиДокумента.Проведение);
			Исключение
				#Если Клиент Тогда
				Сообщить("Ошибка при создании события!" + Символы.ПС + ОписаниеОшибки(), СтатусСообщения.ОченьВажное);
				#КонецЕсли
			КонецПопытки; 
		КонецЦикла;				
	КонецЦикла;
КонецПроцедуры

Функция СоздатьРабочийЛистСервиса(ПриглашенияПоАвтомобилям, СписокСотрудников, ТекущаяДата)
	РабочийЛист = Документы.РабочийЛистСервиса.СоздатьДокумент();		
	РабочийЛист.Дата = ТекущаяДата();
	Подразделение = ПриглашенияПоАвтомобилям.ПодразделениеТО;
	РабочийЛист.ПодразделениеКомпании = Подразделение;
	РабочийЛист.Организация = Подразделение.Организация;
	РабочийЛист.ХозОперация = Справочники.ХозОперации.РабочийЛистСервиса;
	
	РабочийЛист.Автор = Подразделение.РуководительСервиса;
	Если обЗначениеНеЗаполнено(РабочийЛист.Автор) Тогда
		РабочийЛист.Автор = ПараметрыСеанса.Пользователь;
	КонецЕсли;
	
	КоличествоСотрудников = СписокСотрудников.Количество();
	Если КоличествоСотрудников = 0 Тогда
		РабочийЛист.Менеджер = Подразделение.РуководительСервиса.Сотрудник;
	ИначеЕсли КоличествоСотрудников = 1 Тогда
		РабочийЛист.Менеджер = СписокСотрудников[0].Сотрудник;
	Иначе
		ГСЧ = Новый ГенераторСлучайныхЧисел(255);
		Индекс = ГСЧ.СлучайноеЧисло(0, КоличествоСотрудников - 1);
		РабочийЛист.Менеджер = СписокСотрудников[Индекс].Сотрудник;
	КонецЕсли;
	
	РабочийЛист.Контрагент = ПриглашенияПоАвтомобилям.Владелец;
	РабочийЛист.УчастникПрограммыПроактивныйКонтакт = РабочийЛист.Контрагент.СогласиеНаУчастиеВПрограммеПроактивныйКонтакт = Перечисления.ВариантыОтветов.Да;
	Если ЗначениеЗаполнено(РабочийЛист.Контрагент.Пол) Тогда
		РабочийЛист.Пол = РабочийЛист.Контрагент.Пол;
	Иначе
		РабочийЛист.Пол = Перечисления.ПолФизическихЛиц.НеУказан;
	КонецЕсли;
	Если ЗначениеЗаполнено(РабочийЛист.Контрагент.ФормаСобственности) Тогда
		РабочийЛист.ЮридическоеЛицо = Не РабочийЛист.Контрагент.ФормаСобственности = Перечисления.ФормыСобственности.ЧастноеЛицо;
	КонецЕсли;
	
	РабочийЛист.Автомобиль = ПриглашенияПоАвтомобилям.Автомобиль;
	РабочийЛист.VIN = ПриглашенияПоАвтомобилям.Автомобиль.VIN;
	РабочийЛист.Модель = РабочийЛист.Автомобиль.Модель;
	РабочийЛист.Статус = Справочники.СтатусыРабочегоЛиста.Создан;
	
	РабочийЛист.ВидКонтакта = Перечисления.ВидыСобытий.ТелефонныйЗвонок;
	РабочийЛист.ПредставлениеТелефона = РабочийЛист.Контрагент.ОсновнойТелефон;
	Если обЗначениеНеЗаполнено(РабочийЛист.ПредставлениеТелефона) Тогда
		РабочийЛист.ПредставлениеТелефона = киПолучитьПредставлениеКИ(РабочийЛист.Контрагент, Справочники.ВидыКонтактнойИнформации.ТелефонКонтактный);
	КонецЕсли;					
	Если обЗначениеНеЗаполнено(РабочийЛист.ПредставлениеТелефона) Тогда
		РабочийЛист.ПредставлениеТелефона = киПолучитьПредставлениеКИ(РабочийЛист.Контрагент, Справочники.ВидыКонтактнойИнформации.ТелефонСотовый);
	КонецЕсли;					
	Если Не ЗначениеЗаполнено(РабочийЛист.ПредставлениеТелефона) Тогда
		РабочийЛист.ПредставлениеТелефона = "<не указан>";
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Подразделение.РуководительСервиса) Тогда
		РабочийЛист.РуководительМенеджера = Подразделение.РуководительСервиса.Сотрудник;
	КонецЕсли;
	
	РабочийЛист.Пользователи.Очистить();			
	Если ЗначениеЗаполнено(РабочийЛист.Автор) Тогда
		СтрокаПользователь = РабочийЛист.Пользователи.Добавить();
		СтрокаПользователь.Пользователь	= РабочийЛист.Автор; 			
	КонецЕсли;
	
	РабочийЛист.Реклама = Справочники.ИсточникиИнформации.ЛичныйВизит;
	РабочийЛист.ПричинаОбращения = "Приглашение клиента на ТО-" + ПриглашенияПоАвтомобилям.НомерТО;
	РабочийЛист.ДатаКонтакта = ТекущаяДата;
	РабочийЛист.КонтактнаяИнформацияПроактивногоКонтакта = "ТО-" + ПриглашенияПоАвтомобилям.НомерТО + " для автомобиля клиента запланировано на " + Формат(ПриглашенияПоАвтомобилям.ДатаТО, "ДЛФ=Д");
	РабочийЛист.Комментарий = "Рабочий лист создан автоматически по даным о запланированном ТО";
	
	//РабочийЛист.ОбменДанными.Загрузка = Истина;
	Попытка
		РабочийЛист.Записать(РежимЗаписиДокумента.Проведение);
		Возврат РабочийЛист.Ссылка;
	Исключение
		#Если Клиент Тогда
		Сообщить("Ошибка при создании Рабочего листа сервиса!" + Символы.ПС + ОписаниеОшибки(), СтатусСообщения.ОченьВажное);
		#КонецЕсли
		Возврат Документы.РабочийЛистСервиса.ПустаяСсылка();
	КонецПопытки;
КонецФункции

Функция НайтиРабочийЛистСервиса(ПодразделениеКомпании, ПредставлениеТелефона)  Экспорт
	СписокСтатусов = Новый Массив();
	СписокСтатусов.Добавить(Справочники.СтатусыРабочегоЛиста.Интерес);
	СписокСтатусов.Добавить(Справочники.СтатусыРабочегоЛиста.Создан);
	СписокСтатусов.Добавить(Справочники.СтатусыРабочегоЛиста.Сделка);
	
	Подразделение = ПодразделениеКомпании.Родитель;
	Если обЗначениеНеЗаполнено(Подразделение) Или Подразделение = Справочники.ПодразделенияКомпании.ОсновноеПодразделение Тогда
		Подразделение = ПодразделениеКомпании;
	КонецЕсли;
	ДатаНачала = НачалоДня(ТекущаяДата() - 1209600); // за 14 дней
	
	ЗапросРЛ = Новый Запрос();
	ЗапросРЛ.УстановитьПараметр("ПредставлениеТелефона",  СокрЛП(ПредставлениеТелефона));
	ЗапросРЛ.УстановитьПараметр("Подразделение", Подразделение);
	ЗапросРЛ.УстановитьПараметр("ДатаНачала", ДатаНачала);
	ЗапросРЛ.УстановитьПараметр("СписокСтатусов", СписокСтатусов);
		
	ЗапросРЛ.Текст =
	"ВЫБРАТЬ
	|	РабочийЛистСервиса.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.РабочийЛистСервиса КАК РабочийЛистСервиса
	|ГДЕ
	|	РабочийЛистСервиса.ПредставлениеТелефона = &ПредставлениеТелефона
	|	И РабочийЛистСервиса.ПодразделениеКомпании В ИЕРАРХИИ(&Подразделение)
	|	И РабочийЛистСервиса.Проведен = ИСТИНА
	|	И НЕ РабочийЛистСервиса.ПометкаУдаления
	|	И РабочийЛистСервиса.Дата > &ДатаНачала
	|	И РабочийЛистСервиса.Статус В(&СписокСтатусов)
	|
	|УПОРЯДОЧИТЬ ПО
	|	РабочийЛистСервиса.ДатаИзменения УБЫВ";
	
 	РезультатРабочийЛистСервиса = ЗапросРЛ.Выполнить();
	Если РезультатРабочийЛистСервиса.Пустой() Тогда
		Возврат Документы.РабочийЛистСервиса.ПустаяСсылка();
		
	Иначе
		ВыборкаРабочийЛистСервиса = РезультатРабочийЛистСервиса.Выбрать();
		Если ВыборкаРабочийЛистСервиса.Следующий() Тогда
			Возврат ВыборкаРабочийЛистСервиса.Ссылка;
		Иначе
			Возврат Документы.РабочийЛистСервиса.ПустаяСсылка();
		КонецЕсли;
	КонецЕсли;
КонецФункции
// Семенихин 25.06.2025 -----

Процедура ПроверкаНачалаОбслуживания(Параметры = Неопределено) Экспорт
	
	ТекущаяДата = ТекущаяДата();
	КонецПериода = ТекущаяДата - 900;
	НачалоПериода = КонецПериода - 1200; // запас = 5 минут 
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	ЗаявкаНаРемонт.Ссылка,
	|	ЗаявкаНаРемонт.Дата,
	|	ЗаявкаНаРемонт.Диспетчер
	|ИЗ
	|	Документ.ЗаявкаНаРемонт КАК ЗаявкаНаРемонт
	|ГДЕ
	|	ЗаявкаНаРемонт.ДатаНачала МЕЖДУ &НачалоПериода И &КонецПериода
	|	И ЗаявкаНаРемонт.ХозОперация = &Опреация";
	Запрос.УстановитьПараметр("НачалоПериода", НачалоПериода);
	Запрос.УстановитьПараметр("КонецПериода", КонецПериода);
	Запрос.УстановитьПараметр("Опреация", Справочники.ХозОперации.ПланРемонта);
	
	ПланыРемонта = Запрос.Выполнить().Выгрузить();
	Для Каждого ПланРемонта Из ПланыРемонта Цикл
		
		ЗаказНарядСоздан = Ложь;	
		ВыборкаЗН = Документы.ЗаказНаряд.Выбрать(ПланРемонта.Дата, ТекущаяДата);
		Пока ВыборкаЗН.Следующий() Цикл
			Если ВыборкаЗН.ДокументОснование = ПланРемонта.Ссылка Тогда
				ЗаказНарядСоздан = Истина;
				Прервать;
			КонецЕсли;
		КонецЦикла;
		
		Если Не ЗаказНарядСоздан Тогда
			Пользователь = Справочники.Пользователи.НайтиПоРеквизиту("Сотрудник", ПланРемонта.Диспетчер);
			Если Пользователь <> Неопределено И Не Пользователь.Пустая() Тогда
				НаборЗаписей = РегистрыСведений.Напоминания.СоздатьНаборЗаписей();
				Запись = НаборЗаписей.Добавить();
				Запись.Автор = Справочники.Пользователи.Робот;
				Запись.Пользователь = Пользователь;
				Запись.Объект = ПланРемонта.Ссылка;
				Запись.РеальнаяДатаОповещения = ТекущаяДата;
				Запись.ДатаНачала = ТекущаяДата;
				Запись.ТипПериода = "00";
				Запись.УдалитьПоИстеченииСрока = Истина;
				Запись.Тема = "Проверка начала обслуживания клиента";
				Запись.Описание = "С момента начала работ прошло 15 минут, однако соответствующий заказ-наряд ещё не создан!";
				НаборЗаписей.Записать();
			КонецЕсли;
		КонецЕсли;
		
	КонецЦикла;
КонецПроцедуры

Процедура СоставлениеСпискаНеликвидов(Параметры = Неопределено) Экспорт
	Запрос = Новый Запрос();
	Запрос.Текст = "ВЫБРАТЬ
	               |	ПартииТоваровКомпании.Номенклатура,
	               |	СУММА(ПартииТоваровКомпании.Количество) КАК КоличествоРасход,
	               |	0 КАК КоличествоОстаток
	               |ПОМЕСТИТЬ ОстаткиИРасход
	               |ИЗ
	               |	РегистрНакопления.ПартииТоваровКомпании КАК ПартииТоваровКомпании
	               |ГДЕ
	               |	ПартииТоваровКомпании.Период МЕЖДУ &ДатаНачала И &ДатаОкончания
	               |	И ПартииТоваровКомпании.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	               |	И НЕ ПартииТоваровКомпании.Регистратор ССЫЛКА Документ.ПеремещениеТоваров
	               |	И ВЫБОР
	               |			КОГДА ПартииТоваровКомпании.Регистратор ССЫЛКА Документ.РеализацияТоваров
	               |				ТОГДА НЕ ПартииТоваровКомпании.Регистратор.Контрагент.НашаФирма
	               |			ИНАЧЕ ИСТИНА
	               |		КОНЕЦ
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ПартииТоваровКомпании.Номенклатура
	               |
	               |ИМЕЮЩИЕ
	               |	СУММА(ПартииТоваровКомпании.Количество) > 0
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	ПартииТоваровКомпанииОстатки.Номенклатура,
	               |	0,
	               |	СУММА(ПартииТоваровКомпанииОстатки.КоличествоОстаток)
	               |ИЗ
	               |	РегистрНакопления.ПартииТоваровКомпании.Остатки(&ДатаНачала, ) КАК ПартииТоваровКомпанииОстатки
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ПартииТоваровКомпанииОстатки.Номенклатура
	               |
	               |ИМЕЮЩИЕ
	               |	СУММА(ПартииТоваровКомпанииОстатки.КоличествоОстаток) > 0
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |	ОстаткиИРасход.Номенклатура
	               |ИЗ
	               |	ОстаткиИРасход КАК ОстаткиИРасход
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ОстаткиИРасход.Номенклатура
	               |
	               |ИМЕЮЩИЕ
	               |	СУММА(ОстаткиИРасход.КоличествоРасход) = 0";
				   
	ДатаОкончания = ТекущаяДата();
	ДатаНачала = ДобавитьМесяц(ДатаОкончания, -12); 
	Запрос.УстановитьПараметр("ДатаНачала", ДатаНачала);
	Запрос.УстановитьПараметр("ДатаОкончания", ДатаОкончания);
	
    СписокНеликвидов = Запрос.Выполнить().Выгрузить();
	НаборНеликвидов = РегистрыСведений.УценкаТоваров.СоздатьНаборЗаписей();
	НаборНеликвидов.Загрузить(СписокНеликвидов);
	НаборНеликвидов.Записать();
КонецПроцедуры

// + КМ
Процедура СоздатьРабочиеЛистыПоПрограммеПроактивныйКонтакт(Параметры = Неопределено) Экспорт	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	ВидыРемонта.Ссылка КАК ВидРем
	|ПОМЕСТИТЬ ВидыРемонтаПро
	|ИЗ
	|	Справочник.ВидыРемонта КАК ВидыРемонта
	|ГДЕ
	|	ВидыРемонта.УчаствуетВПроактивномКонтакте = ИСТИНА
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	МАКСИМУМ(ЗаказНаряд.Ссылка) КАК Ссылка,
	|	ЗаказНаряд.Автомобиль
	|ПОМЕСТИТЬ ЗаказыНаряды
	|ИЗ
	|	Документ.ЗаказНаряд КАК ЗаказНаряд
	|ГДЕ
	|	ЗаказНаряд.Проведен
	|	И НЕ ЗаказНаряд.ДатаПроактивногоКонтакта = ДАТАВРЕМЯ(1, 1, 1)
	|	И ЗаказНаряд.Дата МЕЖДУ &НачПериода И &КонПериода
	|	И ЗаказНаряд.ВидРемонта В
	|			(ВЫБРАТЬ
	|				ВыбНомен.ВидРем
	|			ИЗ
	|				ВидыРемонтаПРо КАК ВыбНомен)
	|	И ЗаказНаряд.Состояние = ЗНАЧЕНИЕ(Справочник.ВидыСостоянийЗаказНарядов.Закрыт)
	|
	|СГРУППИРОВАТЬ ПО
	|	ЗаказНаряд.Автомобиль
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	РабочийЛистСервиса.Автомобиль,
	|	МАКСИМУМ(РабочийЛистСервиса.Дата) КАК Дата
	|ПОМЕСТИТЬ РабочиеЛистыПоДате
	|ИЗ
	|	Документ.РабочийЛистСервиса КАК РабочийЛистСервиса
	|ГДЕ
	|	РабочийЛистСервиса.Проведен
	|	И РабочийЛистСервиса.УчастникПрограммыПроактивныйКонтакт
	|	И РабочийЛистСервиса.Автомобиль В
	|			(ВЫБРАТЬ
	|				ЗаказыНаряды.Автомобиль
	|			ИЗ
	|				ЗаказыНаряды КАК ЗаказыНаряды)
	|
	|СГРУППИРОВАТЬ ПО
	|	РабочийЛистСервиса.Автомобиль
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Дата
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	РабочиеЛистыПоДате.Автомобиль,
	|	МАКСИМУМ(РабочийЛистСервиса.Ссылка) КАК ПоследнийРабочийЛист
	|ПОМЕСТИТЬ ПоследниеРабочиеЛисты
	|ИЗ
	|	РабочиеЛистыПоДате КАК РабочиеЛистыПоДате
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.РабочийЛистСервиса КАК РабочийЛистСервиса
	|		ПО РабочиеЛистыПоДате.Автомобиль = РабочийЛистСервиса.Автомобиль
	|			И РабочиеЛистыПоДате.Дата = РабочийЛистСервиса.Дата
	|			И (РабочийЛистСервиса.Проведен)
	|
	|СГРУППИРОВАТЬ ПО
	|	РабочиеЛистыПоДате.Автомобиль
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПоследниеРабочиеЛисты.Автомобиль
	|ПОМЕСТИТЬ АвтомобилиИсключить
	|ИЗ
	|	ПоследниеРабочиеЛисты КАК ПоследниеРабочиеЛисты
	|ГДЕ
	|	ПоследниеРабочиеЛисты.ПоследнийРабочийЛист.Статус = ЗНАЧЕНИЕ(Справочник.СтатусыРабочегоЛиста.Создан)
	//|	НЕ ПоследниеРабочиеЛисты.ПоследнийРабочийЛист.Статус В (ЗНАЧЕНИЕ(Справочник.СтатусыРабочегоЛиста.Сделка), ЗНАЧЕНИЕ(Справочник.СтатусыРабочегоЛиста.Отказ))
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЗаказыНаряды.Ссылка
	|ИЗ
	|	ЗаказыНаряды КАК ЗаказыНаряды
	|ГДЕ
	|	НЕ ЗаказыНаряды.Автомобиль В
	|				(ВЫБРАТЬ
	|					АвтомобилиИсключить.Автомобиль
	|				ИЗ
	|					АвтомобилиИсключить КАК АвтомобилиИсключить)";
	
	Запрос.УстановитьПараметр("НачПериода", НачалоДня(ТекущаяДата()));
	Запрос.УстановитьПараметр("КонПериода", КонецДня(ТекущаяДата()));
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Заказ = Выборка.Ссылка;		
		// Семенихин 09.11.2017 +++++
		Автолига = Справочники.ПодразделенияКомпании.НайтиПоКоду("ЦБ000117");
		Если Заказ.ПодразделениеКомпании = Автолига Или Заказ.ПодразделениеКомпании.ПринадлежитЭлементу(Автолига) Тогда
			Продолжить;
		КонецЕсли;
		// Семенихин 09.11.2017 -----
			
		РабочийЛист = Документы.РабочийЛистСервиса.СоздатьДокумент();
		
		РабочийЛист.Дата = ТекущаяДата();
		РабочийЛист.Организация = Заказ.Организация;
		РабочийЛист.ПодразделениеКомпании = Заказ.ПодразделениеКомпании;
		РабочийЛист.УчастникПрограммыПроактивныйКонтакт = Истина;
		РабочийЛист.Реклама = Заказ.ИсточникИнформации;
		РабочийЛист.ХозОперация = Справочники.ХозОперации.РабочийЛистСервиса;
		
		Если Константы.НазначениеРабочегоЛиста.Получить() = Перечисления.НазначениеРабочегоЛиста.Оператор Тогда
			РабочийЛист.Менеджер = Заказ.Оператор;
		Иначе
			РабочийЛист.Менеджер = Заказ.Диспетчер;
		КонецЕсли;
		
		РабочийЛист.Контрагент = Заказ.Заказчик;
		РабочийЛист.Автор = Заказ.Автор;
		РабочийЛист.Автомобиль = Заказ.Автомобиль;		
		РабочийЛист.Статус = Справочники.СтатусыРабочегоЛиста.Создан;
		РабочийЛист.ВидКонтакта = Перечисления.ВидыСобытий.ЛичнаяВстреча;
		РабочийЛист.ДокументОснование = Заказ;
		РабочийЛист.ПредставлениеТелефона = киПолучитьПредставлениеКИ(Заказ.Заказчик, Справочники.ВидыКонтактнойИнформации.ТелефонКонтактный);
		
		Если Не ЗначениеЗаполнено(РабочийЛист.ПредставлениеТелефона) Тогда
			РабочийЛист.ПредставлениеТелефона = "<не указан>";
		КонецЕсли;
		
		Если ЗначениеЗаполнено(РабочийЛист.Автомобиль) Тогда
			РабочийЛист.Модель = РабочийЛист.Автомобиль.Модель;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(РабочийЛист.Контрагент) И ЗначениеЗаполнено(РабочийЛист.Контрагент.Пол) Тогда
			РабочийЛист.Пол = РабочийЛист.Контрагент.Пол;
		Иначе
			РабочийЛист.Пол = Перечисления.ПолФизическихЛиц.НеУказан;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(РабочийЛист.Организация) И ЗначениеЗаполнено(РабочийЛист.Организация.РуководительСервиса) Тогда
			РабочийЛист.РуководительМенеджера = РабочийЛист.Организация.РуководительСервиса.Сотрудник;
		КонецЕсли;
		
		РабочийЛист.Пользователи.Очистить();
		
		Если ЗначениеЗаполнено(РабочийЛист.Автор) Тогда
			СтрокаПользователь				= РабочийЛист.Пользователи.Добавить();
			СтрокаПользователь.Пользователь	= Заказ.Автор; 			
		КонецЕсли;
		
		РабочийЛист.ПричинаОбращения = "Обращение по программе ""Проактивный контакт"" на основании документа ""Заказ-наряд"" №" + Заказ.Номер + " от " + Формат(Заказ.Дата, "ДФ=dd.MM.yyyy") + ?(ЗначениеЗаполнено(Заказ.Рекомендации), " (" + Заказ.Рекомендации + ")", "");
		РабочийЛист.ДатаКонтакта = Дата(Год(Заказ.ДатаПроактивногоКонтакта), Месяц(Заказ.ДатаПроактивногоКонтакта), День(Заказ.ДатаПроактивногоКонтакта), Час(Заказ.ВремяПроактивногоКонтакта), Минута(Заказ.ВремяПроактивногоКонтакта), Секунда(Заказ.ВремяПроактивногоКонтакта));
		РабочийЛист.КонтактнаяИнформацияПроактивногоКонтакта = Заказ.КонтактнаяИнформацияПроактивногоКонтакта;
		РабочийЛист.Комментарий = "Последнее обращение: " + Строка(Заказ.ПричинаОбращения) + Символы.ПС;
		РабочийЛист.Комментарий = РабочийЛист.Комментарий + Строка(Заказ.Ссылка);
		
		Попытка
			РабочийЛист.Записать(РежимЗаписиДокумента.Проведение);
		Исключение			
		КонецПопытки;
		
	КонецЦикла;
	
КонецПроцедуры
// - КМ

Процедура  ПроверкаЗаполненияРЛСервиса(Параметры = Неопределено) Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ЖурналСостоянийСрезПоследних.Период,
	|	ЖурналСостоянийСрезПоследних.Объект,
	|	ЖурналСостоянийСрезПоследних.Состояние,
	|	ЖурналСостоянийСрезПоследних.Объект.ДатаКонтакта,
	|	Напоминания.Объект КАК ЕстьНапоминание
	|ИЗ
	|	РегистрСведений.ЖурналСостояний.СрезПоследних(&Дата, ) КАК ЖурналСостоянийСрезПоследних
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.Напоминания КАК Напоминания
	|		ПО ЖурналСостоянийСрезПоследних.Объект = Напоминания.Объект
	|ГДЕ
	|	ЖурналСостоянийСрезПоследних.Объект ССЫЛКА Документ.РабочийЛистСервиса
	|	И ЖурналСостоянийСрезПоследних.Объект.ДатаКонтакта <> &ПустаяДата
	|	И ЖурналСостоянийСрезПоследних.Объект.ДатаКонтакта > ДАТАВРЕМЯ(2013, 1, 1, 1, 1, 1)
	|	И ЖурналСостоянийСрезПоследних.Объект.ДатаКонтакта МЕЖДУ &ДатаКонтактаНач И &ДатаКонтактаКОн
	|	И ЖурналСостоянийСрезПоследних.Объект.ДатаКонтакта <= &ДатаПроверки
	|
	|УПОРЯДОЧИТЬ ПО
	|	ЖурналСостоянийСрезПоследних.Объект.ДатаКонтакта";
	ДатаПроверки = ТекущаяДата();
	Запрос.УстановитьПараметр("Дата", ДатаПроверки);
	Запрос.УстановитьПараметр("ДатаКонтактаКОн", ДатаПроверки+300);
	Запрос.УстановитьПараметр("ДатаКонтактаНач", ДатаПроверки-300);
	Запрос.УстановитьПараметр("ДатаПроверки", ДатаПроверки);
	Запрос.УстановитьПараметр("ПустаяДата", '00010101');
	
	Результат = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = Результат.Выбрать();
	Пользователи = г_Функции.ПолучитьПользователейСПравом(ПланыВидовХарактеристик.ПраваИНастройки.СоздаватьНапоминаниеКолЦентр);
	Если Пользователи.Количество()=0 тогда
		Возврат;	
	КонецЕсли;	
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Если  ВыборкаДетальныеЗаписи.ЕстьНапоминание <> NULL тогда
			Продолжить;
		КонецЕсли;	
		
		Для Каждого РегистраторАвтор из Пользователи цикл 
			НаборЗаписейНапоминания=РегистрыСведений.Напоминания.СоздатьНаборЗаписей();
			НаборЗаписейНапоминания.Отбор.Автор.Установить(РегистраторАвтор.Объект);
			НаборЗаписейНапоминания.Отбор.Завершено.Установить(Ложь);
			НаборЗаписейНапоминания.Прочитать();
			ДатаОповещения=ТекущаяДата();
			
			ЗаписатьНапоминания = Истина;
			
			//Для каждого автора создадим напоминание
			НоваяЗапись = НаборЗаписейНапоминания.Добавить();
			//НоваяЗапись.Пользователь            = Справочники.Пользователи.НайтиПоРеквизиту("Сотрудник",ВыборкаДетальныеЗаписи.Объект.Менеджер);
			НоваяЗапись.Пользователь            = РегистраторАвтор.Объект;
			
			НоваяЗапись.Автор                   = РегистраторАвтор.Объект;
			НоваяЗапись.Завершено               = Ложь;
			НоваяЗапись.РеальнаяДатаОповещения  = ДатаОповещения;
			НоваяЗапись.Объект                  = ВыборкаДетальныеЗаписи.Объект;
			НоваяЗапись.ДатаНачала              = ДатаОповещения;
			НоваяЗапись.ДатаОповещения          = ДатаОповещения;
			НоваяЗапись.Описание                = СокрЛП(ВыборкаДетальныеЗаписи.Объект)+"! Позвоните сотруднику <"+ВыборкаДетальныеЗаписи.Объект.Менеджер+"> чтобы он связался с клиентом по рабочему листу.";
			
			НоваяЗапись.Редактирование          = Ложь;
			НоваяЗапись.Тема                    = "Обзвон по рабочему листу сервиса"; 
			НоваяЗапись.ТипПериода              = "00"; 
			НоваяЗапись.УдалитьПоИстеченииСрока = Истина; 
			
			ЗаписатьНапоминания = Истина;
			
			
			
			Попытка
				НаборЗаписейНапоминания.Записать(Истина);
			Исключение
				#Если Клиент Тогда
					Сообщить("Ошибка создания напоминаний о резервировании товаров: "+ОписаниеОшибки());
				#КонецЕсли
			КонецПопытки;
			
			
		КонецЦикла;
	КонецЦикла;
	
КонецПроцедуры

//Бондаренко++ 20210405
 Функция НайтиСоздатьСинхронизироватьДокументСчетФактураВыданный(ДокументОснование,ПометкаУдаления,ИзФормыДокумента) Экспорт

  	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СчетФактураВыданный.Ссылка,
		|	СчетФактураВыданный.ДокументОснование
		|ИЗ
		|	Документ.СчетФактураВыданный КАК СчетФактураВыданный
		|ГДЕ
		|	СчетФактураВыданный.ДокументОснование = &ДокументОснование";
	
	Запрос.УстановитьПараметр("ДокументОснование", ДокументОснование);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		СФ_объект = ВыборкаДетальныеЗаписи.Ссылка.ПолучитьОбъект();
		//Бондаренко++ 2023207
		Если СФ_объект.ДоговорВзаиморасчетов <> ДокументОснование.ДоговорВзаиморасчетов Тогда
			Попытка
				СФ_объект.Контрагент = ДокументОснование.Контрагент;
				СФ_объект.ДоговорВзаиморасчетов = ДокументОснование.ДоговорВзаиморасчетов;
				СФ_объект.Грузополучатель = ДокументОснование.Контрагент;
				СФ_объект.Записать(РежимЗаписиДокумента.Запись);
			Исключение
	 		КонецПопытки;
		КонецЕсли;            
		//Бондаренко-- 2023207
		Прервать;
	КонецЦикла;
	
	Если обЗначениеНеЗаполнено(СФ_объект) Тогда
		СФ_объект = Документы.СчетФактураВыданный.СоздатьДокумент();
 	КонецЕсли; 
 	 
 	СФ_объект.ОбработкаЗаполнения(ДокументОснование);
	СФ_объект.Номер = ДокументОснование.Номер;
	СФ_объект.Дата = ДокументОснование.Дата;
	
	Если ПометкаУдаления Тогда
		Если НЕ ИзФормыДокумента Тогда
			СФ_объект.Товары.Очистить();
 		КонецЕсли; 
 	КонецЕсли; 
 	
	Если ДокументОснование.Проведен И Не ПометкаУдаления Тогда
		Попытка
 		    Если ИзФормыДокумента Тогда
				СФ_объект.Записать(РежимЗаписиДокумента.Проведение);
				Сообщить("Проведен документ: "+СФ_объект);			
 			Иначе
				СФ_объект.Записать(РежимЗаписиДокумента.Запись);
				Сообщить("Записан документ: "+СФ_объект);			
 			КонецЕсли;  
 		Исключение
			Сообщить("ОШИБКА! Не удалось "+?(ИзФормыДокумента,"провести","записать")+" документ: "+СФ_объект,СтатусСообщения.ОченьВажное);		
		КонецПопытки;
 	Иначе
		Попытка
		    СФ_объект.Записать(РежимЗаписиДокумента.ОтменаПроведения);
			Сообщить("Записан непроведенный документ: "+СФ_объект);		
 		Исключение
			Сообщить("ОШИБКА! Не удалось записать непроведённый документ: "+СФ_объект,СтатусСообщения.ОченьВажное);		
		КонецПопытки;
	КонецЕсли;
 	
	Возврат СФ_объект.Ссылка;

КонецФункции // НайтиСоздатьСинхронизироватьДокументСчетФактураВыданный(ДокументОснование)
//Бондаренко-- 20210405

//Бондаренко++ 20210517
Функция СформироватьНадписьПоДоверенности(ДокументСсылка,Сотрудник,ИмяПечатнойФормы) Экспорт
	
	НоваяНадписьОДоверенности = "";
	
	Если обЗначениеНеЗаполнено(ДокументСсылка) Тогда
		Возврат НоваяНадписьОДоверенности;
 	КонецЕсли; 
	
	Если обЗначениеНеЗаполнено(Сотрудник) Тогда
		Возврат НоваяНадписьОДоверенности;
 	КонецЕсли; 
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПодтверждающиеДокументы.Ссылка,
		|	ПодтверждающиеДокументы.Владелец КАК Владелец,
		|	ПодтверждающиеДокументы.ВидПодтверждающегоДокумента,
		|	ПодтверждающиеДокументы.Организация,
		|	ПодтверждающиеДокументы.КемВыдан,
		|	ПодтверждающиеДокументы.Текущий,
		|	ПодтверждающиеДокументы.Серия,
		|	ПодтверждающиеДокументы.Номер,
		|	ПодтверждающиеДокументы.ДатаВыдачи,
		|	ПодтверждающиеДокументы.ДатаОкончания,
		|	ПодтверждающиеДокументы.ПометкаУдаления
		|ИЗ
		|	Справочник.ПодтверждающиеДокументы КАК ПодтверждающиеДокументы
		|ГДЕ
		|	ПодтверждающиеДокументы.Владелец = &Владелец
		|	И ПодтверждающиеДокументы.ВидПодтверждающегоДокумента = ЗНАЧЕНИЕ(Перечисление.ВидыДокументов.Доверенность)
		|	И ПодтверждающиеДокументы.Текущий = ИСТИНА
		|	И ПодтверждающиеДокументы.ПометкаУдаления = ЛОЖЬ
		|	И ПодтверждающиеДокументы.Организация = &Организация";
	
  	Запрос.УстановитьПараметр("Владелец", Сотрудник);
	Запрос.УстановитьПараметр("Организация", ДокументСсылка.Организация);	
 
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		НоваяНадписьОДоверенности = ", по доверенности №"+ВыборкаДетальныеЗаписи.Номер+" от "+Формат(ВыборкаДетальныеЗаписи.ДатаВыдачи,"ДФ=dd.MM.yy");	 
	КонецЦикла;
	
	Если Не обЗначениеНеЗаполнено(НоваяНадписьОДоверенности) Тогда
		Возврат НоваяНадписьОДоверенности;
	КонецЕсли;
	
	ДатаКП = Дата(1,1,1);
	
	Попытка
	    ДатаКП = ДокументСсылка.ДоговорВзаиморасчетов.ДатаКП;
	 Исключение
		//	
	КонецПопытки;
	
	Если Не обЗначениеНеЗаполнено(ДатаКП) Тогда
		Если обЗначениеНеЗаполнено(ДокументСсылка.ДоговорВзаиморасчетов.НомерДоговора) Тогда
			НомерДоверенности = СокрЛП(ДокументСсылка.Номер);
		Иначе
			НомерДоверенности = СокрЛП(ДокументСсылка.ДоговорВзаиморасчетов.НомерДоговора);
	 	КонецЕсли; 
		НоваяНадписьОДоверенности = ", по доверенности №"+НомерДоверенности+" от "+Формат(ДатаКП,"ДФ=dd.MM.yy");
	Иначе
		НоваяНадписьОДоверенности = ", по доверенности №"+СокрЛП(ДокументСсылка.Номер)+" от "+Формат(ДокументСсылка.Дата,"ДФ=dd.MM.yy");
	  КонецЕсли; 
 	
	Возврат НоваяНадписьОДоверенности;
 
КонецФункции // СформироватьНадписьПоДоверенности(ДокументСсылка,Сотрудник,ИмяПечатнойФормы)

Функция ПолучитьКассираСДоверенностью(Организация,СотрудникКассир) Экспорт	
	
	КассирПредставление = "";
	
	Запрос = Новый Запрос();
	Запрос.УстановитьПараметр("ВидДокумента", Перечисления.ВидыДокументов.Доверенность);
	Запрос.УстановитьПараметр("Владелец", СотрудникКассир);
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.Текст = "ВЫБРАТЬ
	               |	ПодтверждающиеДокументы.Наименование
	               |ИЗ
	               |	Справочник.ПодтверждающиеДокументы КАК ПодтверждающиеДокументы
	               |ГДЕ
	               |	ПодтверждающиеДокументы.ВидПодтверждающегоДокумента = &ВидДокумента
	               |	И ПодтверждающиеДокументы.Владелец = &Владелец
	               |	И ПодтверждающиеДокументы.Организация = &Организация
	               |	И ПодтверждающиеДокументы.Текущий
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	ПодтверждающиеДокументы.ДатаВыдачи УБЫВ";
	
	Рез1 = Запрос.Выполнить().Выбрать();
	Если Рез1.Следующий() Тогда
 		КассирПредставление =  СотрудникКассир.Наименование + " (" + Рез1.Наименование + ")";
 	КонецЕсли;

	Возврат КассирПредставление;

КонецФункции
 
Функция daСклонение(_Выражение, _Падеж = "И", _Род = "", _Режим = "ФИО", _ФорматнаяСтрока = "") Экспорт
	//(c) daMaster 2015
	//mailto: damasterprog@yandex.ru
	//
	//СИНТАКСИС
	//        daСклонение(_Выражение, _Падеж, _Род, _Режим, _ФорматнаяСтрока);
	//            _Выражение      - склоняемое выражение
	//            _Падеж          - падеж склонения, буква или цифра: "И" = 1, "Р" = 2, "В" = 3, "Д" = 4, "Т" = 5, "П" = 6
	//            _Род          - род склоняемого выражения, буква или цифра: "М" = 1, "Ж" = 2, "С" = 3, "Н" = 4
	//            _Режим         - режим работы функции, определяется типом склоняемого выражения
	//            _ФорматнаяСтрока - определяет формат и регистр выводимого результата
	//
    
    _Версия = "12.02.2015";
    
    //ТАБЛИЦЫ ПРАВИЛ СКЛОНЕНИЯ
    //в колонке "Окончания" указывается перечень окончаний, для которых действует данное правило, разделитель "/", в конце также ставится разделитель
    //алгоритм ищет строки с окончаниями последовательно, при совпадении останавливается, поэтому более узкое правило ("РВИН") должно следовать выше, чем широкое ("ИН")
    //если окончание не найдено в таблице правил - такое слово не склоняется
    //колонка "Обрезка" определяет, сколько символов с конца слова обрезать, перед добавлением окончания из колонки падежа ("Р", "Д", "В", "Т", "П")
    _ПравилаФ = //Фамилия
    //Род;    Окончания;                                            Обрезка;    Р;        Д;        В;        Т;        П;        Комментарий   
    //символ "*" перед окончанием означает, что данное окончание сравнивается не с концом слова, а с целым словом ("*ГРИН" сработает только на Грин, а "ГРИН" - и на "Грин", и на "Багрин")
    "М-;    *ГРИН/*ЧАПЛИН/РВИН/*БИН/;                            0;            а;        у;        а;        ом;        е;        Грин, Дарвин, Чаплин - исключения, чтобы пройти тест gramota.ru )
    //в колонке "Род" указывается один литерал рода ("М", "Ж", "С"), если окончание позволяет однозначно определить род ("Петров" - "М", "Ильина" - "Ж")
    |Ж;        ЕВА/ЁВА/ИНА/ОВА/ЫНА/;                                1;            ой;        ой;        у;        ой;        ой;
    |М;        ЕВ/ЁВ/ИН/ОВ/ЫН/;                                    0;            а;        у;        а;        ым;        е;
    |М;        ЧИЙ/ШИЙ/ЩИЙ/;                                        2;            его;    ему;    его;    им;        ем;        Осадчий, Старший, Вещий
    |Ж;        ЧАЯ/ШАЯ/ЩАЯ/;                                        2;            ей;        ей;        ую;        ей;        ей;     Осадчая, Старшая, Вещая
    |Ж;        АЯ/;                                                2;            ой;        ой;        ую;        ой;        ой;     Крутая
    |Ж;        ЯЯ/;                                                2;            ей;        ей;        юю;        ей;        ей;     Верхняя
    //"М-" в колонке "Род" означает, что по окончанию род не определить, но правило действует  только для рода "М" ("Воробей" склоняется только для "М", для "Ж" - не склоняется)
    |М-;    *ВОРОБЕЙ/*СОЛОВЕЙ/;                                    2;            ья;        ью;        ья;        ьем;    ье;        Воробей, Соловей
    |М-;    *ЛЕВ/;                                                2;            ьва;    ьву;    ьва;    ьвом;    ьве;    Лев
    |М-;    *КИЙ/*БОКИЙ/;                                        1;            я;        ю;        я;        ем;        е;        Кий
    |М-;    ЦОЙ/ВИЙ/СОЙ/ЕЙ/АЙ/УЙ/;                                1;            я;        ю;        я;        ем;        е;        Цой, Гелетей, Лузай
    |М;        ХОЙ/ШОЙ/;                                            2;            ого;    ому;    ого;    им;        ом;     Плохой, Большой
    |М;        ЧОЙ/ЩОЙ/;                                            2;            его;    ему;    его;    им;        ом;     
    |М;        ОЙ/ЫЙ/;                                                2;            ого;    ому;    ого;    ым;        ом;     Крутой, Мудрый
    |М;        ГИЙ/КИЙ/;                                            2;            ого;    ому;    ого;    им;        ом;
    |М-;    ИЙ/;                                                1;            я;        ю;        я;        ем;        и;        Шарий
    |М-;    КАШ/;                                                0;            а;        у;        а;        ом;        е;      Лукаш
    |М-;    ЬМИЧ/;                                                0;            а;        у;        а;        ом;        е;      Кузьмич
    |М-;    ИЧ/Ш/;                                                0;            а;        у;        а;        ем;        е;      Митрич, Гаспажиньш, Милош, Хараш, Черныш
    |М-;    АК/АН/ЕР/ИР/ЙН/НГ/ОН/ОР/УК/ЯК/ЯН/БИХ/РИХ/;            0;            а;        у;        а;      ом;     е;                   
    //колонка "Род" пустая, если по окончанию род не определить, но правило склонения одинаковое для "М" и "Ж ("Живаго", "Лисица")
    |;        АГО/ИА/НКО/ОВО/ОТО/ЦКО/ЫХ/ЮДО/ОЛЯ/ЬДА/ИХ/ЫХ/УА/;    0;            ;        ;        ;          ;         ;                   
    //символ "+" перед окончанием означает, что данное правило действует, для не последней части составного слова (в "Абдул-Шах" часть "Абдул" не склоняется, а если "Абдул" - отдельное слово, то склоняется)
    |;        +ВАН/+АБДУЛ/+БЕЛИЦ/+ГАСАН/+ДЮССАР/+ДЮМОН/+КНИППЕР/+КОРВИН/  0;    ;        ;        ;          ;         ;        
    |;        +КАРА/+САЕД/+БОНЧ/+ШОЛОМ/+ПРИЗВАН/+МЕЛИК/*ТЕР/*ВАР/*ФОН/;    0;    ;        ;        ;          ;         ;        
    |;        *ДЮМА/*ТОМА/*ДЕГА/*ЛЮКА/*ФЕРМА/*ГАМАРРА/;           0;            ;        ;        ;          ;         ;        
    |;        *ПЕТИПА/*ШАНДРА/*СКАЛЯ/*КАРУАНА/;                    0;            ;        ;        ;          ;         ;        
    |М-;    ИЯ/;                                                1;            и;        и;        ю;        ей;        и;      Берия             
    |М-;    ОЯ/;                                                1;            и;        е;        ю;        ей;        е;        
    |;        НЖА/;                                                1;            и;        е;        у;        ей;        е;        Стринжа
    |;        ЖА/;                                                1;            и;        е;        у;        ой;        е;        Ганжа
    |;        ГА/КА/УЛЕША/ВАША/ХА/;                                1;            и;        е;        у;        ой;        е;        Кулеша/Кулешой
    |;        Я/;                                                    1;            и;        е;        ю;        ей;        е;        Разиня
    |;        ЙА/ЧА/ША/ЩА/;                                        1;            и;        е;        у;        ей;        е;        Олеша/Олешей, Мойа
    |;        ЦА/;                                                1;            ы;        е;        у;        ей;        е;        Лисица
    |;        А/;                                                    1;            ы;        е;        у;        ой;        е;                   
    |М-;    ЕНЬ/;                                                3;            ня;        ню;        ня;        нем;    не;        Камень
    |М-;    Ь/;                                                    1;            я;        ю;        я;        ем;        е;        Даль
    |М-;    ЁК/;                                                2;            ька;    ьку;    ька;    ьком;    ьке;    Королёк
    |М-;    БЛОК/;                                                0;            а;        у;        а;        ом;        е;      Блок
    |М-;    ОК/;                                                2;            ка;        ку;        ка;        ком;    ке;        Миненок, Кисляченок
    |М-;    ИЕЦ/;                                                2;            йца;    йцу;    йца;    йцем;    йце;    Коломиец
    |М-;    ПАЛЕЦ/;                                                2;            ьца;    ьцу;    ьца;    ьцем;    ьце;    Долгопалец
    |М-;    ЛЕЦ/;                                                2;            ьца;    ьцу;    ьца;    ьцом;    ьце;    Стрелец
    |М-;    ЧЕЦ/;                                                0;            а;        у;        а;        ом;        е;        Чайчец
    |М-;    АВЕЦ/ЖЕЦ/;                                            2;            ца;        цу;        ца;        цем;    це;        Переяславец, Запорожец
    |М-;    ОВЕЦ/БЕЦ/АМЕЦ/НЕЦ/ТЕЦ/;                                2;            ца;        цу;        ца;        цом;    це;        Горовец
    |М-;    ШВЕЦ/;                                                0;            а;        у;        а;        ом;        е;        Швец
    |М-;    Ц/;                                                    0;            а;        у;        а;        ем;        е;        Кац, Бэц
    |М-;    ЁЛ/;                                                2;            ла;        лу;        ла;        лом;    ле;        Козёл
    |М-;    ДЖ/ИЖ/ОЖ/РЖ/ЙЧ/;                                    0;            а;        у;        а;        ем;        е;        Джордж, Лейч
    |М-;    Б/В/Г/Д/Ж/З/К/Л/М/Н/П/Р/С/Т/Ф/Х/Ч/Ш/Щ/;                0;            а;        у;        а;        ом;        е;        Заканчивается на согласную";
    
    _ПравилаИ = //Имя
    //Род;    Окончания;                                            Обрезка;    Р;        Д;        В;        Т;        П;        Комментарий   
    "Ж;        *ИЯ/;                                                1;            и;        е;        ю;        ей;        е;        Ия
    |Ж;        ИЯ/;                                                1;            и;        и;        ю;        ей;        и;        Мария
    |;        ГА/КА/ХА/;                                            1;            и;        е;        у;        ой;        е;        Ольга, Серега, Лука, Лика, Хоха
    |;        ЖА/ЙА/ЧА/ША/ЩА/;                                    1;            и;        е;        у;        ей;        е;        Миша, Маша
    |;        ЦА/;                                                1;            ы;        е;        у;        ей;        е;      Маца
    |Ж;        НА/ВЕРА/;                                            1;            ы;        е;        у;        ой;        е;      Инна, Нина, Ирина, Вера
    |Ж;        А/;                                                    1;            ы;        е;        у;        ой;        е;      Тома (женские на -а чаще)
    |М;        *ШОТА/;                                                0;            ;        ;        ;        ;        ;        Шота
    |М;        А/ЛО/;                                                1;            ы;        е;        у;        ой;        е;      Дима, Гаврило
    |М;        *ИЛЬЯ/*ИЛИЯ/;                                        1;            и;        е;        ю;        ей;        е;        Илья
    |Ж-;    Я/;                                                    1;            и;        е;        ю;        ей;        е;        Дуня
    |М-;    Я/;                                                    1;            и;        е;        ю;        ей;        е;        Гия
    |М;        РЬ/;                                                1;            я;        ю;        я;        ем;        е;        Игорь
    |Ж;        *ЛЮБОВЬ/*АГАРЬ/*РАХИЛЬ/*РУФЬ/*СУЛАМИФЬ/*ЭСФИРЬ/;    1;            и;        и;        ь;        ью;        и;        Любовь
    |Ж;        *ЮДИФЬ/*РАШЕЛЬ/*НИНЕЛЬ/*ИЗАБЕЛЬ/*ИСАБЕЛЬ/;            1;            и;        и;        ь;        ью;        и;        Любовь
    |М-;    Ь/;                                                    1;            я;        ю;        я;        ем;        е;        Олесь
    |М;        *ПАВЕЛ/;                                            2;            ла;        лу;        ла;        лом;    ле;        Павел
    |М;        *ЛЕВ/;                                                2;            ьва;    ьву;    ьва;    ьвом;    ьве;    Лев
    |М;        ИЙ/;                                                1;            я;        ю;        я;        ем;        и;        Василий
    |М;        Й/;                                                    1;            я;        ю;        я;        ем;        е;        Гай
    |М;        ЁТР/;                                                3;            етра;    етру;    етра;    етром;    етре;    Пётр
    |М;        +АХМАД/+АБДУЛ/+ГАСАН/+САЛИМ/+САИД/;                    0;            ;        ;        ;        ;        ;        Салим-Гирей
    |М;        ДЖ/;                                                0;            а;        у;        а;        ем;        е;        Джордж
    |М;        Б/В/Г/Д/Ж/З/К/Л/М/Н/П/Р/С/Т/Ф/Х/Ц/Ч/Ш/Щ/;            0;            а;        у;        а;        ом;        е;        Заканчивается на согласную";
    
    _ПравилаО = //Отчество
    //Род;    Окончания;                                            Обрезка;    Р;        Д;        В;        Т;        П;        Комментарий   
    "М;        *ИЛЬИЧ/*КУЗЬМИЧ/*ЛУКИЧ/*ФОМИЧ/;                        0;            а;        у;        а;        ом;        е;        Ильичом, Кузьмичом (после шипящих под ударением!)
    |М;        ИЧ/;                                                0;            а;        у;        а;        ем;        е;
    |Ж;        НА/;                                                1;            ы;        е;        у;        ой;        е;
    |М;        ОГЛЫ/УЛЫ/УУЛУ/;                                        0;            ;        ;        ;        ;        ;       Оглы, Улы, Уулу
    |Ж;        ЫЗЫ/ИЗИ/;                                            0;            ;        ;        ;        ;        ;        Кызы, Гызы, Кизи
    |;        +Б/+В/+Г/+Д/+Ж/+З/+К/+Л/+М/+Н/+П/+Р/+С/+Т/+Ф/+Х/+Ц/+Ч/+Ш/+Щ/;0;    ;        ;        ;        ;        ;        Заканчивается на согласную - восточные отчества - не последняя часть слова
    |;        Б/В/Г/Д/Ж/З/К/Л/М/Н/П/Р/С/Т/Ф/Х/Ц/Ч/Ш/Щ/;            0;            а;        у;        а;        ом;        е;        Заканчивается на согласную - восточные отчества";
    
    _ПравилаД = //Должность
    //Род;    Окончания;                                            Тег;    Обрезка;    Р;        Д;        В;        Т;        П;        
    "М;        ВЕНТИЛЕВОЙ/РУЛЕВОЙ/ДВЕРЕВОЙ/ПЕЧЕВОЙ/КОВШЕВОЙ/;                                            ;        2;            ого;    ому;    ого;    ым;        ом;
    |М;        ЛЮКОВОЙ/СКИПОВОЙ/МИКСЕРОВОЙ/СТВОЛОВОЙ/ГОРНОВОЙ/ПОСТОВОЙ/ВЕРХОВОЙ/РАЗЪЕЗДНОЙ/ПОРТНОЙ/;    ;        2;            ого;    ому;    ого;    ым;        ом;
    |М;        БИРЖЕВОЙ/ПОЛЕВОЙ/ПУТЕВОЙ/ЛИЦЕВОЙ/ЗУБНОЙ/ПОЕЗДНОЙ/РЕЧНОЙ/РУЧНОЙ/ВТОРОЙ/;                            К;        2;            ого;    ому;    ого;    ым;        ом;
    |М;        ПРАВОВОЙ/БЕРЕГОВОЙ/ТРУДОВОЙ/СУДОВОЙ/ГРУЗОВОЙ/МИРОВОЙ/ЛЕНТОВОЙ/БОРТОВОЙ/МОСТОВОЙ/СТРАХОВОЙ/;        К;        2;            ого;    ому;    ого;    ым;        ом;
    |М;        ЗАВОДСКОЙ/ГОРОДСКОЙ/МОРСКОЙ/;                                                                    К;        2;            ого;    ому;    ого;    им;        ом;
    |М;        ЖИЙ/ЧИЙ/ШИЙ/ЩИЙ/;                                    ;        2;            его;    ему;    его;    им;        ем;        
    |М;        СКИЙ/;                                                ;        2;            ого;    ому;    ого;    им;        ом;        
    |М;        ЫЙ/;                                                ;        2;            ого;    ому;    ого;    ым;        ом;        
    |Ж;        ЖАЯ/ЧАЯ/ШАЯ/ЩАЯ/;                                    ;        2;            ей;        ей;        ую;        ей;        ей;        
    |Ж;        ЯЯ/;                                                ;        2;            ей;        ей;        юю;        ей;        ей;        
    |Ж;        АЯ/;                                                ;        2;            ой;        ой;        ую;        ой;        ой;        
    |;        Е/И/Ы/Ю/;                                            П;        0;            ;        ;        ;        ;        ;        
    |;        ЗАВ/ЗАМ/НАЧ/;                                        П;        0;            ;        ;        ;        ;        ;        
    |;        ОЙ/;                                                П;        0;            ;        ;        ;        ;        ;        
    |;        *ОВЕЦ/;                                                ;        0;            ;        ;        ;        ;        ;        
    |;        ДЬЯ/;                                                ;        1;            и;        е;        ю;        ей;        е;      
    |;        АРЬ/;                                                ;        1;            я;        ю;        я;        ем;        е;        
    |;        ИСТ/;                                                ;        0;            а;        у;        а;        ом;        е;        
    |Ж;        ЙКА/ИСТКА/ША/ТАРКА/ЕРКА/ЯРКА/ЕНКА/ЧИХА/ЖКА/;        ;        1;            и;        е;        у;        ой;        е;        
    |Ж;        ИЦА/;                                                ;        1;            ы;        е;        у;        ей;        е;      
    |Ж;        НЯ/ВЕЯ/НЬЯ/;                                        ;        1;            и;        е;        ю;        ей;        е;      
    |Ж;        СЕСТРА/ССА/;                                        ;        1;            ы;        е;        у;        ой;        е;      
    |Ж;        ДЕЛЬ/;                                                ;        1;            и;        и;        ь;        ью;        и;      
    |М;        ГЛАВА/ШИНА/;                                        ;        1;            ы;        е;        у;        ой;        е;      
    |М;        КАЛЬ/ГАЛЬ/ИТЕЛЬ/АТЕЛЬ/ОТЕЛЬ/ЕРЬ/;                    ;        1;            я;        ю;        я;        ем;        е;        
    |М;        АЧЕЙ/КЕЙ/ДЖЕЙ/;                                        ;        1;            я;        ю;        я;        ем;        е;        
    |М;        ЛИСТ/;                                                ;        0;            а;        у;        а;        ом;        е;        
    |М;        ЗНЕЦ/ТЕЦ/;                                            ;        0;            а;        у;        а;        ом;        е;        
    |М;        АВЕЦ/ЕБЕЦ/ЕВЕЦ/ОВЕЦ/ЖЕЦ/РЕЦ/СЕЦ/НЕЦ/;                ;        2;            ца;        цу;        ца;        цом;    це;        
    |М;        ОЕЦ/;                                                ;        2;            йца;    йцу;    йца;    йцом;    йце;    
    |М;        ИЕЦ/;                                                ;        2;            йца;    йцу;    йца;    йцем;    йце;    
    |М;        ПОСОЛ/;                                                ;        2;            ла;        лу;        ла;        лом;    ле;        
    |М;        РЕЛОК/;                                                ;        2;            ка;        ку;        ка;        ком;    ке;        
    |М;        РОНОМ/АНАТОМ/;                                        ;        0;            а;        у;        а;        ом;        е;        
    |М;        ОРУБ/ДУВ/КЛАД/ВЕД/ЕВОД/ОВОД/ОХОД/ЛАЗ/ВАЛ/ДЕЛ/СОЛ/ОКОЛ/КОП/ВАР/ОПАР/ВЕС/МЕС/НОС/ТЕС/;        ;    0;    а;        у;        а;        ом;        е;
    |М;        ЛОПРАВ/ТОПРАВ/РИВОД/ЫБАК/ЕГАР/АТУР/ТРОС/ИЛОТ/ПЕРТ/НАСТ/НТЕРН/АТЛЕТ/ХОДОК/ГРОК/ОБОЛ/;        ;    0;    а;        у;        а;        ом;        е;
    |М;        РАБ/ТАВ/МАТ/ГОГ/ЛОГ/ПЕД/РОЖ/ЗАК/СУЛ/ОНАЛ/ЕРСАЛ/ЛЕН/МЕН/ЬОН/ОУН/;                            ;    0;    а;        у;        а;        ом;        е;
    |М;        БАТ/ДАТ/КАТ/ПАТ/ТАТ/ЕКТ/ИСТ/ОСТ/АНТ/ГЕНТ/ДЕНТ/РЕНТ/СТЕНТ/ЦЕНТ/ОНТ/;                            ;    0;    а;        у;        а;        ом;        е;
    |М;        НАР/САР/ТАР/ЦАР/ЧАР/АТР/ИТР/СТР/;                                                            ;    0;    а;        у;        а;        ом;        е;
    |М;        АЕР/ВЕР/ГЕР/ДЕР/ЖЕР/ЗЕР/ЙЕР/КЕР/ЛЕР/НЕР/ПЕР/РЕР/СЕР/ХЕР/ЧЕР/ШЕР/ЮЕР/;                        ;    0;    а;        у;        а;        ом;        е;
    |М;        ЕМЕР/ИМЕР/РМЕР/ЮМЕР/АЛЬЕР/ЕЛЬЕР/РЬЕР/ЁР/;                                                    ;    0;    а;        у;        а;        ом;        е;
    |М;        ДИТЕР/КТЕР/ЛТЕР/ЙТЕР/НТЕР/ОТЕР/ПТЕР/СТЕР/УТЕР/ФТЕР/ХТЕР/;                                    ;    0;    а;        у;        а;        ом;        е;
    |М;        ДОР/ЗОР/ИОР/РОР/СОР/ТОР/ФОР/ЦОР/АТОР/ИТОР/КТОР/НТОР/;                                        ;    0;    а;        у;        а;        ом;        е;
    |М;        ВИК/ЗИК/МИК/НИК/ГРАФИК/ЧИК/ШИК/ЩИК/ИРИК/ОРИК/ТРИК/ГИСТИК/ТИСТИК/УСТИК/АТИК/ЕТИК/ИТИК/ПТИК/;    ;    0;    а;        у;        а;        ом;        е;
    |М;        ИВ/РГ/ИД/ЯК/АН/ГУН/ИР/ЭР/ЮР/ЯР/УС/ВТ/ЬТ/АФ/СОФ/ТУХ/ЮХ/АЧ/;                                    ;    0;    а;        у;        а;        ом;        е;";
    
    _ПравилаЧ = //Числительное
    //Род;    Окончания;                                Тег;    Обрезка;    И;            Р;            Д;            В;            Т;            П;            О;        Комментарий   
    "М;        *ОДИН/*ОДНА/*ОДНО/;                        1;        2;            ин;            ного;        ному;        ин;            ним;        ном;        ного;    Один
    |С;        *ОДИН/*ОДНА/*ОДНО/;                        1;        2;            но;            ного;        ному;        но;            ним;        ном;        ного;    Одно
    |Ж;        *ОДИН/*ОДНА/*ОДНО/;                        1;        2;            на;            ной;        ной;        ну;            ной;        ной;        ну;        Одна
    |М;        *ДВА/*ДВЕ/;                                2;        1;            а;            ух;            ум;            а;            умя;        ух;            ух;        Два, Две
    |С;        *ДВА/*ДВЕ/;                                2;        1;            а;            ух;            ум;            а;            умя;        ух;            ух;        Два, Две
    |Ж;        *ДВА/*ДВЕ/;                                2;        1;            е;            ух;            ум;            е;            умя;        ух;            ух;        Два, Две
    |;        *ТРИ/;                                    2;        1;            и;            ех;            ем;            и;            емя;        ех;            ех;        Три
    |;        *ЧЕТЫРЕ/;                                2;        1;            е;            ех;            ем;            е;            ьмя;        ех;            ех;        Четыре
    |;        *ВОСЕМЬ/;                                ;        3;            емь;        ьми;        ьми;        емь;        емью;        ьми;        емь;    Восемь
    |;        *ПЯТЬ/*ШЕСТЬ/*СЕМЬ/*ДЕВЯТЬ/*ДЕСЯТЬ/ДЦАТЬ/;    ;    1;            ь;            и;            и;            ь;            ью;            и;            ь;        Пять, Шесть, Семь, Десять и др.
    |;        *СОРОК/;                                ;        0;            ;            а;            а;            ;            а;            а;            ;        Сорок
    |;        *ВОСЕМЬДЕСЯТ/;                            ;        8;            емьдесят;    ьмидесяти;    ьмидесяти;    емьдесят;    емьюдесятью;ьмидесяти;    емьдесят;Восемьдесят
    |;        ЬДЕСЯТ/;                                ;        6;            ьдесят;        идесяти;    идесяти;    ьдесят;        ьюдесятью;    идесяти;     ьдесят;    Пятьдесят и др.
    |;        *СТО/*ДЕВЯНОСТО/;                        ;        1;            о;            а;            а;            о;            а;            а;             о;        Девяносто, Сто
    |;        *ДВЕСТИ/;                                ;        4;            ести;        ухсот;        умстам;        ести;        умястами;    ухстах;        ести;    Двести
    |;        *ТРИСТА/;                                ;        4;            иста;        ехсот;        емстам;        иста;        емястами;    ехстах;        иста;    Триста
    |;        *ЧЕТЫРЕСТА/;                            ;        4;            еста;        ехсот;        емстам;        еста;        ьмястами;    ехстах;        еста;    Четыреста
    |;        *ВОСЕМЬСОТ/;                            ;        6;            емьсот;        ьмисот;        ьмистам;    емьсот;        емьюстами;    ьмистах;    емьсот;    Восемьсот
    |;        ЬСОТ/;                                    ;        4;            ьсот;        исот;        истам;        ьсот;        ьюстами;     истах;        ьсот;    Пятьсот, Шестьсот, Семьсот, Девятьсот
    |;        *НОЛЬ/*НУЛЬ/;                            ;        1;            ь;            я;            ю;            ь;            ем;            е;            ь;        Ноль, Нуль
    |М;        1/;                                        1;        0;            -ин;        -го;        -му;        -ин;        -им;        -ом;        -го;    
    |С;        1/;                                        1;        0;            -но;        -го;        -му;        -ин;        -им;        -ом;        -го;    
    |Ж;        1/;                                        1;        0;            -на;        -ой;        -ой;        -ну;        -ой;        -ой;        -ну;        
    |М;        2/;                                        2;        0;            -а;            -ух;        -ум;        -а;            -мя;        -ух;        -ух;    
    |С;        2/;                                        2;        0;            -а;            -ух;        -ум;        -а;            -мя;        -ух;        -ух;
    |Ж;        2/;                                        2;        0;            -е;            -ух;        -ум;        -е;            -мя;        -ух;        -ух;
    |;        3/;                                        2;        0;            -и;            -ех;        -ем;        -и;            -мя;        -ех;        -ех;    
    |;        4/;                                        2;        0;            -ре;        -х;            -ем;        -ре;        -мя;        -ех;        -ех;    
    |;        5/6/9/10/11/12/13/14/15/16/17/18/19/20/30/;;    0;            -ть;        -ти;        -ти;        -ть;        -тью;        -ти;        -ть;    
    |;        7/8/;                                    ;        0;            -мь;        -ми;        -ми;        -мь;        -мью;        -ми;        -мь;    
    |;        40/;                                    ;        0;            -к;            -ка;        -ка;        -к;            -ка;        -ка;        -к;        
    |;        50/60/70/80/;                            ;        0;            -т;            -ти;        -ти;        -т;            -тью;        -ти;        -т;        
    |;        90/;                                    ;        0;            -сто;        -та;        -та;        -сто;        -та;        -та;        -сто;    
    |;        100/;                                    ;        0;            ;            -та;        -та;        ;            -та;        -та;        ;    
    |;        200/;                                    ;        0;            -и;            -сот;        -стам;        -и;            -стами;        -стах;      -и;    
    |;        300/400/;                                ;        0;            -а;            -сот;        -стам;        -а;            -стами;        -стах;      -а;        
    |;        500/600/700/800/900/;                    ;        0;            -сот;        -сот;        -стам;        -сот;        -стами;        -стах;      -сот;    
    |;        *0/;                                    ;        0;            -ль;        -ля;        -лю;        -ль;        -ем;        -ле;        -ль;    
    |;        0/;                                        ;        0;            ;            ;            ;            ;            ;            ;            ;";
    
    _ПравилаВ = //Выражение
    //Род;    Окончания;                                    Обрезка;    И;                Р;                Д;                В;                Т;                П;                О;                
    "С;        ЕНИЕ/;                                        1;            е/я;            я/й;            ю/ям;            е/я;            ем/ями;            и/ях;            е/й;            
    //"Р" в колонке "Род" означает, слово родоизменяемое, и порядок окончания в списке определяет род слова
    |Р;        КИЙ/КАЯ/КОЕ/КИЕ/;                            2;            ий/ая/ое/ие;    ого/ой/ого/их;    ому/ой/ому/им;    ий/ую/ое/ие;    им/ой/им/ими;    ом/ой/ом/их;    ого/ую/ое/их;    
    |Р;        НИЙ/НЯЯ/НЕЕ/НИЕ/;                            2;            ий/яя/ее/ие;    его/ей/его/их;    ему/ей/ему/им;    ий/юю/ее/ие;    им/ей/им/ими;    ем/ей/ем/их;    его/юю/ое/их;    
    |Р;        ЫЙ/АЯ/ОЕ/ЫЕ/;                                2;            ый/ая/ое/ые;    ого/ой/ого/ых;    ому/ой/ому/ым;    ый/ую/ое/ые;    ым/ой/ым/ыми;    ом/ой/ом/ых;    ого/ую/ое/ых;    
    |Р;        ЧЕЛ/ЧЛА/ЧЛО/ЧЛИ/;                            2;            ел/ла/ло/ли;    ел/ла/ло/ли;    ел/ла/ло/ли;    ел/ла/ло/ли;    ел/ла/ло/ли;    ел/ла/ло/ли;    ел/ла/ло/ли;    
    |Р;        АЛ/АЛА/АЛО/АЛИ/;                            0111;        /а/о/и;            /а/о/и;            /а/о/и;            /а/о/и;            /а/о/и;            /а/о/и;            /а/о/и;            
    |Р;        ИЛ/ИЛА/ИЛО/ИЛИ/;                            0111;        /а/о/и;            /а/о/и;            /а/о/и;            /а/о/и;            /а/о/и;            /а/о/и;            /а/о/и;            
    |Р;        ЕЛ/ЕЛА/ЕЛО/ЕЛИ/;                            0111;        /а/о/и;            /а/о/и;            /а/о/и;            /а/о/и;            /а/о/и;            /а/о/и;            /а/о/и;            
    |Ж;        *ТЫСЯЧА/*ТЫСЯЧИ/*ТЫСЯЧ/;                        110;        а/и;            и/;                е/ам;            у/и;            ей/ами;            е/ах;            у/и;            
    |М;        ЛЛИОН/ЛЛИОНА/ЛЛИОНОВ/ЛЛИАРД/ЛЛИАРДА/ЛЛИАРДОВ/;012012;    /ы;                а/ов;            у/ам;            /ы;                ом/ами;            е/ах;            /ы;                
    |;        *САНКТ/*УСТЬ/*ЙОШКАР/*НА/;                    0;            /;                /;                /;                /;                /;                /;                /;                
    |;        *СТЕРЛИНГОВ/;                                0;            /;                /;                /;                /;                /;                /;                /;                
    |М;        ОВЕК/;                                        0;            /и;                а/;                у/ам;            а/;                ом/ами;            е/ах;            а/;                
    |М;        ЕЦ/;                                        2;            ец/цы;            ца/цов;            цу/цам;            ец/цы;            цом/цами;        це/цах;            ца/цов;            
    |М;        ЕНЬ/;                                        3;            ень/ни;            ня/ней;            ню/ням;            ень/ни;            нем/нями;        не/нях;            ня/ней;            
    |М;        ШОК/;                                        2;            ок/ки;            ка/ков;            ку/кам;            ок/ки;            ком/ками;        ке/ках;            ка/ков;            
    |М;        *ДОЛЛАР/*ДОЛЛАРА/*ДОЛЛАРОВ/;                012;        /ы;                а/ов;            у/ам;            /ы;                ом/ами;            е/ах;            а/ов;            
    |М;        ЦЕНТ/ЦЕНТА/ЦЕНТОВ/;                            012;        /ы;                а/ов;            у/ам;            /ы;                ом/ами;            е/ах;            а/ов;            
    |М;        *РУБЛЬ/*РУБЛЯ/*РУБЛЕЙ/;                        112;        ь/и;            я/ей;            ю/ям;            ь/и;            ем/ями;            е/ях;            я/ей;            
    |Ж;        *КОПЕЙКА/*КОПЕЙКИ/*КОПЕЕК/;                    332;        йка/йки;        йки/ек;            йке/йкам;        йку/йки;        йкой/йками;        йке/йках;        йку/ек;            
    |М;        Б/В/Д/З/Л/М/Н/П/Р/С/Т/Ф/Ц/;                    0;            /ы;                а/ов;            у/ам;            /ы;                ом/ами;            е/ах;            а/ов;            
    |М;        Г/К/Х/;                                        0;            /и;                а/ов;            у/ам;            /и;                ом/ами;            е/ах;            а/ов;            
    |М;        Ж/Ч/Ш/Щ/;                                    0;            /и;                а/ей;            у/ам;            /и;                ем/ами;            е/ах;            а/ей;            
    |М;        Й/;                                            1;            й/и;            я/ев;            ю/ям;            й/и;            ем/ями;            е/ях;            я/ев;            
    |Ж;        Ь/;                                            1;            ь/и;            и/ей;            и/ям;            ь/и;            ью/ями;            и/ях;            и/ей;            
    |М;        Ь/;                                            1;            ь/и;            я/ей;            ю/ям;            ь/и;            ем/ями;            е/ях;            я/ей;            
    |Ж;        ЛЯ/;                                        2;            ля/ли;            ли/ель;            ле/лям;            лю/ли;            лей/лями;        ле/лях;            лю/ли;            
    |Ж;        ХНЯ/;                                        2;            ня/ни;            ни/онь;            не/ням;            ню/ни;            ней/нями;        не/нях;            ню/ни;            
    |Ж;        РЯ/НЯ/;                                        1;            я/и;            и/ей;            е/ям;            ю/и;            ей/ями;             е/ях;            ю/ей;            
    |Ж;        СКА/МКА/НКА/;                                2;            ка/ки;            ки/ок;            ке/кам;            ку/ки;            кой/ками;        ке/ках;            ку/ок;            
    |Ж;        ЖА/ЙА/ЧА/ША/ЩА/;                            1;            а/и;            и/;                е/ам;            у/и;            ей/ами;            е/ах;            у/;                
    |Ж;        ГА/КА/ХА/;                                    1;            а/и;            и/;                е/ам;            у/и;            ой/ами;            е/ах;            у/;                
    |Ж;        ЦА/;                                        1;            а/ы;            ы/;                е/ам;            у/ы;            ей/ами;            е/ах;            у/;                
    |Ж;        ВНА/;                                        2;            на/ны;            ны/ен;            не/нам;            ну/ны;            ной/нами;        не/нах;            ну/ен;            
    |Ж;        А/;                                            1;            а/ы;            ы/;                е/ам;            у/ы;            ой/ами;            е/ах;            у/;                
    |С;        *ЕВРО/;                                        0;            /;                /;                /;                /;                /;                /;                /;                
    |С;        КО/;                                        1;            о/а;            а/ов;            у/ам;            о/а;            ом/ами;            е/ах;            о/;                
    |С;        О/;                                            1;            о/а;            а/;                у/ам;            о/а;            ом/ами;            е/ах;            о/;                
    |С;        Е/;                                            1;            е/я;            я/й;            ю/ям;            е/я;            ем/ями;            и/ях;            е/й;            ";
    
    _Параметр0 = _Выражение;
    _Параметр1 = _Падеж;
    _Параметр2 = _Род;
    _Параметр3 = _Режим;
    _Параметр4 = _ФорматнаяСтрока;
    
    Если _Параметр0 = "_РазделитьСтроку" Тогда
        
        _ПозРазделителя = Найти(_Параметр1, _Параметр2); _Режим = Сред(_Параметр1, _ПозРазделителя + 1); Возврат Лев(_Параметр1, _ПозРазделителя - 1);
        
    ИначеЕсли _Параметр0 = "_ВМассивБезРазделителей" Тогда
        
        _МассивСтрок = Новый Массив(); Пока ИСТИНА Цикл _Поз = Найти(_Параметр1, _Параметр2); Если _Поз = 0 Тогда _МассивСтрок.Добавить(_Параметр1); Возврат _МассивСтрок;    КонецЕсли;    _МассивСтрок.Добавить(СокрЛП(Лев(_Параметр1, _Поз - 1))); _Параметр1 = СокрЛП(Сред(_Параметр1, _Поз + СтрДлина(_Параметр2))); КонецЦикла; Возврат _МассивСтрок;
        
    ИначеЕсли _Параметр0 = "_ВМассивСРазделителями" Тогда
        
        _МассивСтрок = Новый Массив(); _КолРазделителей = СтрДлина(_Параметр2);    Пока ИСТИНА Цикл _МинПозРазделителя = 10000; Для _ИндРазделителя = 1 По _КолРазделителей Цикл _ПозРазделителя = Найти(_Параметр1, Сред(_Параметр2, _ИндРазделителя, 1)); Если _ПозРазделителя > 0 Тогда _МинПозРазделителя = Мин(_МинПозРазделителя, _ПозРазделителя); КонецЕсли; КонецЦикла; Если _МинПозРазделителя = 10000 Тогда _МассивСтрок.Добавить(_Параметр1); Возврат _МассивСтрок; КонецЕсли; _МассивСтрок.Добавить(Лев(_Параметр1, _МинПозРазделителя - 1)); Для _Поз = _МинПозРазделителя По СтрДлина(_Параметр1) + 1 Цикл _ТекСимвол = Сред(_Параметр1, _Поз, 1); Если Найти(_Параметр2, _ТекСимвол) = 0 ИЛИ _Поз = СтрДлина(_Параметр1) + 1 Тогда _МассивСтрок.Добавить(Сред(_Параметр1, _МинПозРазделителя, _Поз - _МинПозРазделителя)); _Параметр1 = Сред(_Параметр1, _Поз); Прервать; КонецЕсли; КонецЦикла; КонецЦикла; 
        
    ИначеЕсли _Параметр0 = "_ПривестиПоДлинеИРегистру" Тогда
        
        _ИсходнаяСтрока     = _Параметр1;
        _Образец             = _Параметр2;
        
        _Результат = ?(Лев(_Образец, 1) = "-", Лев(_ИсходнаяСтрока, 1), ?(Лев(_Образец, 1) <> НРег(Лев(_Образец, 1)), ВРег(Лев(_ИсходнаяСтрока, 1)), НРег(Лев(_ИсходнаяСтрока, 1))));
        Если НЕ Сред(_Образец, 2, 1) = "" Тогда
            _Результат = _Результат + ?(Сред(_Образец, 2, 1) = "-", Сред(_ИсходнаяСтрока, 2), ?(Сред(_Образец, 2, 1) <> НРег(Сред(_Образец, 2, 1)), ВРег(Сред(_ИсходнаяСтрока, 2)), НРег(Сред(_ИсходнаяСтрока, 2))));
        КонецЕсли;

        Возврат _Результат;
        
    ИначеЕсли _Параметр0 = "_ПросклонятьСлово" Тогда
        
        _СтрокаСлово    = _Параметр3; 
        
        Если _СтрокаСлово.Склонение = "-" ИЛИ _СтрокаСлово.Склонение = "!" Тогда 
            Возврат "";
        КонецЕсли;
        
        _ИсходнаяСтрока = _СтрокаСлово.Значение;
        _Метод = ?(Найти("ФИО", _СтрокаСлово.Субметод) > 0, "ФИО", _СтрокаСлово.Субметод);
        _СтрокаПадежи    = ?(Найти("ЧВ", _Метод) > 0, "ИРДВТПО", "РДВТП");
        
        _ПраваяЧасть = "";
        
        _ТаблицаПравила = Вычислить("_Правила" + _СтрокаСлово.Субметод);
        Для _НомСтр = 1 По СтрЧислоСтрок(_ТаблицаПравила) Цикл
            
            _СтрокаПравила = СтрПолучитьСтроку(_ТаблицаПравила, _НомСтр);
            
            Если Найти(_СтрокаПравила, ВРег(Прав(_ИсходнаяСтрока, 1)) + "/") = 0 Тогда Продолжить; КонецЕсли; 
            
            _РодПравила = СокрЛП(daСклонение("_РазделитьСтроку", _СтрокаПравила, ";", _ПраваяЧасть)); 
            Если (Найти(" МЖС", _Род) > 1 И НЕ ПустаяСтрока(_РодПравила) И Найти(_РодПравила, _Род) = 0 И _РодПравила <> "Р") Тогда Продолжить; КонецЕсли;
            
            _ЛеваяЧасть = daСклонение("_РазделитьСтроку", _ПраваяЧасть, ";", _ПраваяЧасть);
            _МассивОкончания = daСклонение("_ВМассивБезРазделителей", СокрЛП(_ЛеваяЧасть), "/");
            Для _Инд = 0 По _МассивОкончания.ВГраница() - 1 Цикл
                
                _СтрокаОкончание = _МассивОкончания[_Инд];
                
                Если НЕ ((ВРег(Прав(_ИсходнаяСтрока, СтрДлина(_СтрокаОкончание))) = ВРег(_СтрокаОкончание)) 
                    ИЛИ (Лев(_СтрокаОкончание, 1) = "*" И ВРег(_ИсходнаяСтрока) = ВРег(Сред(_СтрокаОкончание, 2)))
                    ИЛИ (Лев(_СтрокаОкончание, 1) = "+" И ВРег(Прав(_ИсходнаяСтрока, СтрДлина(_СтрокаОкончание) - 1)) = Сред(ВРег(_СтрокаОкончание), 2) И _СтрокаСлово.Тег = "Н")) Тогда 
                    Продолжить;
                КонецЕсли;
                
                Если _Метод = "Д" ИЛИ _Метод = "Ч" Тогда 
                    _ТегПравило = СокрЛП(daСклонение("_РазделитьСтроку", _ПраваяЧасть, ";", _ПраваяЧасть));
                    _ТегПравило = ?(_Метод = "Ч" И СтрДлина(_ТегПравило) = 0, Сред("51222", Найти("1234", Прав(_ИсходнаяСтрока, 1)) + 1, 1), _ТегПравило); 
                    
                    Если СтрДлина(_ТегПравило) > 0 И ПустаяСтрока(_СтрокаСлово.Тег) Тогда
                        _СтрокаСлово.Тег = _ТегПравило;
                        _СтрокаСлово.Склонение = ?(_ТегПравило = "П", "!", _СтрокаСлово.Склонение); 
                        Возврат "";
                    КонецЕсли;
                КонецЕсли;
                
                Если _РодПравила = "Р" Тогда 
                    _РодНайденный = Сред("МЖСН", _Инд + 1, 1);
                    _СтрокаСлово.Тег = "Р"; 
                Иначе
                    _РодНайденный = ?(СтрДлина(_РодПравила) = 1, _РодПравила, "");
                КонецЕсли;
                
                _СтрокаСлово.Род = _РодНайденный;
                
                Если _Метод = "ФИО" И ПустаяСтрока(_Род) И ПустаяСтрока(_РодНайденный) Тогда 
                    Возврат ""; 
                КонецЕсли;
                
                Если _Метод = "В" И _СтрокаСлово.Склонение = "?" Тогда 
                    _СтрокаСлово.Склонение = "";
                    Возврат ""; 
                КонецЕсли;
                
                Если Найти(_СтрокаПадежи, _Падеж) = 0 Тогда 
                    _СтрокаСлово.Склонение = "!";
                    Возврат "";
                КонецЕсли;
                
                _Обрезка = СокрЛП(daСклонение("_РазделитьСтроку", _ПраваяЧасть, ";", _ПраваяЧасть));
                _Обрезка = Число(?(СтрДлина(_Обрезка) = 1, _Обрезка, Сред(_Обрезка, _Инд + 1, 1)));
                
                _МассивСклонения = daСклонение("_ВМассивБезРазделителей", СокрЛП(_ПраваяЧасть), ";");
                _Окончание = СокрЛП(_МассивСклонения[Найти(_СтрокаПадежи, _Падеж) - 1]);
                Если _Метод = "В" Тогда 
                    _МассивОкончания = daСклонение("_ВМассивБезРазделителей", _Окончание, "/");
                    _ИндОкончания = Число(Сред(?(_РодПравила = "Р", "00123", "00001"), Найти("МЖСН", ?(ПустаяСтрока(_Род), _РодНайденный, _Род)) + 1, 1));
                    _Окончание = _МассивОкончания[_ИндОкончания];
                КонецЕсли;
                _СтрокаСлово.Значение = Лев(_ИсходнаяСтрока, СтрДлина(_ИсходнаяСтрока) - _Обрезка) + daСклонение("_ПривестиПоДлинеИРегистру", _Окончание, Прав(_ИсходнаяСтрока, 1) + Прав(_ИсходнаяСтрока, 1)); 
                _СтрокаСлово.Склонение = "!";
                Возврат "";
                
            КонецЦикла;
            
        КонецЦикла;
        
        Если _Метод = "Ч" Тогда
            _СтрокаСлово.Субметод = "В"; 
            _СтрокаСлово.Склонение = "?";
            Возврат daСклонение("_ПросклонятьСлово", _Падеж, "", _СтрокаСлово);
        Иначе
            _СтрокаСлово.Склонение = "!"; 
            Возврат  ""; 
        КонецЕсли;
        
    ИначеЕсли _Параметр0 = "_ПроверкаТипов" Тогда
        
        _ИсходнаяСтрока     = _Параметр1;
        
        _СтруктураТипы = Новый Структура("ЕстьЦифры, ЕстьНеЦифры, ЕстьВРег, ЕстьНРег, Аббревиатура", Ложь, Ложь, Ложь, Ложь, Ложь);
        _СтрокаЦифры                 = "0123456789";
        _СтрокаЦифрыИРазделители     = "0123456789. "; 
        _КолНРег = 0;
        
        Для _Поз = 1 По СтрДлина(_ИсходнаяСтрока) Цикл
            _ТекСимвол = Сред(_ИсходнаяСтрока, _Поз, 1);
            _СтруктураТипы.ЕстьЦифры     = _СтруктураТипы.ЕстьЦифры ИЛИ Найти(_СтрокаЦифры, _ТекСимвол) > 0;
            _СтруктураТипы.ЕстьНеЦифры     = _СтруктураТипы.ЕстьНеЦифры ИЛИ Найти(_СтрокаЦифрыИРазделители, _ТекСимвол) = 0;
            _СтруктураТипы.ЕстьВРег     = _СтруктураТипы.ЕстьВРег ИЛИ _ТекСимвол <> НРег(_ТекСимвол);
            _СтруктураТипы.ЕстьНРег     = _СтруктураТипы.ЕстьНРег ИЛИ _ТекСимвол <> ВРег(_ТекСимвол);
            _КолНРег = _КолНРег + (_ТекСимвол <> ВРег(_ТекСимвол));
        КонецЦикла; 
        
        _СтруктураТипы.Аббревиатура = _СтруктураТипы.ЕстьНеЦифры И (_КолНРег < Макс(СтрДлина(_ИсходнаяСтрока) - 1, 2) ИЛИ _СтруктураТипы.ЕстьЦифры);
        
        Возврат _СтруктураТипы;
        
    ИначеЕсли _Параметр0 = "?" Тогда 
        
        Возврат _Версия;
        
    КонецЕсли;
    
    _РежимЗапуска = ?(ПустаяСтрока(_Режим), "ФИО", ВРег(СокрЛП(_Режим))); 
    
    Если Найти("ФИО", Лев(_РежимЗапуска, 1)) > 0 Тогда
        _РегистрыШаблона     = Новый Структура("ФАМИЛИЯ, ИМЯ, ОТЧЕСТВО, Ф, И, О", , , , "--", "--", "--"); 
        _Метод                 = "ФИО";
    ИначеЕсли Найти("ДЧВ", _РежимЗапуска) > 0 Тогда
        _РегистрыШаблона     = Новый Структура("А, Б, В, Г", "-", "-", "-", "-"); 
        _Метод                 = _РежимЗапуска;
    Иначе
        Возврат "<неправильный режим!!!>";
    КонецЕсли;
    _Разделители = " -+.,()/"""; 
    
    _МакросИзШаблона = _ФорматнаяСтрока;
    Если НЕ ПустаяСтрока(_ФорматнаяСтрока) Тогда
        
        Для Каждого _ЭлементРегистрыШаблона Из _РегистрыШаблона Цикл
            _Поз = Найти(ВРег(_МакросИзШаблона), _ЭлементРегистрыШаблона.Ключ);
            Если _Поз = 0 Тогда
                Продолжить;
            КонецЕсли;
            
            _СимволМакроса         = Лев(_ЭлементРегистрыШаблона.Ключ, 1); 
            _НайденныйШаблон     = Сред(_МакросИзШаблона, _Поз, СтрДлина(_ЭлементРегистрыШаблона.Ключ)); 
            _РегистрыШаблона[_СимволМакроса] = _НайденныйШаблон; 
            
            Если _Метод = "ФИО" Тогда
                _ПриведенныйМакрос = "%" + Найти("ФИО", _СимволМакроса); 
                _МакросИзШаблона = СтрЗаменить(_МакросИзШаблона, _НайденныйШаблон, _ПриведенныйМакрос);
            КонецЕсли;
        КонецЦикла;
        
        Если _Метод = "ФИО" Тогда
            Для _Ном = 1 По 3 Цикл
                _МакросИзШаблона = СтрЗаменить(_МакросИзШаблона, "%" + _Ном, "%" + Сред("ФИО", _Ном, 1));
            КонецЦикла; 
        КонецЕсли;
            
    КонецЕсли;
    
    _ТаблицаСлова = Новый ТаблицаЗначений;
    _ТаблицаСлова.Колонки.Добавить("Значение");
    _ТаблицаСлова.Колонки.Добавить("Субметод");
    _ТаблицаСлова.Колонки.Добавить("Род");
    _ТаблицаСлова.Колонки.Добавить("Тег");
    _ТаблицаСлова.Колонки.Добавить("Регистр");
    _ТаблицаСлова.Колонки.Добавить("Склонение");
    _ТаблицаСлова.Колонки.Добавить("Порядок", Новый ОписаниеТипов("Число"));
    
    _ПадежИтоговый    = Сред("ИИРДВТПОИРДВТПО", Найти("ИРДВТПО1234567", ВРег(_Падеж)) + 1, 1); 
    _РодИтоговый    = СокрЛП(Сред("  МЖСНМЖСН", Найти("?МЖСН1234", ВРег(_Род)) + 1, 1)); 
    _МакросПоУмолчанию = "";
    _ПозШаблонВход = 1;
    _ПозЧастиСтроки = 0;
    _СоставноеСлово = Ложь;
    _РодСклонения    = ?(_Метод = "Ч", "", _РодИтоговый); 
    
    _МассивЧастиСтроки = daСклонение("_ВМассивСРазделителями", _Выражение, _Разделители);
    Пока _ПозЧастиСтроки <= _МассивЧастиСтроки.ВГраница() Цикл
        
        _ЧастьСтроки = _МассивЧастиСтроки[_ПозЧастиСтроки];
        
        Если _Метод = "ФИО" И НЕ ПустаяСтрока(_МакросИзШаблона) И Лев(_ЧастьСтроки, 1) = "." И _ТаблицаСлова.Количество() > 0 И СтрДлина(_ТаблицаСлова[_ТаблицаСлова.Количество() - 1].Регистр) > 1 Тогда
            _ТаблицаСлова[_ТаблицаСлова.Количество() - 1].Тег = "."; 
        КонецЕсли;
            
        Если Найти(_Разделители, Лев(_ЧастьСтроки, 1)) > 0 ИЛИ (_Метод = "ФИО" И _ПозШаблонВход > СтрДлина(_РежимЗапуска)) Тогда 
            _МакросПоУмолчанию = _МакросПоУмолчанию + ?(_СоставноеСлово, "", _ЧастьСтроки); 
        Иначе
            _СтрокаСлово = _ТаблицаСлова.Добавить();
            
            Если Лев(_ЧастьСтроки, 1) = "\" Тогда
                _ЧастьСтроки = Сред(_ЧастьСтроки, 2);
                _СтрокаСлово.Склонение = "-";
            ИначеЕсли Лев(_ЧастьСтроки, 1) = "^" Тогда  
                _ЧастьСтроки = Сред(_ЧастьСтроки, 2);
                _СтрокаСлово.Склонение = "+"; 
            КонецЕсли; 
            
            _СтруктураТипы = daСклонение("_ПроверкаТипов", _ЧастьСтроки);
            
            Если _Метод = "Ч" И _СтрокаСлово.Склонение <> "-" И _СтрокаСлово.Склонение <> "+" И _СтруктураТипы.ЕстьЦифры И НЕ _СтруктураТипы.ЕстьНеЦифры Тогда 
                _МассивЧастиСубСтроки = daСклонение("_ВМассивСРазделителями", СокрЛП(ЧислоПрописью(_ЧастьСтроки, "Л = ru_RU", ",,,,,,,,0")), " ");
                _МассивЧастиСтроки.Удалить(_ПозЧастиСтроки);
                Для _ПозЧастиСубСтроки = 0 По _МассивЧастиСубСтроки.ВГраница() Цикл
                    _МассивЧастиСтроки.Вставить(_ПозЧастиСтроки, _МассивЧастиСубСтроки[_МассивЧастиСубСтроки.ВГраница() - _ПозЧастиСубСтроки]);
                КонецЦикла; 
                _ЧастьСтроки = _МассивЧастиСтроки[_ПозЧастиСтроки];
            КонецЕсли;
            
            Если СтрДлина(_ЧастьСтроки) <= 1 И НЕ _СтруктураТипы.ЕстьЦифры Тогда 
                _СтрокаСлово.Склонение = "-";
            КонецЕсли;
            _СтрокаСлово.Значение = _ЧастьСтроки;
            
            Если _Метод = "ФИО" Тогда
                Если _ПозЧастиСтроки <= _МассивЧастиСтроки.ВГраница() - 2 И _МассивЧастиСтроки[_ПозЧастиСтроки + 1] = "-" Тогда 
                    _СтрокаСлово.Тег = "Н"; 
                    _СоставноеСлово = Истина;
                Иначе
                    _СоставноеСлово = Ложь;
                КонецЕсли; 
                _СимволМакроса = Сред(_РежимЗапуска, _ПозШаблонВход, 1);
                _СтрокаСлово.Регистр = _РегистрыШаблона[_СимволМакроса];
                _СтрокаСлово.Субметод = Сред(_РежимЗапуска, _ПозШаблонВход, 1); 
                _СтрокаСлово.Порядок = Найти("ОФИ", _СтрокаСлово.Субметод) * 100 + _ПозЧастиСтроки; 
            Иначе
                _СтрокаСлово.Субметод = _Метод;
                _СимволМакроса = "С" + Формат(_ПозШаблонВход, "ЧЦ=2; ЧВН="); 
                
                Если _Метод = "Ч" И ((_ПозЧастиСтроки + 1 <= _МассивЧастиСтроки.ВГраница() И Найти("/-.", Лев(_МассивЧастиСтроки[_ПозЧастиСтроки + 1], 1)) > 0)
                    ИЛИ (_ПозЧастиСтроки - 1 >= 0 И Найти("/-.", Лев(_МассивЧастиСтроки[_ПозЧастиСтроки - 1], 1)) > 0)) Тогда
                    _СтруктураТипы.Аббревиатура = Истина; 
                КонецЕсли;
                
                Если _СтруктураТипы.Аббревиатура Тогда
                    _СтрокаСлово.Регистр = _РегистрыШаблона.Г + _РегистрыШаблона.Г;
                    _СтрокаСлово.Склонение = "-"; 
                Иначе
                    _СтрокаСлово.Регистр = ?(_ПозШаблонВход = 1, _РегистрыШаблона.А, _РегистрыШаблона.Б) + _РегистрыШаблона.В;
                КонецЕсли;
                
                daСклонение("_ПросклонятьСлово", _ПадежИтоговый, _РодСклонения, _СтрокаСлово);
            КонецЕсли;
            
            Если НЕ _СоставноеСлово Тогда
                _ПозШаблонВход = _ПозШаблонВход + 1;
                _МакросПоУмолчанию = _МакросПоУмолчанию + "%" + _СимволМакроса;
            КонецЕсли;
            
        КонецЕсли;
        
        _ПозЧастиСтроки = _ПозЧастиСтроки + 1;
        
    КонецЦикла;
    
    _МакросИзШаблона = ?(_Метод = "ФИО" И НЕ ПустаяСтрока(_МакросИзШаблона), _МакросИзШаблона, _МакросПоУмолчанию);
    
    Если _Метод = "ФИО" Тогда
        Пока _ПозШаблонВход <= СтрДлина(_РежимЗапуска) Цикл 
            _СтрокаСлово = _ТаблицаСлова.Добавить();
            _СтрокаСлово.Субметод = Сред(_РежимЗапуска, _ПозШаблонВход, 1);
            _СтрокаСлово.Склонение = "-"; 
            _ПозШаблонВход = _ПозШаблонВход + 1;
        КонецЦикла;
        _ТаблицаСлова.Сортировать("Порядок");
    КонецЕсли;
    
    _РодНайденный    = ""; 
    
    Для Каждого _СтрокаСлово Из _ТаблицаСлова Цикл
        
        _ПадежСклонения = _ПадежИтоговый;
        
        Если _СтрокаСлово.Субметод = "Ч" Тогда 
            
            _СледИндекс = _ТаблицаСлова.Индекс(_СтрокаСлово) + 1;
            _РодСклонения = _РодИтоговый;
            Если _СледИндекс <= _ТаблицаСлова.Количество() - 1 И НЕ ПустаяСтрока(_ТаблицаСлова[_СледИндекс].Род) Тогда
                _РодСклонения = _ТаблицаСлова[_СледИндекс].Род;
            КонецЕсли;
            
        ИначеЕсли _СтрокаСлово.Субметод = "В" Тогда 
            
            _ТипСклонения = "";
            _ПредИндекс = _ТаблицаСлова.Индекс(_СтрокаСлово) - 1;
            Пока ИСТИНА Цикл 
                Если _ПредИндекс < 0 Тогда
                    Прервать;
                ИначеЕсли _ТаблицаСлова[_ПредИндекс].Субметод = "Ч" Тогда
                    _ТипСклонения = _ТаблицаСлова[_ПредИндекс].Тег; 
                    Прервать;
                Иначе
                    _ПредИндекс = _ПредИндекс - 1;
                КонецЕсли;
            КонецЦикла;
            
            Если _ТипСклонения = "1" Тогда 
                _РодСклонения = "";
                _ПадежСклонения = _ПадежИтоговый;
            ИначеЕсли _ТипСклонения = "2" Тогда 
                Если Найти("ИВ", _ПадежИтоговый) > 0 Тогда
                    _РодСклонения = ?(_СтрокаСлово.Тег = "Р", "Н", ""); 
                    _ПадежСклонения = "Р";
                Иначе    
                    _РодСклонения = "Н";
                    _ПадежСклонения = _ПадежИтоговый;
                КонецЕсли; 
            ИначеЕсли _ТипСклонения = "5" Тогда 
                Если Найти("ИВ", _ПадежИтоговый) > 0 Тогда
                    _РодСклонения = "Н";
                    _ПадежСклонения = "Р";
                Иначе    
                    _РодСклонения = "Н";
                    _ПадежСклонения = _ПадежИтоговый;
                КонецЕсли;
            Иначе 
                _РодСклонения = _СтрокаСлово.Род; 
                _ПадежСклонения = _ПадежИтоговый;
            КонецЕсли; 
            
        ИначеЕсли _СтрокаСлово.Субметод = "Д" И _СтрокаСлово.Тег = "К" Тогда 
            
            _ТекИндекс = _ТаблицаСлова.Индекс(_СтрокаСлово);
            Пока ИСТИНА Цикл 
                _СледИндекс = _ТекИндекс + 1;
                Если _ТекИндекс + 1 > _ТаблицаСлова.Количество() - 1 ИЛИ ПустаяСтрока(_ТаблицаСлова[_ТекИндекс + 1].Тег) Тогда 
                    Прервать;
                Иначе
                    Если _ТаблицаСлова[_СледИндекс].Тег = "П" Тогда 
                        _СтрокаСлово.Склонение = "-"; 
                        Прервать;
                    КонецЕсли; 
                    _ТекИндекс = _ТекИндекс + 1;
                КонецЕсли; 
            КонецЦикла;
            
        КонецЕсли;
        
        daСклонение("_ПросклонятьСлово", _ПадежСклонения, _РодСклонения, _СтрокаСлово);
        
        _РодНайденный = ?(НЕ ПустаяСтрока(_СтрокаСлово.Род), _СтрокаСлово.Род, _РодНайденный);
        _РодСклонения = ?(_Метод = "ФИО" И НЕ ПустаяСтрока(_РодНайденный), _РодНайденный, _РодСклонения); 
        
    КонецЦикла;
    
    Если _Род = "?" Тогда 
        _Род = ?(ПустаяСтрока(_РодНайденный), "?", _РодНайденный);
    КонецЕсли; 
    
    _РодИтоговый = ?(ПустаяСтрока(_РодИтоговый), ?(ПустаяСтрока(_РодНайденный), "М", _РодНайденный), _РодИтоговый); 
    _РезультатСклонения = "";
    
    Для Каждого _СтрокаСлово Из _ТаблицаСлова Цикл
        
        daСклонение("_ПросклонятьСлово", _ПадежИтоговый, _РодИтоговый, _СтрокаСлово); 
        _СтрокаСлово.Значение = daСклонение("_ПривестиПоДлинеИРегистру", _СтрокаСлово.Значение, _СтрокаСлово.Регистр);
        
        Если _СтрокаСлово.Тег = "Н" Тогда 
            _РезультатСклонения    = _РезультатСклонения + _СтрокаСлово.Значение + "-";
            Продолжить;
        КонецЕсли;
        
        _РезультатСклонения    = _РезультатСклонения + _СтрокаСлово.Значение;
        
        Если _Метод = "ФИО" Тогда
            _ЭлементШаблона = "%" + _СтрокаСлово.Субметод;
            Если НЕ ЗначениеЗаполнено(_СтрокаСлово.Значение) Тогда 
                _Поз = Найти(_МакросИзШаблона, _ЭлементШаблона);
                _ЭлементШаблона = ?(_Поз > 1 И Сред(_МакросИзШаблона, _Поз - 1, 1) = " ", " ", "") + _ЭлементШаблона + ?(_Поз <> 0 И Сред(_МакросИзШаблона, _Поз + 2, 1) = ".", ".", ""); 
            КонецЕсли;
            _РезультатСклонения    = _РезультатСклонения + _СтрокаСлово.Тег; 
        Иначе
            _ЭлементШаблона = "%С" + Формат(_ТаблицаСлова.Индекс(_СтрокаСлово) + 1, "ЧЦ=2; ЧВН=");
        КонецЕсли;
        
        _МакросИзШаблона = СтрЗаменить(_МакросИзШаблона, _ЭлементШаблона, _РезультатСклонения);
        
        _РезультатСклонения = "";
        
    КонецЦикла;
    
    Возврат _МакросИзШаблона;
        
КонецФункции

Функция ПадежФИО(Знач ФИО,Падеж=2,ТолькоИнициалы=Ложь) Экспорт
	Если ТипЗнч(ФИО)<>Тип("Строка") Тогда
		Сообщить("Неверная строка передана ""падежу ФИО!"""); Возврат ФИО;
	КонецЕсли;
 
	// уберем множественные пробелы
	Пока 1=1 Цикл
		ФИО=СокрЛП(СтрЗаменить(ФИО,"  "," "));
		Если Найти(ФИО,"  ")=0 Тогда Прервать КонецЕсли;
	КонецЦикла;
 
	// вернем, если сам именительный
	Если (Лев(Падеж,1)="И") или (Падеж=1) Тогда Возврат ФИО КонецЕсли;
 
	Если ТипЗнч(Падеж)=Тип("Строка") Тогда
		пад=СокрЛП(НРег(Лев(Падеж,1))); 
		Если Найти("рдвтп",пад)=0 Тогда
			Сообщить("Неверный падеж передан ""падежу ФИО""!"); Возврат ФИО;
		КонецЕсли;
	ИначеЕсли ТипЗнч(Падеж)=Тип("Число") Тогда
		Если (Падеж<1) или (Падеж>6) Тогда
			Сообщить("Неверный падеж передан ""падежу ФИО""!"); Возврат ФИО;
		КонецЕсли;			
		пад=Падеж-1;
	КонецЕсли;
 
	ФИО=СокрЛП(НРег(ФИО)); // так удобнее
 
	// свой анализатор состава
	Фамилия="";
	Для й=1 По СтрДлина(ФИО) Цикл
		символс=Сред(ФИО,й,1);
		Если символс=" " Тогда Прервать КонецЕсли;
		Фамилия=Фамилия+символс;
	КонецЦикла;
	ы=й+1; // перешли пробел
	Имя="";
	Для й=ы По СтрДлина(ФИО) Цикл
		символс=Сред(ФИО,й,1);
		Если символс=" " Тогда Прервать КонецЕсли;
		Имя=Имя+символс;
	КонецЦикла;
	ы=й+1; // перешли второй пробел
	Отчество="";
	Для й=ы По СтрДлина(ФИО) Цикл
		символс=Сред(ФИО,й,1);
		Если символс=" " Тогда Прервать КонецЕсли;
		Отчество=Отчество+символс;
	КонецЦикла;
 
	// теперь имеем раздельно Фамилию, Имя и Отчество.	
	// начинается собственно блок анализа содержания и падежей
 
	// проанализируем пол М/Ж
	Если Прав(Отчество,1)="а" Тогда Пол="Ж" Иначе Пол="М" КонецЕсли;
 
	// создадим структуру таблицы, хранящей окончания слов
	ток = Новый ТаблицаЗначений ();
	ТипСтроки=Новый ОписаниеТипов("Строка",Новый КвалификаторыСтроки(2));
	ТипЧисла=Новый ОписаниеТипов("Число",Новый КвалификаторыЧисла(1,0));
	ток.Колонки.Добавить("СтарОк",ТипСтроки); // старое окончание 2 символа
	// колонки, хранящие новые окончания слов
	ток.Колонки.Добавить("р"); // родительный
	ток.Колонки.Добавить("д"); // дательный
	ток.Колонки.Добавить("в"); // винительный
	ток.Колонки.Добавить("т"); // творительный
	ток.Колонки.Добавить("п"); // предложный
	// для указания, сколько букв с конца слова отсечь,
	ток.Колонки.Добавить("КолвоСрез",ТипЧисла); // кол-во срезаемых букв
 
	Гласные="аеэоуиыяюьъ"; // список гласных букв в виде строки
 
	// ======== обработаем фамилию ==========
	// заполним таблицу данными для фамилии
 
	Если пол="М" Тогда
		строток=ток.Добавить(); // иванов
		строток.СтарОк="*s";
		строток.р="а"; строток.д="у"; строток.в="а"; строток.т="ым"; строток.п="е";
		строток.КолвоСрез=0;
 
		строток=ток.Добавить(); // красинский
		строток.СтарОк="*й"; 
		строток.р="я"; строток.д="ю"; строток.в="я"; строток.т="ем"; строток.п="е";
		строток.КолвоСрез=1;
 
		строток=ток.Добавить(); // белый
		строток.СтарОк="ый";
		строток.р="ого"; строток.д="ому"; строток.в="ого"; строток.т="ым"; строток.п="ом";
		строток.КолвоСрез=2;
 
		строток=ток.Добавить(); // палей
		строток.СтарОк="*й";
		строток.р="я"; строток.д="ю"; строток.в="я"; строток.т="ем"; строток.п="е";
		строток.КолвоСрез=1;
 
		строток=ток.Добавить(); // рабинович
		строток.СтарОк="*ч";
		строток.р="а"; строток.д="у"; строток.в="а"; строток.т="ем"; строток.п="е";
		строток.КолвоСрез=0;
 
		строток=ток.Добавить(); // починок, зализняк
		строток.СтарОк="*к";
		строток.р="а"; строток.д="у"; строток.в="а"; строток.т="ом"; строток.п="е";
		строток.КолвоСрез=0;
 
		строток=ток.Добавить(); // шинкарь
		строток.СтарОк="*ь";
		строток.р="я"; строток.д="ю"; строток.в="я"; строток.т="ем"; строток.п="е";
		строток.КолвоСрез=1;
 
		строток=ток.Добавить(); // перельман, оганесян
		строток.СтарОк="*н";
		строток.р="а"; строток.д="у"; строток.в="а"; строток.т="ом"; строток.п="е";
		строток.КолвоСрез=0;
 
		строток=ток.Добавить(); // баранкин
		строток.СтарОк="ин";
		строток.р="а"; строток.д="у"; строток.в="а"; строток.т="ым"; строток.п="е";
		строток.КолвоСрез=0;
 
	ИначеЕсли Пол="Ж" Тогда		
		строток=ток.Добавить(); // склодовская
		строток.СтарОк="ая";
		строток.р="ой"; строток.д="ой"; строток.в="ую"; строток.т="ой"; строток.п="ой";
		строток.КолвоСрез=2;
 
		строток=ток.Добавить(); // иванова
		строток.СтарОк="*а"; 
		строток.р="ой"; строток.д="ой"; строток.в="у"; строток.т="ой"; строток.п="ой";
		строток.КолвоСрез=1;
	КонецЕсли;
 
	// таблица заполнена. считаем 2 последних буквы и поищем их
	Если не ПустаяСтрока(Фамилия) Тогда
		пб=Прав(Фамилия,2); кол="СтарОк"; // ищем по ней
		новФамилия=Фамилия; // если ничего не изменится, так и будет
		стро=ток.Найти(пб,кол);
		Если стро<>Неопределено Тогда // нашли строгое сразу
			Основа=Лев(Фамилия,СтрДлина(Фамилия)-стро.КолвоСрез);
			новФамилия=Основа+СокрЛП(стро[пад]);
		Иначе // строго не нашли, ищем только по последней
			пб="*"+Прав(пб,1); 
			стро=ток.Найти(пб,кол);
			Если стро<>Неопределено Тогда // нашли по последней
				Основа=Лев(Фамилия,СтрДлина(Фамилия)-стро.КолвоСрез);
				новФамилия=Основа+СокрЛП(стро[пад]);
			Иначе // по последней не нашли, ищем по виду буквы
				пб="*"+?(Найти(Гласные,Прав(пб,1))=0,"s","g");
				стро=ток.Найти(пб,кол);
				Если стро<>Неопределено Тогда // нашли по виду
					Основа=Лев(Фамилия,СтрДлина(Фамилия)-стро.КолвоСрез);
					новФамилия=Основа+СокрЛП(стро[пад]);
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
	Иначе
		новФамилия="";
	КонецЕсли;
 
	// ======== обработаем имя ==========
	// заполним таблицу данными для имени
	ток.Очистить();
 
	Если Пол="М" Тогда
		// обработаем исключения
		Если Имя="лев" Тогда Имя="льв" КонецЕсли;
		Если Имя="павел" Тогда Имя="павл" КонецЕсли;
 
		строток=ток.Добавить(); // сергей
		строток.старок="*й";
		строток.р="я"; строток.д="ю"; строток.в="я"; строток.т="ем"; строток.п="е";
		строток.колвосрез=1;
 
		строток=ток.Добавить(); // иван + лев + павел
		строток.старок="*s";
		строток.р="а"; строток.д="у"; строток.в="а"; строток.т="ом"; строток.п="е";
		строток.колвосрез=0;
 
		строток=ток.Добавить(); // никита
		строток.старок="*а";
		строток.р="ы"; строток.д="е"; строток.в="у"; строток.т="ой"; строток.п="е";
		строток.колвосрез=1;
 
		строток=ток.Добавить(); // лука
		строток.старок="ка";
		строток.р="и"; строток.д="е"; строток.в="у"; строток.т="ой"; строток.п="е";
		строток.колвосрез=1;
 
		строток=ток.Добавить(); // иеремия
		строток.старок="ия";
		строток.р="и"; строток.д="и"; строток.в="ю"; строток.т="ей"; строток.п="и";
		строток.колвосрез=1;
 
		строток=ток.Добавить(); // илья
		строток.старок="*я";
		строток.р="и"; строток.д="е"; строток.в="ю"; строток.т="ей"; строток.п="е";
		строток.колвосрез=1;
 
		строток=ток.Добавить(); // игорь
		строток.старок="*ь";
		строток.р="я"; строток.д="ю"; строток.в="я"; строток.т="ем"; строток.п="е";
		строток.колвосрез=1;
 
	ИначеЕсли Пол="Ж" Тогда
		// обработаем исключения
		//Если Имя="ольга" Тогда Имя="ольгь" КонецЕсли;
 
		строток=ток.Добавить(); // ирина
		строток.старок="*а";
		строток.р="ы"; строток.д="е"; строток.в="у"; строток.т="ой"; строток.п="е";
		строток.колвосрез=1;
 
		строток=ток.Добавить(); // инга, ольга
		строток.старок="га";
		строток.р="и"; строток.д="е"; строток.в="у"; строток.т="ой"; строток.п="е";
		строток.колвосрез=1;
 
		строток=ток.Добавить(); // эсфирь
		строток.старок="*ь";
		строток.р="и"; строток.д="и"; строток.в="ь"; строток.т="ью"; строток.п="и";
		строток.колвосрез=1;
 
		строток=ток.Добавить(); // мария
		строток.старок="ия";
		строток.р="и"; строток.д="и"; строток.в="ю"; строток.т="ей"; строток.п="и";
		строток.колвосрез=1;
 
		строток=ток.Добавить(); // софья
		строток.старок="*я";
		строток.р="и"; строток.д="е"; строток.в="ю"; строток.т="ей"; строток.п="е";
		строток.колвосрез=1;
	КонецЕсли;
 
	// таблица заполнена. считаем 2 последних буквы и поищем их
	Если не ПустаяСтрока(Имя) Тогда
		пб=Прав(Имя,2); кол="СтарОк"; // ищем по ней
		новИмя=Имя; // если ничего не изменится, так и будет
		стро=ток.Найти(пб,кол);
		Если стро<>Неопределено Тогда // нашли строгое сразу
			Основа=Лев(Имя,СтрДлина(Имя)-стро.КолвоСрез);
			новИмя=Основа+СокрЛП(стро[пад]);
		Иначе // строго не нашли, ищем только по последней
			пб="*"+Прав(пб,1); 
			стро=ток.Найти(пб,кол);
			Если стро<>Неопределено Тогда // нашли по последней
				Основа=Лев(Имя,СтрДлина(Имя)-стро.КолвоСрез);
				новИмя=Основа+СокрЛП(стро[пад]);
			Иначе // по последней не нашли, ищем по виду буквы
				пб="*"+?(Найти(Гласные,Прав(пб,1))=0,"s","g");
				стро=ток.Найти(пб,кол);
				Если стро<>Неопределено=1 Тогда // нашли по виду
					Основа=Лев(Имя,СтрДлина(Имя)-стро.КолвоСрез);
					новИмя=Основа+СокрЛП(стро[пад]);
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
	Иначе
		новИмя="";
	КонецЕсли;
 
	// ======== обработаем отчество, тут проще ==========
	ток.Очистить();
 
	Если Пол="М" Тогда
		строток=ток.Добавить();
		строток.р="а"; строток.д="у"; строток.в="а"; строток.т="ем"; строток.п="е";
		строток.колвосрез=0;
	ИначеЕсли Пол="Ж" Тогда
		строток=ток.Добавить();
		строток.р="ы"; строток.д="е"; строток.в="у"; строток.т="ой"; строток.п="е";
		строток.колвосрез=1;
	КонецЕсли;
	Если не ПустаяСтрока(Отчество) Тогда
		Основа=Лев(Отчество,СтрДлина(Отчество)-ток[0].КолвоСрез);	
		новОтчество=Основа+СокрЛП(ток[0][пад]);
	Иначе
		новОтчество="";
	КонецЕсли;	
 
	Если ТолькоИнициалы Тогда
		новИмя=Лев(новИмя,1); новОтчество=Лев(новОтчество,1);
	КонецЕсли;
 
	// установим первые буквы верхним регистром
	новФамилия=ВРег(Лев(новФамилия,1))+Сред(новФамилия,2);
	новИмя=ВРег(Лев(новИмя,1))+Сред(новИмя,2);
	новОтчество=ВРег(Лев(новОтчество,1))+Сред(новОтчество,2);
 
	// и теперь всё вместе	
	новФИО=новФамилия+" "+новИмя+" "+новОтчество;
	Возврат новФИО;
КонецФункции

Функция ПолучитьДоверенность(Сотр,Орг) Экспорт

	Рез1 = Справочники.ПодтверждающиеДокументы.ПустаяСсылка();
	 
	Запрос = Новый Запрос();
 	Запрос.Текст = "ВЫБРАТЬ
 	               |	ПодтверждающиеДокументы.Ссылка КАК Ссылка
 	               |ИЗ
 	               |	Справочник.ПодтверждающиеДокументы КАК ПодтверждающиеДокументы
 	               |ГДЕ
 	               |	ПодтверждающиеДокументы.ВидПодтверждающегоДокумента = ЗНАЧЕНИЕ(Перечисление.ВидыДокументов.Доверенность)
 	               |	И ПодтверждающиеДокументы.Владелец = &Владелец
 	               |	И ПодтверждающиеДокументы.Организация = &Организация
 	               |	И ПодтверждающиеДокументы.Текущий
 	               |
 	               |УПОРЯДОЧИТЬ ПО
 	               |	ПодтверждающиеДокументы.ДатаВыдачи УБЫВ";
	
 	Запрос.УстановитьПараметр("Владелец", Сотр);
	Запрос.УстановитьПараметр("Организация", Орг);
 
	Рез1 = Запрос.Выполнить().Выбрать();
	
	Если Рез1.Следующий() Тогда
		Возврат Рез1.Ссылка;
		
	Иначе
		Рез1 = Неопределено;
	КонецЕсли;

	Возврат Рез1;
 
КонецФункции // ПолучитьДоверенность(Сотр,Орг)
//Бондаренко-- 20210517

// Семенихин 27.05.2021 +++++
Процедура РаспределитьРабочиеЛистыУволенныхМОП(Параметры = Неопределено) Экспорт
	АктивныеСтатусы = Новый Массив();
	АктивныеСтатусы.Добавить(Справочники.СтатусыРабочегоЛиста.Создан);
	АктивныеСтатусы.Добавить(Справочники.СтатусыРабочегоЛиста.Интерес);
	АктивныеСтатусы.Добавить(Справочники.СтатусыРабочегоЛиста.Сделка);
	АктивныеСтатусы.Добавить(Справочники.СтатусыРабочегоЛиста.Архив);
	
	ЗапросРЛ = Новый Запрос();
	ЗапросРЛ.УстановитьПараметр("АктивныеСтатусы", АктивныеСтатусы);
	ЗапросРЛ.Текст =
	"ВЫБРАТЬ
	|	РабочийЛист.Ссылка КАК Ссылка,
	|	РабочийЛист.ПодразделениеКомпании КАК ПодразделениеКомпании
	|ИЗ
	|	Документ.РабочийЛист КАК РабочийЛист
	|ГДЕ
	|	РабочийЛист.Менеджер.ФлагУволен
	|	И РабочийЛист.Менеджер.Подразделение В ИЕРАРХИИ(&ГруппаПодразделений)
	|	И РабочийЛист.Статус В(&АктивныеСтатусы)
	|	И НЕ РабочийЛист.ПометкаУдаления
	|
	|УПОРЯДОЧИТЬ ПО
	|	РабочийЛист.Дата";
	
	ЗапросПереводРЛ = Новый Запрос();
	ЗапросПереводРЛ.УстановитьПараметр("АктивныеСтатусы", АктивныеСтатусы);
	ЗапросПереводРЛ.УстановитьПараметр("МенеджерОП", Справочники.Должности.МенеджерОтделаПродажАвтомобилей);
	ЗапросПереводРЛ.Текст =
	"ВЫБРАТЬ
	|	Сотрудники.Ссылка
	|ПОМЕСТИТЬ ПереведенныеСотрудники
	|ИЗ
	|	Справочник.Сотрудники КАК Сотрудники
	|ГДЕ
	|	Сотрудники.Должность = &МенеджерОП
	|	И НЕ Сотрудники.Подразделение В ИЕРАРХИИ (&ГруппаПодразделений)
	|	И НЕ Сотрудники.ФлагУволен
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	РабочийЛист.Ссылка КАК Ссылка,
	|	РабочийЛист.ПодразделениеКомпании КАК ПодразделениеКомпании
	|ИЗ
	|	Документ.РабочийЛист КАК РабочийЛист
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ПереведенныеСотрудники КАК ПереведенныеСотрудники
	|		ПО РабочийЛист.Менеджер = ПереведенныеСотрудники.Ссылка
	|ГДЕ
	|	РабочийЛист.Статус В(&АктивныеСтатусы)
	|	И НЕ РабочийЛист.ПометкаУдаления
	|	И РабочийЛист.ПодразделениеКомпании В ИЕРАРХИИ(&ГруппаПодразделений)
	|
	|УПОРЯДОЧИТЬ ПО
	|	РабочийЛист.Дата";
	
	ЗапросМОП = Новый Запрос();
	ЗапросМОП.УстановитьПараметр("МенеджерОП", Справочники.Должности.МенеджерОтделаПродажАвтомобилей);
	ЗапросМОП.Текст =
	"ВЫБРАТЬ
	|	Сотрудники.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.Сотрудники КАК Сотрудники
	|ГДЕ
	|	Сотрудники.Подразделение В ИЕРАРХИИ(&ГруппаПодразделений)
	|	И Сотрудники.Должность = &МенеджерОП
	|	И НЕ Сотрудники.ФлагУволен";
	
	сзМенеджерыОП = Новый СписокЗначений;
	ПодразделенияВыборка = Справочники.ПодразделенияКомпании.Выбрать(Справочники.ПодразделенияКомпании.ОсновноеПодразделение,,, "Наименование");
	Пока ПодразделенияВыборка.Следующий() Цикл
		КодПодр = ПодразделенияВыборка.Код;
		Если КодПодр = "ЦБ001247" Или КодПодр = "00002" Тогда // _Управляющая компания или ОПТ
			Продолжить;
			
		ИначеЕсли ПодразделенияВыборка.Ссылка.ПометкаУдаления Тогда
			Продолжить;
		КонецЕсли;
		
		ЗапросМОП.УстановитьПараметр("ГруппаПодразделений", ПодразделенияВыборка.Ссылка);
	 	сзМенеджерыОП.ЗагрузитьЗначения(ЗапросМОП.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка"));
		Если сзМенеджерыОП.Количество() = 0 Тогда
			Продолжить;
		КонецЕсли;
		
		ЗапросРЛ.УстановитьПараметр("ГруппаПодразделений", ПодразделенияВыборка.Ссылка);
		выбРабочиеЛисты = ЗапросРЛ.Выполнить().Выбрать();
		Если выбРабочиеЛисты.Количество() > 0 Тогда
			РаспределитьРабочиеЛисты(выбРабочиеЛисты, сзМенеджерыОП);
		КонецЕсли;
		
		//ЗапросПереводРЛ.УстановитьПараметр("ГруппаПодразделений", ПодразделенияВыборка.Ссылка);
		//выбРабочиеЛисты = ЗапросПереводРЛ.Выполнить().Выбрать();
		//РаспределитьРабочиеЛисты(выбРабочиеЛисты, сзМенеджерыОП);
	КонецЦикла;	
КонецПроцедуры

Процедура РаспределитьРабочиеЛисты(ВыборкаРЛ, СписокМенеджеров) Экспорт
	КоличествоМенеджеров = СписокМенеджеров.Количество();
	ТекущаяДата = ТекущаяДата();
	ВсегоДокументов = ВыборкаРЛ.Количество();
	
	сч = 0;
	сч1 = 0;
	КоличествоМенеджеровБезДоступа = 0;
	ЕстьРабЛисты = ВыборкаРЛ.Следующий();	
	Пока ЕстьРабЛисты Цикл			
		Для Каждого Менеджер Из СписокМенеджеров Цикл
			Если ЕстьДоступКДокументам(Менеджер.Значение, ВыборкаРЛ.ПодразделениеКомпании) Тогда
				ПередатьРабочийЛист(ВыборкаРЛ.Ссылка, Менеджер.Значение);
				сч = сч + 1;
				
				ЕстьРабЛисты = ВыборкаРЛ.Следующий();
				Если Не ЕстьРабЛисты Тогда
					Прервать;
				КонецЕсли;
				
			Иначе
				КоличествоМенеджеровБезДоступа = КоличествоМенеджеровБезДоступа + 1;
				Если КоличествоМенеджеровБезДоступа = КоличествоМенеджеров Тогда
					РОП = ВыборкаРЛ.ПодразделениеКомпании.РуководительОП;
					Если ЗначениеЗаполнено(РОП) Тогда
						ПередатьРабочийЛист(ВыборкаРЛ.Ссылка, РОП);
						сч = сч + 1;
					Иначе
						сч1 = сч1 + 1;
					КонецЕсли;
					
					ЕстьРабЛисты = ВыборкаРЛ.Следующий();
					Если Не ЕстьРабЛисты Тогда
						Прервать;
					КонецЕсли;
					КоличествоМенеджеровБезДоступа = 0;
					
				Иначе
					Продолжить;
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
		
		КоличествоМенеджеровБезДоступа = 0;
		#Если Клиент Тогда
		Состояние("Обработано: " + Строка(сч + сч1) + " документов из " + ВсегоДокументов);
		#КонецЕсли
	КонецЦикла;
	
	#Если Клиент Тогда
	Состояние();
	Сообщить("Модифицировано рабочих листов: " + Строка(сч) + ".", СтатусСообщения.Информация);
	Если сч1 > 0 Тогда
		Сообщить("Не удалось записать: " + Строка(сч1) + " рабочих листов.", СтатусСообщения.Внимание);
	КонецЕсли;
	#КонецЕсли
КонецПроцедуры

Функция ЕстьДоступКДокументам(Сотрудник, Подразделение)
	Если Сотрудник.Подразделение = Подразделение Тогда
		Возврат Истина;
	Иначе
		ЕстьДоступ = Ложь;	
	КонецЕсли;
	
	Для Каждого СтрокаПодразделение Из Сотрудник.ТаблицаПодразделенийРаботы Цикл
		Если СтрокаПодразделение.ПодразделениеРаботы = Справочники.ПодразделенияКомпании.ОсновноеПодразделение Тогда
			Продолжить;
		КонецЕсли;
		
		Если Подразделение = СтрокаПодразделение.ПодразделениеРаботы 
			Или Подразделение.ПринадлежитЭлементу(СтрокаПодразделение.ПодразделениеРаботы) Тогда
			ЕстьДоступ = Истина;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	Возврат ЕстьДоступ;
КонецФункции

Процедура ПередатьРабочийЛист(РабочийЛистСсылка, Менеджер)
	РабочийЛист = РабочийЛистСсылка.ПолучитьОбъект();
	РабочийЛист.Менеджер = Менеджер;
	РабочийЛист.ДатаИзменения = ТекущаяДата();
	#Если Клиент Тогда
		НовыйКомментарий = "Оператор: " + Строка(ПараметрыСеанса.Пользователь) + ".";
	#Иначе
		НовыйКомментарий = "Распределение РЛ уволенных МОП.";
	#КонецЕсли
	РабочийЛист.Комментарий = РабочийЛист.Комментарий + Символы.ПС + НовыйКомментарий +
	" Передан " + Формат(ТекущаяДата(), "ДЛФ=ДВ") + " от " + Строка(РабочийЛист.Ссылка.Менеджер);
	
	РабочийЛистЗаписан = Истина;
	Попытка
		РабочийЛист.ОбменДанными.Загрузка = Истина;
		РабочийЛист.Записать();
	Исключение
		РабочийЛистЗаписан = Ложь;
	КонецПопытки;

	Если РабочийЛистЗаписан Тогда
		ПередатьЗапланированныеСобытия(РабочийЛистСсылка, Менеджер)
	КонецЕсли;
КонецПроцедуры

Процедура ПередатьЗапланированныеСобытия(РабочийЛист, Менеджер)
	ЗапросСобытия = Новый Запрос();
	ЗапросСобытия.УстановитьПараметр("Запланировано", Перечисления.СостоянияСобытий.Запланировано);
	ЗапросСобытия.УстановитьПараметр("РабочийЛист", РабочийЛист);
	ЗапросСобытия.Текст = "ВЫБРАТЬ
	                      |	Событие.Ссылка,
	                      |	Событие.ДатаНачала,
	                      |	Событие.ДатаОкончания,
	                      |	Событие.Содержание
	                      |ИЗ
	                      |	Документ.Событие КАК Событие
	                      |ГДЕ
	                      |	Событие.Состояние = &Запланировано
	                      |	И Событие.ДокументОснование = &РабочийЛист";

	ВыборкаСобытия = ЗапросСобытия.Выполнить().Выбрать();
	Пока ВыборкаСобытия.Следующий() Цикл
		ДокументСобытие = ВыборкаСобытия.Ссылка.ПолучитьОбъект();
		ДокументСобытие.Продавец = Менеджер;
		Попытка
			ДокументСобытие.ОбменДанными.Загрузка = Истина;
			ДокументСобытие.Записать();
		Исключение
		КонецПопытки;
	КонецЦикла;
КонецПроцедуры
// Семенихин 05.02.2026 -----

//Бондаренко++ 20210827
Функция ВернутьПодписанта(Ссылка) Экспорт
	
	Попытка
		Возврат Ссылка.Подписант;
	Исключение
		Попытка
			Возврат Ссылка.Автор;
		Исключение
			Возврат Справочники.Сотрудники.ПустаяСсылка();		
		КонецПопытки; 
	КонецПопытки; 
 
КонецФункции // ВернутьПодписанта(Ссылка)
//Бондаренко++ 20210827

// Семенихин 09.09.2021 -----
// Типовая исправленная
Функция Транслитерация(Текст) Экспорт
	// Заполняем список соответствий
	СписокСоответствийТранслитерации = Новый СписокЗначений;
	СписокСоответствийТранслитерации.Добавить("а", "a");
	СписокСоответствийТранслитерации.Добавить("б", "b");
	СписокСоответствийТранслитерации.Добавить("в", "v");
	СписокСоответствийТранслитерации.Добавить("г", "g");
	СписокСоответствийТранслитерации.Добавить("д", "d");
	СписокСоответствийТранслитерации.Добавить("е", "e");
	СписокСоответствийТранслитерации.Добавить("ё", "yo");
	СписокСоответствийТранслитерации.Добавить("ж", "zh");
	СписокСоответствийТранслитерации.Добавить("з", "z");
	СписокСоответствийТранслитерации.Добавить("и", "i");
	СписокСоответствийТранслитерации.Добавить("й", "j");
	СписокСоответствийТранслитерации.Добавить("к", "k");
	СписокСоответствийТранслитерации.Добавить("л", "l");
	СписокСоответствийТранслитерации.Добавить("м", "m");
	СписокСоответствийТранслитерации.Добавить("н", "n");
	СписокСоответствийТранслитерации.Добавить("о", "o");
	СписокСоответствийТранслитерации.Добавить("п", "p");
	СписокСоответствийТранслитерации.Добавить("р", "r");
	СписокСоответствийТранслитерации.Добавить("с", "s");
	СписокСоответствийТранслитерации.Добавить("т", "t");
	СписокСоответствийТранслитерации.Добавить("у", "u");
	СписокСоответствийТранслитерации.Добавить("ф", "f");
	СписокСоответствийТранслитерации.Добавить("х", "h"); 
	СписокСоответствийТранслитерации.Добавить("ц", "c"); 
	СписокСоответствийТранслитерации.Добавить("ч", "ch");
	СписокСоответствийТранслитерации.Добавить("ш", "sh");
	СписокСоответствийТранслитерации.Добавить("щ", "sch"); 
	СписокСоответствийТранслитерации.Добавить("ъ", """");
	СписокСоответствийТранслитерации.Добавить("Ъ", """");
	СписокСоответствийТранслитерации.Добавить("ы", "y");
	СписокСоответствийТранслитерации.Добавить("Ы", "Y");
	СписокСоответствийТранслитерации.Добавить("ь", """");
	СписокСоответствийТранслитерации.Добавить("Ь", """");
	СписокСоответствийТранслитерации.Добавить("э", "e");
	СписокСоответствийТранслитерации.Добавить("ю", "yu");
	СписокСоответствийТранслитерации.Добавить("я", "ya");
	СписокСоответствийТранслитерации.Добавить("А", "A");
	СписокСоответствийТранслитерации.Добавить("Б", "B");
	СписокСоответствийТранслитерации.Добавить("В", "V");
	СписокСоответствийТранслитерации.Добавить("Г", "G");
	СписокСоответствийТранслитерации.Добавить("Д", "D");
	СписокСоответствийТранслитерации.Добавить("Е", "E");
	СписокСоответствийТранслитерации.Добавить("Ё", "YO");
	СписокСоответствийТранслитерации.Добавить("Ж", "ZH");
	СписокСоответствийТранслитерации.Добавить("З", "Z");
	СписокСоответствийТранслитерации.Добавить("И", "I");
	СписокСоответствийТранслитерации.Добавить("Й", "J");
	СписокСоответствийТранслитерации.Добавить("К", "K");
	СписокСоответствийТранслитерации.Добавить("Л", "L");
	СписокСоответствийТранслитерации.Добавить("М", "M");
	СписокСоответствийТранслитерации.Добавить("Н", "N");
	СписокСоответствийТранслитерации.Добавить("О", "O");
	СписокСоответствийТранслитерации.Добавить("П", "P");
	СписокСоответствийТранслитерации.Добавить("Р", "R");
	СписокСоответствийТранслитерации.Добавить("С", "S");
	СписокСоответствийТранслитерации.Добавить("Т", "T");
	СписокСоответствийТранслитерации.Добавить("У", "U");
	СписокСоответствийТранслитерации.Добавить("Ф", "F");
	СписокСоответствийТранслитерации.Добавить("Х", "H");
	СписокСоответствийТранслитерации.Добавить("Ц", "C");
	СписокСоответствийТранслитерации.Добавить("Ч", "Ch");
	СписокСоответствийТранслитерации.Добавить("Ш", "SH");
	СписокСоответствийТранслитерации.Добавить("Щ", "SCH");
	СписокСоответствийТранслитерации.Добавить("Э", "E");
	СписокСоответствийТранслитерации.Добавить("Ю", "YU");
	СписокСоответствийТранслитерации.Добавить("Я", "YA");
	СписокСоответствийТранслитерации.Добавить("«", "<");
	СписокСоответствийТранслитерации.Добавить("»", ">");
	СписокСоответствийТранслитерации.Добавить("№", "N");
	СписокСоответствийТранслитерации.Добавить("{", "(");
	СписокСоответствийТранслитерации.Добавить("[", "(");
	СписокСоответствийТранслитерации.Добавить("}", ")");
	СписокСоответствийТранслитерации.Добавить("]", ")");
	СписокСоответствийТранслитерации.Добавить("\", "/");
	СписокСоответствийТранслитерации.Добавить("|", "I");
	СписокСоответствийТранслитерации.Добавить("^", "'");
	СписокСоответствийТранслитерации.Добавить("_", "-");
	СписокСоответствийТранслитерации.Добавить("~", "-");
	СписокСоответствийТранслитерации.Добавить("`", "'");
	СписокСоответствийТранслитерации.Добавить(Символы.НПП, " ");
	
	СписокСоответствийСимовлы = Новый СписокЗначений;
	СписокСоответствийСимовлы.Добавить(91,"(");
	СписокСоответствийСимовлы.Добавить(92,"/");
	СписокСоответствийСимовлы.Добавить(93,")");
	СписокСоответствийСимовлы.Добавить(94,"'");
	СписокСоответствийСимовлы.Добавить(95,"-");
	СписокСоответствийСимовлы.Добавить(96,"'");
	СписокСоответствийСимовлы.Добавить(123,"(");
	СписокСоответствийСимовлы.Добавить(124,"!");
	СписокСоответствийСимовлы.Добавить(125,")");
	СписокСоответствийСимовлы.Добавить(126,"-");
	СписокСоответствийСимовлы.Добавить(127," ");
	СписокСоответствийСимовлы.Добавить(130,",");
	СписокСоответствийСимовлы.Добавить(132,"""");
	СписокСоответствийСимовлы.Добавить(133,"...");
	СписокСоответствийСимовлы.Добавить(136,"'");
	СписокСоответствийСимовлы.Добавить(137,"%");
	СписокСоответствийСимовлы.Добавить(139,"<");
	СписокСоответствийСимовлы.Добавить(145,"'");
	СписокСоответствийСимовлы.Добавить(146,"'");
	СписокСоответствийСимовлы.Добавить(147,"""");
	СписокСоответствийСимовлы.Добавить(148,"""");
	СписокСоответствийСимовлы.Добавить(149,"-");
	СписокСоответствийСимовлы.Добавить(150,"-");
	СписокСоответствийСимовлы.Добавить(151,"-");
	СписокСоответствийСимовлы.Добавить(152,"-");
	СписокСоответствийСимовлы.Добавить(155,">");
	СписокСоответствийСимовлы.Добавить(160," ");
	СписокСоответствийСимовлы.Добавить(161,"!");
	СписокСоответствийСимовлы.Добавить(166,"!");
	СписокСоответствийСимовлы.Добавить(168,"""");
	СписокСоответствийСимовлы.Добавить(169,"(C)");
	СписокСоответствийСимовлы.Добавить(171,"<");
	СписокСоответствийСимовлы.Добавить(172,"");
	СписокСоответствийСимовлы.Добавить(173,"-");
	СписокСоответствийСимовлы.Добавить(174,"(R)");
	СписокСоответствийСимовлы.Добавить(175,"-");
	СписокСоответствийСимовлы.Добавить(176,"'");
	СписокСоответствийСимовлы.Добавить(180,"'");
	СписокСоответствийСимовлы.Добавить(183,"-");
	СписокСоответствийСимовлы.Добавить(185,"N");
	СписокСоответствийСимовлы.Добавить(187,">");
	СписокСоответствийСимовлы.Добавить(8218,",");
	СписокСоответствийСимовлы.Добавить(8222,"""");
	СписокСоответствийСимовлы.Добавить(8230,"...");
	СписокСоответствийСимовлы.Добавить(8265,"'");
	СписокСоответствийСимовлы.Добавить(8240,"%");
	СписокСоответствийСимовлы.Добавить(8249,"<");
	СписокСоответствийСимовлы.Добавить(8216,"'");
	СписокСоответствийСимовлы.Добавить(8217,"'");
	СписокСоответствийСимовлы.Добавить(8220,"""");
	СписокСоответствийСимовлы.Добавить(8221,"""");
	СписокСоответствийСимовлы.Добавить(8208,"-");
	СписокСоответствийСимовлы.Добавить(8209,"-");
	СписокСоответствийСимовлы.Добавить(8210,"-");
	СписокСоответствийСимовлы.Добавить(8211,"-");
	СписокСоответствийСимовлы.Добавить(8212,"-");
	СписокСоответствийСимовлы.Добавить(8213,"-");
	СписокСоответствийСимовлы.Добавить(732,"-");
	СписокСоответствийСимовлы.Добавить(8250,">");
	СписокСоответствийСимовлы.Добавить(8232," ");
	СписокСоответствийСимовлы.Добавить(8254,"-");
	СписокСоответствийСимовлы.Добавить(8226,"-");
	СписокСоответствийСимовлы.Добавить(8470,"N");
	СписокСоответствийСимовлы.Добавить(8219,"'");
	СписокСоответствийСимовлы.Добавить(8223,"""");
	СписокСоответствийСимовлы.Добавить(8228,".");
	СписокСоответствийСимовлы.Добавить(8231,"-");
	СписокСоответствийСимовлы.Добавить(8263,"-");
	СписокСоответствийСимовлы.Добавить(8259,"-");
	СписокСоответствийСимовлы.Добавить(8260,"/");
	СписокСоответствийСимовлы.Добавить(8962," ");
	
	РезультирующийТекст = "";
	ДлинаТекста = СтрДлина(Текст);
	Для Сч = 1 По ДлинаТекста Цикл
		КодСимвола = КодСимвола(Текст, Сч);
		РусскаяЗаглавная = Ложь;
		Если (КодСимвола > 1039 И КодСимвола < 1072) ИЛИ (КодСимвола = 1025) Тогда
			РусскаяЗаглавная = Истина;
		КонецЕсли;
		
		Символ = Сред(Текст, Сч, 1);
		Соответствие = СписокСоответствийТранслитерации.НайтиПоЗначению(Символ);
		Если Соответствие <> Неопределено Тогда
			Символ = Соответствие.Представление;
			
		Иначе
			Соответствие = СписокСоответствийСимовлы.НайтиПоЗначению(КодСимвола);			
			Если Соответствие <> Неопределено Тогда
				Символ = Соответствие.Представление;
			Иначе
				Если НЕ Найти(" !@#$%&'""()*+,-./0123456789:;<=>?ABCDEFGIKLMNJOPQRSTUVWXYZHabcdefgiklmnjopqrstuvwxyzh"+Символы.ПС+Символы.Таб+Символы.ВК, Символ) Тогда
					Символ = "?"; // Меняем неизвестный символ на "?"
				КонецЕсли;
			КонецЕсли;		
		КонецЕсли;
		
		// Результат транслитерации
		РезультирующийТекст = РезультирующийТекст + Символ;	
	КонецЦикла;
	
	Возврат РезультирующийТекст;	
КонецФункции // Транслитерация()	
// Семенихин 09.09.2021 -----

// Семенихин 17.09.2021 +++++
////////////////////////////////////////////////////////////////////////////
// Регламентное задание для планирования звонков вежливости на текущий день.
Процедура ЗапланироватьЗвонкиВежливости(Параметры = Неопределено) Экспорт
	//ТекущаяДата = Дата(2021, 9, 15); 
	ТекущаяДата = ТекущаяДата();
	СоздатьЗвонкиВежливости(ТекущаяДата);
	СоздатьЗвонкиВежливостиФордФиат(ТекущаяДата);
КонецПроцедуры

Процедура СоздатьЗвонкиВежливости(ТекущаяДата)
	Сутки = 86400;
	МассивДат = Новый Массив();
	МассивДат.Добавить(ТекущаяДата - Сутки);
	МассивДат.Добавить(ТекущаяДата - 10 * Сутки);
	МассивДат.Добавить(ДобавитьМесяц(ТекущаяДата, -12));
	
	ИндексЗвонка = 0;
	Для Каждого ДатаВыборки Из МассивДат Цикл
		ДатаНачала = НачалоДня(ДатаВыборки);
		ДатаОкончания = КонецДня(ДатаВыборки);
		
		тзЗавершенныеВыдачи = ПолучитьЗавершенныеВыдачи(ДатаНачала, ДатаОкончания);
		
		тзВыдачиРаботающихМенеджеров = тзЗавершенныеВыдачи.Скопировать(Новый Структура("ПродавецУволен", Ложь));
		Для Каждого СтрокаВыдача Из тзВыдачиРаботающихМенеджеров Цикл
			//Если АвтомобильНовый(СтрокаВыдача.Автомобиль, ДатаНачала) Тогда // Семенихин 16.02.2023
				Содержание = ПолучитьСодержаниеЗвонка(СтрокаВыдача.Марка, ИндексЗвонка);
				ЗапланироватьЗвонокВежливости(СтрокаВыдача.Ссылка, Справочники.Сотрудники.ПустаяСсылка(), Содержание);
			//КонецЕсли;			
		КонецЦикла;
		
		тзВыдачиУволенныхМенеджеров = тзЗавершенныеВыдачи.Скопировать(Новый Структура("ПродавецУволен", Истина));		
		Для Каждого СтрокаВыдача Из тзВыдачиУволенныхМенеджеров Цикл
			//Если АвтомобильНовый(СтрокаВыдача.Автомобиль, ДатаНачала) Тогда
				Менеджер = СлучайныйВыборСотрудника(СтрокаВыдача.Подразделение, Справочники.Должности.МенеджерОтделаПродажАвтомобилей, ТекущаяДата);
				Если ЗначениеЗаполнено(Менеджер) Тогда
					Содержание = ПолучитьСодержаниеЗвонка(СтрокаВыдача.Марка, ИндексЗвонка);
					ЗапланироватьЗвонокВежливости(СтрокаВыдача.Ссылка, Менеджер, Содержание);
				Иначе
					Продолжить;
				КонецЕсли;			
			//КонецЕсли;			
		КонецЦикла;
		
		ИндексЗвонка = ИндексЗвонка + 1;
	КонецЦикла;	
КонецПроцедуры

Процедура СоздатьЗвонкиВежливостиФордФиат(ТекущаяДата)
	Сутки = 86400;
	МассивДат = Новый Массив();
	МассивДат.Добавить(ТекущаяДата - Сутки);
	МассивДат.Добавить(ДобавитьМесяц(ТекущаяДата, -3));
	МассивДат.Добавить(ДобавитьМесяц(ТекущаяДата, -12));
	
	ИндексЗвонка = 0;
	Для Каждого ДатаВыборки Из МассивДат Цикл
		ДатаНачала = НачалоДня(ДатаВыборки);
		ДатаОкончания = КонецДня(ДатаВыборки);
		
		тзЗавершенныеВыдачи = ПолучитьЗавершенныеВыдачи(ДатаНачала, ДатаОкончания, Истина);
		
		тзВыдачиРаботающихМенеджеров = тзЗавершенныеВыдачи.Скопировать(Новый Структура("ПродавецУволен", Ложь));
		Для Каждого СтрокаВыдача Из тзВыдачиРаботающихМенеджеров Цикл
			//Если АвтомобильНовый(СтрокаВыдача.Автомобиль, ДатаНачала) Тогда // Семенихин 16.02.2023
				Содержание = ПолучитьСодержаниеЗвонка(СтрокаВыдача.Марка, ИндексЗвонка);
				ЗапланироватьЗвонокВежливости(СтрокаВыдача.Ссылка, Справочники.Сотрудники.ПустаяСсылка(), Содержание);
			//КонецЕсли;			
		КонецЦикла;
		
		тзВыдачиУволенныхМенеджеров = тзЗавершенныеВыдачи.Скопировать(Новый Структура("ПродавецУволен", Истина));		
		Для Каждого СтрокаВыдача Из тзВыдачиУволенныхМенеджеров Цикл
			//Если АвтомобильНовый(СтрокаВыдача.Автомобиль, ДатаНачала) Тогда
				Менеджер = СлучайныйВыборСотрудника(СтрокаВыдача.Подразделение, Справочники.Должности.МенеджерОтделаПродажАвтомобилей, ТекущаяДата);
				Если ЗначениеЗаполнено(Менеджер) Тогда
					Содержание = ПолучитьСодержаниеЗвонка(СтрокаВыдача.Марка, ИндексЗвонка);
					ЗапланироватьЗвонокВежливости(СтрокаВыдача.Ссылка, Менеджер, Содержание);
				Иначе
					Продолжить;
				КонецЕсли;			
			//КонецЕсли;			
		КонецЦикла;
		
		ИндексЗвонка = ИндексЗвонка + 1;
	КонецЦикла;	
КонецПроцедуры

Функция ПолучитьЗавершенныеВыдачи(ДатаНачала, ДатаОкончания, ТолькоФордФиат = Ложь)
	мМаркиАвто = Новый Массив();
	мМаркиАвто.Добавить(Справочники.Марка.FORD);
	мМаркиАвто.Добавить(Справочники.Марка.FIAT);
	
	ЗапросВыдачи = Новый Запрос();
	ЗапросВыдачи.УстановитьПараметр("Завершено", Перечисления.СостоянияСобытий.Завершено);
	ЗапросВыдачи.УстановитьПараметр("ВыдачаАвтомобиля", Перечисления.ВидыСобытий.ВыдачаАвтомобиля);
	ЗапросВыдачи.УстановитьПараметр("ДатаНачала", ДатаНачала);
	ЗапросВыдачи.УстановитьПараметр("ДатаОкончания", ДатаОкончания);
	ЗапросВыдачи.УстановитьПараметр("СписокМарок", мМаркиАвто);
	ЗапросВыдачи.Текст =
	"ВЫБРАТЬ
	|	Событие.Ссылка КАК Ссылка,
	|	Событие.Продавец.ФлагУволен КАК ПродавецУволен,
	|	Событие.Автомобиль КАК Автомобиль,
	|	Событие.ПодразделениеКомпании КАК Подразделение,
	|	Событие.Автомобиль.Модель.Марка КАК Марка
	|ИЗ
	|	Документ.Событие КАК Событие
	|ГДЕ
	|	Событие.Состояние = &Завершено
	|	И Событие.ВидСобытия = &ВыдачаАвтомобиля
	|	И Событие.ДатаОкончания МЕЖДУ &ДатаНачала И &ДатаОкончания";
	
	Если ТолькоФордФиат Тогда
		ЗапросВыдачи.Текст = ЗапросВыдачи.Текст + " И Событие.Автомобиль.Модель.Марка В (&СписокМарок)";
	Иначе
		ЗапросВыдачи.Текст = ЗапросВыдачи.Текст + " И Не Событие.Автомобиль.Модель.Марка В (&СписокМарок)";
	КонецЕсли;
	
	Возврат ЗапросВыдачи.Выполнить().Выгрузить();
КонецФункции

Процедура ЗапланироватьЗвонокВежливости(ВыдачаСсылка, Продавец, Содержание)
	РабочийЛист = ВыдачаСсылка.ДокументОснование;
	Если обЗначениеНеЗаполнено(РабочийЛист) Или ТипЗнч(РабочийЛист) <> Тип("ДокументСсылка.РабочийЛист") Тогда
		#Если Клиент Тогда
		Сообщить("Выдача <" + Строка(ВыдачаСсылка) + "> не на основании рабочего листа!", СтатусСообщения.Информация);
		#КонецЕсли
		Возврат;
	КонецЕсли;
	
	СобытиеОбъект = Документы.Событие.СоздатьДокумент();
	СобытиеОбъект.Заполнить(РабочийЛист);
	СобытиеОбъект.ВидСобытия = Перечисления.ВидыСобытий.ЗвонокВежливости;
	СобытиеОбъект.Содержание = Содержание;
	СобытиеОбъект.Состояние = Перечисления.СостоянияСобытий.Запланировано;
	СобытиеОбъект.Приоритет = Перечисления.Важность.Средняя;
	СобытиеОбъект.ВторичныйКонтакт = Истина;
	
	ТекущаяДата = ТекущаяДата();
	ДатаНачала = Дата(Год(ТекущаяДата), Месяц(ТекущаяДата), День(ТекущаяДата), 10, 0, 0);
	СобытиеОбъект.ДатаНачала = ДатаНачала;
	СобытиеОбъект.ДатаОкончания = ДатаНачала + 900;
	
	Если ЗначениеЗаполнено(Продавец) Тогда
		СобытиеОбъект.Продавец = Продавец;
	Иначе
		СобытиеОбъект.Продавец = ВыдачаСсылка.Продавец;
	КонецЕсли;
	
	Попытка
		СобытиеОбъект.Записать(РежимЗаписиДокумента.Проведение);
	Исключение
		СобытиеОбъект.ОбменДанными.Загрузка = Истина;
		СобытиеОбъект.Записать();
	КонецПопытки;
	
	#Если Клиент Тогда
	Сообщить("Запланировано " + Строка(СобытиеОбъект.Ссылка), СтатусСообщения.Информация);
	#КонецЕсли
КонецПроцедуры

Функция АвтомобильНовый(Автомобиль, НаДату) Экспорт
	Значение = Справочники.Автомобили.ЧтениеЗначенияРегистраСведения(Автомобиль, Перечисления.ДополнительнаяИнформацияАвтомобилей.ВидАвтомобиля, НаДату);
	Если ЗначениеЗаполнено(Значение) Тогда
		Возврат Значение = Перечисления.ВидАвтомобиля.Новый;
	Иначе
		Возврат Ложь;
	КонецЕсли;	
КонецФункции
 
Функция СлучайныйВыборСотрудника(Подразделение, Должность, Дата) Экспорт
	ЗапросСотрудники = Новый Запрос();
	ЗапросСотрудники.УстановитьПараметр("Подразделение", Подразделение);
	ЗапросСотрудники.УстановитьПараметр("Должность", Должность);
	ЗапросСотрудники.УстановитьПараметр("Дата", НачалоДня(Дата));
	ЗапросСотрудники.Текст =
	"ВЫБРАТЬ
	|	ГрафикРаботКалендарный.График
	|ПОМЕСТИТЬ ГрафикиРаботающих
	|ИЗ
	|	РегистрСведений.ГрафикРаботКалендарный КАК ГрафикРаботКалендарный
	|ГДЕ
	|	ГрафикРаботКалендарный.Дата = &Дата
	|	И ГрафикРаботКалендарный.ВидДня = ЗНАЧЕНИЕ(Перечисление.ВидДня.Рабочий)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Сотрудники.Ссылка КАК Сотрудник
	|ИЗ
	|	Справочник.Сотрудники КАК Сотрудники
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ГрафикиРаботающих КАК ГрафикиРаботающих
	|		ПО Сотрудники.ГрафикРаботы = ГрафикиРаботающих.График
	|ГДЕ
	|	Сотрудники.Подразделение В ИЕРАРХИИ(&Подразделение)
	|	И Сотрудники.Должность = &Должность
	|	И НЕ Сотрудники.ФлагУволен";
	
	тзСотрудники = ЗапросСотрудники.Выполнить().Выгрузить();
	КоличествоСотрудников = тзСотрудники.Количество();
	Если КоличествоСотрудников = 0 Тогда
		Возврат Справочники.Сотрудники.ПустаяСсылка();
	ИначеЕсли КоличествоСотрудников = 1 Тогда
		Возврат тзСотрудники[0].Сотрудник; 
	КонецЕсли;
	
	ГСЧ = Новый ГенераторСлучайныхЧисел();
	Индекс = ГСЧ.СлучайноеЧисло(0, КоличествоСотрудников - 1);	
	Возврат тзСотрудники[Индекс].Сотрудник;
КонецФункции

Функция ПолучитьСодержаниеЗвонка(МаркаАвто, ИндексЗвонка)
	мМаркиАвто = Новый Массив();
	мМаркиАвто.Добавить(Справочники.Марка.CHEVROLET);
	мМаркиАвто.Добавить(Справочники.Марка.GEELY);
	мМаркиАвто.Добавить(Справочники.Марка.LADA_ВАЗ);
	мМаркиАвто.Добавить(Справочники.Марка.ВАЗ_LADA);
	мМаркиАвто.Добавить(Справочники.Марка.NISSAN);
	мМаркиАвто.Добавить(Справочники.Марка.RENAULT);
	мМаркиАвто.Добавить(Справочники.Марка.SUZUKI);
	
	Содержание = "";
	Если МаркаАвто = Справочники.Марка.HYUNDAI Тогда
		Если ИндексЗвонка = 0 Тогда
			Содержание = "1. Представиться." + Символы.ПС;
			Содержание = Содержание + "2. Узнать как добрался? Появились ли вопросы по настройкам и управлению автомобиля, мультимедиа системы?" + Символы.ПС;
			Содержание = Содержание + "3. Напомнить о связи 24/7 и ещё раз поздравить с приобретением, напомнить что у нас более 10 брендов и сможем на лучших условиях подобрать авто для близких и знакомых.";
		ИначеЕсли ИндексЗвонка = 1 Тогда
			Содержание = "1. Поинтересоваться о впечатлениях от автомобиля? пробеге? напомнить о ТО-0, ТО-1." + Символы.ПС;
			Содержание = Содержание + "2. Напомнить о необходимости активации телематики для внесения авто в гарантийную систему. Помочь клиенту с настройками." + Символы.ПС;
			Содержание = Содержание + "3. Попросить клиента пройти опрос в Мир Хендэ и поставить максимальный честный балл. Это очень важно для менеджера и позволит клиенту получить баллы, которые он сможет использовать в дальнейшем для получения выгод от дилера и Хендэ." + Символы.ПС;
			Содержание = Содержание + "4. Напомнить о передачи контакта менеджера окружению клиента." + Символы.ПС;
			Содержание = Содержание + "5. В случае отсутствия вопросов со стороны клиента, напомнить о связи 24/7, поблагодарить и попрощаться.";
		Иначе
			Содержание = "1. Напомнить о себе." + Символы.ПС;
			Содержание = Содержание + "2. Поздравить с годовщиной." + Символы.ПС;
			Содержание = Содержание + "3. Пригласить на ТО." + Символы.ПС;
			Содержание = Содержание + "4. Напомнить о своей помощи при (обслуживании, продаже, покупке и т.д) для клиента и его окружения." + Символы.ПС;
			Содержание = Содержание + "5. Поблагодарить клиента за выбор компании, ДЦ, бренда.";
		КонецЕсли;
		
	ИначеЕсли мМаркиАвто.Найти(МаркаАвто) <> Неопределено Тогда
		Если ИндексЗвонка = 0 Тогда
			Содержание = "1. Узнать как добрался? Появились ли вопросы по настройкам и управлению автомобиля, мультимедиа системы?" + Символы.ПС;
			Содержание = Содержание + "2. Напомнить о прохождении анкетирования по телефонному звонку, порекомендовать нас близким, знакомым, поставить 10 баллов." + Символы.ПС;
			Содержание = Содержание + "3. Напомнить о связи 24/7 и ещё раз поздравить с приобретением, напомнить что у нас более 10 брендов и сможем на лучших условиях подобрать авто для близких и знакомых.";
		ИначеЕсли ИндексЗвонка = 1 Тогда
			Содержание = "1. Поинтересоваться о впечатлениях от автомобиля? пробеге? напомнить о ТО-0, ТО-1." + Символы.ПС;
			Содержание = Содержание + "2. Напомнить о предстоящем опросе по телефону." + Символы.ПС;
			Содержание = Содержание + "3. Напомнить о передачи контакта менеджера окружению клиента." + Символы.ПС;
			Содержание = Содержание + "4. В случае отсутствия вопросов со стороны клиента, напомнить о связи 24/7, поблагодарить и попрощаться.";
		Иначе
			Содержание = "1. Напомнить о себе." + Символы.ПС;
			Содержание = Содержание + "2. Поздравить с годовщиной." + Символы.ПС;
			Содержание = Содержание + "3. Пригласить на ТО." + Символы.ПС;
			Содержание = Содержание + "4. Напомнить о своей помощи при (обслуживании, продаже, покупке и т.д) для клиента и его окружения." + Символы.ПС;
			Содержание = Содержание + "5. Поблагодарить клиента за выбор компании, ДЦ, бренда.";
		КонецЕсли;
		
	Иначе
		Если ИндексЗвонка = 0 Тогда
			Содержание = "1. Узнать как добрался? Появились ли вопросы по настройкам и управлению автомобиля, мультимедиа системы?" + Символы.ПС;
			Содержание = Содержание + "2. Порекомендовать нас близким, знакомым." + Символы.ПС;
			Содержание = Содержание + "3. Напомнить о связи 24/7 и ещё раз поздравить с приобретением, напомнить что у нас более 10 брендов и сможем на лучших условиях подобрать авто для близких и знакомых.";
		ИначеЕсли ИндексЗвонка = 1 Тогда
			Содержание = "1. Поинтересоваться о впечатлениях от автомобиля? пробеге? напомнить о ТО-0, ТО-1." + Символы.ПС;
			Содержание = Содержание + "2. Напомнить о передачи контакта менеджера окружению клиента." + Символы.ПС;
			Содержание = Содержание + "3. В случае отсутствия вопросов со стороны клиента, напомнить о связи 24/7, поблагодарить и попрощаться.";
		Иначе
			Содержание = "1. Напомнить о себе." + Символы.ПС;
			Содержание = Содержание + "2. Поздравить с годовщиной." + Символы.ПС;
			Содержание = Содержание + "3. Пригласить на ТО." + Символы.ПС;
			Содержание = Содержание + "4. Напомнить о своей помощи при (обслуживании, продаже, покупке и т.д) для клиента и его окружения." + Символы.ПС;
			Содержание = Содержание + "5. Поблагодарить клиента за выбор компании, ДЦ, бренда.";
		КонецЕсли;
	КонецЕсли;
	
	Возврат Содержание;
КонецФункции
// Семенихин 20.09.2021 -----

// Семениихн 11.10.2021 +++++
Процедура ЗапланироватьИсходящийЗвонок(ДокументСсылка, Содержание, ДатаНачала)
	Если ОбЗначениеНеЗаполнено(ДокументСсылка) Тогда
		Возврат;
	КонецЕсли;
	
	Если ДокументСсылка.Статус = Справочники.СтатусыРабочегоЛиста.Отказ 
		Или ДокументСсылка.Статус = Справочники.СтатусыРабочегоЛиста.Продажа Тогда
		
		ТекущийРабочийЛист = СоздатьНовыйРабочийЛист(ДокументСсылка);
		Если обЗначениеНеЗаполнено(ТекущийРабочийЛист) Тогда
			Возврат;
		КонецЕсли;
		
	Иначе
		ТекущийРабочийЛист = ДокументСсылка;
	КонецЕсли;
	
	СобытиеОбъект = Документы.Событие.СоздатьДокумент();
	СобытиеОбъект.Заполнить(ТекущийРабочийЛист);
	СобытиеОбъект.ВидСобытия = Перечисления.ВидыСобытий.ТелефонныйЗвонок;
	СобытиеОбъект.Состояние = Перечисления.СостоянияСобытий.Запланировано;
	СобытиеОбъект.Содержание = Содержание;
	СобытиеОбъект.Приоритет = Перечисления.Важность.Средняя;
	СобытиеОбъект.ДатаНачала = ДатаНачала;
	СобытиеОбъект.ДатаОкончания = ДатаНачала + 900;
	
	Попытка
		СобытиеОбъект.Записать(РежимЗаписиДокумента.Проведение);
	Исключение
		//СобытиеОбъект.ОбменДанными.Загрузка = Истина;
		//СобытиеОбъект.Записать();
		#Если Клиент Тогда
		Сообщить("Не удалось запланировать событие: " 
		    	+ Символы.ПС + ОписаниеОшибки(), СтатусСообщения.Важное);
		#КонецЕсли
	КонецПопытки;
	#Если Клиент Тогда
	Сообщить("Запланировано " + Строка(СобытиеОбъект.Ссылка), СтатусСообщения.Информация);
	#КонецЕсли
	
КонецПроцедуры

Функция СоздатьНовыйРабочийЛист(ДокументСсылка)
	РабочийЛистОбъект = ДокументСсылка.Скопировать();
	РабочийЛистОбъект.Дата = ТекущаяДата();
	РабочийЛистОбъект.Статус = Справочники.СтатусыРабочегоЛиста.Создан;
	РабочийЛистОбъект.Комментарий = "Создан автоматически при планировании исходящего звонка.";
	
	Попытка
		РабочийЛистОбъект.Записать(РежимЗаписиДокумента.Проведение);
	Исключение
		//СобытиеОбъект.ОбменДанными.Загрузка = Истина;
		//СобытиеОбъект.Записать();
		#Если Клиент Тогда
		Сообщить("Не удалось создать новай Рабочий лист: " 
		    	+ Символы.ПС + ОписаниеОшибки(), СтатусСообщения.Важное);
		#КонецЕсли
	КонецПопытки;
	
	Возврат РабочийЛистОбъект.Ссылка;
КонецФункции
// Семениихн 11.10.2021 -----

//Бондаренко++ 20211216
Функция СМГ_НайтиСоздатьДоговорСубподряд(ТекКонтрагент,ТекОрганизация,ТекПодразделение) Экспорт
	
	НовДог = Справочники.ДоговорыВзаиморасчетов.ПустаяСсылка();
	
	Запрос = Новый Запрос;
	
	Запрос.Текст = "ВЫБРАТЬ
	               |	ДоговорыВзаиморасчетов.Ссылка,
	               |	ДоговорыВзаиморасчетов.Владелец,
	               |	ДоговорыВзаиморасчетов.Организация,
	               |	ДоговорыВзаиморасчетов.ВидДоговора
	               |ИЗ
	               |	Справочник.ДоговорыВзаиморасчетов КАК ДоговорыВзаиморасчетов
	               |ГДЕ
	               |	ДоговорыВзаиморасчетов.Владелец = &Владелец
	               |	И ДоговорыВзаиморасчетов.ВидДоговора = ЗНАЧЕНИЕ(Перечисление.ВидыДоговоров.Продажа)
	               |	И ДоговорыВзаиморасчетов.Организация = &Организация
	               |	И ДоговорыВзаиморасчетов.ПометкаУдаления = ЛОЖЬ
	               |	И ДоговорыВзаиморасчетов.ЭтоГруппа = ЛОЖЬ";
	 
	Запрос.УстановитьПараметр("Владелец",ТекКонтрагент);
 	Запрос.УстановитьПараметр("Организация",ТекОрганизация);
	//Бондаренко++ 20230201
	//Запрос.УстановитьПараметр("Субподряд","%%"+"СУБПОДРЯД"+"%%");
	//Бондаренко-- 20230201
 	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Возврат ВыборкаДетальныеЗаписи.Ссылка;
	КонецЦикла;
	
	НовДог = Справочники.ДоговорыВзаиморасчетов.СоздатьЭлемент();
	НовДог.УстановитьНовыйКод();
	НовДог.ТипДоговора = Перечисления.ТипыДоговоров.Договор;
 	НовДог.ВидДоговора=Перечисления.ВидыДоговоров.Продажа;
	НовДог.Владелец = ТекКонтрагент;
	НовДог.Организация = ТекОрганизация;
	НовДог.Подразделение = ТекПодразделение;
	НовДог.Владелец = ТекКонтрагент;
	НовДог.ДатаНачала = ТекущаяДата();
	
	//Бондаренко++ 20230201
 	//НовДог.Наименование = СокрЛП(НовДог.ВидДоговора)+" от "+Формат(НовДог.ДатаНачала,"ДЛФ=D")+" СУБПОДРЯД";
	НовДог.Наименование = СокрЛП(НовДог.ВидДоговора)+" от "+Формат(НовДог.ДатаНачала,"ДЛФ=D");
	//Бондаренко-- 20230201
	
	НовДог.Автор = ПараметрыСеанса.Пользователь;
	НовДог.ДатаСоздания = ТекущаяДата();
	НовДог.ВидОплаты = Перечисления.ВидыОплаты.ПроизвольнаяОплата;
	НовДог.Комментарий = "Договор создан обработкой из общего модуля СМ_ФормированиеНовыхОбъектов пользователем: "+ПараметрыСеанса.Пользователь+" "+Формат(ТекущаяДата(),"ДЛФ=DDT");
	НовДог.ВалютаВзаиморасчетов = Константы.ВалютаРегламентированногоУчетаОрганизаций.Получить();
	
	Попытка
		НовДог.Записать();
		#Если Клиент Тогда 
		Сообщить("Записан новый договор "+НовДог);
		#КонецЕсли
	Исключение
		#Если Клиент Тогда 
		Сообщить("ОШИБКА! Не удалось записать новый договор общего модуля СМ_ФормированиеНовыхОбъектов",СтатусСообщения.ОченьВажное);	
		#КонецЕсли
   	КонецПопытки; 
	
	Возврат НовДог.Ссылка;

КонецФункции // СМГ_НайтиСоздатьДоговорСубподряд(ТекКонтрагент,ТекОрганизация,ТекПодразделение)

Функция СМГ_НайтиСоздатьДоговорПерепродаж(ТекКонтрагент,ТекОрганизация,ТекПодразделение) Экспорт
	
	НовДог = Справочники.ДоговорыВзаиморасчетов.ПустаяСсылка();
	
	Запрос = Новый Запрос;
	
	Запрос.Текст = "ВЫБРАТЬ
	               |	ДоговорыВзаиморасчетов.Ссылка,
	               |	ДоговорыВзаиморасчетов.Владелец,
	               |	ДоговорыВзаиморасчетов.Организация,
	               |	ДоговорыВзаиморасчетов.ВидДоговора
	               |ИЗ
	               |	Справочник.ДоговорыВзаиморасчетов КАК ДоговорыВзаиморасчетов
	               |ГДЕ
	               |	ДоговорыВзаиморасчетов.Владелец = &Владелец
	               |	И ДоговорыВзаиморасчетов.ВидДоговора = ЗНАЧЕНИЕ(Перечисление.ВидыДоговоров.Продажа)
	               |	И ДоговорыВзаиморасчетов.Организация = &Организация
	               |	И ДоговорыВзаиморасчетов.ПометкаУдаления = ЛОЖЬ
	               |	И ДоговорыВзаиморасчетов.ЭтоГруппа = ЛОЖЬ
	               |	И ДоговорыВзаиморасчетов.ДляПерепродаж = ИСТИНА";
	 
	Запрос.УстановитьПараметр("Владелец",ТекКонтрагент);
 	Запрос.УстановитьПараметр("Организация",ТекОрганизация);
 	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Возврат ВыборкаДетальныеЗаписи.Ссылка;
	КонецЦикла;
	
	НовДог = Справочники.ДоговорыВзаиморасчетов.СоздатьЭлемент();
	НовДог.УстановитьНовыйКод();
	НовДог.ТипДоговора = Перечисления.ТипыДоговоров.Договор;
 	НовДог.ВидДоговора=Перечисления.ВидыДоговоров.Продажа;
	НовДог.Владелец = ТекКонтрагент;
	НовДог.Организация = ТекОрганизация;
	НовДог.Подразделение = ТекПодразделение;
	НовДог.Владелец = ТекКонтрагент;
	НовДог.ДатаНачала = ТекущаяДата();
	НовДог.ДляПерепродаж=Истина;
  	НовДог.Наименование = СокрЛП(НовДог.ВидДоговора)+" от "+Формат(НовДог.ДатаНачала,"ДЛФ=D"); 
	НовДог.Автор = ПараметрыСеанса.Пользователь;
	НовДог.ДатаСоздания = ТекущаяДата();
	НовДог.ВидОплаты = Перечисления.ВидыОплаты.ПроизвольнаяОплата;
	НовДог.Комментарий = "Договор создан обработкой пользователем: "+ПараметрыСеанса.Пользователь+" "+Формат(ТекущаяДата(),"ДЛФ=DDT");
	НовДог.ВалютаВзаиморасчетов = Константы.ВалютаРегламентированногоУчетаОрганизаций.Получить();
 	
	Попытка
		НовДог.Записать();
		#Если Клиент Тогда 
		Сообщить("Записан новый договор "+НовДог);
		#КонецЕсли
	Исключение
		#Если Клиент Тогда 
		Сообщить("ОШИБКА! Не удалось записать новый договор ЗаказПокупателя ",СтатусСообщения.ОченьВажное);	
		#КонецЕсли
   	КонецПопытки; 
	
	Возврат НовДог.Ссылка;

КонецФункции // НайтиСоздатьДоговор(Справочники.Контрагенты.ОсновнойПокупатель,ПараметрыСеанса.ПодразделениеКомпании.Организация);()

//Бондаренко-- 20211216

//Бондаренко++ 20220126
Функция СМГ_НайтиСоздатьАктОказанияУслугСубподряд(Источник) Экспорт
	ФлОтказ = Ложь;  
	
	//Бондаренко++ 20220802
	Если РольДоступна("ПолныеПрава") Тогда
		Возврат ФлОтказ;
	КонецЕсли;             
	//Бондаренко-- 20220802
	
 	Запрос = Новый Запрос;
 	ПоступлениеТоваров = Документы.ПоступлениеТоваров.СоздатьДокумент();
 	
   	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ПоступлениеТоваров.Ссылка КАК Поступление_Товаров
	|ИЗ
	|	Документ.ПоступлениеТоваров КАК ПоступлениеТоваров
	|ГДЕ
	|	ПоступлениеТоваров.ДокументОснование = &ДокументОснование
	|	И ПоступлениеТоваров.ХозОперация = &ХозОперация
	|	И ПоступлениеТоваров.Организация.КонтрагентОрганизации = &КонтрагентИсточника";
 	Запрос.УстановитьПараметр("ДокументОснование", Источник.Ссылка);
	Запрос.УстановитьПараметр("ХозОперация", Справочники.ХозОперации.УслугиПоСубподряду);
	//Бондаренко++ 20220304
	Запрос.УстановитьПараметр("КонтрагентИсточника", Источник.Контрагент);	
	//Бондаренко-- 20220304
  	РезультатЗапроса = Запрос.Выполнить();
  	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
  	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		ПоступлениеТоваров = ВыборкаДетальныеЗаписи.Поступление_Товаров.ПолучитьОбъект();
	КонецЦикла;
 	 
  	ПоступлениеТоваров.ОбработкаЗаполнения(Источник.Ссылка); 
 	
	//Бондаренко++ 20220126
	Попытка
		ПоступлениеТоваров.Дата = Источник.Дата;	
 	Исключение
	КонецПопытки;          
	//Бондаренко-- 20220126	
	
 	ПодразделениеОстатковАвто = СМГ_НайтиПодразделениеПоСкладуОстатковАвто(Источник.Автомобиль,Источник.Дата);
	
	Если обЗначениеНеЗаполнено(ПодразделениеОстатковАвто) Тогда
		#Если НаКлиенте Тогда
			Сообщить("ОШИБКА! "+СокрЛП(Источник.Автомобиль)+" отсутствует на складе по состоянию на "+Формат(Источник.Дата,"ДЛФ=DDT"),СтатусСообщения.ОченьВажное);		 
		#КонецЕсли 
		ФлОтказ = Истина;
		Возврат ФлОтказ;	
 	КонецЕсли;
	
	ВидДоговораПокупка = Перечисления.ВидыДоговоров.Покупка;
	ПоступлениеТоваров.ПодразделениеКомпании = ПодразделениеОстатковАвто; 
  	ПоступлениеТоваров.Организация =  ПодразделениеОстатковАвто.Организация;
 	ПоступлениеТоваров.УстановитьНовыйНомер();
	
	//Бондаренко++ 20230308 
	Попытка
		УстановитьПривилегированныйРежим(Истина);
 	Исключение
 	КонецПопытки; 
	//Бондаренко-- 20230308 

	ПоступлениеТоваров.ДоговорВзаиморасчетов = СМГ_НайтиСоздатьДоговорСубподрядСВидомДоговора(ПоступлениеТоваров.Контрагент,ПоступлениеТоваров.Организация,ПоступлениеТоваров.ПодразделениеКомпании,ВидДоговораПокупка); 

	//Бондаренко++ 20230308 
	Попытка
		УстановитьПривилегированныйРежим(Ложь);
 	Исключение
 	КонецПопытки; 
	//Бондаренко-- 20230308 
	
	ПоступлениеТоваров.Комментарий = "Создан (или изменён) автоматически "+Формат(ТекущаяДата(),"ДЛФ=DDT")+" пользователем "+СокрЛП(ПараметрыСеанса.Пользователь)+" при проведении документа: "+СокрЛП(Источник);
	
	//Бондаренко++ 20220802
	Попытка
		ПоступлениеТоваров.ВхДокНомер = Источник.Номер;	
 	Исключение
		ПоступлениеТоваров.ВхДокНомер = "б/н";		
	КонецПопытки;	
	Попытка
		ПоступлениеТоваров.ВхДокДата = Источник.Дата;	
 	Исключение
		ПоступлениеТоваров.ВхДокДата = ТекущаяДата();		
	КонецПопытки;	
	//Бондаренко-- 20220802
  
  	Попытка
		ПоступлениеТоваров.Записать(РежимЗаписиДокумента.Запись);
		Попытка
			ПоступлениеТоваров.Записать(РежимЗаписиДокумента.Проведение);
		Исключение 
		ФлОтказ = Истина;	
 	 	#Если Клиент Тогда
 			Сообщить("ОШИБКА! Документ '"+ПоступлениеТоваров+"' не удалось провести.",СтатусСообщения.ОченьВажное);
	  	#КонецЕсли 
 		КонецПопытки;
	Исключение
		ФлОтказ = Истина;	
	 	#Если Клиент Тогда
 			Сообщить("ОШИБКА! Документ '"+ПоступлениеТоваров+"' не удалось записать.",СтатусСообщения.ОченьВажное);
	  	#КонецЕсли 
	КонецПопытки; 
 	Если Не ФлОтказ Тогда
		СМГ_НайтиСоздатьСФполученный(ПоступлениеТоваров);
	КонецЕсли;
 	
	Возврат ФлОтказ;
КонецФункции // СМГ_НайтиСоздатьАктОказанияУслугСубподряд(Источник)
 
Функция СМГ_НайтиСоздатьСФполученный(Источник) Экспорт
	ФлОтказ = Ложь;
 	Запрос = Новый Запрос;
 	СчетФактура = Документы.СчетФактураПолученный.СоздатьДокумент();
 	Запрос.Текст = 
	"ВЫБРАТЬ
	|	СчетФактураПолученный.Ссылка
	|ИЗ
	|	Документ.СчетФактураПолученный КАК СчетФактураПолученный
	|ГДЕ
	|	СчетФактураПолученный.ДокументОснование = &ДокументОснование";
 	Запрос.УстановитьПараметр("ДокументОснование", Источник.Ссылка);
  	РезультатЗапроса = Запрос.Выполнить();
  	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
  	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		СчетФактура = ВыборкаДетальныеЗаписи.Ссылка.ПолучитьОбъект();
	КонецЦикла;
	
	СчетФактура.ОбработкаЗаполнения(Источник.Ссылка);
	
	СчетФактура.ДоговорВзаиморасчетов = Источник.ДоговорВзаиморасчетов;
	
 	Попытка
		СчетФактура.Дата = Источник.Дата;	
 	Исключение
	КонецПопытки;           
	
 	Попытка
		СчетФактура.УстановитьНовыйНомер();	
 	Исключение
	КонецПопытки;          
 	
  	Попытка
		СчетФактура.Записать(РежимЗаписиДокумента.Запись);
		Попытка
			СчетФактура.Записать(РежимЗаписиДокумента.Проведение);
		Исключение 
		ФлОтказ = Истина;	
 	 	#Если Клиент Тогда
 			Сообщить("ОШИБКА! Документ '"+СчетФактура+"' не удалось провести.",СтатусСообщения.ОченьВажное);
	  	#КонецЕсли 
 		КонецПопытки;
	Исключение
		ФлОтказ = Истина;	
	 	#Если Клиент Тогда
 			Сообщить("ОШИБКА! Документ '"+СчетФактура+"' не удалось записать.",СтатусСообщения.ОченьВажное);
	  	#КонецЕсли 
	КонецПопытки;           
	Возврат ФлОтказ;
КонецФункции // СМГ_НайтиСоздатьСФполученный(Источник)  
 
Функция НайтиСоздатьДоговор(Владелец,Организация,Подразделение,ВидДоговора) Экспорт
  	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ДоговорыВзаиморасчетов.Ссылка КАК Ссылка,
		|	ДоговорыВзаиморасчетов.ВидДоговора КАК ВидДоговора,
		|	ДоговорыВзаиморасчетов.Организация КАК Организация,
		|	ДоговорыВзаиморасчетов.ПометкаУдаления КАК ПометкаУдаления
		|ИЗ
		|	Справочник.ДоговорыВзаиморасчетов КАК ДоговорыВзаиморасчетов
		|ГДЕ
		|	ДоговорыВзаиморасчетов.Владелец = &Владелец
		|	И ДоговорыВзаиморасчетов.ВидДоговора = &ВидДоговора
		|	И ДоговорыВзаиморасчетов.Организация = &Организация
		|	И НЕ ДоговорыВзаиморасчетов.ПометкаУдаления";
	
	Запрос.УстановитьПараметр("ВидДоговора", ВидДоговора);
	Запрос.УстановитьПараметр("Владелец", Владелец);
	Запрос.УстановитьПараметр("Организация", Организация);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Возврат ВыборкаДетальныеЗаписи.Ссылка;
	КонецЦикла;

	НовДоговор = Справочники.ДоговорыВзаиморасчетов.СоздатьЭлемент();
	НовДоговор.ВидДоговора = ВидДоговора;
	НовДоговор.Автор = ПараметрыСеанса.Пользователь; 
	НовДоговор.Организация = Организация;
	НовДоговор.Подразделение = Подразделение;
	НовДоговор.ВалютаВзаиморасчетов = Константы.ВалютаРегламентированногоУчетаОрганизаций.Получить();
	Новдоговор.ДатаНачала = ТекущаяДата();
	НовДоговор.ТипДоговора=Перечисления.ТипыДоговоров.Договор;
	НовДоговор.ВидОплаты=Перечисления.ВидыОплаты.БезналичныйРасчет;
	НовДоговор.Владелец=Владелец; 
	НовДоговор.СформироватьНаименование();                         
	НовДоговор.УстановитьНовыйКод("");
	
	Попытка
		НовДоговор.Записать();
	Исключение
		УстановитьПривилегированныйРежим(Истина);
		ОбновитьНумерациюОбъектов(Метаданные.Справочники.ДоговорыВзаиморасчетов);
		УстановитьПривилегированныйРежим(Ложь);
		НовДоговор.УстановитьНовыйКод("");
 		Попытка
  			НовДоговор.Записать();
		Исключение 
			СМГ_Сообщить("Ошибка! Не создан договор взаиморасчетов.",СтатусСообщения.ОченьВажное);
		КонецПопытки;
	КонецПопытки;
	
	Возврат НовДоговор.Ссылка;
 
КонецФункции // НайтиСоздатьДоговор(Владелец,Организация,Подразделение,ВидДоговора)
 
Функция СМГ_НайтиПодразделениеПоРодителю(Организация,Родитель) Экспорт
 	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПодразделенияКомпании.Ссылка,
		|	ПодразделенияКомпании.Организация,
		|	ПодразделенияКомпании.Родитель
		|ИЗ
		|	Справочник.ПодразделенияКомпании КАК ПодразделенияКомпании
		|ГДЕ
		|	ПодразделенияКомпании.Организация = &Организация
		|	И ПодразделенияКомпании.Родитель = &Родитель
		|	И ПодразделенияКомпании.ПометкаУдаления = ЛОЖЬ";
	
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("Родитель", Родитель);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Возврат ВыборкаДетальныеЗаписи.Ссылка;
	КонецЦикла;
	
	Возврат Справочники.ПодразделенияКомпании.ПустаяСсылка();
 
КонецФункции // СМГ_НайтиПодразделениеПоРодителю(Организация,Родитель)

Функция СМГ_НайтиПодразделениеПоСкладуОстатковАвто(Автомобиль,ДатаОстатков) Экспорт
	
	НайденноеПодразделение = Справочники.ПодразделенияКомпании.ПустаяСсылка();
	
	Запрос = Новый Запрос;
	
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ОстаткиАвтомобилейОстатки.СкладКомпании.Подразделение КАК Подразделение,
		|	ОстаткиАвтомобилейОстатки.Автомобиль,
		|	ОстаткиАвтомобилейОстатки.КоличествоОстаток
		|ИЗ
		|	РегистрНакопления.ОстаткиАвтомобилей.Остатки(&ДатаОстатков, Автомобиль = &Автомобиль) КАК ОстаткиАвтомобилейОстатки
		|ГДЕ
		|	ОстаткиАвтомобилейОстатки.КоличествоОстаток > 0";
	
 		Запрос.УстановитьПараметр("Автомобиль", Автомобиль);
 		Запрос.УстановитьПараметр("ДатаОстатков", ДатаОстатков);
		
		РезультатЗапроса = Запрос.Выполнить().Выгрузить();;
		
		Если РезультатЗапроса.Количество() > 0 тогда
 			НайденноеПодразделение = РезультатЗапроса[0].Подразделение;
		КонецЕсли;                                   
		
		Возврат НайденноеПодразделение; 
 
КонецФункции // СМГ_НайтиПодразделениеПоСкладуОстатковАвто()

Функция СМГ_НайтиСоздатьДоговорСубподрядСВидомДоговора(ТекКонтрагент,ТекОрганизация,ТекПодразделение,ТекВидДоговора) 
	
	НовДог = Справочники.ДоговорыВзаиморасчетов.ПустаяСсылка();
	
	Запрос = Новый Запрос;
	
	Запрос.Текст = "ВЫБРАТЬ
	               |	ДоговорыВзаиморасчетов.Ссылка,
	               |	ДоговорыВзаиморасчетов.Владелец,
	               |	ДоговорыВзаиморасчетов.Организация,
	               |	ДоговорыВзаиморасчетов.ВидДоговора
	               |ИЗ
	               |	Справочник.ДоговорыВзаиморасчетов КАК ДоговорыВзаиморасчетов
	               |ГДЕ
	               |	ДоговорыВзаиморасчетов.Владелец = &Владелец
	               |	И ДоговорыВзаиморасчетов.ВидДоговора = &ВидДоговора
	               |	И ДоговорыВзаиморасчетов.Организация = &Организация
	               |	И ДоговорыВзаиморасчетов.ПометкаУдаления = ЛОЖЬ
	               |	И ДоговорыВзаиморасчетов.ЭтоГруппа = ЛОЖЬ
	               |	И ДоговорыВзаиморасчетов.Наименование ПОДОБНО &Субподряд";
	 
	Запрос.УстановитьПараметр("Владелец",ТекКонтрагент);
 	Запрос.УстановитьПараметр("Организация",ТекОрганизация);
	Запрос.УстановитьПараметр("ВидДоговора",ТекВидДоговора);
	Запрос.УстановитьПараметр("Субподряд","%%"+"СУБПОДРЯД"+"%%");
 	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Возврат ВыборкаДетальныеЗаписи.Ссылка;
	КонецЦикла;
	
	НовДог                      = Справочники.ДоговорыВзаиморасчетов.СоздатьЭлемент();
	
	НовДог.УстановитьНовыйКод();
	
	НовДог.ТипДоговора          = Перечисления.ТипыДоговоров.Договор;
 	НовДог.ВидДоговора          = ТекВидДоговора;
	НовДог.Владелец             = ТекКонтрагент;
	НовДог.Организация          = ТекОрганизация;
	НовДог.Подразделение        = ТекПодразделение;
	НовДог.Владелец             = ТекКонтрагент;
	НовДог.ДатаНачала           = ТекущаяДата();
	НовДог.НомерДоговора        = "";
 	НовДог.Автор                = ПараметрыСеанса.Пользователь;
	НовДог.ДатаСоздания         = ТекущаяДата();
	НовДог.ВидОплаты            = Перечисления.ВидыОплаты.ПроизвольнаяОплата;
	НовДог.Комментарий          = "Договор создан обработкой. Пользователь: "+ПараметрыСеанса.Пользователь+" "+Формат(ТекущаяДата(),"ДЛФ=DDT");
	НовДог.ВалютаВзаиморасчетов = Константы.ВалютаРегламентированногоУчетаОрганизаций.Получить();
 	НовДог.ТипЦенПродажи        = Справочники.ТипыЦен.ОсновнойТипЦенЗакупки;
	НовДог.ТипЦенРабот          = Справочники.ТипыЦен.ОсновнойТипЦенЗакупки;
	НовДог.ТипЦенПокупки        = Справочники.ТипыЦен.ОсновнойТипЦенЗакупки;

	НовДог.СформироватьНаименование();
	НовДог.Наименование = СокрЛП(НовДог.Наименование)+" СУБПОДРЯД";

	//Форма = НовДог.ПолучитьФорму("ФормаЭлемента");
	//Если Не Форма.Открыта() Тогда
	//	Форма.ОткрытьМодально();
	//КонецЕсли;
	
	Попытка
		НовДог.Записать();
		#Если Клиент Тогда 
			Сообщить("Записан новый договор "+НовДог);
		#КонецЕсли
	Исключение
		#Если Клиент Тогда 
			Сообщить("ОШИБКА! Не удалось записать новый договор взаиморасчетов ",СтатусСообщения.ОченьВажное);	
		#КонецЕсли
   	КонецПопытки; 
	
	Возврат НовДог.Ссылка;

КонецФункции // СМГ_НайтиСоздатьДоговорСубподрядСВидомДоговора(ТекКонтрагент,ТекОрганизация,ТекПодразделение,ТекВидДоговора)
 //Бондаренко-- 20220126
 
 //Бондаренко++ 20220127
Функция СМГ_НайтиХозяинаПоЗаказНаряду(Автомобиль) Экспорт                 
	
	ХозяинПоЗН = Справочники.Контрагенты.ПустаяСсылка();
	
	Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ЗаказНаряд.Автомобиль.Ссылка КАК Автомобиль,
		|	ЗаказНаряд.Заказчик КАК Заказчик,
		|	ЗаказНаряд.Дата
		|ИЗ
		|	Документ.ЗаказНаряд КАК ЗаказНаряд
		|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		|			ЗаказНаряд.Проведен КАК Проведен,
		|			МАКСИМУМ(ЗаказНаряд.Дата) КАК Дата,
		|			ЗаказНаряд.Автомобиль КАК Автомобиль
		|		ИЗ
		|			Документ.ЗаказНаряд КАК ЗаказНаряд
		|		ГДЕ
		|			ЗаказНаряд.Проведен = ИСТИНА
		|		
		|		СГРУППИРОВАТЬ ПО
		|			ЗаказНаряд.Проведен,
		|			ЗаказНаряд.Автомобиль) КАК ВложенныйЗапрос
		|		ПО ЗаказНаряд.Автомобиль = ВложенныйЗапрос.Автомобиль
		|ГДЕ
		|	ЗаказНаряд.Проведен = ИСТИНА
		|	И ЗаказНаряд.Автомобиль = &Автомобиль
		|	И ЗаказНаряд.Дата = ВложенныйЗапрос.Дата";
		
		Запрос.УстановитьПараметр("Автомобиль", Автомобиль);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			ХозяинПоЗН = ВыборкаДетальныеЗаписи.Заказчик;
		КонецЦикла; 
		
		Возврат ХозяинПоЗН;
 
КонецФункции // СМГ_НайтиХозяинаПоЗаказНаряду(Автомобиль)
//Бондаренко-- 20220127	
 
 //Бондаренко++ 20221221
Функция АвтомобильПараллельногоИмпортаНаДату(Автомобиль,ДатаЗнач) Экспорт
 	ПараллельныйИмпорт = Справочники.Автомобили.ЧтениеЗначенияРегистраСведения(Автомобиль, Перечисления.ДополнительнаяИнформацияАвтомобилей.ПараллельныйИмпорт, ДатаЗнач);
	Если ПараллельныйИмпорт = Неопределено Тогда
		ПараллельныйИмпорт = Ложь;
 	КонецЕсли;
	Возврат ПараллельныйИмпорт;
КонецФункции
//Бондаренко-- 20221221

//Бондаренко++ 20221231
Процедура НормализоватьНомераДокументов(Параметры=Неопределено) Экспорт
 	Обработки.НормализоватьНомераДокументовВсех.Создать().НормализоватьНомера();
 КонецПроцедуры         
//Бондаренко-- 20221231

//Бондаренко++ 20230502
Функция ВернутьСтруктуруПоступления(Авто,ДатаЗнач) Экспорт
	
	Если НЕ обЗначениеНеЗаполнено(Авто) Тогда
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		               |	ОстаткиАвтомобилейОстатки.Автомобиль КАК Автомобиль,
		               |	ОстаткиАвтомобилейОстатки.СкладКомпании КАК СкладКомпании,
		               |	ОстаткиАвтомобилейОстатки.СтатусПартии КАК СтатусПартии,
		               |	ОстаткиАвтомобилейОстатки.Партия КАК Партия,
		               |	ОстаткиАвтомобилейОстатки.ГТД КАК ГТД,
		               |	ЕСТЬNULL(ОстаткиАвтомобилейОстатки.КоличествоОстаток, 0) КАК Количество,
		               |	ЕСТЬNULL(ОстаткиАвтомобилейОстатки.СуммаОстаток, 0) КАК Сумма,
		               |	ЕСТЬNULL(ОстаткиАвтомобилейОстатки.СуммаУпрОстаток, 0) КАК СуммаУпр,
		               |	ЕСТЬNULL(ОстаткиАвтомобилейОстатки.СуммаНДСОстаток, 0) КАК СуммаНДС
		               |ПОМЕСТИТЬ ПартияАвто
		               |ИЗ
		               |	РегистрНакопления.ОстаткиАвтомобилей.Остатки(&Момент, Автомобиль = &Автомобиль) КАК ОстаткиАвтомобилейОстатки
		               |
		               |ДЛЯ ИЗМЕНЕНИЯ
		               |	РегистрНакопления.ОстаткиАвтомобилей.Остатки
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ
		               |	ЕСТЬNULL(ПоступлениеАвтомобилейАвтомобили.АвтомобильБУ, ЛОЖЬ) КАК БУ,
		               |	ПоступлениеАвтомобилейАвтомобили.СуммаВсего,
		               |	ПоступлениеАвтомобилейАвтомобили.Ссылка.Организация,
		               |	ПоступлениеАвтомобилейАвтомобили.Ссылка.Организация.ФормаСобственности КАК ОрганизацияФормаСобственности,
		               |	ЕСТЬNULL(ПоступлениеАвтомобилейАвтомобили.ПараллельныйИмпорт, ЛОЖЬ) КАК ПараллельныйИмпорт,
		               |	ПоступлениеАвтомобилейАвтомобили.Ссылка.Контрагент КАК Контрагент,
		               |	ПоступлениеАвтомобилейАвтомобили.Ссылка.Контрагент.ОГРН КАК КонтрагентОГРН,
		               |	ПоступлениеАвтомобилейАвтомобили.Ссылка.Контрагент.ИНН КАК КонтрагентИНН,
		               |	ПоступлениеАвтомобилейАвтомобили.Ссылка.ХозОперация КАК ХозОперация,
		               |	ПоступлениеАвтомобилейАвтомобили.Ссылка.Контрагент.ФормаСобственности КАК КонтрагентФормаСобственности,
		               |	ПоступлениеАвтомобилейАвтомобили.ВидАвтомобиля КАК ВидАвтомобиля,
		               |	ПоступлениеАвтомобилейАвтомобили.Ссылка.Дата
		               |ИЗ
		               |	ПартияАвто КАК ПартияАвто
		               |		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ПоступлениеАвтомобилей.Автомобили КАК ПоступлениеАвтомобилейАвтомобили
		               |		ПО ПартияАвто.Партия.Ссылка = ПоступлениеАвтомобилейАвтомобили.Ссылка
		               |ГДЕ
		               |	(ПоступлениеАвтомобилейАвтомобили.Ссылка.ХозОперация = &ХозОперацияПоступлениеАвтомобилейКомиссия
		               |			ИЛИ ПоступлениеАвтомобилейАвтомобили.Ссылка.ХозОперация = &ХозОперацияПоступлениеАвтомобилей)";
		
		Запрос.УстановитьПараметр("Момент",ДатаЗнач);
		Запрос.УстановитьПараметр("Автомобиль",Авто);
		Запрос.УстановитьПараметр("ХозОперацияПоступлениеАвтомобилейКомиссия",Справочники.ХозОперации.ПоступлениеАвтомобилейКомиссия);
		Запрос.УстановитьПараметр("ХозОперацияПоступлениеАвтомобилей",Справочники.ХозОперации.ПоступлениеАвтомобилей);
 	  								   
		Результат = Запрос.Выполнить().Выбрать();
 		СтруктураВозврата = Новый Структура;
		Если Результат.Следующий() тогда
			СтруктураВозврата.Вставить("БУ",Результат.БУ);
			СтруктураВозврата.Вставить("ХозОперация",Результат.ХозОперация);
			СтруктураВозврата.Вставить("ПараллельныйИмпорт",Результат.ПараллельныйИмпорт);
			СтруктураВозврата.Вставить("Импортер",Результат.Контрагент);
			СтруктураВозврата.Вставить("ИмпортерИНН",Результат.КонтрагентИНН);
			СтруктураВозврата.Вставить("ИмпортерОГРН",Результат.КонтрагентОГРН);
			СтруктураВозврата.Вставить("ВидАвтомобиля",Результат.ВидАвтомобиля);
			//Бондаренко++ 20230222
			СтруктураВозврата.Вставить("ИмпортерФормаСобственности",Результат.КонтрагентФормаСобственности);
            //Бондаренко-- 20230222
			//Бондаренко++ 20230222
			СтруктураВозврата.Вставить("ОрганизацияФормаСобственности",Результат.ОрганизацияФормаСобственности);
			СтруктураВозврата.Вставить("ДатаПоступления",Результат.Дата);
            //Бондаренко-- 20230222
  			Возврат СтруктураВозврата;
		Иначе
			Возврат Неопределено;
		КонецЕсли;
	Иначе
		Возврат Неопределено;
	КонецЕсли;
КонецФункции //ВернутьСтруктуруПоступленияОМ(Авто,ДатаЗнач)
//Бондаренко-- 20230502

//Бондаренко++ 20221231
Процедура ЧтениеДанныхИзТрассирNew(Параметры=Неопределено) Экспорт
 	Обработки.ЧтениеДанныхИзТрассирNew.Создать().ЗагрузитьДанныеВРегистрМодуль();
 КонецПроцедуры         
//Бондаренко-- 20221231

//Бондаренко++ 20230531
Функция СМГ_ОтменаПроведенияАктОказанияУслугСубподряд(Источник) Экспорт
	
	ФлОтказ = Ложь;  
	
	ПоступлениеТоваров = "";
	
	//Бондаренко++ 20220802
	Если РольДоступна("ПолныеПрава") Тогда
		Возврат ФлОтказ;
	КонецЕсли;             
	//Бондаренко-- 20220802

	Запрос = Новый Запрос;
	
   	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ПоступлениеТоваров.Ссылка КАК Поступление_Товаров
	|ИЗ
	|	Документ.ПоступлениеТоваров КАК ПоступлениеТоваров
	|ГДЕ
	|	ПоступлениеТоваров.ДокументОснование = &ДокументОснование
	|	И ПоступлениеТоваров.ХозОперация = &ХозОперация
	|	И ПоступлениеТоваров.Организация.КонтрагентОрганизации = &КонтрагентИсточника";
 	Запрос.УстановитьПараметр("ДокументОснование", Источник.Ссылка);
	Запрос.УстановитьПараметр("ХозОперация", Справочники.ХозОперации.УслугиПоСубподряду);
 	Запрос.УстановитьПараметр("КонтрагентИсточника", Источник.Контрагент);	
	
	РезультатЗапроса = Запрос.Выполнить();
  	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
  	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		ПоступлениеТоваров = ВыборкаДетальныеЗаписи.Поступление_Товаров.ПолучитьОбъект();
 	КонецЦикла;
	
	Если НЕ обЗначениеНеЗаполнено(ПоступлениеТоваров) Тогда
		Попытка
			ПоступлениеТоваров.Записать(РежимЗаписиДокумента.ОтменаПроведения); 
			Сообщить("Подчинённый документ "+СокрЛП(ПоступлениеТоваров)+" стал непроведённым.",СтатусСообщения.Обычное);			
		Исключение
			ФлОтказ = Истина;	
			#Если Клиент Тогда
				Сообщить("ОШИБКА! Документ '"+ПоступлениеТоваров+"'. Не удалось отменить проведение.",СтатусСообщения.ОченьВажное);
			#КонецЕсли 
		КонецПопытки; 
		
		 Если Не ФлОтказ Тогда
			СМГ_ОтменаПроведенияСФполученный(ПоступлениеТоваров);
		КонецЕсли;
	КонецЕсли;

	Возврат ФлОтказ;
	
КонецФункции // СМГ_ОтменаПроведенияАктОказанияУслугСубподряд(Источник) 

Функция СМГ_ОтменаПроведенияСФполученный(Источник)
	
	ФлОтказ = Ложь;
	
	Запрос = Новый Запрос;
	
	СчетФактура = "";
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	СчетФактураПолученный.Ссылка
	|ИЗ
	|	Документ.СчетФактураПолученный КАК СчетФактураПолученный
	|ГДЕ
	|	СчетФактураПолученный.ДокументОснование = &ДокументОснование";
 	Запрос.УстановитьПараметр("ДокументОснование", Источник.Ссылка);
  	РезультатЗапроса = Запрос.Выполнить();
  	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
  	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		СчетФактура = ВыборкаДетальныеЗаписи.Ссылка.ПолучитьОбъект();
	КонецЦикла;
	
	Если НЕ обЗначениеНеЗаполнено(СчетФактура) Тогда
		Попытка
			СчетФактура.Записать(РежимЗаписиДокумента.ОтменаПроведения);
			Сообщить("Подчинённый документ "+СокрЛП(СчетФактура)+" также стал непроведённым.",СтатусСообщения.Обычное);			
		Исключение
			ФлОтказ = Истина;	
			#Если Клиент Тогда
				Сообщить("ОШИБКА! Документ '"+СчетФактура+"'. Не удалось отменить проведение.",СтатусСообщения.ОченьВажное);
			#КонецЕсли 
		КонецПопытки;                                          
	КонецЕсли;

	Возврат ФлОтказ; 
	
КонецФункции // СМГ_ОтменаПроведенияСФполученный(Источник)  
//Бондаренко-- 20230531

// Семенихин 26.06.2023 +++++

// Формирование штрихкодов внешним компонентом 1C:Печать штрихкодов
// Формирование штрихкода внешним компонентом 1С:Печать штрихкодов
//
// ТипКода:
// 1  - EAN13
// 24 - GS1 DataMatrix
//
Процедура ВывестиКартинкуШтрихКода(Рисунок, ШтрихКод, ТипКода = Неопределено) Экспорт

	ВнешняяКомпонента = ПодключитьВнешнююКомпонентуПечатиШтрихкода();

	Если ВнешняяКомпонента = Неопределено Тогда
		Возврат;
	КонецЕсли;

	омЭталон = Метаданные.ОбщиеМакеты.Найти("Эталон");

	Если омЭталон = Неопределено Тогда
		Сообщить(
			"Не найден общий макет Эталон, печать штрихкода невозможна!",
			СтатусСообщения.Важное
		);
		Возврат;
	Иначе
		МакетЭталон = ПолучитьОбщийМакет("Эталон");
	КонецЕсли;

	КоличествоМиллиметровВПикселе =
		МакетЭталон.Рисунки.Квадрат100Пикселей.Высота / 100;

	// Размер картинки
	ВнешняяКомпонента.Ширина =
		Окр(Рисунок.Ширина / КоличествоМиллиметровВПикселе);

	ВнешняяКомпонента.Высота =
		Окр(Рисунок.Высота / КоличествоМиллиметровВПикселе);

	// Общие настройки
	ВнешняяКомпонента.ОтображатьТекст = Истина;
	ВнешняяКомпонента.АвтоТип = Ложь;
	ВнешняяКомпонента.ТипВходныхДанных = 0;
	ВнешняяКомпонента.ЗначениеКода = Строка(ШтрихКод);
	ВнешняяКомпонента.УголПоворота = 0;
	ВнешняяКомпонента.УровеньКоррекцииQR = 1;

	// Если тип явно передан — используем его.
	// Если не передан — сохраняем старую логику.
	Если ТипКода <> Неопределено Тогда

		ВнешняяКомпонента.ТипКода = ТипКода;

	Иначе

		// Старая логика определения EAN13 / весового штрихкода
		ПрефиксВесовогоШК = Константы.ПрефиксВесовогоШК.Получить();

		ВнешняяКомпонента.ТипКода =
			Число(
				НЕ (
					СтрДлина(ШтрихКод) = 8
					И Число(Лев(ШтрихКод, 2)) <> ПрефиксВесовогоШК
				)
			);

	КонецЕсли;

	// Формируем картинку
	ДвоичныеДанныеКартинки = ВнешняяКомпонента.ПолучитьШтрихкод();

	Если ДвоичныеДанныеКартинки <> Неопределено Тогда
		Рисунок.Картинка = Новый Картинка(ДвоичныеДанныеКартинки);
	Иначе
		Сообщить(
			"Не удалось сформировать штрихкод. Тип: "
			+ Строка(ВнешняяКомпонента.ТипКода)
		);
	КонецЕсли;

КонецПроцедуры

Функция ПодключитьВнешнююКомпонентуПечатиШтрихкода()
	// Подлючение компоненты
	Попытка
		Если ПодключитьВнешнююКомпоненту("ОбщийМакет.КомпонентаПечатиШтрихкодов", "Barcode", ТипВнешнейКомпоненты.Native) Тогда
			ВнешняяКомпонента = Новый("AddIn.Barcode.Barcode");
		Иначе
			Сообщить("Не удалось подключить компоненту для формирования штрихкодов!");
			Возврат Неопределено;
		КонецЕсли;
	Исключение
		Сообщить("ОШИБКА при подключении компоненты для формирования штрихкодов: " + Символы.ПС + ОписаниеОшибки());
		Возврат Неопределено;
	КонецПопытки;
	
	// Если нет возможности рисовать
	Если НЕ ВнешняяКомпонента.ГрафикаУстановлена Тогда
		// То картинку сформировать не сможем
		Сообщить("Не найдена графическая библиотека компоненты для формирования штрихкодов!");
		Возврат Неопределено;
		
	Иначе
		// Установим основные параметры компоненты
		Если ВнешняяКомпонента.НайтиШрифт("Tahoma") = Истина Тогда
			// Выбираем его как шрифт для формирования картинки
			ВнешняяКомпонента.Шрифт = "Tahoma";
			
		Иначе
			// Шрифт Tahoma в системе отсутствует
			// Обойдем все доступные компоненте шрифты
			Для Сч = 0 По ВнешняяКомпонента.КоличествоШрифтов -1 Цикл
				// Получим очередной шрифт, доступный компоненте
				ТекущийШрифт = ВнешняяКомпонента.ШрифтПоИндексу(Сч);
				// Если шрифт доступен
				Если ТекущийШрифт <> Неопределено Тогда
					// Они и будет шрифтом для формирования штри-кода
					ВнешняяКомпонента.Шрифт = ТекущийШрифт;
					Прервать;
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
		// Утановим размер шрифта
		ВнешняяКомпонента.РазмерШрифта = 7;
		Возврат ВнешняяКомпонента;
	КонецЕсли;
КонецФункции

// проверяет наличие установленной компоненты "1С-BarCode"
// Возвращает Истина-Компонента установлена, Ложь - нет.
Функция КомпонентаПечатиШтрихКодовУстановлена() Экспорт
	Попытка
		БарКодПроверка=Новый COMОбъект("V8.Barcod.1");
		Возврат Истина;
	Исключение
		Возврат Ложь;
	КонецПопытки;
КонецФункции
// Семенихин 15.12.2025 -----

Процедура СоздатьОпросПриПроведенииДокумента(Источник) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	АнкетаПоБренду = Истина;
	ЗаполнениеПоЗН = ложь;
	Если ТипЗнч(Источник.Ссылка) = Тип("ДокументСсылка.ЗаказНаряд") Тогда
		ЗаполнениеПоЗН = истина;
	КонецЕсли;
	
	Если (НачалоДня(ТекущаяДата()) - НачалоДня(Источник.Дата)) / (60 * 60 * 24) > 2 тогда
		Возврат;
	КонецЕсли;
	
	Если ЗаполнениеПоЗН Тогда
		Если Источник.Состояние <> Справочники.ВидыСостоянийЗаказНарядов.Закрыт
			ИЛИ НЕ ВидРемонтаПодходит(Источник.ВидРемонта) тогда 
			Возврат;
		КонецЕсли; 
		Если ЗначениеЗаполнено(Источник.Заказчик) И 
			(Источник.Заказчик.ВидКонтрагента = Перечисления.ВидыКонтрагентов.ПодотчетноеЛицо ИЛИ Источник.Заказчик.НашаФирма) Тогда
			Возврат;
		КонецЕсли;
	ИначеЕсли Источник.Контрагент.НашаФирма тогда
			Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Опрос.Ссылка
		|ИЗ
		|	Документ.Опрос КАК Опрос
		|ГДЕ
		|	Опрос.ДокументОснование = &ДокументОснование";
	
	Запрос.УстановитьПараметр("ДокументОснование", Источник.Ссылка);
	
	Результат = Запрос.Выполнить();	
	Если НЕ Результат.Пустой() Тогда
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	НастройкиЗвонковВежливости.Подразделение,
		|	НастройкиЗвонковВежливости.Анкета3Дня,
		|	НастройкиЗвонковВежливости.АнкетаСервис,
		|	НастройкиЗвонковВежливости.ОтветственныйМенеджер,
		|	1 КАК УровеньИерархии
		|ИЗ
		|	РегистрСведений.НастройкиЗвонковВежливости КАК НастройкиЗвонковВежливости
		|ГДЕ
		|	НастройкиЗвонковВежливости.Подразделение = &Подразделение
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	НастройкиЗвонковВежливости.Подразделение,
		|	НастройкиЗвонковВежливости.Анкета3Дня,
		|	НастройкиЗвонковВежливости.АнкетаСервис,
		|	НастройкиЗвонковВежливости.ОтветственныйМенеджер,
		|	2
		|ИЗ
		|	РегистрСведений.НастройкиЗвонковВежливости КАК НастройкиЗвонковВежливости
		|ГДЕ
		|	НастройкиЗвонковВежливости.Подразделение = ВЫРАЗИТЬ(&Подразделение КАК Справочник.ПодразделенияКомпании).Родитель
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	НастройкиЗвонковВежливости.Подразделение,
		|	НастройкиЗвонковВежливости.Анкета3Дня,
		|	НастройкиЗвонковВежливости.АнкетаСервис,
		|	НастройкиЗвонковВежливости.ОтветственныйМенеджер,
		|	3
		|ИЗ
		|	РегистрСведений.НастройкиЗвонковВежливости КАК НастройкиЗвонковВежливости
		|ГДЕ
		|	НастройкиЗвонковВежливости.Подразделение = ВЫРАЗИТЬ(&Подразделение КАК Справочник.ПодразделенияКомпании).Родитель.Родитель";
	
	Запрос.УстановитьПараметр("Подразделение", Источник.ПодразделениеКомпании);	
	Результат = Запрос.Выполнить().Выбрать();
	Для Сч = 1 По 3 Цикл
		Если Результат.НайтиСледующий(Сч,"УровеньИерархии") тогда
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	ДокОпрос = Документы.Опрос.СоздатьДокумент();
	ДокОпрос.Заполнить(Источник);
	ДокОпрос.ДокументОснование = Источник.Ссылка;
	Если ЗаполнениеПоЗН тогда
		ДокОпрос.Дата = Источник.ДатаЗакрытия + 60*60*24*3;
		ДокОпрос.ОпрашиваемоеЛицо = Источник.Заказчик;
		ДокОпрос.Мастер = Источник.Диспетчер; 
	Иначе
		ДокОпрос.Дата = Источник.Дата + 60*60*24*3;
		ДокОпрос.ОпрашиваемоеЛицо = Источник.Контрагент;
		ДокОпрос.Мастер = Источник.Менеджер; 
	КонецЕсли;
	ДокОпрос._г_ДатаСоздания = ТекущаяДата();
	ДокОпрос.СпособКонтакта = Перечисления.ВидыСобытий.ТелефонныйЗвонок;
	ДокОпрос.Менеджер = Результат.ОтветственныйМенеджер;
	Если ЗначениеЗаполнено(ДокОпрос.ОпрашиваемоеЛицо) И ТипЗнч(ДокОпрос.ОпрашиваемоеЛицо) = Тип("СправочникСсылка.Контрагенты") Тогда
		ДокОпрос.Поле = ДокОпрос.ОпрашиваемоеЛицо.ОсновнойТелефон;
	КонецЕсли;
	
	Если АнкетаПоБренду Тогда
		Если ЗаполнениеПоЗН тогда
			МаркаАМ = Источник.Автомобиль.Модель.Марка;
		Иначе
			МаркаАМ = Источник.Автомобили[0].Автомобиль.Модель.Марка;
		КонецЕсли;
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	НастройкиЗвонковВежливости.Анкета3Дня,
		|	НастройкиЗвонковВежливости.АнкетаСервис,
		|	1 КАК Приоритет
		|ИЗ
		|	РегистрСведений.НастройкиЗвонковВежливости КАК НастройкиЗвонковВежливости
		|ГДЕ
		|	НастройкиЗвонковВежливости.МаркаАМ = &МаркаАМ
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	НастройкиЗвонковВежливости.Анкета3Дня,
		|	НастройкиЗвонковВежливости.АнкетаСервис,
		|	2
		|ИЗ
		|	РегистрСведений.НастройкиЗвонковВежливости КАК НастройкиЗвонковВежливости
		|ГДЕ
		|	НастройкиЗвонковВежливости.Подразделение =  Значение(Справочник.ПодразделенияКомпании.ПустаяСсылка)
		|	И НастройкиЗвонковВежливости.МаркаАМ =  Значение(Справочник.Марка.ПустаяСсылка)";
		
		Запрос.УстановитьПараметр("МаркаАМ", МаркаАМ);
		Запрос.УстановитьПараметр("Подразделение", Источник.ПодразделениеКомпании);
		
		РезультатЗапроса = Запрос.Выполнить();
		Если Не РезультатЗапроса.Пустой() тогда  
			Результат = РезультатЗапроса.Выбрать(); 
			Для Сч = 1 По 2 Цикл
				Если Результат.НайтиСледующий(Сч,"Приоритет") тогда
				Прервать;
		КонецЕсли;
	КонецЦикла;
		КонецЕсли;
	КонецЕсли;
	Если ЗаполнениеПоЗН тогда
		ДокОпрос.ТиповаяАнкета = Результат.АнкетаСервис;
	Иначе
		ДокОпрос.ТиповаяАнкета = Результат.Анкета3Дня;
	КонецЕсли;
	
	#Если Клиент Тогда
	Попытка
		зфОпросОбновитьСписокВопросов(ДокОпрос);
	Исключение
	КонецПопытки;
	#КонецЕсли
	
	Попытка
	ДокОпрос.Записать(РежимЗаписиДокумента.Запись);
	Исключение
	КонецПопытки;

	УстановитьПривилегированныйРежим(Ложь);
	
КонецПроцедуры     

Функция ВидРемонтаПодходит(ВидРемонта) 
	
	Если ВидРемонта = Справочники.ВидыРемонта.КузовнойРемонт
		ИЛИ ВидРемонта = Справочники.ВидыРемонта.КузовнойКоммерческий
		ИЛИ ВидРемонта = Справочники.ВидыРемонта.КоммерческийРемонт
		ИЛИ ВидРемонта = Справочники.ВидыРемонта.ТехническоеОбслуживание
		ИЛИ ВидРемонта = Справочники.ВидыРемонта.ТехническоеОбслуживаниеБесплатное
		ИЛИ ВидРемонта = Справочники.ВидыРемонта.ТО_ноль
		ИЛИ ВидРемонта = Справочники.ВидыРемонта.ТО_нольПлатный
		ИЛИ ВидРемонта = Справочники.ВидыРемонта.ГарантияHPromise
		ИЛИ ВидРемонта = Справочники.ВидыРемонта.ГарантияДистирибьютера
		ИЛИ ВидРемонта = Справочники.ВидыРемонта.ГарантияПроизводителя
		ИЛИ ВидРемонта = Справочники.ВидыРемонта.ГарантияПроизводителяЛКП
		Тогда 
		Возврат Истина;
	Иначе
		Возврат ложь;
	КонецЕсли;
КонецФункции

//Бондаренко++ 20231207
Функция АвтомобильСПробегом(Автомобиль, НаДату) Экспорт
	Значение = Справочники.Автомобили.ЧтениеЗначенияРегистраСведения(Автомобиль, Перечисления.ДополнительнаяИнформацияАвтомобилей.ВидАвтомобиля, НаДату);
	Если ЗначениеЗаполнено(Значение) Тогда
		Возврат Значение = Перечисления.ВидАвтомобиля.АвтомобильСПробегом;
	Иначе
		Возврат Ложь;
	КонецЕсли;	
КонецФункции

//Бондаренко++ 20240109
 Функция НайтиСоздатьСинхронизироватьДокументСчетФактураВыданныйБезСообщений(ДокументОснование,ПометкаУдаления,ИзФормыДокумента) Экспорт

  	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СчетФактураВыданный.Ссылка,
		|	СчетФактураВыданный.ДокументОснование
		|ИЗ
		|	Документ.СчетФактураВыданный КАК СчетФактураВыданный
		|ГДЕ
		|	СчетФактураВыданный.ДокументОснование = &ДокументОснование";
	
	Запрос.УстановитьПараметр("ДокументОснование", ДокументОснование);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		СФ_объект = ВыборкаДетальныеЗаписи.Ссылка.ПолучитьОбъект();
 		Если СФ_объект.ДоговорВзаиморасчетов <> ДокументОснование.ДоговорВзаиморасчетов Тогда
			Попытка
				СФ_объект.Контрагент = ДокументОснование.Контрагент;
				СФ_объект.ДоговорВзаиморасчетов = ДокументОснование.ДоговорВзаиморасчетов;
				СФ_объект.Грузополучатель = ДокументОснование.Контрагент;
				СФ_объект.Записать(РежимЗаписиДокумента.Запись);
			Исключение
	 		КонецПопытки;
		КонецЕсли;            
 		Прервать;
	КонецЦикла;
	
	Если обЗначениеНеЗаполнено(СФ_объект) Тогда
		СФ_объект = Документы.СчетФактураВыданный.СоздатьДокумент();
 	КонецЕсли; 
 	 
 	СФ_объект.ОбработкаЗаполнения(ДокументОснование);
	СФ_объект.Номер = ДокументОснование.Номер;
	СФ_объект.Дата = ДокументОснование.Дата;
	
	Если ПометкаУдаления Тогда
		Если НЕ ИзФормыДокумента Тогда
			СФ_объект.Товары.Очистить();
 		КонецЕсли; 
 	КонецЕсли; 
 	
	Если ДокументОснование.Проведен И Не ПометкаУдаления Тогда
		Попытка
 		    Если ИзФормыДокумента Тогда
				СФ_объект.Записать(РежимЗаписиДокумента.Проведение);
  			Иначе
				СФ_объект.Записать(РежимЗаписиДокумента.Запись);
  			КонецЕсли;  
 		Исключение
 		КонецПопытки;
 	Иначе
		Попытка
		    СФ_объект.Записать(РежимЗаписиДокумента.ОтменаПроведения);
  		Исключение
 		КонецПопытки;
	КонецЕсли;
 	
	Возврат СФ_объект.Ссылка;

КонецФункции // НайтиСоздатьСинхронизироватьДокументСчетФактураВыданныйБезСообщений(ДокументОснование)
//Бондаренко-- 20240109

// Семенихин 29.10.2024 +++++
Процедура УстановитьСтатусНекорректныйФПК(Параметры = Неопределено) Экспорт
	СписокСтатусов = Новый Массив();
	СписокСтатусов.Добавить(Справочники.СтатусыРабочегоЛиста.Интерес);
	СписокСтатусов.Добавить(Справочники.СтатусыРабочегоЛиста.Создан);
	
	ЗапросРабЛисты = Новый Запрос();
	ЗапросРабЛисты.УстановитьПараметр("СписокСтатусов", СписокСтатусов);
	ЗапросРабЛисты.Текст =
	"ВЫБРАТЬ
	|	РабочийЛист.Ссылка КАК РабЛист,
	|	РабочийЛист.ТолькоБУ КАК ТолькоБУ,
	|	РабочийЛист.ЮридическоеЛицо КАК ЮридическоеЛицо
	|ИЗ
	|	Документ.РабочийЛист КАК РабочийЛист
	|ГДЕ
	|	РабочийЛист.Статус В(&СписокСтатусов)
	|	И РабочийЛист.ПредставлениеТелефона ПОДОБНО ""+7, 800%""
	|	И РабочийЛист.ВидОплаты <> ЗНАЧЕНИЕ(Перечисление.ВидыОплаты.Лизинг)";
	
	ВыборкаРабЛисты = ЗапросРабЛисты.Выполнить().Выбрать();
	ВсегоСтрок = ВыборкаРабЛисты.Количество();
	Если ВсегоСтрок = 0 Тогда
		Возврат;
	КонецЕсли;
	
	сч = 1;
	Пока ВыборкаРабЛисты.Следующий() Цикл
		ЗавершитьЗапланированныеСобытия(ВыборкаРабЛисты.РабЛист);
		
		Если Не ВыборкаРабЛисты.ТолькоБУ Тогда // добавить Отказ
			СобытиеОбъект = Документы.Событие.СоздатьДокумент();
			СобытиеОбъект.Заполнить(ВыборкаРабЛисты.РабЛист);
			СобытиеОбъект.Состояние = Перечисления.СостоянияСобытий.Завершено;
			СобытиеОбъект.Приоритет = Перечисления.Важность.Средняя;
			СобытиеОбъект.ВидСобытия = Перечисления.ВидыСобытий.ОтказОтАвтомобиля;
			СобытиеОбъект.Результат = "Некорректный ФПК";
			СобытиеОбъект.ДатаНачала = ТекущаяДата();
			СобытиеОбъект.ДатаОкончания = СобытиеОбъект.ДатаНачала + 900;
			СобытиеОбъект.ПредметОбращения = Справочники.ПредметыОбращения.Автосалон;
			СобытиеОбъект.ВторичныйКонтакт = Истина;
			Если ВыборкаРабЛисты.ЮридическоеЛицо Тогда
				СобытиеОбъект.ТипКлиента = Перечисления.ФормыСобственности.ЮридическоеЛицо;
			Иначе
				СобытиеОбъект.ТипКлиента = Перечисления.ФормыСобственности.ЧастноеЛицо;
			КонецЕсли;
			
			Попытка
				СобытиеОбъект.Записать(РежимЗаписиДокумента.Проведение);
			Исключение
				СобытиеОбъект.ОбменДанными.Загрузка = Истина;
				СобытиеОбъект.Записать();
				СМ_ВыгрузкаВАвтодилер.РегистрацияИзмененныхДокументов(СобытиеОбъект, Ложь);
			КонецПопытки;
		КонецЕсли;
		
		// записать РЛ
		РабЛистОбъект = ВыборкаРабЛисты.РабЛист.ПолучитьОбъект();
		РабЛистОбъект.Статус = Справочники.СтатусыРабочегоЛиста.ОшибочныйНомер;
		ПричинаОтказа = Справочники.ВозраженияИПричиныОтказов.НайтиПоКоду("ЦБ000018"); //Неправильный номер телефона
		РабЛистОбъект.ПричинаОтказа = ПричинаОтказа;
		РабЛистОбъект.Комментарий = РабЛистОбъект.Комментарий + "; Автоматически установлен статус <Некорректный ФПК> " +
		Формат(ТекущаяДата(), "ДЛФ=ДД");
		
		Попытка
			РабЛистОбъект.Записать();
		Исключение
			РабЛистОбъект.ОбменДанными.Загрузка = Истина;
			РабЛистОбъект.Записать();
			СМ_ВыгрузкаВАвтодилер.РегистрацияИзмененныхДокументов(РабЛистОбъект, Ложь);
		КонецПопытки;
		
		Сообщить("Обработано строк " + сч + " из " + ВсегоСтрок, СтатусСообщения.Информация);
		сч = сч + 1;
	КонецЦикла;
КонецПроцедуры

Процедура ЗавершитьЗапланированныеСобытия(РабЛист)
	Если обЗначениеНеЗаполнено(РабЛист) Тогда
		Возврат;
	КонецЕсли;
	
	СписокВидов = Новый Массив();
	СписокВидов.Добавить(Перечисления.ВидыСобытий.ЛичнаяВстреча);
	СписокВидов.Добавить(Перечисления.ВидыСобытий.ТелефонныйЗвонок);
	СписокВидов.Добавить(Перечисления.ВидыСобытий.ЗаявкаССайта);
	СписокВидов.Добавить(Перечисления.ВидыСобытий.ТестДрайв);
	
	ЗапросЗапланированные = Новый Запрос();
	ЗапросЗапланированные.УстановитьПараметр("РабочийЛист", РабЛист);
	ЗапросЗапланированные.УстановитьПараметр("СписокВидов", СписокВидов);
	ЗапросЗапланированные.УстановитьПараметр("Запланировано", Перечисления.СостоянияСобытий.Запланировано);
	ЗапросЗапланированные.Текст =
	"ВЫБРАТЬ
	|	Событие.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.Событие КАК Событие
	|ГДЕ
	|	Событие.ДокументОснование = &РабочийЛист
	|	И Событие.ВидСобытия В(&СписокВидов)
	|	И Событие.Состояние = &Запланировано";
	
	ВыборкаЗапланированные = ЗапросЗапланированные.Выполнить().Выбрать();
	Пока ВыборкаЗапланированные.Следующий() Цикл
		СобытиеОбъект = ВыборкаЗапланированные.Ссылка.ПолучитьОбъект();
		Если СобытиеОбъект.ВидСобытия = Перечисления.ВидыСобытий.ТестДрайв Тогда
			СобытиеОбъект.Состояние = Перечисления.СостоянияСобытий.Отменено;
		Иначе
			СобытиеОбъект.Состояние = Перечисления.СостоянияСобытий.Завершено;
		КонецЕсли;
		СобытиеОбъект.Результат = "Клиент отказся сообщить номер телефона.";
		
		Попытка
			СобытиеОбъект.Записать();
		Исключение
			Сообщить("Ошибка при отмене запланированного " + Строка(СобытиеОбъект) + Символы.ПС + ОписаниеОшибки(), СтатусСообщения.Важное);
		КонецПопытки;		
	КонецЦикла;
КонецПроцедуры
// Семенихин 29.10.2024 -----

//Бондаренко++ 20250130
Функция НайтиСоздатьДоговорНеИстекший(Владелец,Организация,Подразделение,ВидДоговора,ДатаДокумента) Экспорт
  	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ДоговорыВзаиморасчетов.Ссылка КАК Ссылка,
		|	ДоговорыВзаиморасчетов.ВидДоговора КАК ВидДоговора,
		|	ДоговорыВзаиморасчетов.Организация КАК Организация,
		|	ДоговорыВзаиморасчетов.ПометкаУдаления КАК ПометкаУдаления,
		|	ДоговорыВзаиморасчетов.ДатаКонца КАК ДатаКонца
		|ИЗ
		|	Справочник.ДоговорыВзаиморасчетов КАК ДоговорыВзаиморасчетов
		|ГДЕ
		|	ДоговорыВзаиморасчетов.Владелец = &Владелец
		|	И ДоговорыВзаиморасчетов.ВидДоговора = &ВидДоговора
		|	И ДоговорыВзаиморасчетов.Организация = &Организация
		|	И НЕ ДоговорыВзаиморасчетов.ПометкаУдаления
		|	И (ДоговорыВзаиморасчетов.ДатаКонца = &ПустаяДата
		|			ИЛИ ДоговорыВзаиморасчетов.ДатаКонца >= &ДатаДокумента)
		|
		|УПОРЯДОЧИТЬ ПО
		|	ДоговорыВзаиморасчетов.Основной УБЫВ";
	
	Запрос.УстановитьПараметр("ВидДоговора", ВидДоговора);
	Запрос.УстановитьПараметр("Владелец", Владелец);
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("ПустаяДата", Дата(1,1,1));
	Запрос.УстановитьПараметр("ДатаДокумента", НачалоДня(ДатаДокумента));
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Возврат ВыборкаДетальныеЗаписи.Ссылка;
	КонецЦикла;

	НовДоговор = Справочники.ДоговорыВзаиморасчетов.СоздатьЭлемент();
	НовДоговор.ВидДоговора = ВидДоговора;
	НовДоговор.Автор = ПараметрыСеанса.Пользователь; 
	НовДоговор.Организация = Организация;
	НовДоговор.Подразделение = Подразделение;
	НовДоговор.ВалютаВзаиморасчетов = Константы.ВалютаРегламентированногоУчетаОрганизаций.Получить();
	Новдоговор.ДатаНачала = ТекущаяДата();
	НовДоговор.ТипДоговора=Перечисления.ТипыДоговоров.Договор;
	НовДоговор.ВидОплаты=Перечисления.ВидыОплаты.БезналичныйРасчет;
	НовДоговор.Владелец=Владелец;
	
	//Бондаренко++ 20250214
 	НовДоговор.ДляАвтосалона=Истина;
	НовДоговор.ДляАвтосервиса=Истина;
	НовДоговор.ДляАвтомобилей=Истина;
	НовДоговор.ДляЗаказНарядов=Истина;
	НовДоговор.ДляЗапчастей=Истина;
 	//Бондаренко-- 20250214
	
	//Бондаренко++ 20250218
	НовДоговор.Основной = Истина;
	//Бондаренко-- 20250218
	
 	НовДоговор.СформироватьНаименование();                         
	НовДоговор.УстановитьНовыйКод("");
	
	Попытка
		НовДоговор.Записать();
	Исключение
		УстановитьПривилегированныйРежим(Истина);
		ОбновитьНумерациюОбъектов(Метаданные.Справочники.ДоговорыВзаиморасчетов);
		УстановитьПривилегированныйРежим(Ложь);
		НовДоговор.УстановитьНовыйКод("");
 		Попытка
  			НовДоговор.Записать();
		Исключение 
			СМГ_Сообщить("Ошибка! Не создан договор взаиморасчетов.",СтатусСообщения.ОченьВажное);
		КонецПопытки;
	КонецПопытки;
	
	Возврат НовДоговор.Ссылка;
 
КонецФункции // НайтиСоздатьДоговорНеИстекший(Владелец,Организация,Подразделение,ВидДоговора,ДатаДокумента)
//Бондаренко++ 20250130

//Бондаренко-- 20250131
Функция НайтиЦехОрганизацииВДЦ(Подразделение,ДЦ) Экспорт
	
	Цех_ = "";
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Цеха.Подразделение КАК Подразделение,
		|	Цеха.Подразделение.ДилерскийЦентр КАК ПодразделениеДилерскийЦентр,
		|	Цеха.Ссылка КАК Цех,
		|	Цеха.ОсновнойЦехПодразделения КАК ОсновнойЦехПодразделения
		|ИЗ
		|	Справочник.Цеха КАК Цеха
		|ГДЕ
		|	Цеха.Подразделение.ДилерскийЦентр = &ДЦ
		|	И Цеха.Подразделение = &Подразделение
		|
		|УПОРЯДОЧИТЬ ПО
		|	Организация УБЫВ";
	
	Запрос.УстановитьПараметр("ДЦ", ДЦ);
	Запрос.УстановитьПараметр("Подразделение", Подразделение);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Цех_ = ВыборкаДетальныеЗаписи.Цех;
		Прервать;
	КонецЦикла;
	
	Возврат Цех_;
	
КонецФункции // НайтиЦехОрганизацииВДЦ(Подразделение,ДЦ)
  
Функция НайтиПодразделениеГКпоОрганизацииИДЦ(Орг,ДЦ) Экспорт
	
	ПодразделениеГК_ = "";
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПодразделениеГК.Организация КАК Орг,
		|	ПодразделениеГК.ПодразделениеКомпании.ДилерскийЦентр КАК ДЦ,
		|	ПодразделениеГК.Ссылка КАК ПодразделениеГК,
		|	ПодразделениеГК.Сервис КАК Сервис
		|ИЗ
		|	Справочник.ПодразделенияГК КАК ПодразделениеГК
		|ГДЕ
		|	ПодразделениеГК.ПодразделениеКомпании.ДилерскийЦентр = &ДЦ
		|	И ПодразделениеГК.Организация = &Орг
		|	И ПодразделениеГК.Сервис
		|
		|УПОРЯДОЧИТЬ ПО
		|	ПодразделениеГК.Организация УБЫВ";
	
	Запрос.УстановитьПараметр("ДЦ", ДЦ);
	Запрос.УстановитьПараметр("Орг", Орг);
 	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		ПодразделениеГК_ = ВыборкаДетальныеЗаписи.ПодразделениеГК;
		Прервать;
	КонецЦикла;
	
	Возврат ПодразделениеГК_;
	
КонецФункции // НайтиЦехОрганизацииВДЦ(Орг,ДЦ)


Функция НайтиПодразделениеПоМаркеАвто(Марка) Экспорт
	
	Подр_ = "";
	
	СписокПодразделенийГК  = Новый СписокЗначений;
	
	Для каждого Эл Из ПараметрыСеанса.Пользователь.Сотрудник.ТаблицаПодразделенийГК Цикл
  		СписокПодразделенийГК.Добавить(Эл.ПодразделениеГК);	
	КонецЦикла;
  	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПодразделенияГКМаркиАвтомобилей.Марка КАК Марка,
		|	ПодразделенияГКМаркиАвтомобилей.Ссылка КАК ПодразделениеГК
		|ИЗ
		|	Справочник.ПодразделенияГК.МаркиАвтомобилей КАК ПодразделенияГКМаркиАвтомобилей
		|ГДЕ
		|	ПодразделенияГКМаркиАвтомобилей.Ссылка В(&СписокПодразделенийГК)
		|	И ПодразделенияГКМаркиАвтомобилей.Марка = &Марка
		|	И ПодразделенияГКМаркиАвтомобилей.Ссылка.Сервис";
	
	Запрос.УстановитьПараметр("СписокПодразделенийГК", СписокПодразделенийГК);
	Запрос.УстановитьПараметр("Марка", Марка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Подр_ = ВыборкаДетальныеЗаписи.ПодразделениеГК;
		Прервать;
	КонецЦикла;
	
 	Возврат Подр_;

КонецФункции // ПолучитьПодразделениеПоМаркеАвто(Марка)

Функция НайтиПодразделениеКомпанииПоМаркеДЦ(Марка,ДилерскийЦентр) Экспорт
	
	Подр_ = "";
	
  	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПодразделенияМаркиАвтомобилей.Ссылка КАК Подразделение,
		|	ПодразделенияМаркиАвтомобилей.Ссылка.ДилерскийЦентр КАК ДилерскийЦентр,
		|	ПодразделенияМаркиАвтомобилей.Ссылка.ПометкаУдаления КАК ПометкаУдаления,
		|	ПодразделенияМаркиАвтомобилей.Ссылка.Родитель КАК Родитель
		|ИЗ
		|	Справочник.ПодразделенияКомпании.МаркиАвтомобилей КАК ПодразделенияМаркиАвтомобилей
		|ГДЕ
		|	ПодразделенияМаркиАвтомобилей.Марка = &Марка
		|	И ПодразделенияМаркиАвтомобилей.Ссылка.ДилерскийЦентр = &ДилерскийЦентр
		|	И НЕ ПодразделенияМаркиАвтомобилей.Ссылка.ПометкаУдаления
		|	И НЕ ПодразделенияМаркиАвтомобилей.Ссылка.Родитель = &КомпанияВЦелом";
	
 	Запрос.УстановитьПараметр("Марка", Марка);
 	Запрос.УстановитьПараметр("ДилерскийЦентр", ДилерскийЦентр);
	Запрос.УстановитьПараметр("КомпанияВЦелом",Справочники.ПодразделенияКомпании.ОсновноеПодразделение);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Подр_ = ВыборкаДетальныеЗаписи.Подразделение;
		Прервать;
	КонецЦикла;
	
 	Возврат Подр_;
  
КонецФункции // НайтиПодразделениеКомпанииПоМаркеДЦ(Марка,ДилерскийЦентр)

Функция НайтиОбособленноеПодразделениеКомпанииДЦ(ДилерскийЦентр) Экспорт
	
	Подр_ = "";
	
  	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПодразделенияМаркиАвтомобилей.Ссылка КАК Подразделение,
		|	ПодразделенияМаркиАвтомобилей.Ссылка.ДилерскийЦентр КАК ДилерскийЦентр,
		|	ПодразделенияМаркиАвтомобилей.Ссылка.ПометкаУдаления КАК ПометкаУдаления,
		|	ПодразделенияМаркиАвтомобилей.Ссылка.Родитель КАК Родитель,
		|	ПодразделенияМаркиАвтомобилей.Ссылка.ОПЗарегистрировано КАК ОПЗарегистрировано
		|ИЗ
		|	Справочник.ПодразделенияКомпании.МаркиАвтомобилей КАК ПодразделенияМаркиАвтомобилей
		|ГДЕ
		|	ПодразделенияМаркиАвтомобилей.Ссылка.ДилерскийЦентр = &ДилерскийЦентр
		|	И НЕ ПодразделенияМаркиАвтомобилей.Ссылка.ПометкаУдаления
		|	И НЕ ПодразделенияМаркиАвтомобилей.Ссылка.Родитель = &КомпанияВЦелом
		|	И ПодразделенияМаркиАвтомобилей.Ссылка.ОПЗарегистрировано";
	
  	Запрос.УстановитьПараметр("ДилерскийЦентр", ДилерскийЦентр);
	Запрос.УстановитьПараметр("КомпанияВЦелом",Справочники.ПодразделенияКомпании.ОсновноеПодразделение);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Подр_ = ВыборкаДетальныеЗаписи.Подразделение;
		Прервать;
	КонецЦикла;
	
 	Возврат Подр_;
  
КонецФункции // НайтиОбособленноеПодразделениеКомпанииДЦ(ДилерскийЦентр)

Функция НайтиПодразделениеКомпанииДЦ(ДилерскийЦентр) Экспорт
	
	Подр_ = "";
	
  	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПодразделенияМаркиАвтомобилей.Ссылка КАК Подразделение,
		|	ПодразделенияМаркиАвтомобилей.Ссылка.ДилерскийЦентр КАК ДилерскийЦентр,
		|	ПодразделенияМаркиАвтомобилей.Ссылка.ПометкаУдаления КАК ПометкаУдаления,
		|	ПодразделенияМаркиАвтомобилей.Ссылка.Родитель КАК Родитель
 		|ИЗ
		|	Справочник.ПодразделенияКомпании.МаркиАвтомобилей КАК ПодразделенияМаркиАвтомобилей
		|ГДЕ
		|	ПодразделенияМаркиАвтомобилей.Ссылка.ДилерскийЦентр = &ДилерскийЦентр
		|	И НЕ ПодразделенияМаркиАвтомобилей.Ссылка.ПометкаУдаления
		|	И НЕ ПодразделенияМаркиАвтомобилей.Ссылка.Родитель = &КомпанияВЦелом";
	
  	Запрос.УстановитьПараметр("ДилерскийЦентр", ДилерскийЦентр);
	Запрос.УстановитьПараметр("КомпанияВЦелом",Справочники.ПодразделенияКомпании.ОсновноеПодразделение);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Подр_ = ВыборкаДетальныеЗаписи.Подразделение;
		Прервать;
	КонецЦикла;
	
 	Возврат Подр_;
  
КонецФункции // НайтиПодразделениеКомпанииДЦ(ДилерскийЦентр)
//Бондаренко-- 20250131
 
//Бондаренко++ 20250305
Процедура СформироватьДокументыКорректировкиДолга(Параметры = Неопределено) Экспорт
	Отладка = Ложь;
 	НовОбр = Обработки.СформироватьДокументыКорректировкиДолга.Создать();
 	НовОбр.СформироватьДокументыКорректировкиДолгаПоСчетамИЗаказНарядам(Отладка); 
КонецПроцедуры //СформироватьДокументыКорректировкиДолга
//Бондаренко-- 20250305

Функция НайтиОбособленноеПодразделениеКомпанииПоМаркеДЦ(Марка,ДилерскийЦентр) Экспорт
	
	Подр_ = "";
	
  	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПодразделенияМаркиАвтомобилей.Ссылка КАК Подразделение,
		|	ПодразделенияМаркиАвтомобилей.Ссылка.ДилерскийЦентр КАК ДилерскийЦентр,
		|	ПодразделенияМаркиАвтомобилей.Ссылка.ПометкаУдаления КАК ПометкаУдаления,
		|	ПодразделенияМаркиАвтомобилей.Ссылка.Родитель КАК Родитель,
		|	ПодразделенияМаркиАвтомобилей.Ссылка.ОПЗарегистрировано КАК ОПЗарегистрировано
		|ИЗ
		|	Справочник.ПодразделенияКомпании.МаркиАвтомобилей КАК ПодразделенияМаркиАвтомобилей
		|ГДЕ
		|	ПодразделенияМаркиАвтомобилей.Марка = &Марка
		|	И ПодразделенияМаркиАвтомобилей.Ссылка.ДилерскийЦентр = &ДилерскийЦентр
		|	И НЕ ПодразделенияМаркиАвтомобилей.Ссылка.ПометкаУдаления
		|	И НЕ ПодразделенияМаркиАвтомобилей.Ссылка.Родитель = &КомпанияВЦелом
		|	И ПодразделенияМаркиАвтомобилей.Ссылка.ОПЗарегистрировано";
	
 	Запрос.УстановитьПараметр("Марка", Марка);
 	Запрос.УстановитьПараметр("ДилерскийЦентр", ДилерскийЦентр);
	Запрос.УстановитьПараметр("КомпанияВЦелом",Справочники.ПодразделенияКомпании.ОсновноеПодразделение);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Подр_ = ВыборкаДетальныеЗаписи.Подразделение;
		Прервать;
	КонецЦикла;
	
 	Возврат Подр_;
  
КонецФункции // НайтиОбособленноеПодразделениеКомпанииПоМаркеДЦ(Марка,ДилерскийЦентр)

// Семенихин 29.06.2025 +++++
// закрытие просроченных рабочих листов сервиса
Процедура ЗакрытьПросроченныеРЛСервиса(Параметры = Неопределено) Экспорт
	СписокСтатусов = Новый Массив();
	СписокСтатусов.Добавить(Справочники.СтатусыРабочегоЛиста.Интерес);
	СписокСтатусов.Добавить(Справочники.СтатусыРабочегоЛиста.Создан);
	СписокСтатусов.Добавить(Справочники.СтатусыРабочегоЛиста.Сделка);
	ПричинаОтказа = Справочники.ВозраженияИПричиныОтказов.НайтиПоКоду("ЦБ000049"); // Истёк срок рабочего листа сервиса
	ДатаНачала = НачалоДня(ТекущаяДата() - 1209600); // за 14 дней
	
	ЗапросРЛ = Новый Запрос();
	ЗапросРЛ.УстановитьПараметр("ДатаНачала", ДатаНачала);
	ЗапросРЛ.УстановитьПараметр("ДатаОкончания", КонецДня(ДатаНачала));
	ЗапросРЛ.УстановитьПараметр("СписокСтатусов", СписокСтатусов);
	ЗапросРЛ.Текст =
	"ВЫБРАТЬ
	|	РабочийЛистСервиса.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.РабочийЛистСервиса КАК РабочийЛистСервиса
	|ГДЕ
	|	РабочийЛистСервиса.Дата МЕЖДУ &ДатаНачала И &ДатаОкончания
	|	И РабочийЛистСервиса.Статус В(&СписокСтатусов)
	|	И НЕ РабочийЛистСервиса.ПометкаУдаления";
	
	ВыборкаРЛ = ЗапросРЛ.Выполнить().Выбрать();
	Пока ВыборкаРЛ.Следующий() Цикл
		РабочийЛистОбъект = ВыборкаРЛ.Ссылка.ПолучитьОбъект();
		РабочийЛистОбъект.Статус = Справочники.СтатусыРабочегоЛиста.Отказ;
		РабочийЛистОбъект.ПричинаОтказа = ПричинаОтказа;
		РабочийЛистОбъект.Комментарий = РабочийЛистОбъект.Комментарий + Символы.ВК +
		"Закрыт автоматически по истечении 14 дней со дня обращения.";
		РабочийЛистОбъект.ОбменДанными.Загрузка = Истина;
		РабочийЛистОбъект.Записать();
	КонецЦикла;
КонецПроцедуры

Функция ПроверитьСодержаниеРезультатСобытия(СтрокаТекста, МинБуквЦифр) Экспорт
	Если ТипЗнч(СтрокаТекста) <> Тип("Строка") Тогда
		Сообщить("ОШИБКА! При вызове ПроверитьСодержаниеРезультатСобытия() параметром передана не строка!", СтатусСообщения.ОченьВажное);
		Возврат Ложь;
	КонецЕсли;
	Если обЗначениеНеЗаполнено(СтрокаТекста) Тогда
		Сообщить("ОШИБКА! Содержание или Результат События не заполнен!", СтатусСообщения.ОченьВажное);
		Возврат Ложь;
	КонецЕсли;
	
	СтрокаТекста = СокрЛП(СтрокаТекста);
	ДлинаСтроки = СтрДлина(СтрокаТекста);
	Если ДлинаСтроки = 0 Тогда
		Сообщить("ОШИБКА! Содержание или Результат События не заполнен (только пробелы)!", СтатусСообщения.ОченьВажное);
		Возврат Ложь;
	КонецЕсли;

	КоличествоБуквЦифр = 0;
	Для сч = 1 По ДлинаСтроки Цикл
		КодСимвола = КодСимвола(Сред(СтрокаТекста, сч, 1));
		Если КодСимвола >= 1040 И КодСимвола <= 1103 Тогда // кириллица
			КоличествоБуквЦифр = КоличествоБуквЦифр + 1;
			
		ИначеЕсли КодСимвола = 1025 Или КодСимвола = 1105 Тогда // символы "Ё" и "ё"
			КоличествоБуквЦифр = КоличествоБуквЦифр + 1;
			
		ИначеЕсли КодСимвола >= 65 И КодСимвола <= 90 Тогда // латиница большие
			КоличествоБуквЦифр = КоличествоБуквЦифр + 1;
			
		ИначеЕсли КодСимвола >= 97 И КодСимвола <= 122 Тогда // латиница маленькие
			КоличествоБуквЦифр = КоличествоБуквЦифр + 1;
			
		ИначеЕсли КодСимвола >= 48 И КодСимвола <= 57 Тогда // цифры
			КоличествоБуквЦифр = КоличествоБуквЦифр + 1;
		КонецЕсли;
	КонецЦикла;

	Если КоличествоБуквЦифр >= МинБуквЦифр Тогда
		Возврат Истина;
	Иначе
		Сообщить("ОШИБКА! Содержание или Результат События содержит менее " + МинБуквЦифр + " букв или цифр!", СтатусСообщения.ОченьВажное);
		Возврат Ложь;		
	КонецЕсли;
КонецФункции

Функция СоздатьЗавершитьВыдачуАвтомобиля(Дата, АвтомобильВыдачи, РабочийЛист) Экспорт
	Если обЗначениеНеЗаполнено(АвтомобильВыдачи) Тогда
		Возврат Документы.Событие.ПустаяСсылка();
	КонецЕсли;
	Если обЗначениеНеЗаполнено(РабочийЛист) Тогда
		Возврат Документы.Событие.ПустаяСсылка();
	КонецЕсли;
	
	Если АвтомобильВыдачи.ЗеленыйАвтомобиль Тогда
		Сообщить("Для зелёного автомобиля событие Выдача не создаётся/завершается.", СтатусСообщения.Информация);
		Возврат Документы.Событие.ПустаяСсылка();
	КонецЕсли;
	
	АктивныеСостояния = Новый Массив();
	АктивныеСостояния.Добавить(Перечисления.СостоянияСобытий.Запланировано);
	АктивныеСостояния.Добавить(Перечисления.СостоянияСобытий.Завершено);
	
	ЗапросВыдачи = Новый Запрос();
	ЗапросВыдачи.УстановитьПараметр("Выдача", Перечисления.ВидыСобытий.ВыдачаАвтомобиля);
	ЗапросВыдачи.УстановитьПараметр("РабочийЛист", РабочийЛист);
	ЗапросВыдачи.УстановитьПараметр("АктивныеСостояния", АктивныеСостояния);
	ЗапросВыдачи.Текст =
	"ВЫБРАТЬ
	|	Событие.Ссылка КАК Ссылка,
	|	Событие.Состояние КАК Состояние
	|ИЗ
	|	Документ.Событие КАК Событие
	|ГДЕ
	|	Событие.ВидСобытия = &Выдача
	|	И Событие.ДокументОснование = &РабочийЛист
	|	И Событие.Состояние В(&АктивныеСостояния)
	|	И НЕ Событие.ПометкаУдаления
	|
	|УПОРЯДОЧИТЬ ПО
	|	Событие.Дата";
	
	РезультатВыдача = ЗапросВыдачи.Выполнить();
	Если РезультатВыдача.Пустой() Тогда
		СобытиеОбъект = Документы.Событие.СоздатьДокумент();
		СобытиеОбъект.Заполнить(РабочийЛист);
		СобытиеОбъект.ВидСобытия = Перечисления.ВидыСобытий.ВыдачаАвтомобиля;
		СобытиеОбъект.Автомобиль = АвтомобильВыдачи;	
		СобытиеОбъект.Состояние = Перечисления.СостоянияСобытий.Завершено;
		СобытиеОбъект.Результат = "Автомобиль выдан.";
		СобытиеОбъект.Приоритет = Перечисления.Важность.Средняя;
		СобытиеОбъект.Дата = Дата;
		СобытиеОбъект.ДатаНачала = Дата;
		СобытиеОбъект.ДатаОкончания = СобытиеОбъект.ДатаНачала + 1800;
		СобытиеОбъект.ВторичныйКонтакт = Истина;
		СобытиеОбъект.ПредметОбращения = Справочники.ПредметыОбращения.Автосалон;
		
		Попытка
			СобытиеОбъект.Записать(РежимЗаписиДокумента.Проведение);
			Сообщить("Создана выдача автомобиля: " + Строка(СобытиеОбъект.Ссылка), СтатусСообщения.Информация);
		Исключение
			Сообщить("ВНИМАНИЕ! Ошибка при создании Выдачи автомобиля." + Символы.ПС 
				+ ОписаниеОшибки(), СтатусСообщения.Важное);
		КонецПопытки;
		Возврат СобытиеОбъект.Ссылка;
		
	Иначе
		ВыборкаВыдача = РезультатВыдача.Выбрать();
		Пока ВыборкаВыдача.Следующий() Цикл
			ВыдачаСсылка = ВыборкаВыдача.Ссылка;
			Если ВыборкаВыдача.Состояние = Перечисления.СостоянияСобытий.Запланировано Тогда
				СобытиеОбъект = ВыдачаСсылка.ПолучитьОбъект();
				СобытиеОбъект.Контрагент = РабочийЛист.Контрагент;
				СобытиеОбъект.Состояние = Перечисления.СостоянияСобытий.Завершено;
				СобытиеОбъект.Результат = "Автомобиль выдан.";
				
				Попытка
					СобытиеОбъект.Записать(РежимЗаписиДокумента.Проведение);
					Сообщить("Завершена выдача автомобиля: " + Строка(СобытиеОбъект.Ссылка), СтатусСообщения.Информация);
				Исключение
					Сообщить("ВНИМАНИЕ! Ошибка при завершении Выдачи автомобиля." + Символы.ПС 
						+ ОписаниеОшибки(), СтатусСообщения.Важное);
				КонецПопытки;
				Возврат СобытиеОбъект.Ссылка;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	Возврат Документы.Событие.ПустаяСсылка();
КонецФункции
// Семенихин 24.05.2026 -----   


// Холышевская ++ 26.02.2026
// Закрытие РЛ по которым нет контакта более 30 дней
Процедура ЗакрытьРЛПравило30Дней(НачалоПериода = Неопределено, КонецПериода = Неопределено) Экспорт  
	
	Если НачалоПериода = Дата(1, 1, 1) 
		ИЛИ НачалоПериода = Неопределено Тогда
		НачалоПериода = НачалоГода(ТекущаяДата());
	КонецЕсли;
	Если КонецПериода = Дата(1, 1, 1) 
		ИЛИ КонецПериода = Неопределено Тогда
		КонецПериода = КонецГода(ТекущаяДата());
	КонецЕсли;  
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	РабочийЛист.Ссылка КАК РЛ,
		|	РабочийЛист.Статус КАК СтатусРЛ,
		|	Событие.Ссылка КАК Событие,
		|	Событие.ВидСобытия КАК ВидСобытия,
		|	Событие.Состояние КАК Состояние,
		|	Событие.ТипСообщения КАК ТипСообщения,
		|	МАКСИМУМ(ВЫБОР
		|			КОГДА Событие.Дата >= ДОБАВИТЬКДАТЕ(&ТекущаяДата, МЕСЯЦ, -1)
		|					И Событие.ВидСобытия В (&ВидыСобытий)
		|					И Событие.Состояние В (&Состояния)
		|				ТОГДА ИСТИНА
		|			ИНАЧЕ ЛОЖЬ
		|		КОНЕЦ) КАК УдачныйКонтакт30Дней
		|ИЗ
		|	Документ.РабочийЛист КАК РабочийЛист
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.Событие КАК Событие
		|		ПО РабочийЛист.Ссылка = Событие.ДокументОснование
		|ГДЕ
		|	РабочийЛист.Статус = &Статус
		|	И РабочийЛист.Дата МЕЖДУ &НачалоПериода И &КонецПериода
		|	И НЕ РабочийЛист.ПометкаУдаления
		|	И НЕ Событие.ПометкаУдаления
		|	И РабочийЛист.Проведен
		|	И РабочийЛист.Дата < ДОБАВИТЬКДАТЕ(&ТекущаяДата, МЕСЯЦ, -1)
		|
		|СГРУППИРОВАТЬ ПО
		|	РабочийЛист.Ссылка,
		|	РабочийЛист.Статус,
		|	Событие.Ссылка,
		|	Событие.ВидСобытия,
		|	Событие.Состояние,
		|	Событие.ТипСообщения
		|
		|УПОРЯДОЧИТЬ ПО
		|	РабочийЛист.Дата УБЫВ
		|ИТОГИ ПО
		|	РЛ";
	
	Статус = Справочники.СтатусыРабочегоЛиста.Интерес;     
	
	ВидыСобытий = Новый СписокЗначений;
	ВидыСобытий.Добавить(Перечисления.ВидыСобытий.ЗаявкаССайта);  
	ВидыСобытий.Добавить(Перечисления.ВидыСобытий.ЛичнаяВстреча); 
	ВидыСобытий.Добавить(Перечисления.ВидыСобытий.ТелефонныйЗвонок);
	ВидыСобытий.Добавить(Перечисления.ВидыСобытий.ТестДрайв); 
	
	Состояния = Новый СписокЗначений;
	Состояния.Добавить(Перечисления.СостоянияСобытий.Завершено);
	Состояния.Добавить(Перечисления.СостоянияСобытий.Выполняется);
	
	Запрос.УстановитьПараметр("ВидыСобытий", ВидыСобытий);
	Запрос.УстановитьПараметр("Состояния", Состояния);
	Запрос.УстановитьПараметр("Статус", Статус);
	Запрос.УстановитьПараметр("ТекущаяДата", НачалоДня(ТекущаяДата()));

	Запрос.УстановитьПараметр("НачалоПериода", НачалоПериода);
	Запрос.УстановитьПараметр("КонецПериода", КонецДня(КонецПериода));

	
	РезультатЗапроса = Запрос.Выполнить();                 
		
	ВыборкаРЛ = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Пока ВыборкаРЛ.Следующий() Цикл
		
		// если нет контакта более 30 дней
		Если НЕ ВыборкаРЛ.УдачныйКонтакт30Дней Тогда
			РЛ = ВыборкаРЛ.РЛ;
			ВыборкаСобытий = ВыборкаРЛ.Выбрать(); 			
			Пока ВыборкаСобытий.Следующий() Цикл	
				Попытка
					Событие = ВыборкаСобытий.Событие.ПолучитьОбъект();
					Если Событие.Состояние <> Перечисления.СостоянияСобытий.Выполняется
						И Событие.Состояние <> Перечисления.СостоянияСобытий.Завершено Тогда
						Событие.Состояние = Перечисления.СостоянияСобытий.Отменено;	
					КонецЕсли;
					Событие.Записать(РежимЗаписиДокумента.Проведение); 
				Исключение
					Сообщить("Не удалось провести " + ВыборкаСобытий.Событие + Символы.ПС + ОписаниеОшибки(), СтатусСообщения.Важное); 
				КонецПопытки;
			КонецЦикла; 
			СобытиеОбъект = Документы.Событие.СоздатьДокумент();
			СобытиеОбъект.Заполнить(РЛ); 
			СобытиеОбъект.ДокументОснование = РЛ.Ссылка;
			СобытиеОбъект.Состояние = Перечисления.СостоянияСобытий.Завершено;
			СобытиеОбъект.Приоритет = Перечисления.Важность.Средняя;
			СобытиеОбъект.ВидСобытия = Перечисления.ВидыСобытий.ОтказОтАвтомобиля;
			СобытиеОбъект.Результат = "Отсутствие контакта больше 30 дней";
			СобытиеОбъект.ДатаНачала = ТекущаяДата();
			СобытиеОбъект.ДатаОкончания = СобытиеОбъект.ДатаНачала + 900;
			СобытиеОбъект.ПредметОбращения = Справочники.ПредметыОбращения.Автосалон;
			СобытиеОбъект.ВторичныйКонтакт = Истина;
			Если РЛ.ЮридическоеЛицо Тогда
				СобытиеОбъект.ТипКлиента = Перечисления.ФормыСобственности.ЮридическоеЛицо;
			Иначе
				СобытиеОбъект.ТипКлиента = Перечисления.ФормыСобственности.ЧастноеЛицо;
			КонецЕсли;
			
			Попытка
				СобытиеОбъект.Записать(РежимЗаписиДокумента.Запись);
			Исключение    
				Сообщить("Не удалось записать Отказ !" + Символы.ПС + ОписаниеОшибки(), СтатусСообщения.Важное);
			КонецПопытки;

			Попытка 
				РЛ = ВыборкаРЛ.РЛ.ПолучитьОбъект();
				РЛ.Статус = Справочники.СтатусыРабочегоЛиста.НайтиПоКоду("00000020");
				РЛ.Записать(РежимЗаписиДокумента.Проведение); 
				РЛИзменен = Истина;
			Исключение
				Сообщить("Не удалось провести " + ВыборкаРЛ.РЛ + Символы.ПС + ОписаниеОшибки(), СтатусСообщения.Важное);
				РЛИзменен = Ложь;
			КонецПопытки;
			
		КонецЕсли; 
		
	КонецЦикла;	      

КонецПроцедуры // ЗакрытьРЛ30Дней()  
// Холышевская -- 26.02.2026
