Функция СоздатьКодыПоСписку(СписокСтруктур) Экспорт
	
	Результат = Истина;
	
	Для каждого СтруктураЭлемента из СписокСтруктур Цикл
		
		CustomerObjCode = СтруктураЭлемента["CustomerObjCode"];
		
		//Ищем элемент
		ТекЭлемент = НайтиПоКоду(CustomerObjCode);
		Если НЕ ТекЭлемент = ПустаяСсылка() тогда 
			Элемент = ТекЭлемент.ПолучитьОбъект();
		Иначе
			Элемент = СоздатьЭлемент();
		КонецЕсли;
		
		Элемент.Код = CustomerObjCode;
		Элемент.Наименование = СтруктураЭлемента["CustomerObjection"];
		
		Попытка
			
			Элемент.Записать();
			
			//Если есть хоть одна ошибка, в истину результат уже не выставляем
			Результат = ?(Результат, истина, ложь);
			
		Исключение
			
			Результат = Ложь;
			
		КонецПопытки;
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

Процедура ЗагрузитьИзМакета() Экспорт
	
	ТаблицаКодов = ПолучитьМакет("КодыОщущенийКлиента");
	
	КоличествоСтрок = ТаблицаКодов.ВысотаТаблицы;
	
	СписокСтруктур = Новый Массив;
	
	Для Сч = 2 по КоличествоСтрок Цикл
		
		СтруктураЭлементов = Новый Структура;
		
		СтруктураЭлементов.Вставить("CustomerObjCode", ТаблицаКодов.Область("R"+Формат(Сч,"ЧГ=")+"C1").Текст);
		СтруктураЭлементов.Вставить("CustomerObjection", ТаблицаКодов.Область("R"+Формат(Сч,"ЧГ=")+"C2").Текст);
		
		СписокСтруктур.Добавить(СтруктураЭлементов);
		
	КонецЦикла;
	
	СоздатьКодыПоСписку(СписокСтруктур);
	
КонецПроцедуры
