
Процедура ПередЗаписью(Отказ)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	СервисыПодразделения.Ссылка КАК Ссылка,
	|	СервисыПодразделения.Подразделение КАК Подразделение
	|ПОМЕСТИТЬ Все_сервисы
	|ИЗ
	|	Справочник.Сервисы.Подразделения КАК СервисыПодразделения
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Все_сервисы.Подразделение КАК Подразделение,
	|	Все_сервисы.Ссылка КАК Ссылка
	|ИЗ
	|	Все_сервисы КАК Все_сервисы
	|ГДЕ
	|	Все_сервисы.Подразделение В(&Подразделение)";
	
	Запрос.УстановитьПараметр("Подразделение", Подразделения.ВыгрузитьКолонку("Подразделение"));
	
	РезультатЗапроса = Запрос.Выполнить().Выгрузить();
	
	Если РезультатЗапроса.Количество() <> 0 Тогда	
		Для Каждого Строка Из РезультатЗапроса Цикл  
			
			Если Строка.Ссылка <> Ссылка Тогда
				Сообщить("Подразделение <"+Строка.Подразделение + "> уже есть в сервисе <" + Строка.ссылка + ">"); 
				Отказ = Истина;	
			КонецЕсли;
		
		КонецЦикла;                                                                                           
	КонецЕсли;
	
КонецПроцедуры
