// Модуль документа ОтчетКомитентуЗаАвтомобили

////////////////////////////////////////////////////////////////////////////////
// ПЕРЕМЕННЫЕ ОБЪЕКТА

Перем Права Экспорт;				// Переменная объекта - ссылка на коллекцию прав, настроек и переменных окружения
Перем РезультатОбработки Экспорт;	// Переменная для накопления результатов проведения по модулям наборов записей
Перем ОбработкаЗначенияСвойствОбъектов Экспорт; // Переменная для хранения значения свойств основания/объекта копирования

Перем ТекущаяВалютаДокумента Экспорт; // Текущая валюта документа
Перем ТекущийКурсДокумента Экспорт;   // Текущий курс валюты документа

////////////////////////////////////////////////////////////////////////////////
// ЭКСПОРТНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ ДОПОЛНИТЕЛЬНЫХ МЕТОДОВ ОБЪЕКТА

// Возвращает структуру обязательных / уникальных реквизитов документа
// Возвращаемая структура содержит строковые идентификаторы реквизитов или вложенные структуры для табличных частей
// Для реквизита значение структуры содержит число 1-Обязательный, 2-Уникальный, 3-Уникальный и обязательный
Функция ПолучитьОбязательныеРеквизиты() Экспорт
	// Обязательные поля таблицы автомобилей
	ОбязательныеАвтомобили=Новый Структура();
	ОбязательныеАвтомобили.Вставить("Автомобиль",3);
	ОбязательныеАвтомобили.Вставить("Количество",1);
	ОбязательныеАвтомобили.Вставить("ДокументПоступления",3);
	
	// Обязательные реквизиты документа
	ОбязательныеРеквизиты=Новый Структура();
	ОбязательныеРеквизиты.Вставить("Организация",1);
	ОбязательныеРеквизиты.Вставить("ПодразделениеКомпании",1);
	ОбязательныеРеквизиты.Вставить("Автор",1);
	ОбязательныеРеквизиты.Вставить("ВалютаДокумента",1);
	ОбязательныеРеквизиты.Вставить("КурсДокумента",1);
	ОбязательныеРеквизиты.Вставить("Контрагент",1);
	ОбязательныеРеквизиты.Вставить("ДоговорВзаиморасчетов",1);
	ОбязательныеРеквизиты.Вставить("ХозОперация",1);
	ОбязательныеРеквизиты.Вставить("Автомобили",ОбязательныеАвтомобили);
	
	Возврат ОбязательныеРеквизиты;
КонецФункции

// Проверяет корректность заполнения объекта.
// Возвращает Истина если все заполнено корректно и Ложь иначе.
// В случае некорректного заполнения формирует строку описанием возникших ошибок "Ошибки"
// На вход может быть передана структура ДопРеквизиты с дополнительными реквизитами для проверки
// может управляться булевыми флагами выполняемых проверок Заполнение, Уникальность
// (могут быть и другие необязательные)
// Обычно выполняется универсальным обработчиком, но могут быть добавлены доп. проверки
Функция ПроверитьКорректность(Ошибки="", ДопРеквизиты=Неопределено, Заполнение=Истина, Уникальность=Истина) Экспорт
	// Здесь могут быть определены дополнительные к стандартным обязательным реквизитам условия проверки
	Результат = дкПроверитьКорректность(ЭтотОбъект, Ошибки, ДопРеквизиты, Заполнение, Уникальность);
	
	// Проверим договор документов поступления, он должен совпадать с договором шапки
	Для Каждого СтрокаАвтомобиль Из Автомобили Цикл
		Если НЕ обЗначениеНеЗаполнено(СтрокаАвтомобиль.ДокументПоступления) Тогда
			ДоговорДокументаПоступления = СтрокаАвтомобиль.ДокументПоступления.ДоговорВзаиморасчетов;
			Если ДоговорДокументаПоступления <> ДоговорВзаиморасчетов Тогда
				дкДобавитьОшибку(Ошибки,"Строка №"+СтрокаАвтомобиль.НомерСтроки+". Договор документов поступления """+СокрЛП(ДоговорДокументаПоступления.Наименование)+""" должен быть равен договору в шапке документа");
				Результат = Ложь;
			КонецЕсли;
		КонецЕсли;	
	КонецЦикла;
	
	// Проведем проверку соответствия организации документа организациям некоторых реквизитов документа.
	// Такую проверку необходимо осуществлять, если баланс в системе ведется по организации,
	// или если установлен способ контроля корректности
	// договора и склада документа. Причем, если способ контроля выбран "Контроль по организации и подразделению", то
	// дополнительно осуществляется проверка соответствия подразделений.
	Если Результат Тогда
		СпособКонтроляКорректности = обПраво("КонтрольКорректностиДоговораИСкладаДокумента", Права,,ЭтотОбъект);	
		КонтрольОтсутствует        = (СпособКонтроляКорректности=Перечисления.СпособКонтроляКорректностиДоговораИСкладаДокумента.КонтрольОтсутствует);
		БалансВедетсяПоОрганизации = (Константы.СпособВеденияБаланса.Получить()=Перечисления.СпособВеденияБаланса.ПоОрганизации);
		
		Если БалансВедетсяПоОрганизации ИЛИ НЕ КонтрольОтсутствует Тогда
			КонтрольПоПодразделению = (СпособКонтроляКорректности=Перечисления.СпособКонтроляКорректностиДоговораИСкладаДокумента.КонтрольПоОрганизацииИПодразделению);
			
			КонтролируемыеРеквизиты = Новый Структура();
			
			КонтролируемыеРеквизитыШапки = Новый Структура();
			КонтролируемыеРеквизитыШапки.Вставить("ДоговорВзаиморасчетов", КонтрольПоПодразделению); 			
			КонтролируемыеРеквизиты.Вставить("КонтролируемыеРеквизитыШапки",КонтролируемыеРеквизитыШапки);
			
			Если БалансВедетсяПоОрганизации Тогда
				КонтролируемыеРеквизитыАвтомобили = Новый Структура();
				КонтролируемыеРеквизитыАвтомобили.Вставить("ДокументПоступления");
				ТабличныеЧасти = Новый Структура();
				ТабличныеЧасти.Вставить("Автомобили",КонтролируемыеРеквизитыАвтомобили);
				КонтролируемыеРеквизиты.Вставить("КонтролируемыеРеквизитыТабличныхЧастей",ТабличныеЧасти);
			КонецЕсли;
			
			Результат = дкПроверитьКорректностьПоОрганизации(ЭтотОбъект,КонтролируемыеРеквизиты,Ошибки) И Результат;
		КонецЕсли;  		
	КонецЕсли;
	
	Возврат Результат;
КонецФункции

// Функция проверяет, допустимо ли изменение объекта
// Возвращает Истина, если изменения возможны, ложь иначе
// Если изменения доступны частично, возвращает ложь и структуру блокируемых на изменение реквизитов,
Функция ДоступностьИзменения(БлокироватьРеквизиты=Неопределено) Экспорт
	// Здесь может быть прописано определение наличия ссылок, блокирующих изменение объекта
	Возврат Истина;
КонецФункции

// Возвращает список возможных хозяйственных операций документа
// Возвращаемое значение: СписокЗначений. 
// Строка списка: Значение - имя предопределенного элемента; 
//				  Представление - красивое его представление
// 				  "Помеченная" строка - ХО по умолчанию.
Функция ПолучитьСписокХозОпераций() Экспорт
	СписокХозОпераций = Новый СписокЗначений;
	СписокХозОпераций.Добавить("ОтчетКомитентуЗаАвтомобили","Отчет комитенту за автомобили",Истина);
	Возврат СписокХозОпераций;
КонецФункции

// возвращает выборку по шапке
// ДокументСсылка - Ссылка на документ для которого получаем шапку
Функция ПолучитьШапкуДокумента(ДокументСсылка)
	Запрос=Новый Запрос("
	|ВЫБРАТЬ
	|	Док.Ссылка КАК Ссылка,
	|	Док.Дата КАК Дата,
	|	Док.ВалютаДокумента КАК ВалютаДокумента,
	|	Док.КурсДокумента КАК КурсДокумента,
	|	Док.ТипЦен КАК ТипЦен,
	|	Док.ХозОперация КАК ХозОперация,
	|	Док.КурсВалютыУпр КАК КурсВалютыУпр,
	|	Док.КурсВалютыВзаиморасчетов КАК КурсВалютыВзаиморасчетов,
	|	Док.МоментВремени КАК МоментВремени,
	|	Док.ПодразделениеКомпании КАК ПодразделениеКомпании,
	|	Док.СуммаДокумента КАК СуммаДокумента,
	/////////// ПРИВАТ ////////////
	|	Док.Контрагент КАК Контрагент,
	|	Док.ДоговорВзаиморасчетов КАК ДоговорВзаиморасчетов,
	|	Док.СуммаВознаграждения КАК СуммаВознаграждения
	|
	|ИЗ
	|	Документ."+Метаданные().Имя+" КАК Док
	|
	|ГДЕ
	|	Док.Ссылка=&Ссылка
	|");
	Запрос.УстановитьПараметр("Ссылка",ДокументСсылка);
	Выборка=Запрос.Выполнить().Выбрать(); Выборка.Следующий();
	
	Возврат Выборка;
КонецФункции

// формирует движения документа по партионным регистрам
// Возвращает Истина - все хорошо, ложь - чего-то не так
Функция ПровестиПоПартиям(Режим,ДокументСсылка) Экспорт
	Отказ=Ложь;
	
	// Получим способ ведения баланса.
	БалансВедетсяПоПодразделениям = (Константы.СпособВеденияБаланса.Получить()=Перечисления.СпособВеденияБаланса.ПоПодразделению);
	
	// получим шапку документа
	ШапкаДокумента=ПолучитьШапкуДокумента(ДокументСсылка);
	
	// проверим, если подразделение проводиться по партиям "отложено", то дальше не идем
	НаборЗаписейДопроведениеПоПартиям=Движения.ДопроведениеПоПартиям;
	НаборЗаписейДопроведениеПоПартиям.ДокументОбъект=ЭтотОбъект;
	НаборЗаписейДопроведениеПоПартиям.ШапкаДокумента=ШапкаДокумента;
	Отказ=НЕ НаборЗаписейДопроведениеПоПартиям.Зафиксировать() ИЛИ Отказ;
	Если НаборЗаписейДопроведениеПоПартиям.НеПроводитьПартии Тогда
		//Закроем взаиморасчеты с контрагентом
		Если (ШапкаДокумента.СуммаДокумента-ШапкаДокумента.СуммаВознаграждения)<>0 Тогда
			НаборЗаписейДоходыИРасходы=Движения.ДоходыИРасходы;
			НаборЗаписейДоходыИРасходы.ДокументОбъект=ЭтотОбъект;
			НаборЗаписейДоходыИРасходы.ШапкаДокумента=ШапкаДокумента;
			НаборЗаписейДоходыИРасходы.СтатьяДоходовИРасходов = Справочники.СтатьиДоходовИРасходов.СебестоимостьНеоприходованныхПартий;
			НаборЗаписейДоходыИРасходы.ВУпрВалюте = Ложь;
			НаборЗаписейДоходыИРасходы.Расход = ШапкаДокумента.СуммаДокумента-ШапкаДокумента.СуммаВознаграждения;
			НаборЗаписейДоходыИРасходы.Приход();
		КонецЕсли; 
		//Закроем принятые и реализованные на комиссию автомобили
		Запрос=Новый Запрос;
		Запрос.Текст="ВЫБРАТЬ
		|	ЕСТЬNULL(СУММА(РеализованныеАвтомобили.СуммаУпр),0) КАК СуммаУпр
		|ИЗ
		|	РегистрНакопления.РеализованныеАвтомобили КАК РеализованныеАвтомобили
		|ГДЕ
		|	РеализованныеАвтомобили.Регистратор = &Регистратор";
		Запрос.УстановитьПараметр("Регистратор",ШапкаДокумента.Ссылка);
		Выборка=Запрос.Выполнить().Выбрать();
		Если Выборка.Следующий() Тогда
			Если Выборка.СуммаУпр<>0 Тогда
				НаборЗаписейДоходыИРасходы=Движения.ДоходыИРасходы;
				НаборЗаписейДоходыИРасходы.ДокументОбъект=ЭтотОбъект;
				НаборЗаписейДоходыИРасходы.ШапкаДокумента=ШапкаДокумента;
				НаборЗаписейДоходыИРасходы.СтатьяДоходовИРасходов = Справочники.СтатьиДоходовИРасходов.СебестоимостьНеоприходованныхПартий;
				НаборЗаписейДоходыИРасходы.ВУпрВалюте = Истина;
				НаборЗаписейДоходыИРасходы.Доход = Выборка.СуммаУпр;
				НаборЗаписейДоходыИРасходы.Приход();
			КонецЕсли; 
		КонецЕсли; 		 
		Возврат НЕ Отказ;
	КонецЕсли;
	
	////Спишем оборудование автомобиля
	////YABS: его вроде как уже списали при продаже
	//НаборЗаписейКомплектацияАвтомобилей=Движения.КомплектацияАвтомобилей;
	//Для каждого Автомобиль Из Автомобили Цикл
	//	//Спишем оборудование по документу
	//	НаборЗаписейКомплектацияАвтомобилей.РежимПроведения=Режим;
	//	НаборЗаписейКомплектацияАвтомобилей.ДокументОбъект=ЭтотОбъект;
	//	НаборЗаписейКомплектацияАвтомобилей.РезультатЗапросаПоТоварам=Неопределено;
	//	НаборЗаписейКомплектацияАвтомобилей.Автомобиль=Автомобиль.Автомобиль;
	//	НаборЗаписейКомплектацияАвтомобилей.ПериодДвижения=МоментВремени();
	//	НаборЗаписейКомплектацияАвтомобилей.ТипОборудования="Номенклатура";
	//	Отказ=НЕ НаборЗаписейКомплектацияАвтомобилей.Расход() ИЛИ Отказ;
	//	//Спишем опции, установленное производителем
	//	НаборЗаписейКомплектацияАвтомобилей.РежимПроведения=Режим;
	//	НаборЗаписейКомплектацияАвтомобилей.ДокументОбъект=ЭтотОбъект;
	//	НаборЗаписейКомплектацияАвтомобилей.РезультатЗапросаПоТоварам=Неопределено;
	//	НаборЗаписейКомплектацияАвтомобилей.Автомобиль=Автомобиль.Автомобиль;
	//	НаборЗаписейКомплектацияАвтомобилей.ПериодДвижения=МоментВремени();
	//	НаборЗаписейКомплектацияАвтомобилей.ТипОборудования="Опции";
	//	Отказ=НЕ НаборЗаписейКомплектацияАвтомобилей.Расход() ИЛИ Отказ;
	//КонецЦикла; 
	
	//доходы и расходы
	ВалютаУпр=Константы.ВалютаУправленческогоУчетаКомпании.Получить();
	Если обЗначениеНеЗаполнено(ШапкаДокумента.КурсВалютыУпр) Тогда
		СтруктураКурса = обКурсДляВалюты(ВалютаУпр,ШапкаДокумента.Дата);
		КурсУпр = СтруктураКурса.Курс / ?(СтруктураКурса.Кратность = 0, 1, СтруктураКурса.Кратность);
	Иначе
		КурсУпр = ШапкаДокумента.КурсВалютыУпр;
	КонецЕсли;	
	//Списанная стоимость
	Запрос=Новый Запрос;
	Запрос.Текст="ВЫБРАТЬ
	|	ЕСТЬNULL(СУММА(РеализованныеАвтомобили.СуммаУпр),0) КАК СуммаУпр
	|ИЗ
	|	РегистрНакопления.РеализованныеАвтомобили КАК РеализованныеАвтомобили
	|ГДЕ
	|	РеализованныеАвтомобили.Регистратор = &Регистратор";
	Запрос.УстановитьПараметр("Регистратор",ШапкаДокумента.Ссылка);
	Выборка=Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		СуммаДиР=Выборка.СуммаУпр-обПересчет(ШапкаДокумента.СуммаДокумента,ШапкаДокумента.ВалютаДокумента,ШапкаДокумента.КурсДокумента,ВалютаУпр,КурсУпр);
		Если СуммаДиР<>0 Тогда
			НаборЗаписейДоходыИРасходы=Движения.ДоходыИРасходы;
			НаборЗаписейДоходыИРасходы.ДокументОбъект         = ЭтотОбъект;
			Если БалансВедетсяПоПодразделениям Тогда
				НаборЗаписейДоходыИРасходы.Подразделение      = ШапкаДокумента.ДоговорВзаиморасчетов.Подразделение;
			КонецЕсли; 
			НаборЗаписейДоходыИРасходы.СтатьяДоходовИРасходов = Справочники.СтатьиДоходовИРасходов.СебестоимостьАвтомобилей;
			НаборЗаписейДоходыИРасходы.ВУпрВалюте             = Истина;
			НаборЗаписейДоходыИРасходы.Доход                  = СуммаДиР;
			НаборЗаписейДоходыИРасходы.ШапкаДокумента         = ШапкаДокумента;
			Отказ=НЕ НаборЗаписейДоходыИРасходы.Приход() ИЛИ Отказ; 
		КонецЕсли; 
	КонецЕсли; 
	//Итог Вознаграждение
	Если ШапкаДокумента.СуммаВознаграждения<>0 Тогда
		НаборЗаписейДоходыИРасходы=Движения.ДоходыИРасходы;
		НаборЗаписейДоходыИРасходы.ДокументОбъект=ЭтотОбъект;
		Если БалансВедетсяПоПодразделениям Тогда
			НаборЗаписейДоходыИРасходы.Подразделение = ШапкаДокумента.ДоговорВзаиморасчетов.Подразделение;
		КонецЕсли; 
		НаборЗаписейДоходыИРасходы.СтатьяДоходовИРасходов=Справочники.СтатьиДоходовИРасходов.Вознаграждение;
		НаборЗаписейДоходыИРасходы.ВУпрВалюте=Истина;
		НаборЗаписейДоходыИРасходы.Доход=обПересчет(ШапкаДокумента.СуммаВознаграждения,ШапкаДокумента.ВалютаДокумента,ШапкаДокумента.КурсДокумента,ВалютаУпр,КурсУпр);
		НаборЗаписейДоходыИРасходы.ШапкаДокумента=ШапкаДокумента;
		Отказ=НЕ НаборЗаписейДоходыИРасходы.Приход() ИЛИ Отказ;
	КонецЕсли; 
	
	Возврат НЕ Отказ;
КонецФункции

// Расчет суммы документа
Функция РассчитатьСуммуВсего() Экспорт
	Возврат Автомобили.Итог("СуммаВсего");
КонецФункции

// Обработка изменения реквизитов документа
// Параметры
//  Имя			– Строка			– Имя реквизита документа с полным путем (например Товары.Номенклатура).
//  ЭтаФорма	– Форма				– Ссылка на форму документа. Если значение неопределено,
//									  производится программная обработка реквизитов.
//  ТекСтрока	– СтрокаТабличнойЧасти – Ссылка на строку табличной части документа, реквизит которой обрабатывается.
//										 Имеет смысл только для табличных частей документов.
//  ДопПараметры– Структура			– Структура, содержащая дополнительные параметры обработки реквизита.
// Возвращаемое значение:
//   Булево   – Результат выполнения обработки.
Функция ОбработкаРеквизита(Имя,ТекСтрока=Неопределено,ЭтаФорма=Неопределено,ДопПараметры=Неопределено) Экспорт
	// ОБРАБОТКА РЕКВИЗИТОВ ДОКУМЕНТА
	Если Имя="ВалютаДокумента" Тогда
		Попытка
			ТребуетсяПересчет=ДопПараметры.ТребуетсяПересчет;
		Исключение
			ТребуетсяПересчет=Ложь;
		КонецПопытки; 
		Рез=Истина;
		Если ТребуетсяПересчет И (НЕ обЗначениеНеЗаполнено(ТекущаяВалютаДокумента)) Тогда
			Для каждого СтрокаТЧ Из Автомобили Цикл
				НоваяЦена=обПересчет(СтрокаТЧ.Цена,ТекущаяВалютаДокумента,ТекущийКурсДокумента,ВалютаДокумента,КурсДокумента);
				Если НоваяЦена<>СтрокаТЧ.Цена Тогда
					СтрокаТЧ.Цена=НоваяЦена;
					Рез=ОбработкаРеквизита("Автомобили.Цена",СтрокаТЧ,ЭтаФорма,ДопПараметры) И Рез;
				КонецЕсли;
			КонецЦикла; 
		КонецЕсли; 
		ТекущаяВалютаДокумента=ВалютаДокумента;
		ТекущийКурсДокумента=КурсДокумента;
		Возврат Рез;
		
	ИначеЕсли Имя="Контрагент" Тогда
		Если ХозОперация = Справочники.ХозОперации.ОтчетКомитентуЗаАвтомобили Тогда
			//Параметры для подстановки или создания договора контрагента
			Если ДопПараметры=Неопределено Тогда ДопПараметры=Новый Структура; КонецЕсли; 
			ДопПараметры.Вставить("ВидДоговора",Перечисления.ВидыДоговоров.СКомитентом);
			ДопПараметры.Вставить("ТипЦенПокупки",Справочники.ТипыЦен.ПустаяСсылка());
			ДопПараметры.Вставить("ТипЦенПродажи",ТипЦен);
		КонецЕсли; 
		Возврат дкОбработкаРеквизита(ЭтотОбъект,Имя,ТекСтрока,ЭтаФорма,ДопПараметры);
		
	ИначеЕсли Имя="ДоговорВзаиморасчетов" Тогда
		Рез=дкОбработкаРеквизита(ЭтотОбъект,Имя,ТекСтрока,ЭтаФорма,ДопПараметры);
		Если (НЕ обЗначениеНеЗаполнено(ДоговорВзаиморасчетов)) И (НЕ ДоговорВзаиморасчетов.ПолучитьОбъект().СоответствуетХозОперации(ХозОперация)) Тогда
			ДоговорВзаиморасчетов	= Справочники.ДоговорыВзаиморасчетов.ПустаяСсылка();
			Если НЕ обЗначениеНеЗаполнено(Контрагент) Тогда
				Рез	= ОбработкаРеквизита("Контрагент",ТекСтрока,ЭтаФорма,ДопПараметры);
			КонецЕсли;
		КонецЕсли;		
		// проверим вид договора
		Если ДоговорВзаиморасчетов.Пустая() Тогда
		ИначеЕсли НЕ обЗначениеНеЗаполнено(ДоговорВзаиморасчетов) Тогда
			Если ДоговорВзаиморасчетов.ВидДоговора<>Перечисления.ВидыДоговоров.СКомитентом И
				ДоговорВзаиморасчетов.ВидДоговора<>Перечисления.ВидыДоговоров.Прочее Тогда
				#Если Клиент Тогда
					Предупреждение("Необходимо выбирать договор комиссии !",10);
				#КонецЕсли
				ДоговорВзаиморасчетов=Неопределено;
				ОбработкаРеквизита("ДоговорВзаиморасчетов",ТекСтрока,ЭтаФорма,ДопПараметры);
				Возврат Ложь;
			КонецЕсли; 
		КонецЕсли;
		#Если Клиент Тогда
			Если (ЭтаФорма<>Неопределено) И
				(НЕ ДоговорВзаиморасчетов.Пустая()) И
				(ДоговорВзаиморасчетов.ВидДоговора=Перечисления.ВидыДоговоров.СКомитентом) Тогда
				Если Автомобили.Количество()>0 Тогда
					Если Вопрос("Перерассчитать сумму комиссионного вознаграждения?", РежимДиалогаВопрос.ДаНет) = КодВозвратаДиалога.Да Тогда
						ТекущаяКомиссияОтчетНаОснованииПродаж	= ДоговорВзаиморасчетов.КомиссияОтчетНаОснованииПродаж;		
						//Пройдемся по ТЧ и рассчитаем сумму комиссионного вознаграждения
						Для Каждого СтрокаТЧ Из Автомобили Цикл
							Если ТекущаяКомиссияОтчетНаОснованииПродаж Тогда
								ОбработкаРеквизита("Автомобили.Сумма",СтрокаТЧ);	
							Иначе
								ОбработкаРеквизита("Автомобили.СуммаПродажи",СтрокаТЧ);	
							КонецЕсли;						
							ОбработкаРеквизита("РассчитатьВознаграждение",СтрокаТЧ);
						КонецЦикла;
					КонецЕсли; 
				КонецЕсли; 
			КонецЕсли;
		#КонецЕсли
		Возврат Рез;
		
		// ОБРАБОТКА РЕКВИЗИТОВ ТАБЛИЧНОЙ ЧАСТИ "АВТОМОБИЛИ"
	ИначеЕсли Имя="Автомобили.Автомобиль" Тогда
		//Проставим количество
		Если ТекСтрока.Количество=0 Тогда ТекСтрока.Количество=1 КонецЕсли;
		// Заполним ставку НДС
		Если обЗначениеНеЗаполнено(ТекСтрока.СтавкаНДС) Тогда
			Если Организация.СистемаНалогообложения = Перечисления.СистемыНалогообложения.Упрощенная Тогда
				ТекСтрока.СтавкаНДС=Справочники.СтавкиНДС.БезНДС;
			Иначе
				ТекСтрока.СтавкаНДС=Справочники.СтавкиНДС.ОсновнаяСтавкаНДС;
			КонецЕсли;
		КонецЕсли;
		Запрос = Новый Запрос("ВЫБРАТЬ
		|	РеализованныеАвтомобилиОстатки.ДокументПередачи КАК ДокументПередачи
		|ИЗ
		|	РегистрНакопления.РеализованныеАвтомобили.Остатки(&НаМомент,
		|		Автомобиль = &Автомобиль И 
		|		ДоговорВзаиморасчетов = &ДоговорВзаиморасчетов
		|	) КАК РеализованныеАвтомобилиОстатки");
		Запрос.УстановитьПараметр("НаМомент",?(Ссылка.Пустая(),Новый МоментВремени(КонецДня(Дата)),Новый Граница(Дата,ВидГраницы.Исключая)));
		Запрос.УстановитьПараметр("Автомобиль",ТекСтрока.Автомобиль);
		Запрос.УстановитьПараметр("ДоговорВзаиморасчетов",ДоговорВзаиморасчетов);
		Выборка = Запрос.Выполнить().Выбрать();
		Если Выборка.Следующий() Тогда
			ТекСтрока.ДокументПоступления=Выборка.ДокументПередачи;
		Иначе
			ТекСтрока.ДокументПоступления=Неопределено;
		КонецЕсли;
		Возврат ОбработкаРеквизита("Автомобили.ДокументПоступления",ТекСтрока,ЭтаФорма,ДопПараметры);
		
	ИначеЕсли Имя="Автомобили.Количество" ИЛИ Имя="Автомобили.Цена" Тогда
		Если НЕ обЗначениеНеЗаполнено(ДоговорВзаиморасчетов) Тогда
			ТекущаяКомиссияОтчетНаОснованииПродаж	= ДоговорВзаиморасчетов.КомиссияОтчетНаОснованииПродаж;
		Иначе
			ТекущаяКомиссияОтчетНаОснованииПродаж	= Истина;
		КонецЕсли;		
		// Семенихин 01.03.2023 +++++
		ТекущаяКомиссияОтчетНаОснованииПродаж = Ложь;
		ОбработкаРеквизита("РассчитатьВознаграждение",ТекСтрока,ЭтаФорма,ДопПараметры);
		// Семенихин 01.03.2023 -----
		Если ТекущаяКомиссияОтчетНаОснованииПродаж Тогда
			ТекСтрока.Сумма			= ТекСтрока.Цена*ТекСтрока.Количество;
		Иначе
			ТекСтрока.СуммаПродажи	= ТекСтрока.Цена*ТекСтрока.Количество;
		КонецЕсли;
		Если обЗначениеНеЗаполнено(ЭтотОбъект.ТипЦен) Тогда
			ЦенаВключаетНДС=Истина;
		Иначе
			ЦенаВключаетНДС=ЭтотОбъект.ТипЦен.ЦенаВключаетНДС;
		КонецЕсли; 
		Если ЦенаВключаетНДС Тогда
			//Цена уже содержит НДС - Сумма всего равна сумме			
			Если ТекущаяКомиссияОтчетНаОснованииПродаж Тогда
				ТекСтрока.СуммаНДС	= (ТекСтрока.Сумма*ТекСтрока.СтавкаНДС.Ставка)/(100+ТекСтрока.СтавкаНДС.Ставка);
				ТекСтрока.СуммаВсего= ТекСтрока.Сумма;
			Иначе
				//ТекСтрока.СуммаНДС	= (ТекСтрока.СуммаПродажи*ТекСтрока.СтавкаНДС.Ставка)/(100+ТекСтрока.СтавкаНДС.Ставка);
				ТекСтрока.СуммаНДС	= (ТекСтрока.Вознаграждение*ТекСтрока.СтавкаНДС.Ставка)/(100+ТекСтрока.СтавкаНДС.Ставка);
				ТекСтрока.СуммаВсего= ТекСтрока.СуммаПродажи;				
			КонецЕсли;
		Иначе
			//НДС в цену не включен - Получим сумму НДС			
			Если ТекущаяКомиссияОтчетНаОснованииПродаж Тогда
				ТекСтрока.СуммаНДС	= (ТекСтрока.Сумма*ТекСтрока.СтавкаНДС.Ставка)/100;
				ТекСтрока.СуммаВсего= ТекСтрока.Сумма+ТекСтрока.СуммаНДС;
			Иначе
				//ТекСтрока.СуммаНДС	= (ТекСтрока.СуммаПродажи*ТекСтрока.СтавкаНДС.Ставка)/100;
				ТекСтрока.СуммаНДС	= (ТекСтрока.Вознаграждение*ТекСтрока.СтавкаНДС.Ставка)/100;
				ТекСтрока.СуммаВсего= ТекСтрока.СуммаПродажи+ТекСтрока.СуммаНДС;				
			КонецЕсли;
		КонецЕсли;
		Возврат ОбработкаРеквизита("РассчитатьВознаграждение",ТекСтрока,ЭтаФорма,ДопПараметры);
		
	ИначеЕсли Имя="Автомобили.Сумма" Тогда
		Если НЕ обЗначениеНеЗаполнено(ДоговорВзаиморасчетов) Тогда
			ТекущаяКомиссияОтчетНаОснованииПродаж	= ДоговорВзаиморасчетов.КомиссияОтчетНаОснованииПродаж;
		Иначе
			ТекущаяКомиссияОтчетНаОснованииПродаж	= Истина;
		КонецЕсли;		
		// Семенихин 01.03.2023 +++++
		ТекущаяКомиссияОтчетНаОснованииПродаж = Ложь;
		ОбработкаРеквизита("РассчитатьВознаграждение",ТекСтрока,ЭтаФорма,ДопПараметры);
		// Семенихин 01.03.2023 -----
		Если ТекСтрока.Количество<>0 И ТекущаяКомиссияОтчетНаОснованииПродаж Тогда
			ТекСтрока.Цена=ТекСтрока.Сумма/ТекСтрока.Количество;
		КонецЕсли; 
		Возврат ОбработкаРеквизита("Автомобили.Цена",ТекСтрока,ЭтаФорма,ДопПараметры);
		
	ИначеЕсли Имя="Автомобили.СуммаПродажи" Тогда
		Если НЕ обЗначениеНеЗаполнено(ДоговорВзаиморасчетов) Тогда
			ТекущаяКомиссияОтчетНаОснованииПродаж	= ДоговорВзаиморасчетов.КомиссияОтчетНаОснованииПродаж;
		Иначе
			ТекущаяКомиссияОтчетНаОснованииПродаж	= Истина;
		КонецЕсли;		
		// Семенихин 01.03.2023 +++++
		ТекущаяКомиссияОтчетНаОснованииПродаж = Ложь;
		ОбработкаРеквизита("РассчитатьВознаграждение",ТекСтрока,ЭтаФорма,ДопПараметры);
		// Семенихин 01.03.2023 -----
		Если ТекСтрока.Количество<>0 И НЕ ТекущаяКомиссияОтчетНаОснованииПродаж Тогда
			ТекСтрока.Цена=ТекСтрока.СуммаПродажи/ТекСтрока.Количество;
		КонецЕсли; 
		Возврат ОбработкаРеквизита("Автомобили.Цена",ТекСтрока,ЭтаФорма,ДопПараметры);
		
	ИначеЕсли Имя="Автомобили.СуммаВсего" Тогда
		Если НЕ обЗначениеНеЗаполнено(ДоговорВзаиморасчетов) Тогда
			ТекущаяКомиссияОтчетНаОснованииПродаж	= ДоговорВзаиморасчетов.КомиссияОтчетНаОснованииПродаж;
		Иначе
			ТекущаяКомиссияОтчетНаОснованииПродаж	= Истина;
		КонецЕсли;		
		// Семенихин 01.03.2023 +++++
		ТекущаяКомиссияОтчетНаОснованииПродаж = Ложь;
		// Семенихин 01.03.2023 -----
		
		//Получим новую сумму НДС как процент от суммы всего
		Если обЗначениеНеЗаполнено(ЭтотОбъект.ТипЦен) Тогда
			ЦенаВключаетНДС=Истина;
		Иначе
			ЦенаВключаетНДС=ЭтотОбъект.ТипЦен.ЦенаВключаетНДС;
		КонецЕсли; 
		Если ЦенаВключаетНДС Тогда
			//Цена уже содержит НДС
			Если ТекущаяКомиссияОтчетНаОснованииПродаж Тогда
				ТекСтрока.Сумма			= ТекСтрока.СуммаВсего;
				Возврат ОбработкаРеквизита("Автомобили.Сумма",ТекСтрока,ЭтаФорма,ДопПараметры);
			Иначе
				ТекСтрока.СуммаПродажи	= ТекСтрока.СуммаВсего;
				Возврат ОбработкаРеквизита("Автомобили.СуммаПродажи",ТекСтрока,ЭтаФорма,ДопПараметры);
			КонецЕсли;
		Иначе
			//НДС в цену не включен
			Если ТекущаяКомиссияОтчетНаОснованииПродаж Тогда
				ТекСтрока.Сумма=(100*ТекСтрока.СуммаВсего)/(100+ТекСтрока.СтавкаНДС.Ставка);
				Возврат ОбработкаРеквизита("Автомобили.Сумма",ТекСтрока,ЭтаФорма,ДопПараметры);
			Иначе
				ТекСтрока.СуммаПродажи=(100*ТекСтрока.СуммаВсего)/(100+ТекСтрока.СтавкаНДС.Ставка);
				Возврат ОбработкаРеквизита("Автомобили.СуммаПродажи",ТекСтрока,ЭтаФорма,ДопПараметры);
			КонецЕсли;
		КонецЕсли; 		
		
	ИначеЕсли Имя="Автомобили.СтавкаНДС" Тогда
		Возврат ОбработкаРеквизита("Автомобили.Цена",ТекСтрока,ЭтаФорма,ДопПараметры);
		
	ИначеЕсли Имя="Автомобили.ДокументПоступления" Тогда
		Рез = Истина;		
		Если НЕ обЗначениеНеЗаполнено(ТекСтрока.ДокументПоступления) Тогда
			Запрос = Новый Запрос;
			Запрос.Текст =
			"ВЫБРАТЬ
			|	РеализованныеАвтомобилиОстатки.СуммаПродажиОстаток КАК СуммаПродажи,
			|	РеализованныеАвтомобилиОстатки.СуммаПродажиРеглОстаток КАК СуммаПродажиРегл,
			|	РеализованныеАвтомобилиОстатки.СуммаУпрОстаток КАК СуммаУпр,
			|	РеализованныеАвтомобилиОстатки.СуммаРеглОстаток КАК СуммаРегл
			|ИЗ
			|	РегистрНакопления.РеализованныеАвтомобили.Остатки(,
			|			ДокументПередачи = &ДокументПередачи
			|			И Автомобиль = &Автомобиль) КАК РеализованныеАвтомобилиОстатки";
			
			Запрос.УстановитьПараметр("ДокументПередачи", ТекСтрока.ДокументПоступления);
			Запрос.УстановитьПараметр("Автомобиль", ТекСтрока.Автомобиль);			
			Выборка = Запрос.Выполнить().Выбрать();
			
			Если НЕ обЗначениеНеЗаполнено(ДоговорВзаиморасчетов) Тогда
				ТекущаяКомиссияОтчетНаОснованииПродаж	= ДоговорВзаиморасчетов.КомиссияОтчетНаОснованииПродаж;
			Иначе
				ТекущаяКомиссияОтчетНаОснованииПродаж	= Истина;
			КонецЕсли;
			ВалютаУпр  = Константы.ВалютаУправленческогоУчетаКомпании.Получить();
			ВалютаРегл = Константы.ВалютаРегламентированногоУчетаОрганизаций.Получить();
			
			// Семенихин 01.03.2023 +++++
			ТекущаяКомиссияОтчетНаОснованииПродаж = Ложь;
			ТекСтрока.Сумма = НайтиСуммуПоступления(ТекСтрока.ДокументПоступления, ТекСтрока.Автомобиль);
			// Семенихин 02.03.2023 -----
			
			Если Выборка.Следующий() Тогда
				Если Выборка.СуммаПродажи <> 0 Тогда
					// получим сумму для расчета
					Если ВалютаДокумента = ВалютаРегл Тогда
						//ТекСтрока.Сумма			= Выборка.СуммаРегл;
						ТекСтрока.СуммаПродажи	= Выборка.СуммаПродажиРегл;												
					Иначе	
						//ТекСтрока.Сумма			= обПересчет(Выборка.СуммаУпр,ВалютаУпр,КурсВалютыУпр,ВалютаДокумента,КурсДокумента);
						ТекСтрока.СуммаПродажи	= обПересчет(Выборка.СуммаПродажи,ВалютаУпр,КурсВалютыУпр,ВалютаДокумента,КурсДокумента);												
					КонецЕсли;
					
					Если ТекущаяКомиссияОтчетНаОснованииПродаж Тогда
						СуммаРасчет	= ТекСтрока.Сумма;
					Иначе
						СуммаРасчет	= ТекСтрока.СуммаПродажи;
					КонецЕсли;					
					
					СтавкаНДС = ТекСтрока.СтавкаНДС.Ставка;
					Если НЕ ТипЦен.ЦенаВключаетНДС Тогда
						СуммаРасчет = Окр((СуммаРасчет*100)/(100+СтавкаНДС),2);
					КонецЕсли;
					ТекСтрока.Цена = Окр(СуммаРасчет,2);
				Иначе
					ТекСтрока.Цена = 0;
				КонецЕсли;
				Рез=ОбработкаРеквизита("Автомобили.Цена",ТекСтрока,ЭтаФорма,ДопПараметры) И Рез;
			КонецЕсли;
			
		КонецЕсли;
		
	ИначеЕсли Имя="РассчитатьВознаграждение" Тогда
		//расчет вознаграждения по реализованному автомобилю
		//Если НЕ обЗначениеНеЗаполнено(ДоговорВзаиморасчетов) Тогда
		//	Если ДоговорВзаиморасчетов.ТипСуммыКомиссии=0 Тогда
		//		ТекСтрока.Вознаграждение=(ТекСтрока.СуммаВсего*ДоговорВзаиморасчетов.ПроцентКомиссионногоВознаграждения)/100;
		//	Иначе
		//		ТекСтрока.Вознаграждение=ДоговорВзаиморасчетов.СуммаКомиссионногоВознаграждения;
		//	КонецЕсли;
		//Иначе
		//	ТекСтрока.Вознаграждение=0;
		//КонецЕсли;
		
		// Семенихин 01.03.2023 +++++
		Если ТекСтрока.СуммаПродажи > 0 Тогда
			ТекСтрока.Вознаграждение = ТекСтрока.СуммаПродажи - ТекСтрока.Сумма;
		Иначе
			ТекСтрока.Вознаграждение = 0;
		КонецЕсли;	
		// Семенихин 01.03.2023 -----
		Возврат Истина;
		
	Иначе Возврат дкОбработкаРеквизита(ЭтотОбъект,Имя,ТекСтрока,ЭтаФорма,ДопПараметры);
	КонецЕсли;
КонецФункции // ОбработкаРеквизита()

////////////////////////////////////////////////////////////////////////////////
// ЭКСПОРТНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ ПЕЧАТИ ДОКУМЕНТА

#Если Клиент Тогда
	
	// Формирует печатную форму "ОтчетКомитенту"
	// Возвращает сформированный табличный документ:
	Функция ПечатьОтчетКомитентуЗаАвтомобили(ТабДокумент) Экспорт
		Если НЕ ЭтотОбъект.Проведен Тогда
			Сообщить("Печать непроведенного документа невозможна.");
			Возврат Неопределено;
		КонецЕсли;
		
		Макет = ПолучитьМакет("ОтчетКомитентуЗаАвтомобили");
		
		//для начала настроим макет
		ОбластьШапкаТаблицы = орПривестиМакетПечатнойФормы(ЭтотОбъект,Макет);
		ФорматВыводаСуммы = обПраво("ФорматВыводаСуммы",Права,,ЭтотОбъект);
		
		//вывод заголовка документа
		ОбластьМакета = Макет.ПолучитьОбласть("Заголовок");
		ОбластьМакета.Параметры.Заполнить(ЭтотОбъект);
		ТекстЗаголовка = дкПолучитьПредставление(ЭтотОбъект);
		ОбластьМакета.Параметры.ТекстЗаголовка = ТекстЗаголовка;
		ОбластьМакета.Параметры.ПредставлениеКомитента		= спПолучитьПредставление(Контрагент);
		ОбластьМакета.Параметры.ПредставлениеКомиссионера	= спПолучитьПредставление(Организация);
		
		//вывод свойств
		СтрокаСвойств = дкПолучитьСтрокуСвойствДокумента(ЭтотОбъект);
		ОбластьМакета.Параметры.СтрокаСвойств = СтрокаСвойств;
		ТабДокумент.Вывести(ОбластьМакета);
		
		НомерСтраницы = 2;
		НомерСтраницыПред = НомерСтраницы;
		
		//теперь выводим шапку
		ТабДокумент.Вывести(ОбластьШапкаТаблицы);
		
		//готовим области строки
		ОбластьМакета = Макет.ПолучитьОбласть("Строка");
		
		ОбластьМакетаИтогоПоСтранице = Макет.ПолучитьОбласть("ИтогоПоСтранице");
		СтруктураИтоговПоСтранице = Новый Структура("ВалютаДокумента,СуммаВсего",ВалютаДокумента,0,0);
		
		//заполним параметры шапки таблицы для следующего листа
		ОбластьШапкаТаблицы.Параметры.ТекстЗаголовка = ТекстЗаголовка;
		ОбластьШапкаТаблицы.Параметры.НомерСтраницы = "Страница: " + НомерСтраницы;
		Запрос = Новый Запрос("ВЫБРАТЬ
		|	ОтчетКомитентуЗаАвтомобилиАвтомобили.Автомобиль,
		|	ОтчетКомитентуЗаАвтомобилиАвтомобили.Автомобиль.VIN КАК VIN,
		|	1 КАК Количество,
		|	ЕСТЬNULL(Реализации.СуммаПоступления, 0) КАК СуммаПоступления,
		|	ЕСТЬNULL(Реализации.СуммаПродажи, 0) КАК СуммаВсего
		|ИЗ
		|	Документ.ОтчетКомитентуЗаАвтомобили.Автомобили КАК ОтчетКомитентуЗаАвтомобилиАвтомобили
		|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		|			РеализованныеАвтомобили.Автомобиль КАК Автомобиль,
		|			РеализованныеАвтомобили.СуммаУпр КАК СуммаПоступления,
		|			РеализованныеАвтомобили.СуммаПродажи КАК СуммаПродажи
		|		ИЗ
		|			РегистрНакопления.РеализованныеАвтомобили КАК РеализованныеАвтомобили
		|		ГДЕ
		|			РеализованныеАвтомобили.Регистратор = &Ссылка) КАК Реализации
		|		ПО ОтчетКомитентуЗаАвтомобилиАвтомобили.Автомобиль = Реализации.Автомобиль
		|ГДЕ
		|	ОтчетКомитентуЗаАвтомобилиАвтомобили.Ссылка = &Ссылка");
		
		Запрос.УстановитьПараметр("Ссылка",Ссылка);
		
		//перебор строк
		ВыборкаТабличнойЧасти = Запрос.Выполнить().Выгрузить();
		
		ВалютаУпр = Константы.ВалютаУправленческогоУчетаКомпании.Получить();
		КурсВалУпр = ?(обЗначениеНеЗаполнено(ЭтотОбъект.КурсВалютыУпр),обКурсДляВалюты(ВалютаУпр,Дата).Курс,ЭтотОбъект.КурсВалютыУпр);
		Ном = 1; СуммаИтого = 0;
		Для каждого СтрокаТабличнойЧасти Из ВыборкаТабличнойЧасти Цикл
			//заполняем данные строки
			ОбластьМакета.Параметры.НомерСтроки = Ном;
			ОбластьМакета.Параметры.Автомобиль = СтрокаТабличнойЧасти.Автомобиль;
			ОбластьМакета.Параметры.АвтомобильНаименование = спПолучитьНаименование(СтрокаТабличнойЧасти.Автомобиль);
			ОбластьМакета.Параметры.VIN = СтрокаТабличнойЧасти.Автомобиль.VIN;
			СуммаПоступления = обПересчет(СтрокаТабличнойЧасти.СуммаПоступления,ВалютаУпр,КурсВалУпр,ВалютаДокумента,КурсДокумента);
			СуммаВсего = СтрокаТабличнойЧасти.СуммаВсего;
			ОбластьМакета.Параметры.СуммаПоступления = Формат(СуммаПоступления,ФорматВыводаСуммы);
			ОбластьМакета.Параметры.СуммаВсего		 = Формат(СуммаВсего,ФорматВыводаСуммы);
			СуммаИтого = СуммаВсего + СуммаИтого;
			
			//выводим строку, делая проверку попадания на лист
			НомерСтраницы = дкВывестиГоризонтальнуюОбласть(ТабДокумент, ОбластьМакета, ОбластьШапкаТаблицы, ОбластьМакетаИтогоПоСтранице, НомерСтраницы, СтруктураИтоговПоСтранице,ЭтотОбъект);
			
			СтруктураСтрокиИтогов = Новый Структура("СуммаВсего",СуммаВсего);
			//инициализация итогов по странице
			Если НомерСтраницы <> НомерСтраницыПред Тогда
				СтруктураИтоговПоСтранице = Новый Структура("ВалютаДокумента,СуммаВсего",ВалютаДокумента,0,0);
				НомерСтраницыПред = НомерСтраницы;
				ОбластьШапкаТаблицы.Параметры.НомерСтраницы = "Страница: " + НомерСтраницы; 
			КонецЕсли;
			//добавляем итоги
			дкДобавитьИтогиПоСтранице(СтруктураСтрокиИтогов,СтруктураИтоговПоСтранице);
			Ном = Ном + 1;
		КонецЦикла;
		
		//довыводим последний подвал, если страниц больше единицы
		Если НомерСтраницы > 2 Тогда
			дкВывестиИтогиПоСтранице(ТабДокумент,ОбластьМакетаИтогоПоСтранице,СтруктураИтоговПоСтранице,ЭтотОбъект);
		КонецЕсли;
		
		//итоги
		ОбластьМакета = Макет.ПолучитьОбласть("Подвал");
		ОбластьМакета.Параметры.ВалютаДокумента = ВалютаДокумента;
		ОбластьМакета.Параметры.СуммаВсего = Формат(СуммаИтого,ФорматВыводаСуммы);
		ОбластьМакета.Параметры.СуммаПрописью = "Всего наименований "+ВыборкаТабличнойЧасти.Количество()+" на сумму " + обЧислоПрописью(СуммаИтого,ЭтотОбъект.ВалютаДокумента);
		
		// Выводим представления и расшифровки подписей
		Отпустил = дкОтветственноеЛицо(ЭтотОбъект,"Отпустил");
		Отпустил.ОтпустилПредставление = ?(обЗначениеНеЗаполнено(Отпустил.Отпустил),"","/ "+ Отпустил.ОтпустилПредставление);
		ОбластьМакета.Параметры.Заполнить(Отпустил);
		
		//Бондаренко++ 20230708
		//Получил  = дкОтветственноеЛицо(ЭтотОбъект,"Получил");
		//Получил.ПолучилПредставление = ?(обЗначениеНеЗаполнено(Получил.Получил),"","/ "+ Получил.ПолучилПредставление);
		//ОбластьМакета.Параметры.Заполнить(Получил);
		ОбластьМакета.Параметры.ПолучилПредставление = "/ "+Контрагент.НаименованиеПолное;
		//Бондаренко++ 20230708
		
		НомерСтраницы = дкВывестиГоризонтальнуюОбласть(ТабДокумент, ОбластьМакета, , , НомерСтраницы,,ЭтотОбъект);
		
		Возврат ТабДокумент;
	КонецФункции
	
	//Иванченко 20251208 ++
	Функция ПечатьОтчетАгента(ТабДокумент) Экспорт
		СтрокаАвтомобиля = Автомобили[0]; 
		ДокументПоступления = СтрокаАвтомобиля.ДокументПоступления;	
		
		ЗапросПродажа = Новый Запрос;
		ЗапросПродажа.Текст =
		"ВЫБРАТЬ
		|	МИНИМУМ(ПродажиАвтомобилейОбороты.ДокументПродажи) КАК ДокументПродажи
		|ИЗ
		|	РегистрНакопления.ПродажиАвтомобилей.Обороты(
		|			&Дата,
		|			,
		|			,
		|			НЕ ДокументПродажи.Контрагент.НашаФирма
		|				И Автомобиль = &Автомобиль) КАК ПродажиАвтомобилейОбороты";
		
		ЗапросПродажа.Параметры.Вставить("Дата", ДокументПоступления.ДатаСоздания);  
		ЗапросПродажа.Параметры.Вставить("Автомобиль", СтрокаАвтомобиля.Автомобиль);
		
		РезультатПродажа = ЗапросПродажа.Выполнить().Выгрузить();
		
		Если РезультатПродажа.Количество() = 0 Тогда
			Сообщить("ОШИБКА!!! Отчет агента может быть распечатан только по реализованным автомобилям.", СтатусСообщения.ОченьВажное); 
			
			Возврат "";
		КонецЕсли;	
		
		ДатаДоговора = ?(ЗначениеЗаполнено(ДокументПоступления.ДоговорВзаиморасчетов.ДатаКП), ДокументПоступления.ДоговорВзаиморасчетов.ДатаКП, ДокументПоступления.ДатаСоздания);	
		Макет = ПолучитьМакет("ОтчетАгента");
		ОбластьМакета = Макет.ПолучитьОбласть("Приложение3");	
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	КонтактнаяИнформация.Поле4 КАК Город,
		|	КонтактнаяИнформация.Поле5 КАК НаселённыйПункт
		|ИЗ
		|	РегистрСведений.КонтактнаяИнформация КАК КонтактнаяИнформация
		|ГДЕ
		|	КонтактнаяИнформация.Вид В(&Вид)
		|	И КонтактнаяИнформация.Объект = &Объект";
		Запрос.УстановитьПараметр("Объект", ПодразделениеКомпании);
		ВидыАдресов = Новый Массив();
		ВидыАдресов.Добавить(Справочники.ВидыКонтактнойИнформации.АдресФактический);
		ВидыАдресов.Добавить(Справочники.ВидыКонтактнойИнформации.АдресПочтовый);
		Запрос.УстановитьПараметр("Вид", ВидыАдресов);
		Выборка = Запрос.Выполнить().Выбрать();  
		
		Если Выборка.Следующий() Тогда  
			
			Если ЗначениеЗаполнено(Выборка.Город) Тогда
				Город = "г. " + Лев(Выборка.Город, СтрДлина(Выборка.Город) - 2);
			ИначеЕсли ЗначениеЗаполнено(Выборка.НаселённыйПункт) Тогда
				Город = "п. " + Лев(Выборка.НаселённыйПункт, СтрДлина(Выборка.НаселённыйПункт) - 2);
			Иначе
				Город = "";
			КонецЕсли; 
			
		КонецЕсли;
		
		ОбластьМакета.Параметры.Город = Город;	
		ОбластьМакета.Параметры.НомерДоговора = СокрЛП(?(ЗначениеЗаполнено(ДокументПоступления.ВхДокНомер), ДокументПоступления.ВхДокНомер, ДокументПоступления.Номер));		
		ОбластьМакета.Параметры.ДатаДоговора = Формат(ДокументПоступления.ДатаСоздания, "ДЛФ=DD");
		ОбластьМакета.Параметры.НаименованиеПолное = Организация.НаименованиеПолное;	
		ОбластьМакета.Параметры.Принципал = Контрагент.НаименованиеПолное;  
		ОбластьМакета.Параметры.Дата = Формат(Дата, "ДЛФ=DD");	
		
		СтруктураОтбора = Новый Структура("Организация, Объект", Организация, Перечисления.ВидыОбъектовСведений.Руководитель);
		СтруктураСведений = РегистрыСведений.СведенияКомпании.ПолучитьПоследнее(РабочаяДата, СтруктураОтбора);
		Руководитель = СтруктураСведений.Значение;
		СтруктураСведений = Неопределено; 
		
		Параметр_Подписант = ?(Ссылка.Метаданные().Реквизиты.Найти("Подписант") <> Неопределено И ЗначениеЗаполнено(Подписант), Подписант, ПараметрыСеанса.Пользователь.Сотрудник); 
		ТекущаяДоверенность = СМ_ФормированиеНовыхОбъектов.ПолучитьДоверенность(Параметр_Подписант, Организация);
		
		Если ТекущаяДоверенность = Неопределено Тогда
			//Иванченко 20251218 ++                     
			ОтпустилПредставление = Руководитель.Наименование;
			//Иванченко 20251218 -- 
			
			Если Организация.ФормаСобственности	= Перечисления.ФормыСобственности.ЮридическоеЛицо Тогда
				ВЛицеРуководителя = "Генерального директора " + СМ_ФормированиеНовыхОбъектов.ПадежФИО(Руководитель.Наименование);
				НаОсновании = "Устава";	
			Иначе    
				ВЛицеРуководителя = СМ_ФормированиеНовыхОбъектов.ПадежФИО(Руководитель.Наименование);
				НаОсновании = "Свидетельства";			
			КонецЕсли; 
			
		Иначе
			СтруктураОтбора = Новый Структура("Организация", Организация);
			СтруктураСведений = РегистрыСведений.ИОГенеральногоДиректора.ПолучитьПоследнее(Дата, СтруктураОтбора);
			
			Если СтруктураСведений <> Неопределено И ДатаДоговора >= СтруктураСведений.ДатаНачала И ДатаДоговора < КонецДня(СтруктураСведений.ДатаОкончания) Тогда
				Руководитель = СтруктураСведений.Значение;
				//Иванченко 20251218 ++
				ОтпустилПредставление = Руководитель.Наименование;
				//Иванченко 20251218 --			
				ВЛицеРуководителя = " и.о. Генерального директора " + СМ_ФормированиеНовыхОбъектов.ПадежФИО(Руководитель.Наименование);
				ФормаВыбора = Справочники.ПодтверждающиеДокументы.ПолучитьФормуВыбора();
				ФормаВыбора.Заголовок = "Выбор доверенности для и.о. Генерального директора";
				ФормаВыбора.Отбор.Владелец.Значение = Руководитель;
				ФормаВыбора.Отбор.Владелец.Использование = Истина;
				ФормаВыбора.Отбор.ВидПодтверждающегоДокумента.Значение = Перечисления.ВидыДокументов.Доверенность;
				ФормаВыбора.Отбор.ВидПодтверждающегоДокумента.Использование = Истина;
				ПодтвДокументСсылка = ФормаВыбора.ОткрытьМодально();
				
				Если ЗначениеЗаполнено(ПодтвДокументСсылка) Тогда
					НаОсновании = "Доверенности от " + Формат(ПодтвДокументСсылка.ДатаВыдачи, "ДЛФ=Д");			
				КонецЕсли;	
				
			Иначе
				//Иванченко 20251218 ++
				ОтпустилПредставление = Автор.Наименование;
				//Иванченко 20251218 --	
				ВЛицеРуководителя = СМ_ФормированиеНовыхОбъектов.daСклонение(Автор.Сотрудник.Должность, 2) + " " + СМ_ФормированиеНовыхОбъектов.ПадежФИО(Автор.Наименование);
				НаОсновании = "Доверенности № " + ТекущаяДоверенность.Номер + " от " + Формат(ТекущаяДоверенность.ДатаВыдачи, "ДФ=dd.MM.yy");
			КонецЕсли; 		
			
		КонецЕсли;
		
		ОбластьМакета.Параметры.ВЛице = ВЛицеРуководителя + ?(ЗначениеЗаполнено(НаОсновании), ", действующего на основании " + НаОсновании, "");  	
		
		ЗапросПД = Новый Запрос;
		ЗапросПД.Текст = 
		"ВЫБРАТЬ
		|	ПодтверждающиеДокументы.Серия КАК Серия,
		|	ПодтверждающиеДокументы.Номер КАК Номер,
		|	ПодтверждающиеДокументы.ДатаВыдачи КАК ДатаВыдачи,
		|	ПодтверждающиеДокументы.КемВыдан КАК КемВыдан,
		|	ПодтверждающиеДокументы.КодПодразделения КАК КодПодразделения
		|ИЗ
		|	Справочник.ПодтверждающиеДокументы КАК ПодтверждающиеДокументы
		|ГДЕ
		|	ПодтверждающиеДокументы.Владелец = &Владелец
		|	И ПодтверждающиеДокументы.ВидПодтверждающегоДокумента = &ВидПодтверждающегоДокумента
		|	И ПодтверждающиеДокументы.Текущий = ИСТИНА"; 
		
		ЗапросПД.УстановитьПараметр("Владелец", Контрагент); 
		ЗапросПД.УстановитьПараметр("ВидПодтверждающегоДокумента", Перечисления.ВидыДокументов.Паспорт);
		РезультатПД = ЗапросПД.Выполнить().Выбрать();
		
		Если РезультатПД.Следующий() Тогда	
			ПаспортСерия = РезультатПД.Серия;
			ПаспортНомер = РезультатПД.Номер; 
			ПаспортКемВыдан = РезультатПД.КемВыдан;
			ПаспортДатаВыдачи = Формат(РезультатПД.ДатаВыдачи, "ДЛФ=Д") + " г.";  
			КодПодразделения = РезультатПД.КодПодразделения;
			ОбластьМакета.Параметры.Паспорт = ПаспортСерия + " №" + ПаспортНомер + ", выдан " + ПаспортКемВыдан + ", дата выдачи " + ПаспортДатаВыдачи; 
			//Иванченко 20251218 ++				
			//ОбластьМакета.Параметры.ПринципалПаспорт = ПаспортСерия + " " + ПаспортНомер;
			//ОбластьМакета.Параметры.ПринципалВыдан = ПаспортКемВыдан;	
			//ОбластьМакета.Параметры.ПринципалДатаВыдачи = ПаспортДатаВыдачи;	
			//ОбластьМакета.Параметры.ПринципалКодПодразделения = КодПодразделения;		
			//Иванченко 20251218 --
		КонецЕсли;	
		
		ОбластьМакета.Параметры.СуммаПродажи = Автомобили.Итог("СуммаПродажи");
		ОбластьМакета.Параметры.СуммаПродажиПрописью = ЧислоПрописью(Автомобили.Итог("СуммаПродажи"), , ", , , , , , , , 0");	
		ОбластьМакета.Параметры.ВознаграждениеАгента = Формат(СтрокаАвтомобиля.Вознаграждение, "ЧДЦ=2; ЧН=0,00");  
		ОбластьМакета.Параметры.ВознаграждениеАгентаПрописью = ЧислоПрописью(СтрокаАвтомобиля.Вознаграждение, , ", , , , , , , , 0");
		
		Если СтрокаАвтомобиля.СтавкаНДС = Справочники.СтавкиНДС.БезНДС Тогда
			ОбластьМакета.Параметры.СтавкаНДС = "без налога (НДС)";
		Иначе
			ОбластьМакета.Параметры.СтавкаНДС = "в т.ч. " + СтрокаАвтомобиля.СтавкаНДС; 
			ОбластьМакета.Параметры.СуммаНДС = " " + Формат(СтрокаАвтомобиля.СуммаНДС, "ЧДЦ=2; ЧН=0,00");
			ОбластьМакета.Параметры.СуммаНДССтрокой = " (" + ЧислоПрописью(СтрокаАвтомобиля.СуммаНДС, , ", , , , , , , , 0") + ") рублей";
		КонецЕсли;
		
		//Иванченко 20251218 --
		//ОбластьМакета.Параметры.НаименованиеПолное = Организация.НаименованиеПолное;
		//ОбластьМакета.Параметры.АгентАдрес = спПолучитьПредставление(Организация, Новый Структура("АдресЮридический")); 	
		//ОбластьМакета.Параметры.АгентИНН = Организация.ИНН;	
		//ОбластьМакета.Параметры.АгентОГРН = Организация.ОГРН;	
		//ОбластьМакета.Параметры.АгентРС = Организация.ОсновнойБанковскийСчет.НомерСчета;	
		//ОбластьМакета.Параметры.АгентКС = Организация.ОсновнойБанковскийСчет.Банк.КоррСчет;	
		//ОбластьМакета.Параметры.АгентБИК = Организация.ОсновнойБанковскийСчет.Банк.Код;	 
		//ОбластьМакета.Параметры.АгентТелефон = киПолучитьПредставлениеКИ(Организация, Справочники.ВидыКонтактнойИнформации.ТелефонРабочий);         
		//
		//АгентЭлПочта = киПолучитьПредставлениеКИ(Организация, Справочники.ВидыКонтактнойИнформации.АдресЭлектроннойПочтыРабочий);
		//АгентЭлПочта1 = киПолучитьПредставлениеКИ(Организация, Справочники.ВидыКонтактнойИнформации.АдресЭлектроннойПочтыДомашний);
		//
		//Если ЗначениеЗаполнено(АгентЭлПочта) Тогда
		//	ОбластьМакета.Параметры.АгентЭлПочта = АгентЭлПочта + ?(ЗначениеЗаполнено(АгентЭлПочта1), ", " + АгентЭлПочта1, "");
		//Иначе
		//	ОбластьМакета.Параметры.АгентЭлПочта = АгентЭлПочта1;
		//КонецЕсли; 
		
		//ОбластьМакета.Параметры.ПринципалФИО = Контрагент.НаименованиеПолное;	
		//ОбластьМакета.Параметры.ПринципалАдрес = спПолучитьПредставление(Контрагент, Новый Структура("АдресЮридический")); 
		ОбластьМакета.Параметры.СтруктураПринципала = Контрагент.НаименованиеПолное + Символы.ПС + 
		"Адрес: " + спПолучитьПредставление(Контрагент, Новый Структура("АдресЮридический")) + Символы.ПС +
		"Паспорт: " + ПаспортСерия + " " + ПаспортНомер + Символы.ПС +
		"Выдан: " + ПаспортКемВыдан + Символы.ПС + 
		"Дата выдачи: " + ПаспортДатаВыдачи + Символы.ПС +
		"Код подразделения: " + КодПодразделения;												  
		ОбластьМакета.Параметры.СтруктураАгента = Организация.НаименованиеПолное + Символы.ПС +
		"Адрес: " + спПолучитьПредставление(Организация, Новый Структура("АдресЮридический")) + Символы.ПС + 
		"ИНН: " + Организация.ИНН + Символы.ПС +
		"ОГРН: " + Организация.ОГРН + Символы.ПС +
		"р/с: " + Организация.ОсновнойБанковскийСчет.НомерСчета + Символы.ПС +
		"к/с: " + Организация.ОсновнойБанковскийСчет.Банк.КоррСчет + Символы.ПС +
		"БИК: " + Организация.ОсновнойБанковскийСчет.Банк.Код + Символы.ПС +
		"Телефон: " + киПолучитьПредставлениеКИ(Организация, Справочники.ВидыКонтактнойИнформации.ТелефонРабочий) + Символы.ПС +
		"Электронная почта: " + ?(ЗначениеЗаполнено(киПолучитьПредставлениеКИ(Организация, Справочники.ВидыКонтактнойИнформации.АдресЭлектроннойПочтыДомашний)), киПолучитьПредставлениеКИ(Организация, Справочники.ВидыКонтактнойИнформации.АдресЭлектроннойПочтыРабочий) + ", " + киПолучитьПредставлениеКИ(Организация, Справочники.ВидыКонтактнойИнформации.АдресЭлектроннойПочтыДомашний), киПолучитьПредставлениеКИ(Организация, Справочники.ВидыКонтактнойИнформации.АдресЭлектроннойПочтыРабочий)); 	
		ОбластьМакета.Параметры.ОтпустилПредставление = ОтпустилПредставление + ?(ЗначениеЗаполнено(НаОсновании), " на основании " + НаОсновании, "");	
		//Иванченко 20251218 --
		
		ТабДокумент.Вывести(ОбластьМакета);	  
		
		ТабДокумент.ПолеСверху = 0;
		ТабДокумент.ПолеСлева  = 10;
		ТабДокумент.ПолеСнизу  = 12;
		ТабДокумент.ПолеСправа = 5;   
		ТабДокумент.НижнийКолонтитул.ТекстСлева = "Принципал: _______________"; 
		ТабДокумент.НижнийКолонтитул.ТекстСправа = "Агент: _______________";
		ТабДокумент.НижнийКолонтитул.Выводить = Истина;		
		ТабДокумент.АвтоМасштаб = Истина;	
		ТабДокумент.ОтображатьСетку = Ложь;
		ТабДокумент.ТолькоПросмотр = Истина;
		
		Возврат ТабДокумент; 
		
	КонецФункции    
	
	Функция ПечатьАктОбОказанииУслуг(ТабДокумент) Экспорт  
		СтрокаАвтомобиля = Автомобили[0]; 
		ДокументПоступления = СтрокаАвтомобиля.ДокументПоступления;	
		
		ЗапросПродажа = Новый Запрос;
		ЗапросПродажа.Текст =
		"ВЫБРАТЬ
		|	МИНИМУМ(ПродажиАвтомобилейОбороты.ДокументПродажи) КАК ДокументПродажи
		|ИЗ
		|	РегистрНакопления.ПродажиАвтомобилей.Обороты(
		|			&Дата,
		|			,
		|			,
		|			НЕ ДокументПродажи.Контрагент.НашаФирма
		|				И Автомобиль = &Автомобиль) КАК ПродажиАвтомобилейОбороты";
		
		ЗапросПродажа.Параметры.Вставить("Дата", ДокументПоступления.ДатаСоздания);  
		ЗапросПродажа.Параметры.Вставить("Автомобиль", СтрокаАвтомобиля.Автомобиль);
		
		РезультатПродажа = ЗапросПродажа.Выполнить().Выгрузить();
		
		Если РезультатПродажа.Количество() = 0 Тогда
			Сообщить("ОШИБКА!!! Акт об оказании услуг может быть распечатан только по реализованным автомобилям.", СтатусСообщения.ОченьВажное); 
			
			Возврат "";
		КонецЕсли;	
		
		ФорматВыводаСуммы = обПраво("ФорматВыводаСуммы",Права,,ЭтотОбъект);	
		
		Макет = ПолучитьМакет("АктОбОказанииУслуг");
		ОбластьМакета = Макет.ПолучитьОбласть("АктЗаголовок");
		ОбластьМакета.Параметры.Заполнить(ЭтотОбъект);
		ТекстЗаголовка = дкПолучитьПредставление(ЭтотОбъект);
		
		ОбластьМакета.Параметры.ТекстЗаголовка = СтрЗаменить(ТекстЗаголовка,"Отчет комитенту за автомобили","Акт об оказании услуг");
		ОбластьМакета.Параметры.ПредставлениеКомиссионера	= спПолучитьПредставление(Организация);
		ОбластьМакета.Параметры.ПредставлениеКомитента		= спПолучитьПредставление(Контрагент);
		
		ТабДокумент.Вывести(ОбластьМакета);                    
		
		ОбластьМакета = Макет.ПолучитьОбласть("АктШапкаТЧ");
		ТабДокумент.Вывести(ОбластьМакета);                    
		
		ОбластьМакета = Макет.ПолучитьОбласть("АктСтрокаТЧ");
		
		Прибыль = Автомобили.Итог("СуммаПродажи") - Автомобили.Итог("Сумма");	
		
		СуммаДоход = Формат(Прибыль,ФорматВыводаСуммы); 
		СуммаДоходПрописью = обЧислоПрописью(Прибыль,ЭтотОбъект.ВалютаДокумента);	
		
		//Иванченко 20251229 ++
		ОбластьМакета.Параметры.Номенклатура = Справочники.Номенклатура.КомиссионноеВознаграждение;   
		//Иванченко 20251229 --		
		ОбластьМакета.Параметры.СуммаДоход = СуммаДоход;
		ТабДокумент.Вывести(ОбластьМакета);          
		
		ОбластьМакета = Макет.ПолучитьОбласть("АктПодвал"); 
		ОбластьМакета.Параметры.ВалютаДокумента = ВалютаДокумента;
		ОбластьМакета.Параметры.СуммаДоход = СуммаДоход; 
		
		//Иванченко 20251218 ++
		//Если Организация.ФормаСобственности = Перечисления.ФормыСобственности.ЮридическоеЛицо Тогда
		//	ОбластьМакета.Параметры.НДС = "Включая НДС " + Справочники.СтавкиНДС.ОсновнаяСтавкаНДС.Ставка + "%:";
		//	СуммаНДС = Прибыль * Справочники.СтавкиНДС.ОсновнаяСтавкаНДС.Ставка / (100 + Справочники.СтавкиНДС.ОсновнаяСтавкаНДС.Ставка);
		//	ОбластьМакета.Параметры.СуммаНДС = Формат(СуммаНДС, ФорматВыводаСуммы);
		//Иначе
		//	ОбластьМакета.Параметры.НДС = "Без налога (НДС):";
		//	ОбластьМакета.Параметры.СуммаНДС = "-";
		//КонецЕсли;
		                                                                                         
		Если СтрокаАвтомобиля.СтавкаНДС = Справочники.СтавкиНДС.БезНДС Тогда
			ОбластьМакета.Параметры.НДС = "Без налога (НДС):"; 
			ОбластьМакета.Параметры.СуммаНДС = "-";
		Иначе
			ОбластьМакета.Параметры.НДС = "Включая " + СтрокаАвтомобиля.СтавкаНДС + ":"; 
			ОбластьМакета.Параметры.СуммаНДС = Формат(СтрокаАвтомобиля.СуммаНДС, ФорматВыводаСуммы) + " "; 
		КонецЕсли;    
		
		//Иванченко 20251229 ++
		//ОбластьМакета.Параметры.СуммаНДССтрокой = "(" + ЧислоПрописью(СтрокаАвтомобиля.СуммаНДС) + ")";
		ОбластьМакета.Параметры.СуммаНДССтрокой = "(" + обЧислоПрописью(СтрокаАвтомобиля.СуммаНДС, ЭтотОбъект.ВалютаДокумента) + ")";  
		//Иванченко 20251229 --		
		//Иванченко 20251218 --
		
		ОбластьМакета.Параметры.СуммаДоходПрописью = СуммаДоходПрописью;
		
		Отпустил = дкОтветственноеЛицо(ЭтотОбъект,"Отпустил");
		Отпустил.ОтпустилПредставление = ?(обЗначениеНеЗаполнено(Отпустил.Отпустил),"","/ "+ Отпустил.ОтпустилПредставление);
		Отпустил.ОтпустилПредставление = СМГ_ПолучитьСотраОтпустил(Ссылка);
		ОбластьМакета.Параметры.Заполнить(Отпустил);
		
		ТабДокумент.Вывести(ОбластьМакета); 

		ТабДокумент.ПолеСверху = 0;
		ТабДокумент.ПолеСлева  = 10;
		ТабДокумент.ПолеСнизу  = 12;
		ТабДокумент.ПолеСправа = 5;   
		ТабДокумент.АвтоМасштаб = Истина;	
		ТабДокумент.ОтображатьСетку = Ложь;
		
		Возврат ТабДокумент 
		
	КонецФункции 
	
	Функция ПечатьАктСФ(ТабДокумент) Экспорт 	
		дкПечать(Ссылка.ПолучитьОбъект(), "Акт об оказании услуг", 0,, Неопределено);
		дкПечать(Ссылка.ПолучитьОбъект(), "Счет-фактура", 0,, Неопределено);
 	КонецФункции 

	Функция ПечатьЗаявлениеНаПеречислениеДС(ТабДокумент) Экспорт  
		СтрокаАвтомобиля = Автомобили[0]; 
		ДокументПоступления = СтрокаАвтомобиля.ДокументПоступления;	
		ДатаДоговора = ?(ЗначениеЗаполнено(ДокументПоступления.ДоговорВзаиморасчетов.ДатаКП), ДокументПоступления.ДоговорВзаиморасчетов.ДатаКП, ДокументПоступления.ДатаСоздания);	
		
		СтруктураЗаполнения = Новый Структура;
		СтруктураЗаполнения.Вставить("Контрагент", Контрагент); 
		Паспорт = спПолучитьПодтверждающийДокументОбъектаПоВиду(Контрагент, Перечисления.ВидыДокументов.Паспорт); 
		
		Если ЗначениеЗаполнено(Паспорт) Тогда
			СтруктураЗаполнения.Вставить("Документ", "паспорт " + Паспорт.Серия + " №" + Паспорт.Номер + ", выдан " + Паспорт.КемВыдан + ", дата выдачи " + Формат(Паспорт.ДатаВыдачи, "ДЛФ=D"));  
		КонецЕсли;  	
		
		СтруктураЗаполнения.Вставить("НаименованиеДляПечати", Организация.НаименованиеДляПечати);
		СтруктураЗаполнения.Вставить("ЦенаАвто", СтрокаАвтомобиля.СуммаВсего);
		СтруктураЗаполнения.Вставить("ЦенаАвтоПрописью", обЧислоПрописью(СтрокаАвтомобиля.СуммаВсего, ВалютаДокумента));
		СтруктураЗаполнения.Вставить("Модель", СтрокаАвтомобиля.Автомобиль.Модель);
		СтруктураЗаполнения.Вставить("ВИН", СтрокаАвтомобиля.Автомобиль.VIN); 	
		СтруктураЗаполнения.Вставить("Владелец", Контрагент);
		СтруктураЗаполнения.Вставить("ВладелецСЧ", Контрагент.ОсновнойБанковскийСчет.НомерСчета);
		СтруктураЗаполнения.Вставить("ВладелецБанк", Контрагент.ОсновнойБанковскийСчет.Банк);
		СтруктураЗаполнения.Вставить("ВладелецИНН", Контрагент.ИНН);
		СтруктураЗаполнения.Вставить("ВладелецБИК", Контрагент.ОсновнойБанковскийСчет.Банк.Код);
		СтруктураЗаполнения.Вставить("ВладелецКСЧ", Контрагент.ОсновнойБанковскийСчет.Банк.КоррСчет);	
		СтруктураЗаполнения.Вставить("Доверенность", "на праве собственности"); 	
		СтруктураЗаполнения.Вставить("Номер", СокрЛП(?(ЗначениеЗаполнено(ДокументПоступления.ВхДокНомер), ДокументПоступления.ВхДокНомер, ДокументПоступления.Номер)));
		СтруктураЗаполнения.Вставить("Дата", Формат(ДатаДоговора, "ДЛФ=DD"));  
		
		Макет = ПолучитьМакет("ЗаявлениеНаПеречислениеДС");
		Макет.Параметры.Заполнить(СтруктураЗаполнения);
		ТабДокумент.Вывести(Макет); 
		
		ТабДокумент.ПолеСверху		= 0;
		ТабДокумент.ПолеСлева		= 0;
		ТабДокумент.ПолеСнизу		= 0;
		ТабДокумент.ПолеСправа		= 0; 
		ТабДокумент.АвтоМасштаб		= Истина;
		ТабДокумент.ОтображатьСетку = Ложь;
		
		Возврат ТабДокумент;
		
	КонецФункции
	
	Функция ПечатьОтчетАктСФЗаявление(ТабДокумент) Экспорт   
		//Иванченко 20251229 ++
		//Режим = РежимДиалогаВопрос.ДаНет;	
		//НаПринтер = Истина;  
		//Текст = "Вывести на печать?" + Символы.ПС + "Да - печать на принтер" + Символы.ПС + "Нет - вывод печатных форм";
		//Ответ = Вопрос(Текст, Режим, 0);
		//
		//Если Ответ = КодВозвратаДиалога.Нет Тогда
		//	НаПринтер = Ложь;
		//КонецЕсли;
		//
		//#Если Клиент Тогда
		//	Для Счетчик = 1 По 4 Цикл 		
		//		
		//		ТабДокумент = Новый ТабличныйДокумент;    
		//		
		//		Если Счетчик = 1 Тогда
		//			НазваниеПечатнойФормы = "Отчет агента";	 
		//		ИначеЕсли Счетчик = 2 Тогда			
		//			НазваниеПечатнойФормы = "Акт об оказании услуг";
		//		ИначеЕсли Счетчик = 3 Тогда			
		//			НазваниеПечатнойФормы = "Счет-фактура";	 				
		//		ИначеЕсли Счетчик = 4 Тогда			
		//			НазваниеПечатнойФормы = "Заявление на перечисление денежных средств";				
		//		КонецЕсли; 			
		//		
		//		дкПечать(Ссылка.ПолучитьОбъект(), НазваниеПечатнойФормы, 0, НаПринтер, Неопределено);
		//	КонецЦикла;
		//#КонецЕсли   
		//
		//Возврат Неопределено;
		
		ПечатьОтчетАгента(ТабДокумент);
		ТабДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		ПечатьАктОбОказанииУслуг(ТабДокумент);   
		ТабДокумент.ВывестиГоризонтальныйРазделительСтраниц();		
		ПечатьЗаявлениеНаПеречислениеДС(ТабДокумент);  
		дкПечать(Ссылка.ПолучитьОбъект(), "Счет-фактура", 0,, Неопределено);
		
		Возврат ТабДокумент; 
		//Иванченко 20251229 --		
	КонецФункции	
	//Иванченко 20251208 --

	//Иванченко 20260803 ++
	
	//Иванченко 20260803 --	
	
	// Процедура осуществляет печать документа. Можно направить печать на 
	// экран или принтер, а также распечатать необходимое количество копий.
	// Параметры: НазваниеМакета - строка, название макета, если пусто - то по умолчанию,
	//   Документ - сюда можно передать уже созданный табличный документ для заполнения
	Функция Печать(НазваниеПечатнойФормы="", КоличествоЭкземпляров=1, НаПринтер=Ложь, Документ=Неопределено) Экспорт
		// Вызов конкретно печатной формы и печать результата прописано в общем модуле
		// здесь могут быть вставлены дополнительные механизмы
		Возврат дкПечать(ЭтотОбъект, НазваниеПечатнойФормы, КоличествоЭкземпляров, НаПринтер, Документ);
	КонецФункции
	
	// Возвращает доступные варианты печати документа
	// Возвращаемое значение: Структура, каждая строка которой
	// соответствует одному из вариантов печати
	// Первый элемент структуры - форма по умолчанию
	Функция ПолучитьСписокПечатныхФорм() Экспорт
		СтруктураМакетов=Новый Структура(); 
		//Иванченко 20251208 ++	
		//СтруктураМакетов.Вставить("ОтчетКомитентуЗаАвтомобилиПлюсАкт", "Отчет и Акт выполненных работ");
		//СтруктураМакетов.Вставить("ОтчетКомитентуЗаАвтомобили", "Отчет комитенту за автомобили");  
		//Иванченко 20251208 --		
		//Бондаренко++ 20221221
		СтруктураМакетов.Вставить("СчетФактура", "Счет-фактура");
		//Бондаренко-- 20221221  
		//Иванченко 20251208 ++ 
		СтруктураМакетов.Вставить("ОтчетАгента", "Отчет агента");
		СтруктураМакетов.Вставить("АктОбОказанииУслуг", "Акт об оказании услуг"); 
		//Иванченко 20251229 ++ 
		СтруктураМакетов.Вставить("АктСФ", "Акт об оказании услуг, Счет-фактура");       
		//Иванченко 20251229 --  
		СтруктураМакетов.Вставить("ЗаявлениеНаПеречислениеДС", "Заявление на перечисление денежных средств");
		СтруктураМакетов.Вставить("ОтчетАктСФЗаявление", "Отчет агента, Акт об оказании услуг, Счет-фактура, Заявление на перечисление денежных средств");
		//Иванченко 20251208 --	 
		//Иванченко 20260803 ++
		СтруктураМакетов.Вставить("ОтчетАгента", "Отчет агента");
		//Иванченко 20260803 --			
		Возврат СтруктураМакетов;
	КонецФункции
	
#КонецЕсли
// Если Клиент Тогда - завершена клиентская часть

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ

Процедура ПриУстановкеНовогоНомера(СтандартнаяОбработка, Префикс)
	Если НЕ дкПриУстановкеНовогоНомера(ЭтотОбъект, СтандартнаяОбработка, Префикс) Тогда Возврат; КонецЕсли;
КонецПроцедуры

// Процедура - обработчик ввода на основании
Процедура ОбработкаЗаполнения(Основание) Экспорт
	
	Если (НЕ обЗначениеНеЗаполнено(Основание)) И (Основание.ХозОперация=Справочники.ХозОперации.РеализацияАвтомобилей) Тогда		
		// В качестве контрагента должен выступать поставщик, а не покупатель из реализации
		Контрагент				= обПраво("ОсновнойПоставщик",Права,,ЭтотОбъект);
		Если НЕ обЗначениеНеЗаполнено(Контрагент) Тогда
			ДоговорВзаиморасчетов	= Контрагент.ОсновнойДоговорВзаиморасчетов;
		КонецЕсли;
	КонецЕсли;
	
	Если НЕ дкОбработкаЗаполнения(ЭтотОбъект, Основание) Тогда Возврат; КонецЕсли;
	
	Если (НЕ обЗначениеНеЗаполнено(Основание)) И 
		(Основание.ХозОперация=Справочники.ХозОперации.ПоступлениеАвтомобилейКомиссия ИЛИ
		Основание.ХозОперация=Справочники.ХозОперации.ВводОстатковАвтомобилейПринятыхНаКомиссию) Тогда
		Запрос = Новый Запрос;
		Запрос.Текст =
		"ВЫБРАТЬ
		|	РеализованныеАвтомобилиОстатки.Автомобиль,
		|	РеализованныеАвтомобилиОстатки.ДокументПередачи,
		|	РеализованныеАвтомобилиОстатки.ГТД,
		|	РеализованныеАвтомобилиОстатки.КоличествоОстаток КАК Количество,
		|	РеализованныеАвтомобилиОстатки.СуммаУпрОстаток КАК СуммаУпр,
		|	РеализованныеАвтомобилиОстатки.СуммаРеглОстаток КАК СуммаРегл,		
		|	РеализованныеАвтомобилиОстатки.СуммаПродажиОстаток КАК СуммаПродажи,
		|	РеализованныеАвтомобилиОстатки.СуммаПродажиРеглОстаток КАК СуммаПродажиРегл
		|ИЗ
		|	РегистрНакопления.РеализованныеАвтомобили.Остатки(
		|			,
		|			Контрагент = &Контрагент
		|				И ДоговорВзаиморасчетов = &ДоговорВзаиморасчетов) КАК РеализованныеАвтомобилиОстатки";
		
		Запрос.УстановитьПараметр("Контрагент"           ,Контрагент);
		Запрос.УстановитьПараметр("ДоговорВзаиморасчетов",ДоговорВзаиморасчетов);
		Выборка = Запрос.Выполнить().Выбрать();
		
		ВалютаУпр	= Константы.ВалютаУправленческогоУчетаКомпании.Получить();
		ВалютаРегл	= Константы.ВалютаРегламентированногоУчетаОрганизаций.Получить();		
		Автомобили.Очистить();
		Пока Выборка.Следующий() Цикл
			НоваяСтрока = Автомобили.Добавить();
			НоваяСтрока.Автомобиль = Выборка.Автомобиль;
			ОбработкаРеквизита("Автомобили.Автомобиль",НоваяСтрока);
			НоваяСтрока.Количество = Выборка.Количество;
			
			//Если ВалютаДокумента = ВалютаУпр Тогда
			//	НоваяСтрока.Сумма		= Выборка.СуммаУпр;
			//ИначеЕсли ВалютаДокумента = ВалютаРегл Тогда
			//	НоваяСтрока.Сумма		= Выборка.СуммаРегл;
			//Иначе
			//	НоваяСтрока.Сумма		= обПересчет(Выборка.СуммаУпр,ВалютаУпр,КурсВалютыУпр,ВалютаДокумента,КурсДокумента);	
			//КонецЕсли;				
			ОбработкаРеквизита("Автомобили.Сумма",НоваяСтрока);
			
			Если ВалютаДокумента = ВалютаУпр Тогда
				НоваяСтрока.СуммаПродажи = Выборка.СуммаПродажи;
			ИначеЕсли ВалютаДокумента = ВалютаРегл Тогда
				НоваяСтрока.СуммаПродажи = Выборка.СуммаПродажиРегл;
			Иначе
				НоваяСтрока.СуммаПродажи = обПересчет(Выборка.СуммаПродажи,ВалютаУпр,КурсВалютыУпр,ВалютаДокумента,КурсДокумента);
			КонецЕсли;
			ОбработкаРеквизита("Автомобили.СуммаПродажи",НоваяСтрока);
			
			Если НЕ обЗначениеНеЗаполнено(ДоговорВзаиморасчетов) Тогда
				ТекущаяКомиссияОтчетНаОснованииПродаж	= ДоговорВзаиморасчетов.КомиссияОтчетНаОснованииПродаж;
			Иначе
				ТекущаяКомиссияОтчетНаОснованииПродаж	= Истина;
			КонецЕсли;				
			Если ТекущаяКомиссияОтчетНаОснованииПродаж И НоваяСтрока.Сумма>0 Тогда
				НоваяСтрока.СуммаВсего	= НоваяСтрока.Сумма;
				ОбработкаРеквизита("Автомобили.СуммаВсего",НоваяСтрока);
			ИначеЕсли НЕ ТекущаяКомиссияОтчетНаОснованииПродаж И НоваяСтрока.СуммаПродажи>0 Тогда
				НоваяСтрока.СуммаВсего	= НоваяСтрока.СуммаПродажи;
				ОбработкаРеквизита("Автомобили.СуммаВсего",НоваяСтрока);
			КонецЕсли;			
			
			//НоваяСтрока.ДокументПоступления = Выборка.ДокументПередачи;
			//ОбработкаРеквизита("Автомобили.ДокументПоступления",НоваяСтрока);
		КонецЦикла;
		
		// при вводе на основании реализации автомобилей заполним документ передачи
	ИначеЕсли (НЕ обЗначениеНеЗаполнено(Основание)) И (Основание.ХозОперация=Справочники.ХозОперации.РеализацияАвтомобилей) Тогда
		Автомобили.Очистить();
		Запрос = Новый Запрос;
		Запрос.Текст =
		"ВЫБРАТЬ
		|	РеализованныеАвтомобили.Автомобиль,
		|	РеализованныеАвтомобили.ДокументПередачи,
		|	РеализованныеАвтомобили.Контрагент,
		|	РеализованныеАвтомобили.ДоговорВзаиморасчетов,
		|	РеализованныеАвтомобили.ГТД,
		|	СУММА(РеализованныеАвтомобили.СуммаУпр) КАК СуммаУпр,
		|	СУММА(РеализованныеАвтомобили.СуммаРегл) КАК СуммаРегл,		
		|	СУММА(РеализованныеАвтомобили.СуммаПродажи) КАК СуммаПродажи,
		|	СУММА(РеализованныеАвтомобили.СуммаПродажиРегл) КАК СуммаПродажиРегл,
		|	СУММА(РеализованныеАвтомобили.Количество) КАК Количество
		|ИЗ
		|	РегистрНакопления.РеализованныеАвтомобили КАК РеализованныеАвтомобили
		|ГДЕ
		|	РеализованныеАвтомобили.Регистратор = &Регистратор
		|
		|СГРУППИРОВАТЬ ПО
		|	РеализованныеАвтомобили.Автомобиль,
		|	РеализованныеАвтомобили.ДокументПередачи,
		|	РеализованныеАвтомобили.Контрагент,
		|	РеализованныеАвтомобили.ДоговорВзаиморасчетов,
		|	РеализованныеАвтомобили.ГТД";
		Запрос.УстановитьПараметр("Регистратор",Основание);
		
		Выборка = Запрос.Выполнить().Выбрать();
		Если Выборка.Следующий() Тогда
			Контрагент = Выборка.Контрагент;
			ДоговорВзаиморасчетов = Выборка.ДоговорВзаиморасчетов;
		КонецЕсли;
		ВалютаУпр	= Константы.ВалютаУправленческогоУчетаКомпании.Получить();
		ВалютаРегл	= Константы.ВалютаРегламентированногоУчетаОрганизаций.Получить();
		Выборка.Сбросить();
		Пока Выборка.Следующий() Цикл
			НоваяСтрока = Автомобили.Добавить();
			НоваяСтрока.Автомобиль = Выборка.Автомобиль;
			ОбработкаРеквизита("Автомобили.Автомобиль",НоваяСтрока);
			НоваяСтрока.Количество = Выборка.Количество;
			
			Если ВалютаДокумента = ВалютаУпр Тогда
				НоваяСтрока.Сумма		= Выборка.СуммаУпр;
			ИначеЕсли ВалютаДокумента = ВалютаРегл Тогда
				НоваяСтрока.Сумма		= Выборка.СуммаРегл;
			Иначе
				НоваяСтрока.Сумма		= обПересчет(Выборка.СуммаУпр,ВалютаУпр,КурсВалютыУпр,ВалютаДокумента,КурсДокумента);	
			КонецЕсли;				
			ОбработкаРеквизита("Автомобили.Сумма",НоваяСтрока);
			
			Если ВалютаДокумента = ВалютаУпр Тогда
				НоваяСтрока.СуммаПродажи	= Выборка.СуммаПродажи;
			ИначеЕсли ВалютаДокумента = ВалютаРегл Тогда
				НоваяСтрока.СуммаПродажи	= Выборка.СуммаПродажиРегл;
			Иначе
				НоваяСтрока.СуммаПродажи	= обПересчет(Выборка.СуммаПродажи,ВалютаУпр,КурсВалютыУпр,ВалютаДокумента,КурсДокумента);
			КонецЕсли;
			ОбработкаРеквизита("Автомобили.СуммаПродажи",НоваяСтрока);			
			
			Если НЕ обЗначениеНеЗаполнено(ДоговорВзаиморасчетов) Тогда
				ТекущаяКомиссияОтчетНаОснованииПродаж	= ДоговорВзаиморасчетов.КомиссияОтчетНаОснованииПродаж;
			Иначе
				ТекущаяКомиссияОтчетНаОснованииПродаж	= Истина;
			КонецЕсли;			
			
			Если ТекущаяКомиссияОтчетНаОснованииПродаж И НоваяСтрока.Сумма>0 Тогда
				НоваяСтрока.СуммаВсего	= НоваяСтрока.Сумма;
				ОбработкаРеквизита("Автомобили.СуммаВсего",НоваяСтрока);
			ИначеЕсли НЕ ТекущаяКомиссияОтчетНаОснованииПродаж И НоваяСтрока.СуммаПродажи>0 Тогда
				НоваяСтрока.СуммаВсего	= НоваяСтрока.СуммаПродажи;
				ОбработкаРеквизита("Автомобили.СуммаВсего",НоваяСтрока);
			КонецЕсли;			
			НоваяСтрока.ДокументПоступления = Выборка.ДокументПередачи;
			//ОбработкаРеквизита("Автомобили.ДокументПоступления",НоваяСтрока);
		КонецЦикла;
	КонецЕсли;
	//Пройдемся по ТЧ и рассчитаем сумму комиссионного вознаграждения
	Для Каждого СтрокаТЧ Из Автомобили Цикл
		ОбработкаРеквизита("РассчитатьВознаграждение",СтрокаТЧ);
	КонецЦикла;
	
	ТекущаяВалютаДокумента=ВалютаДокумента;
	ТекущийКурсДокумента=КурсДокумента;
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	Если НЕ дкПриКопировании(ЭтотОбъект, ОбъектКопирования) Тогда Возврат; КонецЕсли;
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	ДополнительныеСвойства.Вставить("ДоговорВзаиморасчетовБыл");
	ДополнительныеСвойства.Вставить("МоментВремениБыл");
	
	Если НЕ дкПередЗаписью(ЭтотОбъект, Отказ, РежимЗаписи, РежимПроведения) Тогда Возврат; КонецЕсли;
	
	// получим старые значения, влияющие на границы последовательности
	Если НЕ Отказ И НЕ ЭтоНовый() И РежимЗаписи=РежимЗаписиДокумента.Проведение Тогда
		// прошлый момент времени
		Запрос = Новый Запрос("ВЫБРАТЬ МоментВремени ИЗ Документ."+Метаданные().Имя+" ГДЕ Ссылка=&Ссылка");
		Запрос.УстановитьПараметр("Ссылка",Ссылка);
		ДополнительныеСвойства.Вставить("МоментВремениБыл",Запрос.Выполнить().Выгрузить().Получить(0).МоментВремени);
		
		// взаиморасчеты
		Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ ДоговорВзаиморасчетов ИЗ РегистрНакопления.ВзаиморасчетыКомпании ГДЕ Регистратор=&Ссылка";
		Результат = Запрос.Выполнить();
		Если НЕ Результат.Пустой() Тогда
			ДополнительныеСвойства.Вставить("ДоговорВзаиморасчетовБыл", Результат.Выгрузить().ВыгрузитьКолонку("ДоговорВзаиморасчетов"));
		КонецЕсли;
	КонецЕсли;
	
	СуммаВознаграждения=Автомобили.Итог("Вознаграждение");
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	Если НЕ дкПриЗаписи(ЭтотОбъект, Отказ) Тогда Возврат; КонецЕсли; 
	//Бондаренко++ 20221221
	СМГ_ПриЗаписи();
	//Бондаренко++ 20221221
КонецПроцедуры

Процедура ПередУдалением(Отказ)
	Если НЕ дкПередУдалением(ЭтотОбъект, Отказ) Тогда Возврат; КонецЕсли;
КонецПроцедуры

Процедура ОбработкаУдаленияПроведения(Отказ)
	Если НЕ дкОбработкаУдаленияПроведения(ЭтотОбъект, Отказ) Тогда Возврат; КонецЕсли;
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, Режим)
	Если НЕ дкОбработкаПроведения(ЭтотОбъект, Отказ, Режим) Тогда Возврат; КонецЕсли;
	
	// проведем взаиморасчеты
	НаборЗаписейВзаиморасчеты=Движения.ВзаиморасчетыКомпании;
	НаборЗаписейВзаиморасчеты.ДокументОбъект=ЭтотОбъект;
	НаборЗаписейВзаиморасчеты.РежимПроведения=Режим;
	НаборЗаписейВзаиморасчеты.Контрагент=Контрагент;
	НаборЗаписейВзаиморасчеты.ДоговорВзаиморасчетов=ДоговорВзаиморасчетов;
	НаборЗаписейВзаиморасчеты.ВзаиморасчетыСПокупателем=Ложь;
	НаборЗаписейВзаиморасчеты.Сумма=СуммаДокумента-СуммаВознаграждения;
	НаборЗаписейВзаиморасчеты.СуммаДоходаРасходаСуммовыхРазниц=0;
	Отказ=НЕ НаборЗаписейВзаиморасчеты.Расход() ИЛИ Отказ;
	// доходы и расходы по суммовым разницам
	СуммаДоходаРасходаСуммовыхРазниц=НаборЗаписейВзаиморасчеты.СуммаДоходаРасходаСуммовыхРазниц;
	Если СуммаДоходаРасходаСуммовыхРазниц<>0 Тогда
		НаборЗаписейДиР = Движения.ДоходыИРасходы;
		НаборЗаписейДиР.ДокументОбъект = ЭтотОбъект;
		НаборЗаписейДиР.СтатьяДоходовИРасходов = Справочники.СтатьиДоходовИРасходов.СуммовыеРазницы;
		НаборЗаписейДиР.ВУпрВалюте = Истина;
		Если СуммаДоходаРасходаСуммовыхРазниц<0 Тогда
			НаборЗаписейДиР.Расход = -СуммаДоходаРасходаСуммовыхРазниц;
		Иначе
			НаборЗаписейДиР.Доход = СуммаДоходаРасходаСуммовыхРазниц;
		КонецЕсли;
		Отказ = НЕ НаборЗаписейДиР.Приход() ИЛИ Отказ;
	КонецЕсли;
	
	//Спишем автомобили с регистра проданных комиссионных автомобилей
	НаборЗаписейРеализованныеАвтомобили=Движения.РеализованныеАвтомобили;
	НаборЗаписейРеализованныеАвтомобили.ДокументОбъект=ЭтотОбъект;
	НаборЗаписейРеализованныеАвтомобили.Контрагент=Контрагент;
	НаборЗаписейРеализованныеАвтомобили.ДоговорВзаиморасчетов=ДоговорВзаиморасчетов;
	Отказ=НЕ НаборЗаписейРеализованныеАвтомобили.Расход() ИЛИ Отказ;
	Если НЕ Отказ Тогда
		НаборЗаписейРеализованныеАвтомобили.Записать();
	КонецЕсли; 
	
	// партии
	Отказ=НЕ ПровестиПоПартиям(Режим,Ссылка) ИЛИ Отказ;
	
	// двигаем границу последовательности взаиморасчетов
	ДвигаемГраницу = (Режим<>РежимПроведенияДокумента.Оперативный И Движения.ВзаиморасчетыКомпании.Количество()>0);
	Если ДвигаемГраницу ИЛИ ЗначениеЗаполнено(ДополнительныеСвойства.ДоговорВзаиморасчетовБыл) Тогда
		НаборЗаписейГраницыВзаиморасчетов = РегистрыСведений.ГраницыВзаиморасчетов.СоздатьНаборЗаписей();
		Если ДвигаемГраницу Тогда
			ТаблицаДоговоров = Движения.ВзаиморасчетыКомпании.Выгрузить();
			ТаблицаДоговоров.Свернуть("ДоговорВзаиморасчетов","");
			НаборЗаписейГраницыВзаиморасчетов.ДоговорВзаиморасчетов = ТаблицаДоговоров.ВыгрузитьКолонку("ДоговорВзаиморасчетов");
			НаборЗаписейГраницыВзаиморасчетов.МоментВремени = Дата;
			НаборЗаписейГраницыВзаиморасчетов.ДоговорВзаиморасчетовБыл = ДополнительныеСвойства.ДоговорВзаиморасчетовБыл;
			НаборЗаписейГраницыВзаиморасчетов.МоментВремениБыл = ДополнительныеСвойства.МоментВремениБыл;
		Иначе
			НаборЗаписейГраницыВзаиморасчетов.ДоговорВзаиморасчетов = ДополнительныеСвойства.ДоговорВзаиморасчетовБыл;
			НаборЗаписейГраницыВзаиморасчетов.МоментВремени = ДополнительныеСвойства.МоментВремениБыл;
			НаборЗаписейГраницыВзаиморасчетов.ДоговорВзаиморасчетовБыл = Неопределено;
			НаборЗаписейГраницыВзаиморасчетов.МоментВремениБыл = Неопределено;
		КонецЕсли;
		НаборЗаписейГраницыВзаиморасчетов.ДокументСсылка = Ссылка;
		НаборЗаписейГраницыВзаиморасчетов.ИзменитьГраницу();
	КонецЕсли;
	
	// выведем сообщения об ошибках и предупреждениях
	дкВыводРезультатовОбработки(ЭтотОбъект,Отказ);
	
КонецПроцедуры // ОбработкаПроведения

//Бондаренко++ 20221221
Функция ПечатьСчетФактура(ТабДокумент) Экспорт
	ДокСФ = "";
	ДокСФ = Документы.СчетФактураВыданный.НайтиПоРеквизиту("ДокументОснование",ЭтотОбъект.Ссылка);
	Если Не обЗначениеНеЗаполнено(ДокСФ) Тогда
		ДокСФ_об = ДокСФ.ПолучитьОбъект();
		Возврат ДокСФ_об.ПечатьСчетФактура(ТабДокумент);
	Иначе
		СМГ_Сообщить("ОШИБКА! Документ ""Счет-фактура выданный"" - не существует.",СтатусСообщения.ОченьВажное);
	КонецЕсли;
	Возврат ТабДокумент;
КонецФункции	       
//Бондаренко++ 20221221

// Формирует печатную форму "ОтчетКомитентуПлюсАкт"
// Возвращает сформированный табличный документ:
Функция ПечатьОтчетКомитентуЗаАвтомобилиПлюсАкт(ТабДокумент) Экспорт
	Если НЕ ЭтотОбъект.Проведен Тогда
		Сообщить("Печать непроведенного документа невозможна.");
		Возврат Неопределено;
	КонецЕсли;
	
	Макет = ПолучитьМакет("ОтчетКомитентуЗаАвтомобилиПлюсАкт");
	
	//для начала настроим макет
	ОбластьШапкаТаблицы = орПривестиМакетПечатнойФормы(ЭтотОбъект,Макет);
	ФорматВыводаСуммы = обПраво("ФорматВыводаСуммы",Права,,ЭтотОбъект);
	
	//вывод заголовка документа
	ОбластьМакета = Макет.ПолучитьОбласть("Заголовок");
	ОбластьМакета.Параметры.Заполнить(ЭтотОбъект);
	ТекстЗаголовка = дкПолучитьПредставление(ЭтотОбъект);
	ОбластьМакета.Параметры.ТекстЗаголовка = ТекстЗаголовка;
	//ОбластьМакета.Параметры.ПредставлениеКомитента		= спПолучитьПредставление(Контрагент);
	//ОбластьМакета.Параметры.ПредставлениеКомиссионера	= спПолучитьПредставление(Организация); 
	
	ОбластьМакета.Параметры.ПредставлениеКомитентаПолноеНаименование = Контрагент.НаименованиеПолное;
	ОбластьМакета.Параметры.ПредставлениеКомиссионераПолноеНаименование = Организация.НаименованиеПолное;
	
	//вывод свойств
	//СтрокаСвойств = дкПолучитьСтрокуСвойствДокумента(ЭтотОбъект);
	//ОбластьМакета.Параметры.СтрокаСвойств = СтрокаСвойств;
	ТабДокумент.Вывести(ОбластьМакета);
	
	НомерСтраницы = 2;
	НомерСтраницыПред = НомерСтраницы;
	
	//теперь выводим шапку
	ТабДокумент.Вывести(ОбластьШапкаТаблицы);
	
	//готовим области строки
	ОбластьМакета = Макет.ПолучитьОбласть("Строка");
	
	ОбластьМакетаИтогоПоСтранице = Макет.ПолучитьОбласть("ИтогоПоСтранице");
	СтруктураИтоговПоСтранице = Новый Структура("ВалютаДокумента,СуммаВсего",ВалютаДокумента,0,0);
	
	//заполним параметры шапки таблицы для следующего листа
	ОбластьШапкаТаблицы.Параметры.ТекстЗаголовка = ТекстЗаголовка;
	ОбластьШапкаТаблицы.Параметры.НомерСтраницы = "Страница: " + НомерСтраницы;
	Запрос = Новый Запрос("ВЫБРАТЬ
	|	ОтчетКомитентуЗаАвтомобилиАвтомобили.Автомобиль,
	|	ОтчетКомитентуЗаАвтомобилиАвтомобили.Автомобиль.VIN КАК VIN,
	|	1 КАК Количество,
	|	ЕСТЬNULL(Реализации.СуммаПоступления, 0) КАК СуммаПоступления,
	|	ЕСТЬNULL(Реализации.СуммаПродажи, 0) КАК СуммаВсего,
	|	ОтчетКомитентуЗаАвтомобилиАвтомобили.ДокументПоступления
	|ИЗ
	|	Документ.ОтчетКомитентуЗаАвтомобили.Автомобили КАК ОтчетКомитентуЗаАвтомобилиАвтомобили
	|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|			РеализованныеАвтомобили.Автомобиль КАК Автомобиль,
	|			РеализованныеАвтомобили.СуммаУпр КАК СуммаПоступления,
	|			РеализованныеАвтомобили.СуммаПродажи КАК СуммаПродажи
	|		ИЗ
	|			РегистрНакопления.РеализованныеАвтомобили КАК РеализованныеАвтомобили
	|		ГДЕ
	|			РеализованныеАвтомобили.Регистратор = &Ссылка) КАК Реализации
	|		ПО ОтчетКомитентуЗаАвтомобилиАвтомобили.Автомобиль = Реализации.Автомобиль
	|ГДЕ
	|	ОтчетКомитентуЗаАвтомобилиАвтомобили.Ссылка = &Ссылка");
	
	Запрос.УстановитьПараметр("Ссылка",Ссылка);
	
	//перебор строк
	ВыборкаТабличнойЧасти = Запрос.Выполнить().Выгрузить();
	
	ВалютаУпр = Константы.ВалютаУправленческогоУчетаКомпании.Получить();
	КурсВалУпр = ?(обЗначениеНеЗаполнено(ЭтотОбъект.КурсВалютыУпр),обКурсДляВалюты(ВалютаУпр,Дата).Курс,ЭтотОбъект.КурсВалютыУпр);
	Ном = 1; СуммаИтого = 0;
	Для каждого СтрокаТабличнойЧасти Из ВыборкаТабличнойЧасти Цикл
		//заполняем данные строки
		ОбластьМакета.Параметры.НомерСтроки = Ном;
		ОбластьМакета.Параметры.Автомобиль = СтрокаТабличнойЧасти.Автомобиль;
		ОбластьМакета.Параметры.АвтомобильНаименование = спПолучитьНаименование(СтрокаТабличнойЧасти.Автомобиль);
		
		СуммаПоступления = обПересчет(СтрокаТабличнойЧасти.СуммаПоступления,ВалютаУпр,КурсВалУпр,ВалютаДокумента,КурсДокумента);
		СуммаВсего = СтрокаТабличнойЧасти.СуммаВсего;
		
		//Бондаренко++ 20220908                                                                                         
		РеализацияАвто = "";
		РеализацияАвто = СМГ_РеализацияАвтомобилейНайти(СтрокаТабличнойЧасти.ДокументПоступления,СтрокаТабличнойЧасти.Автомобиль);
		
		Если НЕ обЗначениеНеЗаполнено(РеализацияАвто) Тогда                  
			ОбластьМакета.Параметры.ДатаПродажиАвто = Формат(РеализацияАвто.Дата,"ДФ=dd.MM.yyyy");
			//ОбластьМакета.Параметры.ХозОперация = РеализацияАвто.ХозОперация;
			
			ПокупательАдрес = "";
			ПокупательАдрес = киПолучитьПредставлениеКИ(РеализацияАвто.Контрагент, Справочники.ВидыКонтактнойИнформации.АдресЮридический);
			Если обЗначениеНеЗаполнено(ПокупательАдрес) Тогда
				ПодразделениеАдрес = киПолучитьПредставлениеКИ(РеализацияАвто.Контрагент, Справочники.ВидыКонтактнойИнформации.АдресФактический);
			КонецЕсли;
			Если обЗначениеНеЗаполнено(ПокупательАдрес) Тогда
				ПодразделениеАдрес = киПолучитьПредставлениеКИ(РеализацияАвто.Контрагент, Справочники.ВидыКонтактнойИнформации.АдресПочтовый);
			КонецЕсли;
			
			ПокупательИНН = ?(обЗначениеНеЗаполнено(РеализацияАвто.Контрагент.ИНН),РеализацияАвто.Контрагент.ИНН,"");
			ПокупательКПП = ?(обЗначениеНеЗаполнено(РеализацияАвто.Контрагент.КПП),РеализацияАвто.Контрагент.КПП,"");
			
			Если НЕ обЗначениеНеЗаполнено(ПокупательИНН) Тогда
				Если НЕ обЗначениеНеЗаполнено(ПокупательКПП) Тогда
					ПроИННКПП = " ИНН/КПП Покупателя: "+ПокупательИНН+"/"+ПокупательКПП;		
				Иначе	
					ПроИННКПП = " ИНН Покупателя: "+ПокупательИНН;								
				КонецЕсли;	
			Иначе	
				Если НЕ обЗначениеНеЗаполнено(ПокупательКПП) Тогда
					ПроИННКПП = " КПП Покупателя: "+ПокупательКПП;		
				Иначе	
					ПроИННКПП = "";								
				КонецЕсли;	
			КонецЕсли;
			
			ОПокупателе = "Покупатель: "+РеализацияАвто.Контрагент+" Адрес: "+ПокупательАдрес+ПроИННКПП;
			ОбластьМакета.Параметры.ОПокупателе = ОПокупателе;
			
		КонецЕсли;		
		//Бондаренко-- 20220908
		
		ОбластьМакета.Параметры.СуммаВсего		 = Формат(СуммаВсего,ФорматВыводаСуммы);
		СуммаИтого = СуммаВсего + СуммаИтого;
		
		//выводим строку, делая проверку попадания на лист
		НомерСтраницы = дкВывестиГоризонтальнуюОбласть(ТабДокумент, ОбластьМакета, ОбластьШапкаТаблицы, ОбластьМакетаИтогоПоСтранице, НомерСтраницы, СтруктураИтоговПоСтранице,ЭтотОбъект);
		
		СтруктураСтрокиИтогов = Новый Структура("СуммаВсего",СуммаВсего);
		//инициализация итогов по странице
		Если НомерСтраницы <> НомерСтраницыПред Тогда
			СтруктураИтоговПоСтранице = Новый Структура("ВалютаДокумента,СуммаВсего",ВалютаДокумента,0,0);
			НомерСтраницыПред = НомерСтраницы;
			ОбластьШапкаТаблицы.Параметры.НомерСтраницы = "Страница: " + НомерСтраницы; 
		КонецЕсли;
		//добавляем итоги
		дкДобавитьИтогиПоСтранице(СтруктураСтрокиИтогов,СтруктураИтоговПоСтранице);
		Ном = Ном + 1;
	КонецЦикла;
	
	дкВывестиИтогиПоСтранице(ТабДокумент,ОбластьМакетаИтогоПоСтранице,СтруктураИтоговПоСтранице,ЭтотОбъект);
	
	//итоги
	ОбластьМакета = Макет.ПолучитьОбласть("Подвал");
	ОбластьМакета.Параметры.ВалютаДокумента = ВалютаДокумента;
	ОбластьМакета.Параметры.СуммаВсего = Формат(СуммаИтого,ФорматВыводаСуммы);
	
	ОбластьМакета.Параметры.СуммаПрописью = "Всего наименований "+ВыборкаТабличнойЧасти.Количество()+" на сумму " + обЧислоПрописью(СуммаИтого, ВалютаДокумента);
	
	ОбластьМакета.Параметры.СуммаПрописьюКратко = обЧислоПрописью(СуммаИтого,ВалютаДокумента);
	
	Прибыль = Автомобили.Итог("СуммаПродажи") - Автомобили.Итог("Сумма");
	ОбластьМакета.Параметры.СуммаКомиссииПрописью = "Сумма комиссионного вознаграждения составила "+обЧислоПрописью(Прибыль, ВалютаДокумента);
	
	// Выводим представления и расшифровки подписей
	//Бондаренко++ 20230601
	Отпустил = дкОтветственноеЛицо(ЭтотОбъект,"Отпустил");
	Отпустил.ОтпустилПредставление = ?(обЗначениеНеЗаполнено(Отпустил.Отпустил),"","/ "+ Отпустил.ОтпустилПредставление);
	Отпустил.ОтпустилПредставление = СМГ_ПолучитьСотраОтпустил(Ссылка);
	ОбластьМакета.Параметры.Заполнить(Отпустил);
	//Бондаренко-- 20230601
	
	//Бондаренко++ 20230708
	//Получил  = дкОтветственноеЛицо(ЭтотОбъект,"Получил");
	//Получил.ПолучилПредставление = ?(обЗначениеНеЗаполнено(Получил.Получил),"","/ "+ Получил.ПолучилПредставление);
	//ОбластьМакета.Параметры.Заполнить(Получил);
	ОбластьМакета.Параметры.ПолучилПредставление = "/ "+Контрагент.НаименованиеПолное;
	//Бондаренко++ 20230708
	
	НомерСтраницы = дкВывестиГоризонтальнуюОбласть(ТабДокумент, ОбластьМакета, , , НомерСтраницы,,ЭтотОбъект);
	
	ТабДокумент.ВывестиГоризонтальныйРазделительСтраниц();
	
	//Бондаренко++ 20220907
	СуммаДоход = Формат(Прибыль,ФорматВыводаСуммы); 
	СуммаДоходПрописью = обЧислоПрописью(Прибыль,ЭтотОбъект.ВалютаДокумента);
	
	ОбластьМакета = Макет.ПолучитьОбласть("ЗаголовокАкта");
	ОбластьМакета.Параметры.Заполнить(ЭтотОбъект);
	ТекстЗаголовка = дкПолучитьПредставление(ЭтотОбъект);
	
	ОбластьМакета.Параметры.ТекстЗаголовка = СтрЗаменить(ТекстЗаголовка,"Отчет комитенту за автомобили","Акт об оказании услуг");
	ОбластьМакета.Параметры.ПредставлениеКомиссионера	= спПолучитьПредставление(Организация);
	ОбластьМакета.Параметры.ПредставлениеКомитента		= спПолучитьПредставление(Контрагент);
	
	ТабДокумент.Вывести(ОбластьМакета);                    
	
	ОбластьМакета = Макет.ПолучитьОбласть("ШапкаТаблицыАкта");
	ТабДокумент.Вывести(ОбластьМакета);                    
	
	ОбластьМакета = Макет.ПолучитьОбласть("СтрокаАкта"); 
	ОбластьМакета.Параметры.СуммаДоход = СуммаДоход;
	ТабДокумент.Вывести(ОбластьМакета);          
	
	// Семенихин 16.01.2023 +++++
	ОбластьМакета = Макет.ПолучитьОбласть("ПодвалАкта"); 
	ОбластьМакета.Параметры.ВалютаДокумента = ВалютаДокумента;
	ОбластьМакета.Параметры.СуммаДоход = СуммаДоход;
	Если Организация.ФормаСобственности = Перечисления.ФормыСобственности.ЮридическоеЛицо Тогда
		ОбластьМакета.Параметры.НДС = "Включая НДС:";
		СуммаНДС = Прибыль * Справочники.СтавкиНДС.ОсновнаяСтавкаНДС.Ставка / (100 + Справочники.СтавкиНДС.ОсновнаяСтавкаНДС.Ставка);
		ОбластьМакета.Параметры.СуммаНДС = Формат(СуммаНДС, ФорматВыводаСуммы);
	Иначе
		ОбластьМакета.Параметры.НДС = "Без налога (НДС):";
		ОбластьМакета.Параметры.СуммаНДС = "-";
	КонецЕсли;
	// Семенихин 16.01.2023 -----
	
	ОбластьМакета.Параметры.СуммаДоходПрописью = СуммаДоходПрописью;
	
	//Бондаренко++ 20230601
	Отпустил = дкОтветственноеЛицо(ЭтотОбъект,"Отпустил");
	Отпустил.ОтпустилПредставление = ?(обЗначениеНеЗаполнено(Отпустил.Отпустил),"","/ "+ Отпустил.ОтпустилПредставление);
	Отпустил.ОтпустилПредставление = СМГ_ПолучитьСотраОтпустил(Ссылка);
	ОбластьМакета.Параметры.Заполнить(Отпустил);
	//Бондаренко-- 20230601
	
	ТабДокумент.Вывести(ОбластьМакета);          
	//Бондаренко-- 20220907  
	
	//Иванченко 20250304 ++
	// Выводим Приложение 1 Отчет агента об исполнении договора и Приложение 2 Акт об исполнении поручения
	// Отчёт агента	
	ТабДокумент.ВывестиГоризонтальныйРазделительСтраниц();
	
	ОбластьМакета = Макет.ПолучитьОбласть("Приложение1");  
	
	ОбластьМакета.Параметры.Номер = СокрЛП(Номер);
	ОбластьМакета.Параметры.Дата = Формат(Дата, "ДЛФ=DD");	
	ОбластьМакета.Параметры.ПринципалФИО = г_Функции_Клиент.ПадежФИО(Контрагент.НаименованиеПолное);
	
	Если ЗначениеЗаполнено(Подписант) Тогда 
		ОбластьМакета.Параметры.ПодписьПродавца = "/" + СокрЛП(Подписант.Наименование) + "/";  
		ТекущаяДоверенность = СМ_ФормированиеНовыхОбъектов.ПолучитьДоверенность(Подписант, Организация);		
	Иначе
		ОбластьМакета.Параметры.ПодписьПродавца = "/___________________________/";
	КонецЕсли;  
	
	Если ТекущаяДоверенность <> Неопределено Тогда
		ОбластьМакета.Параметры.ОснованиеПодписи = "по доверенности № " + ТекущаяДоверенность.Номер + " от " + Формат(ТекущаяДоверенность.ДатаВыдачи, "ДФ=dd.MM.yy");
	Иначе
		ОбластьМакета.Параметры.ОснованиеПодписи = "по доверенности";
	КонецЕсли; 
	
	ТабДокумент.Вывести(ОбластьМакета);
	ТабДокумент.ВывестиГоризонтальныйРазделительСтраниц();
	
	// Акт об исполнении	
	ОбластьМакета = Макет.ПолучитьОбласть("Приложение2");
	ОбластьМакета.Параметры.Город = киПолучитьГород(Организация, Справочники.ВидыКонтактнойИнформации.АдресФактический); 
	
	ОбластьМакета.Параметры.Номер = СокрЛП(Номер);		
	ОбластьМакета.Параметры.Дата 		= Формат(ДатаСоздания, "ДЛФ=DD");	
	ОбластьМакета.Параметры.ТекущаяДата = Формат(ДатаСоздания, "ДЛФ=DD");		
	ОбластьМакета.Параметры.ПринципалФИО = Контрагент.НаименованиеПолное;
	
	Если ЗначениеЗаполнено(Подписант) Тогда 
		ОбластьМакета.Параметры.ПодписьПродавца = "/" + СокрЛП(Подписант.Наименование) + "/"; 
		ТекущаяДоверенность = СМ_ФормированиеНовыхОбъектов.ПолучитьДоверенность(Подписант.Наименование, Организация);			
	Иначе
		ОбластьМакета.Параметры.ПодписьПродавца = "/___________________________/";
	КонецЕсли;  		
	
	
	Если ЗначениеЗаполнено(Подписант) Тогда
		КтоБудетПодписывать = Подписант; 
		ДолжностьКтоБудетПодписывать = СокрЛП(г_Функции_Клиент.ПадежФИО(СокрЛП(КтоБудетПодписывать.Должность))); 
	ИначеЕсли ЗначениеЗаполнено(ПараметрыСеанса.Пользователь.Сотрудник) Тогда
		КтоБудетПодписывать = ПараметрыСеанса.Пользователь.Сотрудник; 
		ДолжностьКтоБудетПодписывать = СокрЛП(г_Функции_Клиент.ПадежФИО(СокрЛП(КтоБудетПодписывать.Должность))); 
	Иначе
		ДолжностьКтоБудетПодписывать = "";	
	КонецЕсли;
	
	Если Найти(ДолжностьКтоБудетПодписывать,"-") > 0  Тогда
		ДолжностьКтоБудетПодписывать = СтрЗаменить(ДолжностьКтоБудетПодписывать,"-","а-");
	КонецЕсли;
	
	Если ЗначениеЗаполнено(КтоБудетПодписывать) Тогда	
		СотрудникРП = г_Функции_Клиент.ПадежФИО(КтоБудетПодписывать.Наименование);     
		
		Если Врег(Прав(КтоБудетПодписывать.Отчество,1))="А" Тогда
			ДействующегоИлиДействующей = "действующей";	
		Иначе
			ДействующегоИлиДействующей = "действующего";		
		КонецЕсли; 
		
	Иначе
		ДействующегоИлиДействующей = "действующего(ей)";
	КонецЕсли;		
	
	Если ТекущаяДоверенность <> Неопределено Тогда 	
		Основание = ТекущаяДоверенность.Номер + " от " + Формат(ТекущаяДоверенность.ДатаВыдачи, "ДФ=dd.MM.yy");		
		
		ОбластьМакета.Параметры.ОбАгенте         = СокрЛП(Организация.НаименованиеПолное) + ", в лице " + ДолжностьКтоБудетПодписывать + " " + СотрудникРП + ", " + ДействующегоИлиДействующей + " " + СокрЛП("на основании доверенности № " + Основание);	
		ОбластьМакета.Параметры.ОснованиеПодписи = "по доверенности № " + Основание;
	Иначе
		ОбластьМакета.Параметры.ОбАгенте         = СокрЛП(Организация.НаименованиеПолное) + ", в лице " + ДолжностьКтоБудетПодписывать + " " + СотрудникРП + ", " + ДействующегоИлиДействующей + " " + "на основании доверенности";
		ОбластьМакета.Параметры.ОснованиеПодписи = "по доверенности";
	КонецЕсли; 
	
	ОбластьМакета.Параметры.Сумма = Автомобили.Итог("Сумма");
	ОбластьМакета.Параметры.СуммаСтрокой = ЧислоПрописью(Автомобили.Итог("Сумма"), , ", , , , , , , , 0");
	ОбластьМакета.Параметры.СуммаПродажи = Автомобили.Итог("СуммаПродажи");
	ОбластьМакета.Параметры.СуммаПродажиПрописью = ЧислоПрописью(Автомобили.Итог("СуммаПродажи"), , ", , , , , , , , 0");	
	ОбластьМакета.Параметры.ВознаграждениеАгента = Формат(Автомобили.Итог("Вознаграждение"), "ЧДЦ=2; ЧН=0,00");  
	ОбластьМакета.Параметры.ВознаграждениеАгентаПрописью = ЧислоПрописью(Автомобили.Итог("Вознаграждение"), , ", , , , , , , , 0"); 
	
	Если Год(Дата) >= 2025 Тогда
		СтавкаНДС = Автомобили[0].СтавкаНДС;		
		СуммаНДС  = Формат(Автомобили.Итог("СуммаНДС"), "ЧДЦ=2; ЧН=0,00");  
		СуммаНДССтрокой = СокрЛП(ЧислоПрописью(Автомобили.Итог("СуммаНДС"), , ", , , , , , , , 0"));
		ОбластьМакета.Параметры.ВознаграждениеАгентаНДС = Строка(СтавкаНДС) + " в размере " + СуммаНДС + " (" + СуммаНДССтрокой + ") рублей";
	Иначе	
		ОбластьМакета.Параметры.ВознаграждениеАгентаНДС = "НДС не облагается";	
	КонецЕсли; 
	
	ТабДокумент.Вывести(ОбластьМакета);	
	//Иванченко 20250304 --
	
	Возврат ТабДокумент;
КонецФункции //ПечатьОтчетКомитентуЗаАвтомобилиПлюсАкт

//Бондаренко++ 20220909
Функция СМГ_РеализацияАвтомобилейНайти(ДокументПередачи,Автомобиль)
	
	РеалАвто = "";	
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	РеализованныеАвтомобилиОбороты.Контрагент,
	|	РеализованныеАвтомобилиОбороты.Автомобиль,
	|	РеализованныеАвтомобилиОбороты.ДокументПередачи,
	|	РеализованныеАвтомобилиОбороты.Регистратор КАК РеалАвто,
	|	РеализованныеАвтомобилиОбороты.КоличествоПриход
	|ИЗ
	|	РегистрНакопления.РеализованныеАвтомобили.Обороты(, , Регистратор, ) КАК РеализованныеАвтомобилиОбороты
	|ГДЕ
	|	РеализованныеАвтомобилиОбороты.ДокументПередачи = &ДокументПередачи
	|	И РеализованныеАвтомобилиОбороты.Автомобиль = &Автомобиль
	|	И РеализованныеАвтомобилиОбороты.КоличествоПриход = 1";
	
	Запрос.УстановитьПараметр("Автомобиль", Автомобиль);
	Запрос.УстановитьПараметр("ДокументПередачи", ДокументПередачи);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		РеалАвто = ВыборкаДетальныеЗаписи.РеалАвто;
	КонецЦикла;
	
	Возврат РеалАвто;
	
КонецФункции // СМГ_РеализацияАвтомобилейНайти(ДокументПоступления)
//Бондаренко-- 20220909

//Бондаренко++ 20221221
Процедура СМГ_ПриЗаписи()
	СМГ_СоздатьИлиОбновитьСФВыданный();
КонецПроцедуры  //СМГ_ПриЗаписи()

Процедура СМГ_СоздатьИлиОбновитьСФВыданный()
	
	Если ЭтотОбъект.ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если НЕ Организация.СистемаНалогообложения = Перечисления.СистемыНалогообложения.Общая Тогда
		Возврат;
	КонецЕсли;	
	
	СФ_выданный = Неопределено;
	
	Если Автомобили.Итог("Вознаграждение") > 0 Тогда
		СФ_выданный = Документы.СчетФактураВыданный.СоздатьДокумент(); 
		СФ_выданный.Комментарий = "Автоматически создан "+СокрЛП(ТекущаяДата());
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	СчетФактураВыданный.Ссылка КАК СФ,
	|	СчетФактураВыданный.ДокументОснование,
	|	СчетФактураВыданный.Проведен
	|ИЗ
	|	Документ.СчетФактураВыданный КАК СчетФактураВыданный
	|ГДЕ
	|	СчетФактураВыданный.ДокументОснование = &ДокументОснование";
	
	Запрос.УстановитьПараметр("ДокументОснование", ЭтотОбъект.Ссылка);
	
	Результат = Запрос.Выполнить();		
	ВыборкаДетальныеЗаписи = Результат.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		СФ_выданный = ВыборкаДетальныеЗаписи.СФ.ПолучитьОбъект();
		Прервать;
	КонецЦикла; 
	
	Если СФ_выданный = Неопределено Тогда
		// Так как "СуммаНДС" равна нулю и старый счет-фактура выданный не найден
		Возврат;
	КонецЕсли;
	
	СФ_выданный.Заполнить(ЭтотОбъект.Ссылка);
	СФ_выданный.Дата = ЭтотОбъект.Дата;      
	СФ_выданный.Номер = ЭтотОбъект.Номер;      				
	
	ФлЭтотОбъектПроведен = ЭтотОбъект.Проведен;
	ФлЭтотОбъектПометкаУдаления = ЭтотОбъект.ПометкаУдаления;
	
	СФ_выданный.Проведен = ФлЭтотОбъектПроведен;			
	СФ_выданный.ПометкаУдаления = ФлЭтотОбъектПометкаУдаления;
	
	Если ФлЭтотОбъектПометкаУдаления Тогда               
		Попытка СФ_выданный.Записать(РежимЗаписиДокумента.Запись); Исключение КонецПопытки; 
	Иначе                                                           
		Если ФлЭтотОбъектПроведен Тогда
			Попытка СФ_выданный.Записать(РежимЗаписиДокумента.Проведение); Исключение КонецПопытки; 					
		Иначе
			Попытка СФ_выданный.Записать(РежимЗаписиДокумента.ОтменаПроведения); Исключение КонецПопытки; 					
		КонецЕсли; 
	КонецЕсли;
	
КонецПроцедуры //СМГ_СоздатьИлиОбновитьСФВыданный()
//Бондаренко-- 20221221 

// Семенихин 01.03.2023 +++++
Функция НайтиСуммуПоступления(ДокументПоступления, Автомобиль)
	ЗапросПоступление = Новый Запрос();
	ЗапросПоступление.УстановитьПараметр("ДокументПоступления", ДокументПоступления);
	ЗапросПоступление.УстановитьПараметр("Автомобиль", Автомобиль);
	ЗапросПоступление.УстановитьПараметр("ПеремещениеАвтомобилей", Справочники.ХозОперации.ПеремещениеАвтомобилей);
	ЗапросПоступление.Текст =
	"ВЫБРАТЬ
	|	ОстаткиАвтомобилей.Сумма
	|ИЗ
	|	РегистрНакопления.ОстаткиАвтомобилей КАК ОстаткиАвтомобилей
	|ГДЕ
	|	ОстаткиАвтомобилей.Партия = &ДокументПоступления
	|	И ОстаткиАвтомобилей.Автомобиль = &Автомобиль
	|	И ОстаткиАвтомобилей.ХозОперация <> &ПеремещениеАвтомобилей
	|	И ОстаткиАвтомобилей.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)";
	
	Результат = ЗапросПоступление.Выполнить();
	Если Результат.Пустой() Тогда
		Возврат 0;
		
	Иначе
		ВыборкаРезулитат = Результат.Выбрать();
		СуммаПоступления = 0;
		Пока ВыборкаРезулитат.Следующий() Цикл
			СуммаПоступления = СуммаПоступления + ВыборкаРезулитат.Сумма;
		КонецЦикла;
		
		Возврат СуммаПоступления;
	КонецЕсли;	
КонецФункции
// Семенихин 10.04.2023 ----- 

//Бондаренко++ 20230601
Функция СМГ_ПолучитьСотраОтпустил(Ссылка)
	
	ОтпустилТекст = "";
	
	Если НЕ обЗначениеНеЗаполнено(Ссылка.Подписант) Тогда
		ПодписантТек = Ссылка.Подписант;
	Иначе
		ПодписантТек = ПараметрыСеанса.Пользователь.Сотрудник;
	КонецЕсли;
	
	ТекущаяДоверенность = СМ_ФормированиеНовыхОбъектов.ПолучитьДоверенность(ПодписантТек,Ссылка.Организация);
	Если ТекущаяДоверенность<>Неопределено Тогда
		ОтпустилТекст = СокрЛП(ПодписантТек.Наименование)+" "+"по доверенности № "+ТекущаяДоверенность.Номер+ " от " + Формат(ТекущаяДоверенность.ДатаВыдачи,"ДФ=dd.MM.yy");;
	Иначе	
		ПодписантТек = дкОтветственноеЛицо(Ссылка.ПолучитьОбъект(),Перечисления.ВидыОбъектовСведений.Руководитель);
		ОтпустилТекст = СокрЛП(ПодписантТек.РуководительПредставление);
	КонецЕсли;
	
	Возврат ОтпустилТекст; 
	
КонецФункции // СМГ_ПолучитьСотраОтпустил(Ссылка)
//Бондаренко-- 20230601

////////////////////////////////////////////////////////////////////////////////
// ИСПОЛНЯЕМАЯ ЧАСТЬ МОДУЛЯ

// сохранение ссылки на коллекцию прав, настроек и окружения
Права = Неопределено;
#Если Клиент Тогда
	Права = глПрава;
#КонецЕсли
