&НаКлиенте
Перем Эксель Экспорт, МасВыб Экспорт;
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Попытка
		ТабНастройка=ХранилищеОбщихНастроек.Загрузить("ПомощникАвтобизнеса","НастройкаЗагрузки");
		Если ТипЗнч(ТабНастройка)<>Тип("ТаблицаЗначений") Тогда
			ТабНастройка=НастройкаЗагрузки.Выгрузить();
		КонецЕсли;
		Если ТабНастройка.Колонки.Найти("Вкл")=Неопределено Тогда
			ТабНастройка.Колонки.Добавить("Вкл",Новый ОписаниеТипов("Булево"));
		КонецЕсли;
		Если ТабНастройка.Колонки.Найти("Лист")=Неопределено Тогда
			ТабНастройка.Колонки.Добавить("Лист",Новый ОписаниеТипов("Строка"));
		КонецЕсли;
		Если ТипЗнч(ТабНастройка)=Тип("ТаблицаЗначений") И ТабНастройка.Количество()>0 Тогда
			НастройкаЗагрузки.Загрузить(ТабНастройка);
		КонецЕсли;
	Исключение
	КонецПопытки;
КонецПроцедуры

&НаКлиенте
Процедура НастройкаЗагрузкиПутьКФайлуНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ДиалогОткрытияФайла = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	Фильтр = "Файлы прайс-листов(*.xlsx; *.xls; *.csv; *.txt)|*.xlsx; *.xls; *.csv; *.txt|Все файлы(*.*)|*.*";
	ДиалогОткрытияФайла.Фильтр = Фильтр;
	ДиалогОткрытияФайла.Заголовок = "Выберите файл";
	ДиалогОткрытияФайла.МножественныйВыбор = Ложь;
	ДиалогОткрытияФайла.Выбрать();
	Если ДиалогОткрытияФайла.ВыбранныеФайлы.Количество() <> 0 тогда
		Путь = ДиалогОткрытияФайла.ВыбранныеФайлы[0];
		Элементы.НастройкаЗагрузки.ТекущиеДанные.ПутьКфайлу = Путь;
		СписокВыбора=Неопределено;
		НастройкаЗагрузкиЛистНачалоВыбора(Элемент, СписокВыбора, СтандартнаяОбработка);
		Элементы.НастройкаЗагрузки.ТекущиеДанные.Лист = СписокВыбора[0].Значение;
	КонецЕсли;
	СтандартнаяОбработка=Ложь;	
КонецПроцедуры

&НаКлиенте
Процедура Сохранить(Команда)
	Строки="";
	НСТР=1;
	Если НастройкаЗагрузки.Количество()>0 Тогда
		Для Каждого Стр Из НастройкаЗагрузки Цикл   
			Если Стр.Артикул=0 или Стр.Время=0 ИЛИ Стр.Наименование=0 ИЛИ Стр.Производитель=0 ИЛИ Стр.Цена=0 ИЛИ  
				НЕ ЗначениеЗаполнено(Стр.Поставщик) ИЛИ ПустаяСтрока(Стр.ПутьКФайлу) Тогда
				Строки=Строки+" "+Строка(НСТР);
				СохранитьЗакрытьФорму=Ложь;  
			КонецЕсли;
			НСТР=НСТР+1;
		КонецЦикла;
	КонецЕсли;
	Если Строки<>"" Тогда	
		Если Вопрос("Не полностью заполнены строки:"+Строки+Символы.ПС+"Сохранить и завершить редактирование?",
			РежимДиалогаВопрос.ДаНет)=КодВозвратаДиалога.Нет Тогда
			Возврат;
		КонецЕсли;
	КонецЕсли;
	СохранитьНаСервере();
	ЭтаФорма.Закрыть();
КонецПроцедуры

&НаСервере
Процедура СохранитьНаСервере()
	ТабНастройка=НастройкаЗагрузки.Выгрузить();
	ХранилищеОбщихНастроек.Сохранить("ПомощникАвтобизнеса","НастройкаЗагрузки",ТабНастройка);
КонецПроцедуры

&НаКлиенте
Процедура ИзменитьФлажки(Команда)
	Значение=Команда.Имя="УстановитьФлажки";
	Для Каждого Стр Из НастройкаЗагрузки Цикл
		Стр.Вкл=Значение;
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура НастройкаЗагрузкиЛистНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка=Ложь;
	Если СписокФайла=Элементы.НастройкаЗагрузки.ТекущиеДанные.ПутьКФайлу Тогда 
		ДанныеВыбора=МасВыб; Возврат;
	КонецЕсли;
	Попытка
		Если Эксель=Неопределено Тогда
			Эксель = Новый COMОбъект("Excel.Application"); 
			Эксель.Displayalerts = 0;
		КонецЕсли;
		Книга = Эксель.WorkBooks.Open(СокрЛП(Элементы.НастройкаЗагрузки.ТекущиеДанные.ПутьКФайлу),0,Истина);
	Исключение
		Предупреждение(ОписаниеОшибки());
		Возврат;
	КонецПопытки;
	КолЛист = Книга.Sheets.Count;
	МасВыб=Новый СписокЗначений;
	Для Инд=1 По КолЛист Цикл
		МасВыб.Добавить(Книга.WorkSheets(Инд).Name);
	КонецЦикла;
	СписокФайла=Элементы.НастройкаЗагрузки.ТекущиеДанные.ПутьКФайлу;
	ДанныеВыбора=МасВыб;
	Книга.Close();
КонецПроцедуры

&НаКлиенте
Процедура НастройкаЗагрузкиЛистОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	Элементы.НастройкаЗагрузки.ТекущиеДанные.Лист=ВыбранноеЗначение;
	СтандартнаяОбработка=Ложь;
	ЭтаФорма.ТекущийЭлемент=Элемент;
КонецПроцедуры


