
Процедура ДобавитьОбновитьЗапись(ДокументСсылка) Экспорт	
	МенеджерЗаписей = СоздатьМенеджерЗаписи();
	МенеджерЗаписей.Документ = ДокументСсылка;
	МенеджерЗаписей.Прочитать();
	
	Если МенеджерЗаписей.Выбран() Тогда 
		МенеджерЗаписей.Автор			= ПараметрыСеанса.Пользователь;
		МенеджерЗаписей.ДатаИзменения	= ТекущаяДата();
		МенеджерЗаписей.Записать(Истина);
	Иначе  
		МенеджерЗаписей.Документ		= ДокументСсылка;
		МенеджерЗаписей.Автор			= ПараметрыСеанса.Пользователь;
		МенеджерЗаписей.ДатаИзменения	= ТекущаяДата();
		МенеджерЗаписей.Записать(Истина);
	КонецЕсли;
КонецПроцедуры
	
//	Параметры:
//		ДокументСсылка - ДокументСсылка - Любая ссылка документа
//	Возвращаемое значение:
//		Дата:
//		- Запись присутсвует, вернет заполненную дату
//		- Запись отсутствует, вернет пустую дату (01.01.0001 0:00:00)
функция ПолучитьДатуиИзмененяДокумента(ДокументСсылка) Экспорт	
	ДанныеЗаписи = Получить(Новый Структура("Документ",ДокументСсылка));
	Возврат ДанныеЗаписи.ДатаИзменения	
КонецФункции