//+ СКД
&НаСервере
//Для источника данных на основе основной таблицы
Функция ИсточникДанныхФормы(Форма,ИмяСписка) Экспорт 
	ТекстЗапроса=?(Форма[ИмяСписка].ОсновнаяТаблица<>"","Выбрать * Из "+Форма[ИмяСписка].ОсновнаяТаблица,"");
	Схема=СхемаПоЗапросу(ТекстЗапроса);
	URLСхемы=ПоместитьВоВременноеХранилище(Схема,Форма.УникальныйИдентификатор);
	Возврат Новый ИсточникДоступныхНастроекКомпоновкиДанных(URLСхемы);
КонецФункции

&НаСервере
//Для источника данных "произвольный запрос", запрос можно получить из формы (толстый клиент) ЭтаФорма[ИмяДинамическогоСписка].ТекстЗапроса
Функция ПроизвольныйИсточникДанных(ТекстЗапроса) Экспорт 
	Схема=СхемаПоЗапросу(ТекстЗапроса);
	URLСхемы=ПоместитьВоВременноеХранилище(Схема,Новый УникальныйИдентификатор);
	Возврат Новый ИсточникДоступныхНастроекКомпоновкиДанных(URLСхемы);
КонецФункции

&НаСервере
Функция СхемаПоЗапросу(ТекстЗапроса) Экспорт
	Схема=Новый СхемаКомпоновкиДанных;
	ИсточникДанных=Схема.ИсточникиДанных.Добавить();
	ИсточникДанных.Имя="Источник";
	ИсточникДанных.ТипИсточникаДанных="Local";
	НаборДанных=Схема.НаборыДанных.Добавить(Тип("НаборДанныхЗапросСхемыКомпоновкиДанных"));
	НаборДанных.Имя="НаборДанных";
	НаборДанных.ИсточникДанных="Источник";
	НаборДанных.Запрос=ТекстЗапроса;
	Возврат Схема
КонецФункции

&НаКлиенте
Процедура ОткрытьФормуОтбора(Форма, ИсточникДоступныхНастроек, КомпоновщикНастроек, ФункцияОповещения, ПараметрФункцииОповещения,Настройки=Ложь,ФиксированныеНастройки=Ложь) Экспорт
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Заголовок", "Настройка отбора");
	ПараметрыФормы.Вставить("ИсточникДоступныхНастроек", ИсточникДоступныхНастроек);
	
	//ПараметрыФормы.Вставить("ПользовательскиеНастройки", ЭтаФорма[ИмяСписка].КомпоновщикНастроек.ПользовательскиеНастройки);
	Если ФиксированныеНастройки Тогда
		ПараметрыФормы.Вставить("ФиксированныеНастройкиОтбор", Истина);
		ПараметрыФормы.Вставить("ФиксированныеНастройки", КомпоновщикНастроек.ФиксированныеНастройки);
	КонецЕсли;
	Если Настройки Тогда
		ПараметрыФормы.Вставить("НастройкиОтбор", Истина);
		ПараметрыФормы.Вставить("Настройки", КомпоновщикНастроек.Настройки);
	КонецЕсли;
	
	Если СтараяПлатформа() Тогда
		Сообщить("Функционал не доступен", СтатусСообщения.Информация);
	Иначе
		Выполнить("ОткрытьФорму(""ОбщаяФорма.Renault_ОтборСписка"",ПараметрыФормы,Форма,Форма.УникальныйИдентификатор,,,Новый ОписаниеОповещения(ФункцияОповещения,Форма,ПараметрФункцииОповещения),РежимОткрытияОкнаФормы.БлокироватьОкноВладельца)")
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьКомпоновщикНастроек(Форма,КомпоновщикНастроек,ФункцияОповещения,ПараметрФункцииОповещения=Неопределено,Настройки=Истина,ФиксированныеНастройки=Ложь) Экспорт
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Заголовок", "Настройка отбора");
	ПараметрыФормы.Вставить("КомпоновщикНастроек", КомпоновщикНастроек);
	
	Если ФиксированныеНастройки Тогда
		ПараметрыФормы.Вставить("ФиксированныеНастройкиОтбор", Истина);
		ПараметрыФормы.Вставить("ФиксированныеНастройки", КомпоновщикНастроек.ФиксированныеНастройки);
	КонецЕсли;
	Если Настройки Тогда
		ПараметрыФормы.Вставить("НастройкиОтбор", Истина);
		ПараметрыФормы.Вставить("Настройки", КомпоновщикНастроек.Настройки);
	КонецЕсли;
	
	Если СтараяПлатформа() Тогда
		Сообщить("Функционал не доступен",СтатусСообщения.Информация);
	Иначе
		Выполнить("ОткрытьФорму(""ОбщаяФорма.Renault_ОтборСписка"",ПараметрыФормы,Форма,Форма.УникальныйИдентификатор,,,Новый ОписаниеОповещения(ФункцияОповещения,Форма,ПараметрФункцииОповещения),РежимОткрытияОкнаФормы.БлокироватьОкноВладельца)")
	КонецЕсли;
	
КонецПроцедуры
//- СКД
&НаСервере
Функция СотрудникПользователя(Пользователь) Экспорт
	
	Запрос = Новый Запрос("Выбрать Первые 1 Сотрудник Из Справочник.Пользователи ГДЕ Ссылка=&Ссылка");
	Запрос.УстановитьПараметр("Ссылка", Пользователь);
	Выборка = Запрос.Выполнить().Выбрать();
	Выборка.Следующий();
	Возврат Выборка.Сотрудник;
	
КонецФункции

&НаСервере
Функция ПраваПользователя(Пользователь) Экспорт
	
	Запрос = Новый Запрос("Выбрать ПраваИНастройки Из РегистрСведений.Renault_ПользователиИШаблоныПравИНастроек ГДЕ Пользователь=&Пользователь");
	Запрос.УстановитьПараметр("Пользователь", Пользователь);
	Выборка = Запрос.Выполнить().Выбрать();
	Выборка.Следующий();
	Возврат Выборка.ПраваИНастройки;
	
КонецФункции

&НаСервере
//версии моделей автомобилей
Функция ВариантыКомплектаций(Модель, Дата = Неопределено) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Модель", Модель);
	Запрос.УстановитьПараметр("Дата", ?(Дата = Неопределено, ТекущаяДата(), Дата));
	Запрос.Текст = "
	|Выбрать ВариантКомплектации
	|ИЗ РегистрСведений.Renault_ТарифНаКомплектацииАвтомобилей.СрезПоследних(,
	|	Тариф В(
	|		Выбрать Первые 1 Ссылка Из Справочник.Renault_ТарифыНаАвтомобили
	|		ГДЕ Активен И НачалоДействия<=&Дата И (ОкончаниеДействия>=&Дата ИЛИ ОкончаниеДействия=ДатаВремя(1,1,1))
	|		Упорядочить По НачалоДействия УБЫВ
	|	) И Модель=&Модель
	|)
	|ГДЕ ДоступноКЗаказуВПроизводство
	|Упорядочить По ВариантКомплектации.Наименование
	|";
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("ВариантКомплектации")
	
КонецФункции

&НаСервере
//по умолчанию фреймворк IE11+, но в настройках шаблона можно задать IE8
Функция ПолучитьИмяФреймворкаОтчетов() Экспорт
	Возврат ?(Справочники.Renault_СлужебныеНастройкиБазыДанных[ПараметрыСеанса.DMS_Бренд.Наименование].ФреймворкОтчетов = "", "Renault_Highcharts", Справочники.Renault_СлужебныеНастройкиБазыДанных[ПараметрыСеанса.DMS_Бренд.Наименование].ФреймворкОтчетов);
КонецФункции

//ОФУ
&НаКлиенте
Функция ПолучитьОтделОФУ(ЭтаФорма,Отдел="") Экспорт //определяем отдел КСО по КлассификацияRenault=КСО
		
	спОтделы = Renault_ОбщиеФункцииСервер.ПолучитьОтделОФУнаСервере(); 
	
	Если спОтделы.Количество() = 1 Тогда Возврат спОтделы[0] КонецЕсли;
	
	Сп = Новый СписокЗначений;
	Сп.ЗагрузитьЗначения(спОтделы);
	Если Отдел <> "" И Сп.НайтиПоЗначению(Отдел)<>Неопределено Тогда
		Сп.НайтиПоЗначению(Отдел).Пометка = Истина;
	КонецЕсли;
	
	Парам = Новый Структура;
	Парам.Вставить("Список", Сп);
	Парам.Вставить("Заголовок", "Отдел консультации (ОФУ)");
	Парам.Вставить("МножественныйВыбор", Ложь);
	Парам.Вставить("КоличествоЭлементовВСтроке", 4);
	Парам.Вставить("ШиринаЭлемента", 12);
	Парам.Вставить("ВысотаЭлемента", 2);
	Возврат ОткрытьФормуМодально("ОбщаяФорма.Renault_ДиалогВыбораСпискаЗначений", Парам, ЭтаФорма);
	
КонецФункции

&НаКлиенте
Функция ПолучитьМенеджераОФУ(ЭтаФорма, ТекМенеджер = "") Экспорт
	
	спМенеджеры= Renault_ОбщиеФункцииСервер.ПолучитьМенеджераОФУнаСервере();

	Если спМенеджеры.Количество()=1 Тогда Возврат спМенеджеры[0] КонецЕсли;
	
	Сп=Новый СписокЗначений; Сп.ЗагрузитьЗначения(спМенеджеры);
	Если ТекМенеджер<>"" Тогда
		Для Каждого Эл Из Сп Цикл Если Эл.Значение=ТекМенеджер Тогда Эл.Пометка=Истина КонецЕсли КонецЦикла;	
	КонецЕсли;
	
	Парам=Новый Структура;
	Парам.Вставить("Список",Сп);
	Парам.Вставить("Заголовок","Сотрудник отдела (ОФУ)");
	Парам.Вставить("МножественныйВыбор",Ложь);
	Парам.Вставить("КоличествоЭлементовВСтроке",4);
	Парам.Вставить("ШиринаЭлемента",17);
	Парам.Вставить("ВысотаЭлемента",2);
	Возврат ОткрытьФормуМодально("ОбщаяФорма.Renault_ДиалогВыбораСпискаЗначений",Парам,ЭтаФорма);
КонецФункции	

Функция СтараяПлатформа(СравнитьСВерсией = 2) Экспорт
	
	Перем Старая;
	СисИнфо = Новый СистемнаяИнформация;
	Попытка
		Старая = (Число(Сред(СисИнфо.ВерсияПриложения,3,1)) <= СравнитьСВерсией);
	Исключение
		Старая=Ложь;
	КонецПопытки;
	
	Если Старая Тогда
		Сообщить("Ваша платформа устарела." + Символы.ПС + Символы.Таб + "Корректная работа приложения не гарантируется", СтатусСообщения.ОченьВажное);
		Возврат Истина;
	Иначе
		Возврат Ложь;
	КонецЕсли;
	
КонецФункции

&НаКлиенте
Функция УбратьИзНомераТелефонаВсеБуквы(НомерТелефона) Экспорт
	
	ТолькоЦифрыНомера = "";
	Для а = 1 По СтрДлина(НомерТелефона) Цикл
		Если СтрЧислоВхождений("1234567890", Сред(НомерТелефона,а,1)) > 0 Тогда
			ТолькоЦифрыНомера = ТолькоЦифрыНомера + Сред(НомерТелефона,а,1);
		КонецЕсли;
	КонецЦикла;
	Возврат ТолькоЦифрыНомера;
	
КонецФункции

&НаКлиенте
Функция ПреобразоватьНомерДляСохранения(Знач НомерТелефона, ЧислоСимволов) Экспорт
	
	Префикс = "1";
	НомерТелефона = УбратьИзНомераТелефонаВсеБуквы(НомерТелефона);
	Возврат ?(НЕ ЗначениеЗаполнено(НомерТелефона), 0, Число(Префикс + Прав(СокрЛП(НомерТелефона), ЧислоСимволов)));
	
КонецФункции

//#Область мультибрендовость
&НаКлиенте
//Логотип,ОсновнойЦвет,ДопЦвет1,ДопЦвет2,ЦветФона,ЦветТекста 
Функция МультибрендПараметрыОформления() Экспорт Возврат Renault_ОбщиеФункцииСервер.МультибрендПараметрыОформления() КонецФункции 

&НаКлиенте
//где МассивЭлементовАкт - массив элементов формы, логитип и сама форма
// МассивЭлементовПас - не активные элементы кнопки и пр..
Процедура МультибрендОсновноеОформление(МассивЭлементовАкт,МассивЭлементовПас="") Экспорт 
	Парам=МультибрендПараметрыОформления();
	ОсновнойЦвет=Вычислить(Парам.ОсновнойЦвет);
	ДопЦвет1=Вычислить(Парам.ДопЦвет1);
	
	Попытка
		ТипКн = Тип("Кнопка");
		ОбычноеПриложение = Истина;
	Исключение
		ОбычноеПриложение = Ложь;
	КонецПопытки;
	
	ТипКнопка = ?(ОбычноеПриложение,Тип("Кнопка"),Неопределено);	
	ТипПолеКартинки = ?(ОбычноеПриложение,Тип("ПолеКартинки"),Неопределено);	
	ТипПолеВвода = ?(ОбычноеПриложение,Тип("ПолеВвода"),Неопределено);
	ТипДекорацияФормы = ?(ОбычноеПриложение,Тип("ДекорацияФормы"),Неопределено);
	ТипФорма = ?(ОбычноеПриложение,Тип("Форма"),Неопределено);
	
	Для Каждого Эл Из МассивЭлементовАкт Цикл
		
		Если ТипЗнч(Эл)=ТипКнопка Тогда
			Эл[?(ОбычноеПриложение,"ЦветФонаКнопки","ЦветФона")]=ОсновнойЦвет;
			Эл.ЦветРамки=ОсновнойЦвет;
			Эл.ЦветТекста=ОсновнойЦвет;
		ИначеЕсли ТипЗнч(Эл)=ТипПолеКартинки Тогда
			Эл.Картинка=Вычислить(Парам.Логотип);
		ИначеЕсли ТипЗнч(Эл)=ТипФорма Тогда
			Эл.Панель.ЦветФона=Вычислить(Парам.ЦветФона);
		ИначеЕсли ТипЗнч(Эл) = ТипПолеВвода Тогда
			Эл.ЦветФона=ОсновнойЦвет;
			Эл.ЦветФонаКнопки=ОсновнойЦвет;
		ИначеЕсли ТипЗнч(Эл) = ТипДекорацияФормы Тогда
			Эл.Картинка = Вычислить(Парам.Логотип);
		Иначе
			Эл.ЦветФона=ОсновнойЦвет;
		КонецЕсли;	
	КонецЦикла;
	
	Если МассивЭлементовПас="" Тогда Возврат КонецЕсли;
	Для Каждого Эл Из МассивЭлементовПас Цикл
		Если ТипЗнч(Эл)=ТипКнопка Тогда
			Эл[?(ОбычноеПриложение,"ЦветФонаКнопки","ЦветФона")]=ДопЦвет1;
			Эл.ЦветРамки=ДопЦвет1;
			Эл.ЦветТекста=ДопЦвет1;
		Иначе
			Эл.ЦветФона=ДопЦвет1;
		КонецЕсли;	
	КонецЦикла;
	
КонецПроцедуры	

&НаКлиенте
//СвойствоЭлемента - типа ЦветФона, ЦветТекста ...
//Параметр - имя параметра из МультибрендПараметрыОформления()
Процедура МультибрендЗадатьОформление(МассивЭлементов,СвойствоЭлемента,Параметр) Экспорт 
	ЗначениеПараметра=Вычислить(МультибрендПараметрыОформления()[Параметр]);
	Для Каждого Эл Из МассивЭлементов Цикл Выполнить("Эл."+СвойствоЭлемента+"=ЗначениеПараметра") КонецЦикла
КонецПроцедуры	
//#КонецОбласти

