
Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)
	Если Не Renault_РаботаСПравамиПользователя.ЕстьПравоОткрытияОтчетапродаж(ПараметрыСеанса.Пользователь,"CRM_РеестрКоммерческихПредложений") тогда
		Сообщить("Недостаточно прав доступа.");
		СтандартнаяОбработка = Ложь;
		Отказ = Истина;
		Возврат;
	КонецЕсли;	
	СтандартнаяОбработка = Ложь;
	
	// переработаем СКД на базе выбранных настроек
	//СформироватьСхемуКомпоновкиДанных();
	//
	НастройкиОтчета = КомпоновщикНастроек.ПолучитьНастройки();
	//
	//ЗаполнитьНастройкиОтчета(НастройкиОтчета);

	//    Далее, устанавливаем значения параметров и загружаем заполненные настройки
	НастройкиОтчета.ПараметрыДанных.УстановитьЗначениеПараметра("Период", Период);
	НастройкиОтчета.ПараметрыДанных.УстановитьЗначениеПараметра("ДилерскийЦентр", ДилерскийЦентр);
	КомпоновщикНастроек.ЗагрузитьНастройки(НастройкиОтчета);
	
	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
	МакетКомпоновки = КомпоновщикМакета.Выполнить(СхемаКомпоновкиДанных, КомпоновщикНастроек.Настройки);

	ПроцессорКомпоновкиДанных = Новый ПроцессорКомпоновкиДанных;
	ПроцессорКомпоновкиДанных.Инициализировать(МакетКомпоновки);
	
	ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент;
	ПроцессорВывода.УстановитьДокумент(ДокументРезультат);
	ПроцессорВывода.Вывести(ПроцессорКомпоновкиДанных);
	
КонецПроцедуры
