// Модуль документа Выписка

////////////////////////////////////////////////////////////////////////////////
// ПЕРЕМЕННЫЕ ОБЪЕКТА

Перем Права Экспорт;				// Переменная объекта - ссылка на коллекцию прав, настроек и переменных окружения
Перем РезультатОбработки Экспорт;	// Переменная для накопления результатов проведения по модулям наборов записей
Перем ОбработкаЗначенияСвойствОбъектов Экспорт; // Переменная для хранения значения свойств основания/объекта копирования
Перем СообщениеОбОшибке Экспорт;	// Переменная для накопления сообщений. Если равна "Неопределено", то сообщения выводятся на экран, иначе накапливаются в переменной
Перем ОбработкаРасчетСкидок Экспорт;              // Переменная для хранения ссылки на обработку "Расчет скидок". Данная обработка содержит необходимые
Перем ЗначениеСкидкиНаценки Экспорт;
Перем СуммаСкидкиНаценки Экспорт;


////////////////////////////////////////////////////////////////////////////////
// ЭКСПОРТНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ ДОПОЛНИТЕЛЬНЫХ МЕТОДОВ ОБЪЕКТА

// Возвращает структуру обязательных / уникальных реквизитов документа
// Возвращаемая структура содержит строковые идентификаторы реквизитов или вложенные структуры для табличных частей
// Для реквизита значение структуры содержит число 1-Обязательный, 2-Уникальный, 3-Уникальный и обязательный
Функция ПолучитьОбязательныеРеквизиты() Экспорт
	// Обязательные поля таблицы состава
	ОбязательныеСостав=Новый Структура();
	ОбязательныеСостав.Вставить("СтатьяДДС",1);
	ОбязательныеСостав.Вставить("Контрагент",1);
	//Гэндальф+++
	//ОбязательныеСостав.Вставить("ДоговорВзаиморасчетов",1);
    //Гэндальф---
	
	// Обязательные реквизиты документа
	ОбязательныеРеквизиты=Новый Структура();
	ОбязательныеРеквизиты.Вставить("Автор",1);
	ОбязательныеРеквизиты.Вставить("БанковскийСчет",1);
	ОбязательныеРеквизиты.Вставить("Организация",1);
	ОбязательныеРеквизиты.Вставить("ПодразделениеКомпании",1);
	ОбязательныеРеквизиты.Вставить("ХозОперация",1);
	ОбязательныеРеквизиты.Вставить("ВалютаДокумента",1);
	ОбязательныеРеквизиты.Вставить("КурсДокумента",1);
	Если ХозОперация=Справочники.ХозОперации.СтрокаБанковскойВыписки Тогда
		ОбязательныеРеквизиты.Вставить("СтатьяДДС",1);
		ОбязательныеРеквизиты.Вставить("Контрагент",1);
		//Гэндальф+++
		//ОбязательныеРеквизиты.Вставить("ДоговорВзаиморасчетов",1);
		//Гэндальф---
		ОбязательныеРеквизиты.Вставить("СтавкаНДС",1);
		Если ДляПробитияНаФР Тогда
			ОбязательныеРеквизиты.Вставить("ТипСпособаРасчетаККТ",1);
			ОбязательныеРеквизиты.Вставить("ТипРасчета", 1);
		КонецЕсли;
	КонецЕсли;
	ОбязательныеРеквизиты.Вставить("Состав",ОбязательныеСостав);
	
	Возврат ОбязательныеРеквизиты;
КонецФункции // ПолучитьОбязательныеРеквизиты()

// Проверяет корректность заполнения объекта.
// может управляться булевыми флагами выполняемых проверок Заполнение, Уникальность
// (могут быть и другие необязательные)
// Обычно выполняется универсальным обработчиком, но могут быть добавлены доп. проверки
//
// Параметры:
//  Ошибки       - строка, в случае некорректного заполнения содержит описанием возникших ошибок, 
//  ДопРеквизиты - структура, на вход может быть передана структура с дополнительными реквизитами для проверки,
//  Заполнение   - булево, флаг проверки, 
//  Уникальность - булево, флаг проверки.
//
// Возвращаемое значение:
//  Булево - Возвращает Истина если все заполнено корректно и Ложь иначе.
// 
Функция ПроверитьКорректность(Ошибки="", ДопРеквизиты=Неопределено, Заполнение=Истина, Уникальность=Истина) Экспорт
	// Здесь могут быть определены дополнительные к стандартным обязательным реквизитам условия проверки
	Результат = дкПроверитьКорректность(ЭтотОбъект, Ошибки, ДопРеквизиты, Заполнение, Уникальность);
	
	Если ХозОперация=Справочники.ХозОперации.СтрокаБанковскойВыписки Тогда
		Если СуммаДокументаПриход<>Состав.Итог("СуммаПриход") Тогда
			дкДобавитьОшибку(Ошибки, "Сумма прихода документа не равна сумме прихода платежей.");
			Результат = Ложь;
		КонецЕсли;
		Если СуммаДокументаРасход<>Состав.Итог("СуммаРасход") Тогда
			дкДобавитьОшибку(Ошибки, "Сумма расхода документа не равна сумме расхода платежей.");
			Результат = Ложь;
		КонецЕсли;
		Если СуммаНДС<>Состав.Итог("СуммаНДС") Тогда
			дкДобавитьОшибку(Ошибки, "Сумма НДС документа не равна сумме НДС платежей.");
			Результат = Ложь;
		КонецЕсли;
		Если СуммаУслуг<>Состав.Итог("СуммаУслуг") Тогда
			дкДобавитьОшибку(Ошибки, "Сумма банковских услуг документа не равна сумме услуг платежей.");
			Результат = Ложь;
		КонецЕсли;
		
		Для Каждого стрСостав Из Состав Цикл
			Если обЗначениеНеЗаполнено(стрСостав.Сделка) Тогда
				Продолжить;
			КонецЕсли;
			
			Если дкДокументЕстьРеквизитШапки("Контрагент", стрСостав.Сделка.Метаданные().Имя) И стрСостав.Контрагент <> стрСостав.Сделка.Контрагент Тогда
				дкДобавитьОшибку(Ошибки, "В строке №" + стрСостав.НомерСтроки + " контрагент сделки не совпадает с контрагентом документа.");
				Результат = Ложь;
			КонецЕсли;
			Если дкДокументЕстьРеквизитШапки("ДоговорВзаиморасчетов", стрСостав.Сделка.Метаданные().Имя) И стрСостав.ДоговорВзаиморасчетов <> стрСостав.Сделка.ДоговорВзаиморасчетов Тогда
				дкДобавитьОшибку(Ошибки, "В строке №" + стрСостав.НомерСтроки + " договор сделки не совпадает с договором документа.");
				Результат = Ложь;
			КонецЕсли;
			
		КонецЦикла;
	КонецЕсли;
	
	Для Каждого стрСостав Из Состав Цикл
		Если стрСостав.СуммаПриход < стрСостав.СуммаУслуг И стрСостав.СуммаРасход < стрСостав.СуммаУслуг Тогда
			дкДобавитьОшибку(Ошибки, "В строке №" + стрСостав.НомерСтроки + " сумма услуг превышает сумму платежа.");
			Результат = Ложь;
		КонецЕсли;
	КонецЦикла;
	
	// Проведем проверку соответствия организации документа организациям некоторых реквизитов документа.
	// Такую проверку необходимо осуществлять, если баланс в системе ведется по организации,
	// или если установлен способ контроля корректности
	// договора и склада документа. Причем, если способ контроля выбран "Контроль по организации и подразделению", то
	// дополнительно осуществляется проверка соответствия подразделений.
	Если Результат Тогда
		СпособКонтроляКорректности = обПраво("КонтрольКорректностиДоговораИСкладаДокумента", Права,,ЭтотОбъект);	
		КонтрольОтсутствует        = (СпособКонтроляКорректности=Перечисления.СпособКонтроляКорректностиДоговораИСкладаДокумента.КонтрольОтсутствует);
		БалансВедетсяПоОрганизации = (Константы.СпособВеденияБаланса.Получить()=Перечисления.СпособВеденияБаланса.ПоОрганизации);
		
		Если БалансВедетсяПоОрганизации ИЛИ НЕ КонтрольОтсутствует Тогда
			КонтрольПоПодразделению = (СпособКонтроляКорректности=Перечисления.СпособКонтроляКорректностиДоговораИСкладаДокумента.КонтрольПоОрганизацииИПодразделению);
			
			КонтролируемыеРеквизиты = Новый Структура();
			
			Если БалансВедетсяПоОрганизации Тогда
				КонтролируемыеРеквизитыБанковскиеСчета = Новый Структура();
				КонтролируемыеРеквизитыБанковскиеСчета.Вставить("БанковскийСчет");
				КонтролируемыеРеквизиты.Вставить("КонтролируемыеРеквизитыБанковскиеСчета",КонтролируемыеРеквизитыБанковскиеСчета);
			КонецЕсли;
			
			КонтролируемыеРеквизитыСостава = Новый Структура();
			КонтролируемыеРеквизитыСостава.Вставить("ДоговорВзаиморасчетов", КонтрольПоПодразделению);
			ТабличныеЧасти = Новый Структура();
			ТабличныеЧасти.Вставить("Состав",КонтролируемыеРеквизитыСостава);
			КонтролируемыеРеквизиты.Вставить("КонтролируемыеРеквизитыТабличныхЧастей",ТабличныеЧасти); 	
			
			Результат = дкПроверитьКорректностьПоОрганизации(ЭтотОбъект,КонтролируемыеРеквизиты,Ошибки) И Результат;
		КонецЕсли;  		
	КонецЕсли;
	
	Если Товары.Количество() > 0 И ДляПробитияНаФР Тогда
		
		Если (СуммаДокументаПриход + СуммаДокументаРасход) > 0 И Товары.Итог("СуммаОплаты") = 0 Тогда
			Результат=Ложь;
			дкДобавитьОшибку(Ошибки, "Необходимо произвести пропорциональное распределение суммы вносимой оплаты между предметами платежа");
		ИначеЕсли (СуммаДокументаПриход + СуммаДокументаРасход) <> Товары.Итог("СуммаОплаты") Тогда
			Результат=Ложь;
			дкДобавитьОшибку(Ошибки, "Неверно заполнена колонка ""Сумма оплаты"" в табличной части товары, необходимо распределить сумму оплаты");
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат Результат;
КонецФункции // ПроверитьКорректность()

// Проверяет корректность заполнения табличных частей объекта.
// Возвращает Истина если все заполнено корректно и Ложь иначе.
// В случае некорректного заполнения формирует строку описанием возникших ошибок "Ошибки"
// На вход может быть передана структура ДопРеквизиты с дополнительными реквизитами для проверки
Функция ПроверитьЗаполненностьТЧ(Ошибки="", ДопРеквизиты=Неопределено) Экспорт
	Результат = Новый СписокЗначений;
	Результат.Добавить(Метаданные.Документы.Выписка.ТабличныеЧасти.Состав);
	Возврат Результат;
КонецФункции

// Функция проверяет, допустимо ли изменение объекта
//
// Параметры:
//  БлокироватьРеквизиты - структура, структура блокируемых на изменение реквизитов.
//
// Возвращаемое значение:
// Булево - Возвращает Истина, если изменения возможны, ложь иначе
//          Если изменения доступны частично, возвращает ложь и структуру блокируемых на изменение реквизитов.
//
Функция ДоступностьИзменения(БлокироватьРеквизиты=Неопределено) Экспорт
    // Здесь может быть прописано определение наличия ссылок, блокирующих изменение объекта
	Возврат Истина;
КонецФункции // ДоступностьИзменения()

// Возвращает список возможных хозяйственных операций документа
// Возвращаемое значение: 
//  СписокЗначений. 
//  Строка списка: Значение - имя предопределенного элемента; 
//				   Представление - красивое его представление
// 				   "Помеченная" строка - ХО по умолчанию.
Функция ПолучитьСписокХозОпераций() Экспорт
	СписокХозОпераций = Новый СписокЗначений;
	СписокХозОпераций.Добавить("БанковскаяВыписка","Банковская выписка",Истина);
	СписокХозОпераций.Добавить("СтрокаБанковскойВыписки","Строка банковской выписки",Ложь);
	Возврат СписокХозОпераций;
КонецФункции // ПолучитьСписокХозОпераций()

// Обработка изменения реквизитов документа
// Параметры
//  Имя			- Строка - Имя реквизита документа с полным путем (например Товары.Номенклатура).
//  ЭтаФорма	- Форма	 - Ссылка на форму документа. Если значение неопределено,
//                         производится программная обработка реквизитов.
//  ТекСтрока	- СтрокаТабличнойЧасти - Ссылка на строку табличной части документа, реквизит которой обрабатывается.
//										 Имеет смысл только для табличных частей документов.
//  ДопПараметры- Структура			- Структура, содержащая дополнительные параметры обработки реквизита.
// Возвращаемое значение:
//   Булево   - Результат выполнения обработки.
Функция ОбработкаРеквизита(Имя,ТекСтрока=Неопределено,ЭтаФорма=Неопределено,ДопПараметры=Неопределено) Экспорт
	Если Имя="ВалютаДокумента" Тогда
		// пересчитаем курсы взаиморасчетов в табличной части "Состав"
		Для Каждого ТекСтрока Из Состав Цикл
			Если обЗначениеНеЗаполнено(ТекСтрока.ДоговорВзаиморасчетов) Тогда
				Продолжить;
			КонецЕсли;
			спрСтрокаСоставВалютаВзаиморасчетов = ТекСтрока.ДоговорВзаиморасчетов.ВалютаВзаиморасчетов;
			// если валюта взаиморасчета в строке и валюта документа совпадают,
			// установим курс взаиморасчета равным курсу документа
			Если спрСтрокаСоставВалютаВзаиморасчетов = ВалютаДокумента Тогда
				ТекСтрока.КурсВалютыВзаиморасчетов = КурсДокумента;
				
			КонецЕсли;
		КонецЦикла; 
		
	ИначеЕсли Имя="Организация" ИЛИ Имя="ПодразделениеКомпании" Тогда
		Рез=дкОбработкаРеквизита(ЭтотОбъект,Имя,ТекСтрока,ЭтаФорма,ДопПараметры);
		//Проставим ставки НДС для исходящих платежей
		ОсвобожденОтНДС=ПодразделениеКомпании.ОсвобожденОтНДС ИЛИ Организация.ОсвобожденОтНДС;
		Если ОсвобожденОтНДС Тогда
			НоваяСтавкаНДС=Справочники.СтавкиНДС.БезНДС;
		Иначе
			НоваяСтавкаНДС=Справочники.СтавкиНДС.ОсновнаяСтавкаНДС;
			//Бондаренко++ 20241228
			СтавкаНДСрасчетная = СМГ_ПолучитьСтавкуНДС(Организация,Дата);
			Если НоваяСтавкаНДС <> СтавкаНДСрасчетная Тогда
				НоваяСтавкаНДС = СтавкаНДСрасчетная;
 			КонецЕсли;
			//Бондаренко-- 20241228
 		КонецЕсли;
		Для Каждого СтрокаТЧ Из Состав Цикл
			Если СтрокаТЧ.СуммаРасход<>0 И СтрокаТЧ.СтавкаНДС<>НоваяСтавкаНДС Тогда
				СтрокаТЧ.СтавкаНДС=НоваяСтавкаНДС;
				Рез=ОбработкаРеквизита("Состав.СтавкаНДС",СтрокаТЧ,ЭтаФорма,ДопПараметры) И Рез;
			КонецЕсли; 
		КонецЦикла;
		
		Если Имя="Организация" Тогда
			ВидимостьПатент = ?(Организация.ВидНалога = Перечисления.ВидыНалогов.ПСН, Истина, Ложь);
			ЭтаФорма.ЭлементыФормы.Патент.Видимость = ВидимостьПатент;
			ЭтаФорма.ЭлементыФормы.ИспользоватьПатент.Видимость = ВидимостьПатент;
			ЭтаФорма.ЭлементыФормы.ИспользоватьПатент.Доступность = ВидимостьПатент;
			ЭтотОбъект.Патент = Неопределено;
			Если ВидимостьПатент Тогда
				ЭтаФорма.ИспользоватьПатент = Ложь;
				ЭтаФорма.ЭлементыФормы.Патент.Доступность = Ложь;
			КонецЕсли;
		КонецЕсли;
		
		Возврат Рез;
		
	ИначеЕсли Имя="СтатьяДДС" Тогда
		Рез=Истина;
		Если СтатьяДДС.ВидДвижения=Перечисления.ВидыДвижений.Приход Тогда
			Если СуммаДокументаРасход<>0 Тогда
				СуммаДокументаРасход=0;
				Если ДопПараметры=Неопределено Тогда
					ДопПараметры=Новый Структура;
				КонецЕсли; 
				ДопПараметры.Вставить("ИзменениеНаправленияПлатежа",Истина);
				Рез=ОбработкаРеквизита("СуммаДокументаРасход",ТекСтрока,ЭтаФорма,ДопПараметры) И Рез;
			КонецЕсли; 
		ИначеЕсли СтатьяДДС.ВидДвижения=Перечисления.ВидыДвижений.Расход Тогда
			Если СуммаДокументаПриход<>0 Тогда
				СуммаДокументаПриход=0;
				Если ДопПараметры=Неопределено Тогда
					ДопПараметры=Новый Структура;
				КонецЕсли; 
				ДопПараметры.Вставить("ИзменениеНаправленияПлатежа",Истина);
				Рез=ОбработкаРеквизита("СуммаДокументаПриход",ТекСтрока,ЭтаФорма,ДопПараметры) И Рез;
			КонецЕсли; 
		КонецЕсли;
		Если СтатьяДДС = Справочники.СтатьиДДС.ОплатаБанковскихУслуг Тогда
			СуммаУслуг = 0;
		КонецЕсли;
		
		Для Каждого СтрокаТЧ Из Состав Цикл
		    Если СтрокаТЧ.СтатьяДДС<>СтатьяДДС Тогда
				СтрокаТЧ.СтатьяДДС=СтатьяДДС;
				Рез=ОбработкаРеквизита("Состав.СтатьяДДС",СтрокаТЧ,ЭтаФорма,ДопПараметры) И Рез;
			КонецЕсли; 
		КонецЦикла; 
		Возврат Рез;
		
	ИначеЕсли Имя="Контрагент" Тогда
		//Параметры для подстановки или создания договора контрагента
		Если ДопПараметры=Неопределено Тогда ДопПараметры=Новый Структура; КонецЕсли; 
		Если СтатьяДДС.ВидДвижения=Перечисления.ВидыДвижений.Приход Тогда
			ДопПараметры.Вставить("ВидДоговора",Перечисления.ВидыДоговоров.Продажа);
		ИначеЕсли СтатьяДДС.ВидДвижения=Перечисления.ВидыДвижений.Расход Тогда
			ДопПараметры.Вставить("ВидДоговора",Перечисления.ВидыДоговоров.Покупка);
		КонецЕсли; 
		ДопПараметры.Вставить("ВалютаВзаиморасчетов",ВалютаДокумента);
		Рез=дкОбработкаРеквизита(ЭтотОбъект,Имя,ТекСтрока,ЭтаФорма,ДопПараметры);
		Для Каждого СтрокаТЧ Из Состав Цикл
		    Если СтрокаТЧ.Контрагент<>Контрагент Тогда
				СтрокаТЧ.Контрагент=Контрагент;
				Рез=ОбработкаРеквизита("Состав.Контрагент",СтрокаТЧ,ЭтаФорма,ДопПараметры) И Рез;
			КонецЕсли; 
		КонецЦикла; 
		Возврат Рез;
		
	ИначеЕсли Имя="ДоговорВзаиморасчетов" Тогда
		Если НЕ обЗначениеНеЗаполнено(ДоговорВзаиморасчетов)
			И НЕ обЗначениеНеЗаполнено(ДоговорВзаиморасчетов.СтатьяДДС) Тогда
			СтатьяДДС = ДоговорВзаиморасчетов.СтатьяДДС;
			Рез=ОбработкаРеквизита("СтатьяДДС",СтрокаТЧ,ЭтаФорма,ДопПараметры);
		КонецЕсли;
		
		Для Каждого СтрокаТЧ Из Состав Цикл
		    Если СтрокаТЧ.ДоговорВзаиморасчетов<>ДоговорВзаиморасчетов Тогда
				СтрокаТЧ.ДоговорВзаиморасчетов=ДоговорВзаиморасчетов;
				Рез=ОбработкаРеквизита("Состав.ДоговорВзаиморасчетов",СтрокаТЧ,ЭтаФорма,ДопПараметры);
			КонецЕсли; 
		КонецЦикла;
		
		Если ДоговорВзаиморасчетов.ВидДоговора = Перечисления.ВидыДоговоров.Зарплата
			И СтатьяДДС.ВидДвижения = Перечисления.ВидыДвижений.Расход И Состав.Количество() = 0 Тогда
			
			СтруктураОтбора=Новый Структура();
			СтруктураОтбора.Вставить("Контрагент", Контрагент);
			СтруктураОтбора.Вставить("ДоговорВзаиморасчетов", ДоговорВзаиморасчетов);
			тзДолги=РегистрыНакопления.ВзаиморасчетыКомпании.Остатки(,СтруктураОтбора,,"Сумма,СуммаУпр,СуммаБаз");
			ВалютаДоговора = ДоговорВзаиморасчетов.ВалютаВзаиморасчетов;
			ВалютаУпр=Константы.ВалютаУправленческогоУчетаКомпании.Получить();
			ВалютаБаз=Константы.ВалютаРегламентированногоУчетаОрганизаций.Получить();
			Если ВалютаДокумента=ВалютаДоговора Тогда
				СуммаДокументаРасход = -тзДолги.Итог("Сумма");
			ИначеЕсли ВалютаДокумента=ВалютаБаз Тогда
				СуммаДокументаРасход = -тзДолги.Итог("СуммаБаз");
			ИначеЕсли ВалютаДокумента=ВалютаУпр Тогда
				СуммаДокументаРасход = -тзДолги.Итог("СуммаУпр");
			Иначе
				СтруктураКурса = обКурсДляВалюты(ВалютаДоговора,Дата);
				Курс           = СтруктураКурса.Курс / ?(СтруктураКурса.Кратность = 0, 1, СтруктураКурса.Кратность);
				СуммаДокументаРасход = обПересчет(-тзДолги.Итог("Сумма"),ВалютаДоговора,Курс,ВалютаДокумента,КурсДокумента);
			КонецЕсли;
			Если СуммаДокументаРасход < 0 Тогда
				СуммаДокументаРасход = 0;
			КонецЕсли;
			ОбработкаРеквизита("СуммаДокументаРасход",ТекСтрока, ЭтаФорма, ДопПараметры);
		КонецЕсли;
		
		Рез=дкОбработкаРеквизита(ЭтотОбъект,Имя,ТекСтрока,ЭтаФорма,ДопПараметры);
		Возврат Рез;
		
	ИначеЕсли Имя="СуммаДокументаПриход" ИЛИ Имя="СуммаДокументаРасход" Тогда
		Рез=ОбработкаРеквизита("СтавкаНДС",ТекСтрока,ЭтаФорма,ДопПараметры);
		Возврат Рез;
		
	ИначеЕсли Имя="СтавкаНДС" Тогда
		Рез=Истина;
		Сумма=СуммаДокументаПриход+СуммаДокументаРасход;
		СуммаНДС=Окр((Сумма*СтавкаНДС.Ставка)/(100+СтавкаНДС.Ставка),2);
		Если ХозОперация=Справочники.ХозОперации.СтрокаБанковскойВыписки Тогда
			Для Каждого СтрокаТЧ Из Состав Цикл
			    Если СтрокаТЧ.СтавкаНДС<>СтавкаНДС Тогда
					СтрокаТЧ.СтавкаНДС=СтавкаНДС;
					Рез=ОбработкаРеквизита("Состав.СтавкаНДС",СтрокаТЧ,ЭтаФорма,ДопПараметры) И Рез;
				КонецЕсли; 
			КонецЦикла; 
		КонецЕсли; 
		Возврат Рез;
		
	ИначеЕсли Имя="СуммаНДС" Тогда
		Рез=Истина;
		Возврат Рез;
		
	ИначеЕсли Имя = "ДляПробитияНаФР" Тогда
		Рез = Истина;
		
		Если ДляПробитияНаФР И НЕ ЗначениеЗаполнено(ТипРасчета) Тогда
			ТипРасчета = дкТипРасчетаДокумента(ЭтотОбъект);
		КонецЕсли;
		
		Возврат Рез;
		
	ИначеЕсли Имя="Состав.СтатьяДДС" Тогда
		Рез=Истина;
		Если НЕ обЗначениеНеЗаполнено(ТекСтрока.СтатьяДДС) Тогда
			Если ТекСтрока.СтатьяДДС.ВидДвижения=Перечисления.ВидыДвижений.Приход Тогда
				Если ТекСтрока.СуммаРасход<>0 Тогда
					ТекСтрока.СуммаРасход=0;
					Если ДопПараметры=Неопределено Тогда
                    	ДопПараметры=Новый Структура;
					КонецЕсли; 
					ДопПараметры.Вставить("ИзменениеНаправленияПлатежа",Истина);
					Рез=ОбработкаРеквизита("Состав.СуммаРасход",ТекСтрока,ЭтаФорма,ДопПараметры) И Рез;
				КонецЕсли; 
			ИначеЕсли ТекСтрока.СтатьяДДС.ВидДвижения=Перечисления.ВидыДвижений.Расход Тогда
				Если ТекСтрока.СуммаПриход<>0 Тогда
					ТекСтрока.СуммаПриход=0;
					Если ДопПараметры=Неопределено Тогда
                    	ДопПараметры=Новый Структура;
					КонецЕсли; 
					ДопПараметры.Вставить("ИзменениеНаправленияПлатежа",Истина);
					Рез=ОбработкаРеквизита("Состав.СуммаПриход",ТекСтрока,ЭтаФорма,ДопПараметры) И Рез;
				КонецЕсли; 
			КонецЕсли;
			Если ТекСтрока.СтатьяДДС=Справочники.СтатьиДДС.ОплатаБанковскихУслуг Тогда
				Если ТекСтрока.СуммаУслуг <> 0 Тогда
					ТекСтрока.СуммаУслуг=0;
					Рез=ОбработкаРеквизита("Состав.СуммаУслуг",ТекСтрока,ЭтаФорма,ДопПараметры) И Рез;
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
		Возврат Рез;
		
	ИначеЕсли Имя="Состав.Контрагент" Тогда
		Рез=Истина;
		Если обЗначениеНеЗаполнено(ТекСтрока.Контрагент) Тогда 
			// если контрагент не указан то очистим договор
			Если НЕ обЗначениеНеЗаполнено(ТекСтрока.ДоговорВзаиморасчетов) Тогда
				ТекСтрока.ДоговорВзаиморасчетов=Неопределено;
			КонецЕсли; 
			Если НЕ обЗначениеНеЗаполнено(ТекСтрока.ПлатежноеПоручениеОснование) Тогда
				ТекСтрока.ПлатежноеПоручениеОснование=Неопределено;
			КонецЕсли; 
		Иначе
			// установим договор по умолчанию
			ВидДоговора = Неопределено;
			Если СтатьяДДС.ВидДвижения=Перечисления.ВидыДвижений.Приход Тогда
				ВидДоговора = Перечисления.ВидыДоговоров.Продажа;
			ИначеЕсли СтатьяДДС.ВидДвижения=Перечисления.ВидыДвижений.Расход Тогда
				ВидДоговора = Перечисления.ВидыДоговоров.Покупка;
			КонецЕсли;
			
			ТекСтрока.ДоговорВзаиморасчетов = Справочники.Контрагенты.ПолучитьДоговорВзаиморасчетов(ТекСтрока.Контрагент, ВидДоговора, ЭтотОбъект, ДопПараметры);
			Рез = ОбработкаРеквизита("Состав.ДоговорВзаиморасчетов", ТекСтрока, ЭтаФорма, ДопПараметры) И Рез;
			
			Если (НЕ обЗначениеНеЗаполнено(ТекСтрока.ПлатежноеПоручениеОснование)) И
				 (ТипЗнч(ТекСтрока.ПлатежноеПоручениеОснование)=Тип("ДокументСсылка.ПлатежноеПоручение")) Тогда
				Если ТекСтрока.Контрагент<>ТекСтрока.ПлатежноеПоручениеОснование.Контрагент Тогда
					ТекСтрока.ПлатежноеПоручениеОснование=Неопределено;
					ТекСтрока.НазначениеПлатежа=Неопределено;
				КонецЕсли;
			КонецЕсли;
			
		КонецЕсли;
		//Проставим ставки НДС для входящих платежей
		ОсвобожденОтНДС=ТекСтрока.Контрагент.ОсвобожденОтНДС;
		Если ОсвобожденОтНДС Тогда
			НоваяСтавкаНДС=Справочники.СтавкиНДС.БезНДС;
		Иначе  
			//Галактионов ++ 03032026
			ПоследняяЗаписьРегистра = РегистрыСведений.УпрощеннаяСистемаНалогообложения.ПолучитьПоследнее(Дата,Новый Структура("Организация",Контрагент));
			НоваяСтавкаНДС = "";
			Если Не ПоследняяЗаписьРегистра.Свойство("СтавкаНДС",НоваяСтавкаНДС) Тогда
				НоваяСтавкаНДС = Справочники.СтавкиНДС.ПустаяСсылка();
			КонецЕсли;
			//Галактионов -- 03032026
			//НоваяСтавкаНДС=Справочники.СтавкиНДС.ОсновнаяСтавкаНДС;
		КонецЕсли;
		Если ТекСтрока.СуммаПриход<>0 И ТекСтрока.СтавкаНДС<>НоваяСтавкаНДС Тогда
			ТекСтрока.СтавкаНДС=НоваяСтавкаНДС;
			Рез=ОбработкаРеквизита("Состав.СтавкаНДС",ТекСтрока,ЭтаФорма,ДопПараметры) И Рез;
		Иначе
			ОсвобожденОтНДС=ПодразделениеКомпании.ОсвобожденОтНДС ИЛИ Организация.ОсвобожденОтНДС;
			Если ОсвобожденОтНДС Тогда
				НоваяСтавкаНДС=Справочники.СтавкиНДС.БезНДС;
			Иначе
				//Галактионов ++ 03032026
				ПоследняяЗаписьРегистра = РегистрыСведений.УпрощеннаяСистемаНалогообложения.ПолучитьПоследнее(Дата,Новый Структура("Организация",Организация));
				НоваяСтавкаНДС = "";
				Если Не ПоследняяЗаписьРегистра.Свойство("СтавкаНДС",НоваяСтавкаНДС) Тогда
					НоваяСтавкаНДС = Справочники.СтавкиНДС.ПустаяСсылка();
				КонецЕсли;
				//Галактионов -- 03032026
				//НоваяСтавкаНДС=Справочники.СтавкиНДС.ОсновнаяСтавкаНДС;
			КонецЕсли;
			Если ТекСтрока.СуммаРасход<>0 И ТекСтрока.СтавкаНДС<>НоваяСтавкаНДС Тогда
				ТекСтрока.СтавкаНДС=НоваяСтавкаНДС;
				Рез=ОбработкаРеквизита("Состав.СтавкаНДС",ТекСтрока,ЭтаФорма,ДопПараметры) И Рез;
			КонецЕсли;
		КонецЕсли; 
		Возврат Рез;
		
	ИначеЕсли Имя="Состав.ДоговорВзаиморасчетов" Тогда
		Если НЕ обЗначениеНеЗаполнено(ТекСтрока.ДоговорВзаиморасчетов) Тогда
			ТекСтрока.АвтоЗакрытиеСделок=ТекСтрока.ДоговорВзаиморасчетов.АвтоЗакрытиеСделок;
			ТекСтрока.КурсВалютыВзаиморасчетов=дкПолучитьКурсВалютыВзаиморасчетов(ЭтотОбъект,ТекСтрока.ДоговорВзаиморасчетов);
			Если НЕ обЗначениеНеЗаполнено(ТекСтрока.ДоговорВзаиморасчетов.СтатьяДДС) Тогда
				ТекСтрока.СтатьяДДС = ТекСтрока.ДоговорВзаиморасчетов.СтатьяДДС;
				Рез=ОбработкаРеквизита("Состав.СтатьяДДС",ТекСтрока,ЭтаФорма,ДопПараметры);
			КонецЕсли;
		КонецЕсли;
		Если ТекСтрока.ДоговорВзаиморасчетов.ВидДоговора = Перечисления.ВидыДоговоров.Зарплата
			И ТекСтрока.СтатьяДДС.ВидДвижения = Перечисления.ВидыДвижений.Расход Тогда
			Если ЗначениеЗаполнено(ДокументОснование) Тогда
				ТекСтрока.Сделка = ДокументОснование;
			КонецЕсли;
			ТекСтрока.АвтоЗакрытиеСделок = Истина;
		КонецЕсли;
		Если (ТекСтрока.СуммаПриход = 0 И ТекСтрока.СуммаРасход = 0) ТОгда
			Рез=ОбработкаРеквизита("Состав.РассчитатьСумму",ТекСтрока,ЭтаФорма,ДопПараметры);
		Иначе
			Рез=Истина;
		КонецЕсли;
		Возврат Рез;
		
	ИначеЕсли Имя="Состав.Сделка" Тогда
		Попытка
			Если НЕ обЗначениеНеЗаполнено(ТекСтрока.Сделка) Тогда
				Если ХозОперация = Справочники.ХозОперации.БанковскаяВыписка Тогда
					ТекСтрока.Контрагент=ТекСтрока.Сделка.Контрагент;
					ОбработкаРеквизита("Состав.Контрагент",ТекСтрока, ЭтаФорма, ДопПараметры);
					ТекСтрока.ДоговорВзаиморасчетов=ТекСтрока.Сделка.ДоговорВзаиморасчетов;
					ОбработкаРеквизита("Состав.ДоговорВзаиморасчетов",ТекСтрока, ЭтаФорма, ДопПараметры);
				Иначе
					Контрагент=ТекСтрока.Сделка.Контрагент;
					ОбработкаРеквизита("Контрагент",ТекСтрока, ЭтаФорма, ДопПараметры);
					ДоговорВзаиморасчетов=ТекСтрока.Сделка.ДоговорВзаиморасчетов;
					ОбработкаРеквизита("ДоговорВзаиморасчетов",ТекСтрока, ЭтаФорма, ДопПараметры);
				КонецЕсли;
			КонецЕсли;
		Исключение
		КонецПопытки;
		Рез=ОбработкаРеквизита("Состав.РассчитатьСумму",ТекСтрока,ЭтаФорма,ДопПараметры);
		
		// Получим сумму НДС
		Если ЗначениеЗаполнено(текСтрока.Сделка)
			И (ТекСтрока.СуммаПриход > 0 ИЛИ ТекСтрока.СуммаРасход > 0) Тогда
			СтруктураСтроки = Новый Структура();
			СтруктураСтроки.Вставить("СтавкаНДС", ТекСтрока.СтавкаНДС);
			СтруктураСтроки.Вставить("СуммаНДС",  ТекСтрока.СуммаНДС);
			СтруктураСтроки.Вставить("ВалютаДокумента", ВалютаДокумента);
			СтруктураСтроки.Вставить("КурсДокумента", КурсДокумента);
			дкСформироватьСуммуНДСДокументаОтгрузки(СтруктураСтроки, ТекСтрока.Сделка, ?(ТекСтрока.СуммаПриход = 0, ТекСтрока.СуммаРасход, ТекСтрока.СуммаПриход));
			ТекСтрока.СуммаНДС = СтруктураСтроки.СуммаНДС;
		КонецЕсли;
		
		Возврат Рез;
		
	ИначеЕсли Имя="Состав.СтатьяДДС" Тогда
		ТекСтрока.ПлатежноеПоручениеОснование = "";
		ТекСтрока.НазначениеПлатежа           = "";
		Возврат Истина;
		
	ИначеЕсли Имя="Состав.СуммаПриход" ИЛИ Имя="Состав.СуммаРасход" Тогда
		Попытка
			ИзменениеНаправленияПлатежа=ДопПараметры.ИзменениеНаправленияПлатежа;	
		Исключение
			ИзменениеНаправленияПлатежа=Ложь;
		КонецПопытки;
		Если ИзменениеНаправленияПлатежа Тогда
			Если ТекСтрока.СуммаПриход<>0 Тогда
				//Проставим ставку НДС для входящего платежа
				ОсвобожденОтНДС=ТекСтрока.Контрагент.ОсвобожденОтНДС;
				Если ОсвобожденОтНДС Тогда
					НоваяСтавкаНДС=Справочники.СтавкиНДС.БезНДС;
				Иначе
					НоваяСтавкаНДС=Справочники.СтавкиНДС.ОсновнаяСтавкаНДС;
				КонецЕсли;
				Если ТекСтрока.СтавкаНДС<>НоваяСтавкаНДС Тогда
					ТекСтрока.СтавкаНДС=НоваяСтавкаНДС;
				КонецЕсли;
			ИначеЕсли ТекСтрока.СуммаРасход<>0 Тогда
				//Проставим ставку НДС для исходящего платежа
				ОсвобожденОтНДС=ПодразделениеКомпании.ОсвобожденОтНДС ИЛИ Организация.ОсвобожденОтНДС;
				Если ОсвобожденОтНДС Тогда
					НоваяСтавкаНДС=Справочники.СтавкиНДС.БезНДС;
				Иначе
					НоваяСтавкаНДС=Справочники.СтавкиНДС.ОсновнаяСтавкаНДС;
				КонецЕсли;
				Если ТекСтрока.СтавкаНДС<>НоваяСтавкаНДС Тогда
					ТекСтрока.СтавкаНДС=НоваяСтавкаНДС;
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
		Если НЕ ТекСтрока.СтатьяДДС = Справочники.СтатьиДДС.ОплатаБанковскихУслуг Тогда
			СуммаПлатежа = ТекСтрока.СуммаРасход + ТекСтрока.СуммаПриход;
			Если СуммаПлатежа < ТекСтрока.СуммаУслуг Тогда
				ТекСтрока.СуммаУслуг = СуммаПлатежа;
				#Если Клиент Тогда
					Предупреждение("Сумма прихода/расхода не может быть меньше суммы комиссии банка!");
				#КонецЕсли
			КонецЕсли;
			ТекСтрока.ПроцентКомиссии = ?(ТекСтрока.СуммаУслуг = 0 ИЛИ СуммаПлатежа = 0, 0, ТекСтрока.СуммаУслуг / СуммаПлатежа * 100);
		КонецЕсли;
		ТекСтрока.СуммаРазница = ?(ТекСтрока.СуммаРасход <> 0 ИЛИ ТекСтрока.СтатьяДДС.ВидДвижения = Перечисления.ВидыДвижений.Расход, ТекСтрока.СуммаРасход, ТекСтрока.СуммаПриход) - ТекСтрока.СуммаУслуг;
		Возврат ОбработкаРеквизита("Состав.СтавкаНДС",ТекСтрока,ЭтаФорма,ДопПараметры);
	ИначеЕсли Имя="Состав.СуммаУслуг" Тогда
		СуммаПлатежа = ?(ТекСтрока.СуммаРасход = 0, ТекСтрока.СуммаПриход, ТекСтрока.СуммаРасход);
		Если СуммаПлатежа < ТекСтрока.СуммаУслуг Тогда
			ТекСтрока.СуммаУслуг = СуммаПлатежа;
			#Если Клиент Тогда
				Предупреждение("Сумма прихода/расхода не может быть меньше суммы комиссии банка!");
			#КонецЕсли
		КонецЕсли;
		ТекСтрока.СуммаРазница = СуммаПлатежа - ТекСтрока.СуммаУслуг;
		ТекСтрока.ПроцентКомиссии = ?(ТекСтрока.СуммаУслуг = 0 ИЛИ СуммаПлатежа = 0, 0, ТекСтрока.СуммаУслуг / СуммаПлатежа * 100);
		Возврат Истина;
	ИначеЕсли Имя="Состав.ПроцентКомиссии" Тогда
		Сумма=ТекСтрока.СуммаПриход+ТекСтрока.СуммаРасход;
		ТекСтрока.СуммаУслуг = Окр(Сумма * ТекСтрока.ПроцентКомиссии / 100, 2);
		ТекСтрока.СуммаРазница = Сумма - ТекСтрока.СуммаУслуг;
		Возврат Истина;
	ИначеЕсли Имя="Состав.СуммаРазница" Тогда
		
		Если ТекСтрока.СтатьяДДС.ВидДвижения = Перечисления.ВидыДвижений.Расход Тогда
			ТекСтрока.СуммаРасход = ТекСтрока.СуммаРазница + ТекСтрока.СуммаУслуг;
			ОбработкаРеквизита("Состав.СуммаРасход",ТекСтрока, ЭтаФорма, ДопПараметры);
		ИначеЕсли ТекСтрока.СтатьяДДС.ВидДвижения = Перечисления.ВидыДвижений.Приход Тогда
			ТекСтрока.СуммаПриход = ТекСтрока.СуммаРазница + ТекСтрока.СуммаУслуг;
			ОбработкаРеквизита("Состав.СуммаПриход",ТекСтрока, ЭтаФорма, ДопПараметры);
		Иначе
			Если ТекСтрока.СуммаРасход <> 0 Тогда
				ТекСтрока.СуммаРасход = ТекСтрока.СуммаРазница + ТекСтрока.СуммаУслуг;
				ОбработкаРеквизита("Состав.СуммаРасход",ТекСтрока, ЭтаФорма, ДопПараметры);
			Иначе
				ТекСтрока.СуммаПриход = ТекСтрока.СуммаРазница + ТекСтрока.СуммаУслуг;
				ОбработкаРеквизита("Состав.СуммаПриход",ТекСтрока, ЭтаФорма, ДопПараметры);
			КонецЕсли;
		КонецЕсли;
		
		Если НЕ ТекСтрока.СтатьяДДС = Справочники.СтатьиДДС.ОплатаБанковскихУслуг Тогда
			Сумма=ТекСтрока.СуммаПриход+ТекСтрока.СуммаРасход;
			ТекСтрока.ПроцентКомиссии = ?(ТекСтрока.СуммаУслуг = 0 ИЛИ Сумма = 0, 0, ТекСтрока.СуммаУслуг / Сумма * 100);
		КонецЕсли;
		Возврат Истина;
	ИначеЕсли Имя="Состав.СтавкаНДС" Тогда
		Сумма=ТекСтрока.СуммаПриход+ТекСтрока.СуммаРасход;
		ТекСтрока.СуммаНДС=Окр((Сумма*ТекСтрока.СтавкаНДС.Ставка)/(100+ТекСтрока.СтавкаНДС.Ставка),2);
		Возврат Истина;
		
	ИначеЕсли Имя="Состав.СуммаНДС" Тогда
		Возврат Истина;
		
	ИначеЕсли Имя="Состав.ПлатежноеПоручениеОснование" Тогда
		Рез=Истина;
		Если (НЕ обЗначениеНеЗаполнено(ТекСтрока.ПлатежноеПоручениеОснование)) И
			 (ТипЗнч(ТекСтрока.ПлатежноеПоручениеОснование)=Тип("ДокументСсылка.ПлатежноеПоручение")) Тогда
			ИзмененКонтрагент=Ложь;
			ИзмененДоговорВзаиморасчетов=Ложь;
			Если ТекСтрока.Контрагент<>ТекСтрока.ПлатежноеПоручениеОснование.Контрагент Тогда
				ТекСтрока.Контрагент=ТекСтрока.ПлатежноеПоручениеОснование.Контрагент;
				ИзмененКонтрагент=Истина;
			КонецЕсли;
			Если ТекСтрока.ДоговорВзаиморасчетов<>ТекСтрока.ПлатежноеПоручениеОснование.ДоговорВзаиморасчетов Тогда
				ТекСтрока.ДоговорВзаиморасчетов=ТекСтрока.ПлатежноеПоручениеОснование.ДоговорВзаиморасчетов;
				ИзмененДоговорВзаиморасчетов=Истина;
			КонецЕсли;
			Если ИзмененКонтрагент Тогда
				Рез=ОбработкаРеквизита("Состав.Контрагент",ТекСтрока,ЭтаФорма,ДопПараметры) И Рез;
			ИначеЕсли ИзмененДоговорВзаиморасчетов Тогда
				Рез=ОбработкаРеквизита("Состав.ДоговорВзаиморасчетов",ТекСтрока,ЭтаФорма,ДопПараметры) И Рез;
			Иначе
				Рез=ОбработкаРеквизита("Состав.РассчитатьСумму",ТекСтрока,ЭтаФорма,ДопПараметры) И Рез;
			КонецЕсли; 
			ЗаполнитьНазначениеПлатежа=Истина;
			Если СокрЛП(ТекСтрока.НазначениеПлатежа)<>"" Тогда
				#Если Клиент Тогда
				Если ЭтаФорма<>Неопределено Тогда
					Ответ=Вопрос("Заполнить назначение платежа из выбранного платежного поручения?",РежимДиалогаВопрос.ДаНет);
					Если Ответ=КодВозвратаДиалога.Нет Тогда
						ЗаполнитьНазначениеПлатежа=Ложь;
					КонецЕсли;
				КонецЕсли; 
				#КонецЕсли
			КонецЕсли;
			Если ЗаполнитьНазначениеПлатежа Тогда
				ТекСтрока.НазначениеПлатежа=""+ТекСтрока.ПлатежноеПоручениеОснование.НазначениеПлатежа;
			КонецЕсли;
		ИначеЕсли обЗначениеНеЗаполнено(ТекСтрока.ПлатежноеПоручениеОснование) Тогда
			#Если Клиент Тогда
			Если ЭтаФорма<>Неопределено И СокрЛП(ТекСтрока.НазначениеПлатежа)<>"" Тогда
				Ответ=Вопрос("Очистить назначение платежа?",РежимДиалогаВопрос.ДаНет);
				Если Ответ=КодВозвратаДиалога.Да Тогда
					ТекСтрока.НазначениеПлатежа="";
				КонецЕсли;
			КонецЕсли; 
			#КонецЕсли
		КонецЕсли;
		Возврат Рез;
		
	ИначеЕсли Имя="Состав.РассчитатьСумму" Тогда
		Рез=Истина;
		ТребуетсяПерерасчет=Истина;
		Если (НЕ обЗначениеНеЗаполнено(ТекСтрока.ПлатежноеПоручениеОснование)) И
			 (ТипЗнч(ТекСтрока.ПлатежноеПоручениеОснование)=Тип("ДокументСсылка.ПлатежноеПоручение")) Тогда
			 ОстатокПоСделке=ТекСтрока.ПлатежноеПоручениеОснование.СуммаДокумента;
			 ОстатокПоСделке=-обПересчет(ОстатокПоСделке,ТекСтрока.ПлатежноеПоручениеОснование.ВалютаДокумента,?(ЗначениеЗаполнено(ТекСтрока.КурсВалютыВзаиморасчетов),ТекСтрока.КурсВалютыВзаиморасчетов, Дата),ВалютаДокумента,КурсДокумента);
			 ТребуетсяПерерасчет=Ложь;
		Иначе
			ОстатокПоСделке=Неопределено;
		КонецЕсли; 
		Если ОстатокПоСделке=Неопределено Тогда
			Если ЗначениеЗаполнено(ТекСтрока.Сделка)
				И (ТипЗнч(ТекСтрока.Сделка) = Тип("ДокументСсылка.ЗаказНаАвтомобиль") ИЛИ ТипЗнч(ТекСтрока.Сделка) = Тип("ДокументСсылка.ЗаказПокупателя")) Тогда
				
				ДокументОбъектСтруктура=Новый Структура();
				ДокументОбъектСтруктура.Вставить("Дата",          ТекущаяДата());
				ДокументОбъектСтруктура.Вставить("МоментВремени", ЭтотОбъект.МоментВремени());
				ДокументОбъектСтруктура.Вставить("Проведен",      ЭтотОбъект.Проведен);
				
				ТаблицаРасчетов = зфЗащищенныеФункцииСервер.ПолучитьТаблицуРасчетовПоЗаказам(ДокументОбъектСтруктура, ТекСтрока.Сделка);
				
				ДолгПоПредоплате = 0;
				Долг = 0;
				Для Каждого СтрокаРасчетов Из ТаблицаРасчетов Цикл
					ДолгПоПредоплате = ДолгПоПредоплате + СтрокаРасчетов.ДолгПоПредоплате;
					Долг = Долг + СтрокаРасчетов.Долг;
				КонецЦикла;
				
				Если ДолгПоПредоплате>0 Тогда
					ОстатокПоСделке = ДолгПоПредоплате;
				Иначе
					ОстатокПоСделке = Долг;
				КонецЕсли;
				
			Иначе
				// evgeny.s
				Если ТипЗнч(ТекСтрока.Сделка)=Тип("ДокументСсылка.СчетОтПоставщика") ИЛИ ТипЗнч(ТекСтрока.Сделка)=Тип("ДокументСсылка.ЗаказПоставщикуНаАвтомобиль")
					ИЛИ ТипЗнч(ТекСтрока.Сделка)=Тип("ДокументСсылка.ПоступлениеТоваров") ИЛИ ТипЗнч(ТекСтрока.Сделка)=Тип("ДокументСсылка.ПоступлениеАвтомобилей") Тогда
					ОстатокПоСделке=ТекСтрока.Сделка.СуммаДокумента;	
				Иначе	
					СтруктураОтбора=Новый Структура(); 
					СтруктураОтбора.Вставить("Контрагент",ТекСтрока.Контрагент);
					СтруктураОтбора.Вставить("ДоговорВзаиморасчетов",ТекСтрока.ДоговорВзаиморасчетов);
					Если НЕ обЗначениеНеЗаполнено(ТекСтрока.Сделка) Тогда
						СтруктураОтбора.Вставить("Сделка",ТекСтрока.Сделка);
					КонецЕсли;
					тзДолги=РегистрыНакопления.ВзаиморасчетыКомпании.Остатки(МоментВремени(),СтруктураОтбора,,"Сумма");
					ОстатокПоСделке=тзДолги.Итог("Сумма");
				КонецЕсли;
				// evgeny.s
			КонецЕсли;
		КонецЕсли;
		Если ТребуетсяПерерасчет Тогда
			ОстатокПоСделке=обПересчет(ОстатокПоСделке,ТекСтрока.ДоговорВзаиморасчетов.ВалютаВзаиморасчетов,?(ЗначениеЗаполнено(ТекСтрока.КурсВалютыВзаиморасчетов),ТекСтрока.КурсВалютыВзаиморасчетов, Дата),ВалютаДокумента,КурсДокумента, 2);
		КонецЕсли; 
		Если ОстатокПоСделке>0 Тогда
			Если ТекСтрока.СтатьяДДС.ВидДвижения<>Перечисления.ВидыДвижений.Расход Тогда
				Если ТекСтрока.СуммаРасход<>0 Тогда
					ТекСтрока.СуммаРасход=0;
					Если ДопПараметры=Неопределено Тогда
						ДопПараметры=Новый Структура;
					КонецЕсли; 
					ДопПараметры.Вставить("ИзменениеНаправленияПлатежа",Истина);
				КонецЕсли;
				ТекСтрока.СуммаПриход=ОстатокПоСделке;
				Рез=ОбработкаРеквизита("Состав.СуммаПриход",ТекСтрока,ЭтаФорма,ДопПараметры) И Рез;
			КонецЕсли; 
		Иначе
			Если ТекСтрока.СтатьяДДС.ВидДвижения<>Перечисления.ВидыДвижений.Приход Тогда
				Если ТекСтрока.СуммаПриход<>0 Тогда
					ТекСтрока.СуммаПриход=0;
					Если ДопПараметры=Неопределено Тогда
						ДопПараметры=Новый Структура;
					КонецЕсли; 
					ДопПараметры.Вставить("ИзменениеНаправленияПлатежа",Истина);
				КонецЕсли;
				ТекСтрока.СуммаРасход=-ОстатокПоСделке;
				Рез=ОбработкаРеквизита("Состав.СуммаРасход",ТекСтрока,ЭтаФорма,ДопПараметры) И Рез;
			КонецЕсли; 
		КонецЕсли;
		Возврат Рез;
	ИначеЕсли Имя = "РассчитатьСкидки" Тогда
		Возврат Истина;
	Иначе
		Возврат дкОбработкаРеквизита(ЭтотОбъект,Имя,ТекСтрока,ЭтаФорма,ДопПараметры);
	КонецЕсли;
КонецФункции // ОбработкаРеквизита()

// заполнение свойств из документа основания
Процедура ЗаполнитьСвойстваНаОсновании(Основание) Экспорт
 //зарезервировано для описания заполнения свойств из свойств основания
КонецПроцедуры

Функция ПолучитьСделку(Знач Основание, ЭтоДебетоваяСделка)
	
	ДоступныеСделки = дкПолучитьРазрешенныеТипыСделок(Неопределено, ЭтоДебетоваяСделка, НЕ ЭтоДебетоваяСделка);
	
	Пока ЗначениеЗаполнено(Основание.ДокументОснование) И
		ДоступныеСделки.НайтиПоЗначению(Основание.ДокументОснование.Метаданные().Имя) <> Неопределено Цикл
		
		Основание = Основание.ДокументОснование;
		
	КонецЦикла;
	
	Возврат Основание;
	
КонецФункции


#Если Клиент Тогда
////////////////////////////////////////////////////////////////////////////////
// ЭКСПОРТНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ ПЕЧАТИ ДОКУМЕНТА

// Формирует печатную форму "Банковская выписка"
// 
// Параметры:
//  ТабДокумент - табличный документ.
//
// Возвращаемое значение:
//  ТабДокумент - возвращает сформированный табличный документ.
//
Функция ПечатьБанковскаяВыписка(ТабДокумент) Экспорт
	//зададим параметры макета
	ТабДокумент.ПолеСверху = 0;
	ТабДокумент.ПолеСлева  = 0;
	ТабДокумент.ПолеСнизу  = 0;
	ТабДокумент.ПолеСправа = 0;
	
	ТабДокумент.ОриентацияСтраницы = ОриентацияСтраницы.Ландшафт;
	
	Макет = ПолучитьМакет("БанковскаяВыписка");
	ФорматВыводаСуммы = обПраво("ФорматВыводаСуммы",Права,,ЭтотОбъект);	
		
	//определяем шапку ТЧ, которая будет повторяться на всех страницах документа
	ОбластьШапкаТаблицы = Макет.ПолучитьОбласть("ШапкаТаблицы");
	
	//реквизиты шапки документа
	ОбластьМакета = Макет.ПолучитьОбласть("Заголовок");
	ТекстЗаголовка = дкПолучитьПредставление(ЭтотОбъект);
	ОбластьМакета.Параметры.ТекстЗаголовка = ТекстЗаголовка;
	//...
	ОбластьМакета.Параметры.Организация = Организация;
	ОбластьМакета.Параметры.ПредставлениеОрганизация = спПолучитьПредставление(ЭтотОбъект.Организация);
	//...
	ОбластьМакета.Параметры.Счет = БанковскийСчет;
	ОбластьМакета.Параметры.БанковскийСчет = спПолучитьНаименование(ЭтотОбъект.БанковскийСчет) ;
	СтрокаСвойств = дкПолучитьСтрокуСвойствДокумента(ЭтотОбъект);
	ОбластьМакета.Параметры.СтрокаСвойств = СтрокаСвойств;
	ОбластьМакета.Параметры.Валюта = ВалютаДокумента;
	ТабДокумент.Вывести(ОбластьМакета);
	//шапка
	ТабДокумент.Вывести(ОбластьШапкаТаблицы);
	//строки
	ОбластьМакета = Макет.ПолучитьОбласть("Строка");
	ВыборкаТабличнойЧасти = ЭтотОбъект.Состав;
	//сразу два, т.к. выводим на второй странице только
	НомерСтраницы = 2;
	НомерСтраницыПред = НомерСтраницы;
	
	ОбластьМакетаИтогоПоСтранице = Макет.ПолучитьОбласть("ИтогоПоСтранице");
		
	СтруктураОтбора	= Новый Структура("СтруктурнаяЕдиница", БанковскийСчет);
	МоментВремени	= ?(ЭтоНовый(), Новый МоментВремени(КонецДня(Дата)), МоментВремени());
	тзОстатки	= РегистрыНакопления.ДенежныеСредстваКомпании.Остатки(МоментВремени,СтруктураОтбора,,"Сумма");
	Остаток		= тзОстатки.Итог("Сумма");
	СуммаНачОстаток = Остаток;
	
	СтруктураИтоговПоСтранице = Новый Структура("СуммаНачальныйОстаток,СуммаПриход,СуммаРасход,СуммаКонечныйОстаток",СуммаНачОстаток,0,0,СуммаНачОстаток);	
	
	ОбластьПодвал = Макет.ПолучитьОбласть("Подвал");
	ОбластьПодвал.Параметры.СуммаНачальныйОстаток = Формат(Остаток,ФорматВыводаСуммы);
	
	//заполним параметры шапки таблицы для следующего листа
	ОбластьШапкаТаблицы.Параметры.ТекстЗаголовка = ТекстЗаголовка;
	ОбластьШапкаТаблицы.Параметры.НомерСтраницы = "Страница: " + НомерСтраницы; 	
	
	Для Каждого СтрокаТабличнойЧасти Из ВыборкаТабличнойЧасти Цикл
		ОбластьМакета.Параметры.Заполнить(СтрокаТабличнойЧасти);
		ОбластьМакета.Параметры.СуммаПриход = Формат(СтрокаТабличнойЧасти.СуммаПриход,ФорматВыводаСуммы);
		ОбластьМакета.Параметры.СуммаРасход = Формат(СтрокаТабличнойЧасти.СуммаРасход,ФорматВыводаСуммы);
		ОбластьМакета.Параметры.СуммаОстаток = Формат(Остаток,ФорматВыводаСуммы);
		СуммаКонОстаток = Остаток+СтрокаТабличнойЧасти.СуммаПриход-СтрокаТабличнойЧасти.СуммаРасход;
		ОбластьМакета.Параметры.СуммаКонОстаток = Формат(СуммаКонОстаток,ФорматВыводаСуммы);
		
		Документ = СтрокаТабличнойЧасти.ПлатежноеПоручениеОснование;
		Если ТипЗнч(Документ)=Тип("ДокументСсылка.ПлатежноеПоручение") Тогда
			ОбластьМакета.Параметры.ПлатежноеПоручениеОснование = "№ " + СокрЛП(Документ.Номер) + " от " + Символы.ПС + Формат(Документ.Дата, "ДЛФ=DD") 
		КонецЕсли;
		
		ОбластьМакета.Параметры.НазначениеПлатежа = СтрЗаменить(СтрокаТабличнойЧасти.НазначениеПлатежа, Символы.ПС, " "); 
		
		//доп. области
		мсвДопОбластиПодвала = Неопределено;
		Если ВыборкаТабличнойЧасти.Индекс(СтрокаТабличнойЧасти) = ВыборкаТабличнойЧасти.Количество()-1 Тогда
			мсвДопОбластиПодвала = Новый Массив;
			мсвДопОбластиПодвала.Добавить(ОбластьПодвал);
		КонецЕсли;
		
		//выводим строку, делая проверку попадания на лист
		НомерСтраницы = дкВывестиГоризонтальнуюОбласть(ТабДокумент, ОбластьМакета, ОбластьШапкаТаблицы, ОбластьМакетаИтогоПоСтранице,
			НомерСтраницы, СтруктураИтоговПоСтранице, ЭтотОбъект, мсвДопОбластиПодвала);
		
		//НомСтр  = дкВывестиГоризонтальнуюОбласть(ТабДокумент, ОбластьМакета, ОбластьШапкаТаблицы, , НомСтр,,ЭтотОбъект);
		Остаток = Остаток+СтрокаТабличнойЧасти.СуммаПриход-СтрокаТабличнойЧасти.СуммаРасход;
		//инициализация итогов по странице
		Если НомерСтраницы <> НомерСтраницыПред Тогда
			КонечныйОстаток = СтруктураИтоговПоСтранице.СуммаКонечныйОстаток;
			СтруктураИтоговПоСтранице = Новый Структура("СуммаНачальныйОстаток,СуммаПриход,СуммаРасход,СуммаКонечныйОстаток",КонечныйОстаток,0,0,КонечныйОстаток);
			НомерСтраницыПред = НомерСтраницы;
			ОбластьШапкаТаблицы.Параметры.НомерСтраницы = "Страница: " + НомерСтраницы; 
		КонецЕсли;
		//добавляем итоги
		ИтогиПоСтранице = Новый Структура("СуммаНачальныйОстаток,СуммаПриход,СуммаРасход,СуммаКонечныйОстаток",0,СтрокаТабличнойЧасти.СуммаПриход,СтрокаТабличнойЧасти.СуммаРасход,СтрокаТабличнойЧасти.СуммаПриход-СтрокаТабличнойЧасти.СуммаРасход);
		
		дкДобавитьИтогиПоСтранице(ИтогиПоСтранице,СтруктураИтоговПоСтранице);		
	КонецЦикла;
	
	//выводим последний подвал, если страниц больше единицы
	Если НомерСтраницы > 2 Тогда
		дкВывестиИтогиПоСтранице(ТабДокумент,ОбластьМакетаИтогоПоСтранице,СтруктураИтоговПоСтранице,ЭтотОбъект);
	КонецЕсли;	
	
	//итоги
	СуммаПриход = Состав.Итог("СуммаПриход");
	ОбластьПодвал.Параметры.ИтогоСуммаПриход = Формат(СуммаПриход,ФорматВыводаСуммы);
	СуммаРасход = Состав.Итог("СуммаРасход");
	ОбластьПодвал.Параметры.ИтогоСуммаРасход = Формат(СуммаРасход,ФорматВыводаСуммы);
	СуммаКонечныйОстаток = СуммаНачОстаток+СуммаПриход-СуммаРасход;
	ОбластьПодвал.Параметры.СуммаКонечныйОстаток = Формат(СуммаКонечныйОстаток,ФорматВыводаСуммы);
	//сумма прописью
	ОбластьПодвал.Параметры.СуммаПрописьюНачОстаток=обЧислоПрописью(тзОстатки.Итог("Сумма"),ЭтотОбъект.ВалютаДокумента);
	ОбластьПодвал.Параметры.СуммаПрописьюПриход = обЧислоПрописью(Состав.Итог("СуммаПриход"),ЭтотОбъект.ВалютаДокумента);
	ОбластьПодвал.Параметры.СуммаПрописьюРасход = обЧислоПрописью(Состав.Итог("СуммаРасход"),ЭтотОбъект.ВалютаДокумента);
	ОбластьПодвал.Параметры.СуммаПрописьюКонОстаток=обЧислоПрописью(Остаток,ЭтотОбъект.ВалютаДокумента);
	// Выводим представления и расшифровки подписей
	ГлавныйБухгалтер = дкОтветственноеЛицо(ЭтотОбъект,Перечисления.ВидыОбъектовСведений.ГлавныйБухгалтер);
	ГлавныйБухгалтер.ГлавныйБухгалтерПредставление = ?(обЗначениеНеЗаполнено(ГлавныйБухгалтер.ГлавныйБухгалтер),"","/ "+ ГлавныйБухгалтер.ГлавныйБухгалтерПредставление);
	ОбластьПодвал.Параметры.Заполнить(ГлавныйБухгалтер);
	ТабДокумент.Вывести(ОбластьПодвал);
	
	ТабДокумент.ТолькоПросмотр = Истина;
	Возврат ТабДокумент;
КонецФункции // ПечатьБанковскаяВыписка()

// Функция осуществляет печать произвольного документа.
// Можно направить печать на экран или принтер, а также распечатать необходимое количество копий.
//
// Параметры:
//	ЭтотОбъект							- ДокументОбъект	- Документ для печати
//	НазваниеПечатнойФормы 				- Строка			- Название печатной формы, если пусто, то по умолчанию
//	КоличествоЭкземпляров				- Число				- Количество экземпляров документа
//	НаПринтер							- Булево			- Признак отправки документа на принтер без отображения его на экране
//  Документ 	  						- ТабличныйДокумент	- Макет печатной формы
//
// Возвращаемое значение:
//   ТабличныйДокумент	- Сформированная печатная форма
//
Функция Печать(НазваниеПечатнойФормы="", КоличествоЭкземпляров=0, НаПринтер=Ложь, Документ=Неопределено) Экспорт
	Возврат дкПечать(ЭтотОбъект, НазваниеПечатнойФормы, КоличествоЭкземпляров, НаПринтер, Документ);
КонецФункции // Печать()

// Возвращает доступные варианты печати документа
// Возвращаемое значение: 
//  Структура, каждая строка которой
//  соответствует одному из вариантов печати
//  Первый элемент структуры - форма по умолчанию
Функция ПолучитьСписокПечатныхФорм() Экспорт
	СтруктураМакетов=Новый Структура();
	СтруктураМакетов.Вставить("БанковскаяВыписка", "Банковская выписка");
	Возврат СтруктураМакетов;
КонецФункции // ПолучитьСписокПечатныхФорм()

#КонецЕсли
// Если Клиент Тогда - завершена клиентская часть

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ

Процедура ПриУстановкеНовогоНомера(СтандартнаяОбработка, Префикс)
	Если НЕ дкПриУстановкеНовогоНомера(ЭтотОбъект, СтандартнаяОбработка, Префикс) Тогда Возврат; КонецЕсли;
КонецПроцедуры // ПриУстановкеНовогоНомера()

// Процедура обработчик ввода на основании
Процедура ОбработкаЗаполнения(Основание)
	Если НЕ дкОбработкаЗаполнения(ЭтотОбъект, Основание) Тогда Возврат; КонецЕсли;
	
	Если обЗначениеНеЗаполнено(БанковскийСчет) Тогда 
		БанковскийСчет	= Организация.ОсновнойБанковскийСчет;
	КонецЕсли;
	Если обЗначениеНеЗаполнено(БанковскийСчет) Тогда 	
		ВалютаДокумента	= Справочники.Валюты.ПустаяСсылка();
	Иначе
		ВалютаДокумента	= БанковскийСчет.ВалютаДенежныхСредств;
		СтруктураКурса	= обКурсДляВалюты(ВалютаДокумента,Дата);
		КурсДокумента	= СтруктураКурса.Курс / ?(СтруктураКурса.Кратность = 0, 1, СтруктураКурса.Кратность);
	КонецЕсли;
	
	//rarus zdoroe begin
	Если ТипЗнч(Основание) = Тип("ДокументСсылка.ЗаявкаНаРасходДС") ИЛИ ТипЗнч(Основание) = Тип("ДокументСсылка.ПланПоступленияДС") Тогда
		
		ОснованиеПлатежи = Основание.Платежи;
		Если ОснованиеПлатежи.Количество() > 0 Тогда
			Для Каждого Платеж Из ОснованиеПлатежи Цикл
				
				НоваяСтрока = Состав.Добавить();
				НоваяСтрока.СтатьяДДС             = Основание.СтатьяДДС;
				НоваяСтрока.Контрагент            = Основание.Контрагент;
				НоваяСтрока.ДоговорВзаиморасчетов = Основание.ДоговорВзаиморасчетов;
				НоваяСтрока.Сделка                = ПолучитьСделку(Основание.ДокументОснование, ТипЗнч(Основание) = Тип("ДокументСсылка.ПланПоступленияДС"));
				НоваяСтрока.ДокументПланирования  = Основание;
				
				ОбработкаРеквизита("Состав.Контрагент", НоваяСтрока);
				
				Если ТипЗнч(Основание) = Тип("ДокументСсылка.ЗаявкаНаРасходДС") Тогда
					НоваяСтрока.СуммаРасход = Платеж.Сумма;
				Иначе 
					НоваяСтрока.СуммаПриход = Платеж.Сумма;
				КонецЕсли;
				
				Если НоваяСтрока.СуммаПриход > 0 Тогда
					ОбработкаРеквизита("Состав.СуммаПриход", НоваяСтрока);
				ИначеЕсли 
					НоваяСтрока.СуммаРасход > 0 Тогда 
					ОбработкаРеквизита("Состав.СуммаРасход", НоваяСтрока);
				КонецЕсли;
				
			КонецЦикла;
		КонецЕсли;
		
	ИначеЕсли ТипЗнч(Основание) = Тип("ДокументСсылка.НачислениеЗарплаты") Тогда
		ДокументОснование=Основание;
		ХозОперация = Справочники.ХозОперации.БанковскаяВыписка;
		//Вычислим сумму
		Состав.Очистить();
		//выберем всю дебиторскую задолженность по договорам, которые есть в начислении зп
		Запрос=Новый Запрос("ВЫБРАТЬ
		|	ВзаиморасчетыКомпанииОстатки.Контрагент,
		|	ВзаиморасчетыКомпанииОстатки.ДоговорВзаиморасчетов,
		|	ЕСТЬNULL(ВзаиморасчетыКомпанииОстатки.СуммаОстаток, 0) КАК Сумма,
		|	ЕСТЬNULL(ВзаиморасчетыКомпанииОстатки.СуммаУпрОстаток, 0) КАК СуммаУпр,
		|	ЕСТЬNULL(ВзаиморасчетыКомпанииОстатки.СуммаБазОстаток, 0) КАК СуммаБаз
		|ИЗ
		|	РегистрНакопления.ВзаиморасчетыКомпании.Остатки(
		|			&МоментВремени,
		|			ДоговорВзаиморасчетов В
		|				(ВЫБРАТЬ РАЗЛИЧНЫЕ
		|					НачислениеЗарплатыСотрудники.ДоговорВзаиморасчетов
		|				ИЗ
		|					Документ.НачислениеЗарплаты.Сотрудники КАК НачислениеЗарплатыСотрудники
		|				ГДЕ
		|					НачислениеЗарплатыСотрудники.Ссылка = &ДокументОснование)) КАК ВзаиморасчетыКомпанииОстатки
		|ГДЕ
		|	ВзаиморасчетыКомпанииОстатки.СуммаОстаток < 0");
		Запрос.УстановитьПараметр("ДокументОснование",ДокументОснование);
		МоментВремени = ?(ТекущаяДата() > ДокументОснование.Дата, ТекущаяДата(), КонецДня(ДокументОснование.Дата));
		Запрос.УстановитьПараметр("МоментВремени",МоментВремени);
		РезультатЗапросаПоСотрудникам = Запрос.Выполнить();
		Если НЕ РезультатЗапросаПоСотрудникам.Пустой() Тогда
			Выборка = РезультатЗапросаПоСотрудникам.Выбрать();
			Пока Выборка.Следующий() Цикл
				НоваяСтрока = Состав.Добавить();
				НоваяСтрока.Контрагент = Выборка.Контрагент;
				НоваяСтрока.ДоговорВзаиморасчетов = Выборка.ДоговорВзаиморасчетов;
				ВалютаДоговора = Выборка.ДоговорВзаиморасчетов.ВалютаВзаиморасчетов;
				ОбработкаРеквизита("Состав.ДоговорВзаиморасчетов", НоваяСтрока);
				НоваяСтрока.Сделка = ДокументОснование;
				НоваяСтрока.АвтоЗакрытиеСделок = Истина;
				Если НЕ ЗначениеЗаполнено(НоваяСтрока.СтатьяДДС) Тогда
					НоваяСтрока.СтатьяДДС				= Справочники.СтатьиДДС.ВыдачаЗП;
				КонецЕсли;
				Если ВалютаДокумента=ВалютаДоговора Тогда
					НоваяСтрока.СуммаРасход = -Выборка.Сумма;
				ИначеЕсли ВалютаДокумента=Константы.ВалютаРегламентированногоУчетаОрганизаций.Получить() Тогда
					НоваяСтрока.СуммаРасход = -Выборка.СуммаБаз; 
				ИначеЕсли ВалютаДокумента=Константы.ВалютаУправленческогоУчетаКомпании.Получить() Тогда
					НоваяСтрока.СуммаРасход = -Выборка.СуммаУпр; 
				Иначе
					СтруктураКурса = обКурсДляВалюты(ВалютаДоговора,ДокументОснование.Дата);
					Курс           = СтруктураКурса.Курс / ?(СтруктураКурса.Кратность = 0, 1, СтруктураКурса.Кратность);
					НоваяСтрока.СуммаРасход = обПересчет(-Выборка.Сумма,ВалютаДоговора,Курс,ВалютаДокумента,ДокументОснование.Дата);
				КонецЕсли;
				ОбработкаРеквизита("Состав.СуммаРасход", НоваяСтрока);
			КонецЦикла;
		КонецЕсли;
		СуммаДокумента=обПересчет(Основание.СуммаДокумента,Основание.ВалютаДокумента,Основание.КурсДокумента,ВалютаДокумента,Дата);
	КонецЕсли;
	
КонецПроцедуры // ОбработкаЗаполнения()

Процедура ПриКопировании(ОбъектКопирования)
	Если НЕ дкПриКопировании(ЭтотОбъект, ОбъектКопирования) Тогда Возврат; КонецЕсли;
	
	Документы.ПриходныйКассовыйОрдер.ОчиститьРеквизитыФискальногоРегистратора(ЭтотОбъект);
	
	Товары.Очистить();
	КодыМаркировки.Очистить();
	
	//Бондаренко++ 20260124
	Если Состав.Количество() > 0 Тогда
	    Для каждого Стр Из Состав Цикл
			Стр.ИдентификаторСтрокиВыписки = Новый УникальныйИдентификатор();
 		КонецЦикла;
 	КонецЕсли;
	//Бондаренко++ 20260124
	
	//Бондаренко++ 20231221
	Скопирован = Истина;
	//Бондаренко 20231221
	
КонецПроцедуры // ПриКопировании()

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	ДополнительныеСвойства.Вставить("ДоговорВзаиморасчетовБыл");
	ДополнительныеСвойства.Вставить("МоментВремениБыл");
	
	Если ХозОперация<>Справочники.ХозОперации.СтрокаБанковскойВыписки Тогда
		СтатьяДДС=Справочники.СтатьиДДС.ПустаяСсылка();
		Контрагент=Справочники.Контрагенты.ПустаяСсылка();
		ДоговорВзаиморасчетов=Справочники.ДоговорыВзаиморасчетов.ПустаяСсылка();
		СтавкаНДС=Справочники.СтавкиНДС.ПустаяСсылка();
		СуммаНДС=0;
		НазначениеПлатежа="";
	КонецЕсли;

	Если НЕ дкПередЗаписью(ЭтотОбъект, Отказ, РежимЗаписи, РежимПроведения) Тогда Возврат; КонецЕсли;
	
	Если ХозОперация<>Справочники.ХозОперации.СтрокаБанковскойВыписки Тогда
		СуммаДокументаПриход=Состав.Итог("СуммаПриход");
		СуммаДокументаРасход=Состав.Итог("СуммаРасход");
	КонецЕсли;
	
	СМГ_ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения);
	
	Если НЕ Отказ И Проведен И РежимЗаписи=РежимЗаписиДокумента.Проведение Тогда
		БылиДвижения = Ложь;
		Запрос = Новый Запрос();
		Запрос.УстановитьПараметр("Ссылка",Ссылка);
		
		// взаиморасчеты
		Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ ДоговорВзаиморасчетов ИЗ РегистрНакопления.ВзаиморасчетыКомпании ГДЕ Регистратор=&Ссылка";
		Результат = Запрос.Выполнить();
		Если НЕ Результат.Пустой() Тогда
			БылиДвижения = Истина;	
			ДополнительныеСвойства.Вставить("ДоговорВзаиморасчетовБыл", Результат.Выгрузить().ВыгрузитьКолонку("ДоговорВзаиморасчетов"));
		КонецЕсли;
		
		// прошлый момент времени
		Если БылиДвижения Тогда
			Запрос.Текст = "ВЫБРАТЬ МоментВремени ИЗ Документ."+Метаданные().Имя+" ГДЕ Ссылка=&Ссылка";
			ДополнительныеСвойства.Вставить("МоментВремениБыл",Запрос.Выполнить().Выгрузить().Получить(0).МоментВремени);
		КонецЕсли;
	КонецЕсли;
  	
КонецПроцедуры // ПередЗаписью()

Процедура ПриЗаписи(Отказ)
	Если НЕ дкПриЗаписи(ЭтотОбъект, Отказ) Тогда Возврат; КонецЕсли;
	
	//Бондаренко++ 20260128
	Если обПраво("ФормироватьСФнаАвансПриЗаписиВыписки") Тогда
		СМГ_ПриЗаписи();
	КонецЕсли
 	//Бондаренко-- 20260128
	
КонецПроцедуры // ПриЗаписи()

//Бондаренко++ 20260129
Процедура ОтменитьПроведениеСФнаАванс()
	
	СпЗн = Новый СписокЗначений;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	СчетФактураВыданный.Ссылка КАК СФ,
	|	СчетФактураВыданный.ДокументОснование КАК ДокументОснование,
	|	СчетФактураВыданный.Проведен КАК Проведен
	|ИЗ
	|	Документ.СчетФактураВыданный КАК СчетФактураВыданный
	|ГДЕ
	|	СчетФактураВыданный.ДокументОснование = &ДокументОснование
	|	И СчетФактураВыданный.Проведен";
	
	СпЗн.ЗагрузитьЗначения(ЭтотОбъект.Состав.ВыгрузитьКолонку("ИдентификаторСтрокиВыписки"));
	
	Запрос.УстановитьПараметр("ДокументОснование", ЭтотОбъект.Ссылка);
      	
	Результат = Запрос.Выполнить();		
	ВыборкаДетальныеЗаписи = Результат.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		СФ_НаАвансВыданный = ВыборкаДетальныеЗаписи.СФ.ПолучитьОбъект(); 
		
		Попытка
			СФ_НаАвансВыданный.Записать(РежимЗаписиДокумента.ОтменаПроведения); 
			#Если Клиент Тогда
				Если ЭтотОбъект.Комментировать Тогда
					СМГ_Сообщить("Снят с проведения авансовый "+СФ_НаАвансВыданный); 
				КонецЕсли;	
			#КонецЕсли
		Исключение
			#Если Клиент Тогда
				Если ЭтотОбъект.Комментировать Тогда
					СМГ_Сообщить("ОШИБКА! Не удалось снять с проведения авансовый "+СФ_НаАвансВыданный,СтатусСообщения.ОченьВажное); 
				КонецЕсли;	
			#КонецЕсли
		КонецПопытки;
		
	КонецЦикла;	

КонецПроцедуры //ОтменитьПроведениеСФнаАванс()
//Бондаренко-- 20260129


//Бондаренко++ 20260124
Процедура СМГ_ПриЗаписи()
	
	Если ЭтотОбъект.Дата < Дата(2026,1,1) Тогда
		Возврат;
	КонецЕсли;
	
	//Иванченко 20260324 ++  
	Если ЭтотОбъект.ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;	
	
	ОтменитьПроведениеСФнаАванс();
	//Иванченко 20260324 --                                  
	
	//Иванченко 20260216 ++                                  
	Если ЭтотОбъект.Контрагент.НашаФирма Тогда
		Возврат;
	КонецЕсли;  
	
	Структура_ОтборДолг = Новый Структура("Контрагент, ДоговорВзаиморасчетов", ЭтотОбъект.Контрагент, ЭтотОбъект.ДоговорВзаиморасчетов);
	ТЗ_Долг = РегистрыНакопления.ВзаиморасчетыКомпании.Остатки(, Структура_ОтборДолг,, "Сумма,СуммаУпр");   
	Долг = ТЗ_Долг.Итог("Сумма");
	
	Если Долг < 0 Тогда
		Возврат;
	КонецЕсли;  
	
	//Иванченко 20260324 ++ 	
	Попытка
		Структура_ОтборОстаток = Новый Структура("Автомобиль", ЭтотОбъект.ДокументОснование.Сделка.Автомобиль);
		ТЗ_Остаток = РегистрыНакопления.ОстаткиАвтомобилей.Остатки(ЭтотОбъект.Дата, Структура_ОтборОстаток,, "Количество");
		Остаток = ТЗ_Остаток.Итог("Количество");
		
		Если Остаток = 0 Тогда
			Возврат;
		КонецЕсли; 
		
	Исключение     
	КонецПопытки;  
	
	//Бондаренко++ 20260325
	//Если ЭтотОбъект.Хозоперация = Справочники.ХозОперации.СтрокаБанковскойВыписки Тогда
	//	Если ЭтотОбъект.Состав.Количество() > 0 Тогда
	//		Если ТипЗнч(ЭтотОбъект.Состав[0].Сделка) = Тип("ДокументСсылка.РеализацияАвтомобилей") Тогда
	//			//Бондаренко-- 20260325
	// 			Структура_ОтборРеализация = Новый Структура("ДокументПродажи", ЭтотОбъект.Состав[0].Сделка); 
	//			ТЗ_Реализация = РегистрыНакопления.ПродажиАвтомобилей.Обороты(,, Структура_ОтборРеализация, "ДокументПродажи", "Количество");
	//			ТЗ_Реализация.Сортировать("ДокументПродажи Убыв");     
	//			Массив_ДатаРеализации = ТЗ_Реализация.ВыгрузитьКолонку("ДокументПродажи");
	//		Иначе 
	//			Структура_ОтборРеализация = Новый Структура("ДокументПередачи", ЭтотОбъект.Состав[0].Сделка);
	//			ТЗ_Реализация = РегистрыНакопления.РеализованныеТовары.Обороты(,, Структура_ОтборРеализация, "ДокументПередачи", "Количество"); 
	//			ТЗ_Реализация.Сортировать("ДокументПередачи Убыв");       
	//			Массив_ДатаРеализации = ТЗ_Реализация.ВыгрузитьКолонку("ДокументПередачи");
	//		КонецЕсли;
	//		
	//		Если Массив_ДатаРеализации.Количество() <> 0 Тогда
	//			ДатаРеализации = Массив_ДатаРеализации[0].Дата;	
	//			
	//			Если НачалоДня(ЭтотОбъект.Дата) = НачалоДня(ДатаРеализации) Тогда   
	//				Возврат;
	//			КонецЕсли;
	//			
	//		КонецЕсли;	
	//		//Бондаренко++ 20260325
	//	КонецЕсли;
	//КонецЕсли;
	//Бондаренко-- 20260325 
	
	//Иванченко 20260324 --	

	//Иванченко 20260324 --	
	//Иванченко 20260216 --	
	
	//Иванченко 20260324 ++  	
	//Если ЭтотОбъект.ОбменДанными.Загрузка Тогда
	//	Возврат;
	//КонецЕсли;

	////Бондаренко++ 20260129
	//ОтменитьПроведениеСФнаАванс();
	////Бондаренко-- 20260129   
	//Иванченко 20260324 --                                  	
 	
	Для каждого Стр Из Состав Цикл
		
		Если обЗначениеНеЗаполнено(Стр.ИдентификаторСтрокиВыписки) Тогда
			Продолжить;
		КонецЕсли;
		
		Если Стр.СуммаПриход <= 0 Тогда
			Продолжить;
		КонецЕсли;
		
		Если Не обЗначениеНеЗаполнено(Стр.Сделка) Тогда
			Если ТипЗНЧ(Стр.Сделка) = Тип("ДокументСсылка.ЗаказНаряд") ИЛИ
				ТипЗНЧ(Стр.Сделка) = Тип("ДокументСсылка.РеализацияАвтомобилей") ИЛИ 
				ТипЗНЧ(Стр.Сделка) = Тип("ДокументСсылка.РеализацияТоваров") Тогда
				//Бондаренко++ 20260203
				Если ЭтотОбъект.Дата > Стр.Сделка.Дата Тогда
					//Бондаренко++ 20260203	
					Продолжить;
					//Бондаренко++ 20260203	
				КонецЕсли;
				//Бондаренко-- 20260203
			КонецЕсли;
		Иначе
			Продолжить;
		КонецЕсли;
		
		Если НЕ (Стр.СтатьяДДС.КоррСчет = ПланыСчетов.Регламентированный.РасчетыПоАвансамПолученным ИЛИ
			    Стр.СтатьяДДС.КоррСчет = ПланыСчетов.Регламентированный.РасчетыСПокупателями ) Тогда
			Продолжить;
 		КонецЕсли;
		
		Попытка
		    СМГ_СоздатьИлиОбновитьСФВыданный(Стр.ИдентификаторСтрокиВыписки);
  		Исключение
 		КонецПопытки; 
		
	КонецЦикла;
	
КонецПроцедуры  //СМГ_ПриЗаписи()
	
Процедура СМГ_СоздатьИлиОбновитьСФВыданный(ИдСтрокиВыписки)
	
	Если ЭтотОбъект.ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
   	СФ_НаАвансВыданный = Документы.СчетФактураВыданный.СоздатьДокумент(); 
	СФ_НаАвансВыданный.Комментарий = "Счет-фактура на аванс из банковской выписки был автоматически создан "+СокрЛП(ТекущаяДата())+" пользователем "+СокрЛП(ПараметрыСеанса.Пользователь);
	СФ_НаАвансВыданный.НаАванс = Истина;
	СФ_НаАвансВыданный.ИдентификаторСтрокиВыписки = ИдСтрокиВыписки;
	СФ_НаАвансВыданныйТребуется = Истина;
 	
	//Если Не СФ_НаАвансВыданныйТребуется Тогда
	//	Возврат;
	//КонецЕсли;	
 	 
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	СчетФактураВыданный.Ссылка КАК СФ,
	|	СчетФактураВыданный.ДокументОснование КАК ДокументОснование,
	|	СчетФактураВыданный.Проведен КАК Проведен,
	|	СчетФактураВыданный.ИдентификаторСтрокиВыписки КАК ИдентификаторСтрокиВыписки
	|ИЗ
	|	Документ.СчетФактураВыданный КАК СчетФактураВыданный
	|ГДЕ
	|	СчетФактураВыданный.ДокументОснование = &ДокументОснование
	|	И СчетФактураВыданный.ИдентификаторСтрокиВыписки = &ИдентификаторСтрокиВыписки";
	
	Запрос.УстановитьПараметр("ДокументОснование", ЭтотОбъект.Ссылка);
	Запрос.УстановитьПараметр("ИдентификаторСтрокиВыписки", ИдСтрокиВыписки);
     	
	Результат = Запрос.Выполнить();		
	ВыборкаДетальныеЗаписи = Результат.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		СФ_НаАвансВыданный = ВыборкаДетальныеЗаписи.СФ.ПолучитьОбъект(); 
		Прервать;
	КонецЦикла; 
	
	//Если СФ_НаАвансВыданный = Неопределено Тогда
	// 	Возврат;
	// КонецЕсли;
	 
	СФ_НаАвансВыданный.Заполнить(ЭтотОбъект.Ссылка);
	
	Если Не СФ_НаАвансВыданный.НаАванс Тогда
		СФ_НаАвансВыданный.НаАванс = Истина;
 	КонецЕсли;
	
 	СФ_НаАвансВыданный.Дата = ЭтотОбъект.Дата; 
	СФ_НаАвансВыданный.Комментарий = "Документ был автоматически обновлен "+СокрЛП(ТекущаяДата());
  	
	ФлЭтотОбъектПроведен = ЭтотОбъект.Проведен;
	ФлЭтотОбъектПометкаУдаления = ЭтотОбъект.ПометкаУдаления;
	
	СФ_НаАвансВыданный.Проведен = ФлЭтотОбъектПроведен;			
	СФ_НаАвансВыданный.ПометкаУдаления = ФлЭтотОбъектПометкаУдаления;
	
	Если ФлЭтотОбъектПометкаУдаления Тогда               
		Попытка 
			СФ_НаАвансВыданный.Записать(РежимЗаписиДокумента.Запись); 
			#Если Клиент Тогда
				Если ЭтотОбъект.Комментировать Тогда
					СМГ_Сообщить("Записан помеченный на удаление "+СФ_НаАвансВыданный); 
				КонецЕсли;	
			#КонецЕсли
		Исключение 
		КонецПопытки; 
	Иначе                                                           
		Если ФлЭтотОбъектПроведен Тогда
			Попытка 
				СФ_НаАвансВыданный.Записать(РежимЗаписиДокумента.Проведение); 
				#Если Клиент Тогда
					Если ЭтотОбъект.Комментировать Тогда
						СМГ_Сообщить("Записан проведённый "+СФ_НаАвансВыданный); 
					КонецЕсли;		
				#КонецЕсли
			Исключение 
			КонецПопытки; 					
		Иначе
			Попытка 
				СФ_НаАвансВыданный.Записать(РежимЗаписиДокумента.ОтменаПроведения); 
				#Если Клиент Тогда
					Если ЭтотОбъект.Комментировать Тогда
						СМГ_Сообщить("Записан непроведённый "+СФ_НаАвансВыданный); 
					КонецЕсли;		
				#КонецЕсли
			Исключение 
			КонецПопытки; 					
		КонецЕсли; 
	КонецЕсли;
  	
КонецПроцедуры //СМГ_СоздатьИлиОбновитьСФВыданный()
//Бондаренко-- 20260124


Процедура ПередУдалением(Отказ)
	Если НЕ дкПередУдалением(ЭтотОбъект, Отказ) Тогда Возврат; КонецЕсли;
КонецПроцедуры // ПередУдалением()

Процедура ОбработкаУдаленияПроведения(Отказ)
	Если НЕ дкОбработкаУдаленияПроведения(ЭтотОбъект, Отказ) Тогда Возврат; КонецЕсли;
КонецПроцедуры // ОбработкаУдаленияПроведения()

//Бондаренко++ 20241207

Функция НайтиVIN(НазнПлат)
	
	VIN = "";
	
	МассивПодстрок = Новый Массив;
 	МассивПодстрок = обРазложитьСтрокуВМассивПодстрок(НазнПлат," ");
	РазмерностьМассива = МассивПодстрок.Количество();
	
	НайденVIN = Ложь;
	
	Для Сч = 0 По РазмерностьМассива-1 Цикл
		
		Если НайденVIN Тогда
		    VIN = Врег(СокрЛП(МассивПодстрок[Сч]));
			Если СтрДлина(VIN) = 17 Тогда
				Возврат VIN;
			КонецЕсли;
  		КонецЕсли;
		
		Если СтрНайти(Врег(МассивПодстрок[Сч]),"VIN") = 0 Тогда
 			Продолжить;
		Иначе	
			НайденVIN = Истина;
		КонецЕсли;
		
	КонецЦикла;	
	
	Возврат VIN;
 
КонецФункции // НайтиVIN(НазнПлат)


Функция СМГ_ОбработкаПроведения()

	флОтказ = Ложь;
	
	Движения.ОплатаАвтомобилей.Очистить();
	
	Для каждого Стр Из Состав Цикл
		
		Если СтрНайти(ВРЕГ(Стр.НазначениеПлатежа),"VIN") = 0 Тогда
			Продолжить;
		КонецЕсли;
		
		Если Стр.СуммаРасход = 0 Тогда
			Продолжить;
		КонецЕсли;
		
		VIN = "";
		Автомобиль = Справочники.Автомобили.ПустаяСсылка();
		ЗаказПоставщику = Документы.ЗаказПоставщикуНаАвтомобиль.ПустаяСсылка();
		
		VIN = НайтиVIN(Стр.НазначениеПлатежа);
		Автомобиль = Справочники.Автомобили.НайтиПоРеквизиту("VIN",VIN);
		ЗаказПоставщикуНаАвтомобиль = Документы.ЗаказПоставщикуНаАвтомобиль.НайтиПоРеквизиту("Автомобиль",Автомобиль);
		
		Движение = Движения.ОплатаАвтомобилей.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Период = ЭтотОбъект.Дата;
		Движение.Автомобиль = Автомобиль ;
		Движение.Выписка = Ссылка;
		Движение.ЗаказПоставщикуНаАвтомобиль = ЗаказПоставщикуНаАвтомобиль;
		Движение.Контрагент = Стр.Контрагент;
		Движение.VIN = VIN;
		Движение.НомерСтрокиВыписки = Стр.НомерСтроки;
		Движение.Сумма = Стр.СуммаРасход; 
		
	КонецЦикла;
	
	Возврат флОтказ;                    
	
КонецФункции       
//Бондаренко-- 20241207
 
Процедура ОбработкаПроведения(Отказ, Режим)
	
	Если НЕ дкОбработкаПроведения(ЭтотОбъект, Отказ, Режим) Тогда
		Возврат;
	КонецЕсли;
	
  	// Ошибка, если счет не соответствует организации или подразделению
	Отказ = НЕ дкПроверитьКорректностьБанковскогоСчета(БанковскийСчет, Организация, ПодразделениеКомпании, ДополнительныеСвойства);
	Если Отказ Тогда
		РезультатОбработки = "Банковский счет не соответствует выбранной организации";
		дкВыводРезультатовОбработки(ЭтотОбъект, Отказ);
		Возврат;
	КонецЕсли;
	
	//Бондаренко++ 20241207
	Отказ = СМГ_ОбработкаПроведения();
	//Бондаренко-- 20241207
 	
	СуммаДоходаРасходаСуммовыхРазниц=0;
	
	// деньги
	НаборЗаписейДС=Движения.ДенежныеСредстваКомпании;
	НаборЗаписейДС.РежимПроведения=Режим;
	НаборЗаписейДС.СтруктурнаяЕдиница=БанковскийСчет;
	НаборЗаписейДС.Валюта=ВалютаДокумента;
	НаборЗаписейДС.Курс=КурсДокумента;
	
	// взаиморасчеты
	НаборЗаписейВзаиморасчеты=Движения.ВзаиморасчетыКомпании;
	НаборЗаписейВзаиморасчеты.РежимПроведения=Режим;
	ТипыСделокСПокупателем=орПолучитьТипыСделок(Истина);
	ТипыСделокСПоставщиком=орПолучитьТипыСделок(Ложь);
	
	// БАЛАНС: Подразделение банковского счета и подразделения договоров из табличной части могут
	// находится в разных балансовых "ветках". Поэтому, если в системе ведется баланс по подразделениям, то
	// возможен "разрыв" баланса. Следовательно, придется создавать корректирующие движения по регистру "Доходы и расходы".
	БалансВедетсяПоПодразделениям = (Константы.СпособВеденияБаланса.Получить()=Перечисления.СпособВеденияБаланса.ПоПодразделению);
	ПодразделениеБанкСета         = обПолучитьБалансовоеПодразделение(БанковскийСчет.Подразделение);
	
	// Для накопления записей корректировок используем специальную таблицу
	ТаблицаВзаиморасчетов = Новый ТаблицаЗначений;
	ТаблицаВзаиморасчетов.Колонки.Добавить("Подразделение",  Новый ОписаниеТипов("СправочникСсылка.ПодразделенияКомпании"));
	ТаблицаВзаиморасчетов.Колонки.Добавить("СуммаУпрРасход", Новый ОписаниеТипов("Число"));
	ТаблицаВзаиморасчетов.Колонки.Добавить("СуммаУпрПриход", Новый ОписаниеТипов("Число"));

	// Суммовые разницы возникают в рамках договора, поэтому их нельзя списывать одним движением.
	ТаблицаСуммовыхРазниц = Новый ТаблицаЗначений;
	ТаблицаСуммовыхРазниц.Колонки.Добавить("Подразделение", Новый ОписаниеТипов("СправочникСсылка.ПодразделенияКомпании"));
	ТаблицаСуммовыхРазниц.Колонки.Добавить("СуммаУпр",      Новый ОписаниеТипов("Число"));
	
	Для Каждого СтрокаТЧ Из Состав Цикл
		// Обнулим суммовые разницы 
		СуммаДоходаРасходаСуммовыхРазниц = 0;
		
		НаборЗаписейДС.ДокументОбъект=ЭтотОбъект;
		НаборЗаписейВзаиморасчеты.ДокументОбъект=ЭтотОбъект;
		НаборЗаписейВзаиморасчеты.Валюта = Неопределено;
		НаборЗаписейВзаиморасчеты.КурсВзаиморасчетов = СтрокаТЧ.КурсВалютыВзаиморасчетов;
		
		// деньги
		НаборЗаписейДС.СтатьяДДС=СтрокаТЧ.СтатьяДДС;
		
		// взаиморасчеты		
		НаборЗаписейВзаиморасчеты.Контрагент=СтрокаТЧ.Контрагент;
		НаборЗаписейВзаиморасчеты.ДоговорВзаиморасчетов=СтрокаТЧ.ДоговорВзаиморасчетов;
		НаборЗаписейВзаиморасчеты.Сделка=СтрокаТЧ.Сделка;
		ТипСделки=ТипЗнч(СтрокаТЧ.Сделка);
		Если ТипыСделокСПокупателем.СодержитТип(ТипСделки) Тогда
			 НаборЗаписейВзаиморасчеты.ВзаиморасчетыСПокупателем=Истина;
		ИначеЕсли ТипыСделокСПоставщиком.СодержитТип(ТипСделки) Тогда
			 НаборЗаписейВзаиморасчеты.ВзаиморасчетыСПокупателем=Ложь;
		Иначе
			 НаборЗаписейВзаиморасчеты.ВзаиморасчетыСПокупателем=Неопределено;
		КонецЕсли;
		Если Режим=РежимПроведенияДокумента.Оперативный Тогда
			НаборЗаписейВзаиморасчеты.МоментВремени=Неопределено;
		Иначе
			Если СтрокаТЧ.НомерСтроки=1 Тогда
				НаборЗаписейВзаиморасчеты.МоментВремени=Новый Граница(МоментВремени(),ВидГраницы.Исключая);
			Иначе
				НаборЗаписейВзаиморасчеты.МоментВремени=Новый Граница(МоментВремени(),ВидГраницы.Включая);
			КонецЕсли;  
		КонецЕсли;  
		НаборЗаписейВзаиморасчеты.АвтоЗакрытиеСделок=СтрокаТЧ.АвтоЗакрытиеСделок;
		НаборЗаписейВзаиморасчеты.СуммаДоходаРасходаСуммовыхРазниц=0;
		Если (СтрокаТЧ.СуммаПриход<>0)И(СтрокаТЧ.СуммаРасход<>0) Тогда
			дкСообщитьРезультат("Приход и расход в одной строке "+СтрокаТЧ.НомерСтроки+" !","Важное&Выписка:",ЭтотОбъект,СтрокаТЧ.Контрагент);
			Отказ = Истина;	Продолжить;
		ИначеЕсли (СтрокаТЧ.СуммаПриход=0)И(СтрокаТЧ.СуммаРасход=0) Тогда
			дкСообщитьРезультат("Ни прихода ни расхода в строке "+СтрокаТЧ.НомерСтроки+" !","Важное&Выписка:",ЭтотОбъект,СтрокаТЧ.Контрагент);
			Отказ = Истина;	Продолжить;
		ИначеЕсли СтрокаТЧ.СуммаПриход<>0 Тогда
			// взаиморасчеты
			НаборЗаписейВзаиморасчеты.Сумма=СтрокаТЧ.СуммаПриход;
			Отказ=НЕ НаборЗаписейВзаиморасчеты.Расход() ИЛИ Отказ;
			
			// деньги
			Если НЕ (СтрокаТЧ.СуммаПриход - СтрокаТЧ.СуммаУслуг) = 0 Тогда
				НаборЗаписейДС.Сумма=СтрокаТЧ.СуммаПриход - СтрокаТЧ.СуммаУслуг;
				НаборЗаписейДС.СуммаВсего=СуммаДокументаПриход-СтрокаТЧ.СуммаПриход-СуммаДокументаРасход;
				Отказ=НЕ НаборЗаписейДС.Приход() ИЛИ Отказ;
			КонецЕсли;
		ИначеЕсли СтрокаТЧ.СуммаРасход<>0 Тогда
			// взаиморасчеты
			Если НЕ СтрокаТЧ.СтатьяДДС = Справочники.СтатьиДДС.ОплатаБанковскихУслуг Тогда
				НаборЗаписейВзаиморасчеты.Сумма=СтрокаТЧ.СуммаРасход - СтрокаТЧ.СуммаУслуг;
				Отказ=НЕ НаборЗаписейВзаиморасчеты.Приход() ИЛИ Отказ;
			КонецЕсли;
			
			// деньги
			НаборЗаписейДС.Сумма=СтрокаТЧ.СуммаРасход;
			НаборЗаписейДС.СуммаВсего=СуммаДокументаПриход+СтрокаТЧ.СуммаРасход-СуммаДокументаРасход;
			Отказ=НЕ НаборЗаписейДС.Расход() ИЛИ Отказ;
		КонецЕсли; 
		
		НаборЗаписейВзаиморасчеты.Записать();
		
		Если СтрокаТЧ.СуммаУслуг <> 0 ИЛИ СтрокаТЧ.СтатьяДДС = Справочники.СтатьиДДС.ОплатаБанковскихУслуг Тогда
			НаборЗаписейДиР = Движения.ДоходыИРасходы;
			НаборЗаписейДиР.ДокументОбъект = ЭтотОбъект;
			НаборЗаписейДиР.Подразделение  = БанковскийСчет.Подразделение;
			НаборЗаписейДиР.СтатьяДоходовИРасходов = Справочники.СтатьиДоходовИРасходов.РасходыНаУслугиБанков;
			НаборЗаписейДиР.ВУпрВалюте = Ложь;
			НаборЗаписейДиР.Расход     = ?(СтрокаТЧ.СуммаУслуг = 0, СтрокаТЧ.СуммаРасход, СтрокаТЧ.СуммаУслуг);
			Отказ = НЕ НаборЗаписейДиР.Приход() ИЛИ Отказ;
		КонецЕсли;
		
		СуммаДоходаРасходаСуммовыхРазниц = НаборЗаписейВзаиморасчеты.СуммаДоходаРасходаСуммовыхРазниц;
		
		// Заполняем таблицу суммовых разниц
		НоваяСтрока = ТаблицаСуммовыхРазниц.Добавить();
		Если БалансВедетсяПоПодразделениям Тогда
			НоваяСтрока.Подразделение = СтрокаТЧ.ДоговорВзаиморасчетов.Подразделение;
		Иначе
			НоваяСтрока.Подразделение = ПодразделениеКомпании; 
		КонецЕсли;
		НоваяСтрока.СуммаУпр = СуммаДоходаРасходаСуммовыхРазниц;
		
		// БАЛАНС: Если балансовые подразделения договора и банковского счета различны, то будет 
		// "разрыв" баланса. Необходимо добавить корректирующие движения по регистру "Доходы и Расходы"
		Если БалансВедетсяПоПодразделениям Тогда
			ПодразделениеДоговора = обПолучитьБалансовоеПодразделение(СтрокаТЧ.ДоговорВзаиморасчетов.Подразделение);
			Если ПодразделениеБанкСета<>ПодразделениеДоговора Тогда
				НоваяСтрока = ТаблицаВзаиморасчетов.Добавить();
				НоваяСтрока.Подразделение  = СтрокаТЧ.ДоговорВзаиморасчетов.Подразделение;
				НоваяСтрока.СуммаУпрРасход = СтрокаТЧ.СуммаРасход;
				НоваяСтрока.СуммаУпрПриход = СтрокаТЧ.СуммаПриход;
			КонецЕсли;
		КонецЕсли;
		
	КонецЦикла;
	
	// Создаем движения по суммовым разницам
	ТаблицаСуммовыхРазниц.Свернуть("Подразделение", "СуммаУпр");
	Если ТаблицаСуммовыхРазниц.Количество()<>0 Тогда
		Для Каждого ТекСтрока Из ТаблицаСуммовыхРазниц Цикл  	
			НаборЗаписейДиР = Движения.ДоходыИРасходы;
			НаборЗаписейДиР.ДокументОбъект         = ЭтотОбъект;
			НаборЗаписейДиР.Подразделение          = ТекСтрока.Подразделение;
			НаборЗаписейДиР.СтатьяДоходовИРасходов = Справочники.СтатьиДоходовИРасходов.СуммовыеРазницы;
			НаборЗаписейДиР.ВУпрВалюте = Истина;
			Если ТекСтрока.СуммаУпр<0 Тогда
				НаборЗаписейДиР.Расход = -ТекСтрока.СуммаУпр;
			Иначе
				НаборЗаписейДиР.Доход  = ТекСтрока.СуммаУпр;
			КонецЕсли;
			Отказ = НЕ НаборЗаписейДиР.Приход() ИЛИ Отказ;			
		КонецЦикла;	
	КонецЕсли;
	
	// БАЛАНС: создаем корректирующие движения. Сумма в управленческой валюте будет рассчитана в 
	// модуле набора записей. Для этого указываем реквизит "ВУпрВалюте=Ложь";
	ТаблицаВзаиморасчетов.Свернуть("Подразделение", "СуммаУпрРасход, СуммаУпрПриход");
	Если ТаблицаВзаиморасчетов.Количество()<>0 Тогда
		Для Каждого ТекСтрока Из ТаблицаВзаиморасчетов Цикл  	
			
			Если ТекСтрока.СуммаУпрПриход<>0 Тогда
				// Корректируем движения денежных средств
				НаборЗаписейДиР = Движения.ДоходыИРасходы;
				НаборЗаписейДиР.ДокументОбъект = ЭтотОбъект;
				НаборЗаписейДиР.Подразделение  = БанковскийСчет.Подразделение;
				НаборЗаписейДиР.СтатьяДоходовИРасходов = Справочники.СтатьиДоходовИРасходов.КорректировкаБалансаПоПодразделениям;
				НаборЗаписейДиР.ВУпрВалюте = Ложь;
				НаборЗаписейДиР.Доход      = ТекСтрока.СуммаУпрПриход;
				Отказ = НЕ НаборЗаписейДиР.Приход() ИЛИ Отказ;	
				
				// Корректируем движения взаиморасчетов.
				НаборЗаписейДиР = Движения.ДоходыИРасходы;
				НаборЗаписейДиР.ДокументОбъект = ЭтотОбъект;
				НаборЗаписейДиР.Подразделение  = ТекСтрока.Подразделение;
				НаборЗаписейДиР.СтатьяДоходовИРасходов = Справочники.СтатьиДоходовИРасходов.КорректировкаБалансаПоПодразделениям;
				НаборЗаписейДиР.ВУпрВалюте = Ложь;
				НаборЗаписейДиР.Расход     = ТекСтрока.СуммаУпрПриход;
				Отказ = НЕ НаборЗаписейДиР.Приход() ИЛИ Отказ;	
			КонецЕсли;
			
			Если ТекСтрока.СуммаУпрРасход<>0 Тогда
				// Корректируем движения денежных средств
				НаборЗаписейДиР = Движения.ДоходыИРасходы;
				НаборЗаписейДиР.ДокументОбъект = ЭтотОбъект;
				НаборЗаписейДиР.Подразделение  = БанковскийСчет.Подразделение;
				НаборЗаписейДиР.СтатьяДоходовИРасходов = Справочники.СтатьиДоходовИРасходов.КорректировкаБалансаПоПодразделениям;
				НаборЗаписейДиР.ВУпрВалюте = Ложь;
				НаборЗаписейДиР.Доход      = ТекСтрока.СуммаУпрРасход;
				Отказ = НЕ НаборЗаписейДиР.Расход() ИЛИ Отказ;
				
				// Корректируем движения взаиморасчетов.
				НаборЗаписейДиР = Движения.ДоходыИРасходы;
				НаборЗаписейДиР.ДокументОбъект = ЭтотОбъект;
				НаборЗаписейДиР.Подразделение  = ТекСтрока.Подразделение;
				НаборЗаписейДиР.СтатьяДоходовИРасходов = Справочники.СтатьиДоходовИРасходов.КорректировкаБалансаПоПодразделениям;
				НаборЗаписейДиР.ВУпрВалюте = Ложь;
				НаборЗаписейДиР.Доход      = ТекСтрока.СуммаУпрРасход;
				Отказ = НЕ НаборЗаписейДиР.Приход() ИЛИ Отказ;	
			КонецЕсли;  					
		КонецЦикла;	
	КонецЕсли;
	
	// Возможно расхождение баланса на "копейки" из-за округления. Возникшую разницу
	// необходимо списать на доходы и расходы.
	Отказ = НЕ дкСписаниеКопейкиПриОкругленииВалютныхСчетов(ЭтотОбъект) ИЛИ Отказ;
	
	//проведение в Платежный календарь
	НаборЗаписей = Движения.ПлатежныйКалендарь;
	НаборЗаписей.ДокументОбъект = Ссылка;
	
	Отказ = НЕ НаборЗаписей.ФактВыписка() ИЛИ Отказ;
	
	ДвигаемГраницу = (Режим<>РежимПроведенияДокумента.Оперативный И Движения.ВзаиморасчетыКомпании.Количество()>0);
	Если ДвигаемГраницу ИЛИ ЗначениеЗаполнено(ДополнительныеСвойства.ДоговорВзаиморасчетовБыл) Тогда
		НаборЗаписейГраницыВзаиморасчетов = РегистрыСведений.ГраницыВзаиморасчетов.СоздатьНаборЗаписей();
		Если ДвигаемГраницу Тогда
			ТаблицаДоговоров = Движения.ВзаиморасчетыКомпании.Выгрузить();
			ТаблицаДоговоров.Свернуть("ДоговорВзаиморасчетов","");
			НаборЗаписейГраницыВзаиморасчетов.ДоговорВзаиморасчетов = ТаблицаДоговоров.ВыгрузитьКолонку("ДоговорВзаиморасчетов");
			НаборЗаписейГраницыВзаиморасчетов.МоментВремени = Дата;
			НаборЗаписейГраницыВзаиморасчетов.ДоговорВзаиморасчетовБыл = ДополнительныеСвойства.ДоговорВзаиморасчетовБыл;
			НаборЗаписейГраницыВзаиморасчетов.МоментВремениБыл = ДополнительныеСвойства.МоментВремениБыл;
		Иначе
			НаборЗаписейГраницыВзаиморасчетов.ДоговорВзаиморасчетов = ДополнительныеСвойства.ДоговорВзаиморасчетовБыл;
			НаборЗаписейГраницыВзаиморасчетов.МоментВремени = ДополнительныеСвойства.МоментВремениБыл;
			НаборЗаписейГраницыВзаиморасчетов.ДоговорВзаиморасчетовБыл = Неопределено;
			НаборЗаписейГраницыВзаиморасчетов.МоментВремениБыл = Неопределено;
		КонецЕсли;
		НаборЗаписейГраницыВзаиморасчетов.ДокументСсылка = Ссылка;
		НаборЗаписейГраницыВзаиморасчетов.ИзменитьГраницу();
	КонецЕсли;
	
	// выведем сообщения об ошибках и предупреждениях
	дкВыводРезультатовОбработки(ЭтотОбъект,Отказ);
	
КонецПроцедуры // ОбработкаПроведения()

Процедура ПодобратьALCПакет(ЭтаФорма, ТекСтрока) Экспорт 
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЗаказНаряд.Ссылка,
		|	ЗаказНаряд.СуммаДокумента
		|ИЗ
		|	Документ.ЗаказНаряд КАК ЗаказНаряд
		|ГДЕ
		|	ЗаказНаряд.НомерАкта = &НомерАкта
		|
		|УПОРЯДОЧИТЬ ПО
		|	ЗаказНаряд.Дата";
	
	Запрос.УстановитьПараметр("НомерАкта", ТекСтрока.ACL);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	Итератор = 1;
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Если Итератор = 1 тогда
			ТекСтрока.Сделка =  ВыборкаДетальныеЗаписи.Ссылка;
			ТекСтрока.СуммаПриход = ВыборкаДетальныеЗаписи.СуммаДокумента; 
			Итератор = Итератор + 1;
			Продолжить;
		КонецЕсли;
		СтрокаТЧ = ЭтаФорма.Состав.Добавить();
		СтрокаТЧ.СтатьяДДС             = ТекСтрока.СтатьяДДС;
		СтрокаТЧ.Контрагент			   = ВыборкаДетальныеЗаписи.Ссылка.Контрагент; 
		СтрокаТЧ.ДоговорВзаиморасчетов = ВыборкаДетальныеЗаписи.Ссылка.ДоговорВзаиморасчетов; 
		СтрокаТЧ.Сделка 			   = ВыборкаДетальныеЗаписи.Ссылка;
		СтрокаТЧ.СуммаПриход		   = ВыборкаДетальныеЗаписи.СуммаДокумента; 
 		СтрокаТЧ.НазначениеПлатежа	   = ТекСтрока.НазначениеПлатежа; 
		СтрокаТЧ.КурсВалютыВзаиморасчетов = 1; 
		СтрокаТЧ.ACL	  			   = ТекСтрока.ACL; 
		СтрокаТЧ.ПлатежноеПоручениеОснование	   = ТекСтрока.ПлатежноеПоручениеОснование; 

		СтрокаТЧ.СтавкаНДС			   = Справочники.СтавкиНДС.БезНДС; 
		
		Итератор = Итератор + 1;
	КонецЦикла;
	

	
КонецПроцедуры	

//Бондаренко++ 20180327
Процедура ЗагрузитьALCПакетИзФайлаЭксель(ЭтаФорма, ТекСтрока) Экспорт
	 
	Диалог = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.ВыборКаталога);
	Диалог.Заголовок = "Укажите каталог, содержащий файлы Exсel";
	СписокФайлов = Неопределено;
 
	Пока Истина Цикл
		Если НЕ Диалог.Выбрать() Тогда // Выбирается каталог с файлами
			Возврат;
		КонецЕсли;
		
		СписокФайлов = НайтиФайлы(Диалог.Каталог, "*.xls"); // Получаем список всех файлов в выбранном каталоге

		// Если не обнаружено ни одной обработки...
		Если СписокФайлов.Количество() = 0 Тогда
			Ответ = Вопрос("В указанном каталоге не обнаружены файлы Excel." + Символы.ПС + "Выбрать другой каталог?", РежимДиалогаВопрос.ДаНет);
			Если Ответ = КодВозвратаДиалога.Нет Тогда
				Прервать;
			КонецЕсли;
		Иначе
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	Для каждого ТекФайл Из СписокФайлов Цикл
		#Если КЛИЕНТ Тогда 
			Сообщить("Имя файла: "+ТекФайл.ПолноеИмя);
		#КонецЕсли	
		ФайлЭксель = Новый Файл(ТекФайл.ПолноеИмя);
 		Если ФайлЭксель.Существует() Тогда
			#Если КЛИЕНТ Тогда 
				ИмяФайлаЭксель = СокрЛП(ФайлЭксель.ПолноеИмя);
				Сообщить("Файл = "+ИмяФайлаЭксель+" существует");
  				Результат = ПрочитатьEXCEL(ЭтаФорма,ИмяФайлаЭксель,ТекСтрока);
				Сообщить("Результат = "+Результат);
			#КонецЕсли	
		КонецЕсли;   
	КонецЦикла; 

КонецПроцедуры // ЗагрузитьALCПакетИзФайлаЭксель()

// функция чтения из EXCEL файла аналогов
Функция ПрочитатьEXCEL(ЭтаФорма,ИмяФайла,ТекСтрока)
	
	НеНужныйФайл = Истина;
 	
	ВсеОК = Истина;
	
	ИмяОбрФайла = СокрЛП(ИмяФайла);
	
	Колонка_НомерЗН = 2;
	Колонка_Вин     = 3;
	Колонка_Сумма   = 5;
	
	СтрокаНачало = 1;
 	СтрокаКонец = 1000;
  	
	Приложение = Новый COMОбъект("Excel.Application");
	Приложение.Application.Workbooks.Open(ИмяОбрФайла);

	Если Приложение=Неопределено Тогда
		Предупреждение("MS Excel не загружен");
		Возврат Ложь;
	КонецЕсли;

	ОбрабатываемаяСтрока=?(обЗначениеНеЗаполнено(СтрокаНачало),1,СтрокаНачало);
	ВесьФайл = обЗначениеНеЗаполнено(СтрокаКонец);
	ТекстЛист = Приложение.ActiveSheet;
	КоличествоСтрок = Приложение.ActiveCell.SpecialCells(11).Row;
	
	Итератор = 1;
	
	Пока ОбрабатываемаяСтрока<=КоличествоСтрок И (ВесьФайл ИЛИ ОбрабатываемаяСтрока<=СтрокаКонец) Цикл
		Состояние("Обрабатывается строка " + ОбрабатываемаяСтрока);
		ОбработкаПрерыванияПользователя();
		
		НомерЗН = ТекстЛист.Cells(ОбрабатываемаяСтрока, Колонка_НомерЗН).Value;
  		ВИН=ТекстЛист.Cells(ОбрабатываемаяСтрока,Колонка_Вин).Value;
		Сумма=ТекстЛист.Cells(ОбрабатываемаяСтрока,Колонка_Сумма).Value;
  		ОбрабатываемаяСтрока = ОбрабатываемаяСтрока+1;
		
 		НомерЗН = СокрЛП(НомерЗН);
		НомерЗН=СтрЗаменить(НомерЗН,"?","");
		ВИН = СокрЛП(ВИН);
		Сумма = СтрЗаменить(Сумма,Символы.НПП,"");
		Сумма = СтрЗаменить(Сумма,",",".");
 		
		Если обЗначениеНеЗаполнено(НомерЗН) Тогда
			Продолжить;
		КонецЕсли; 
		
		Если Найти(ТекСтрока.НазначениеПлатежа,НомерЗН)>0 Тогда
			Сообщить("Найден акт = "+НомерЗН+" в Назначении платежа "+ТекСтрока.НазначениеПлатежа);	
			НеНужныйФайл = Ложь;
		КонецЕсли; 
		
		Если НеНужныйФайл Тогда
			// Не нашли номер вкта в Назначении платежа текущей строки;
			Продолжить;
 		КонецЕсли; 
 		
		Если обЗначениеНеЗаполнено(ВИН) Тогда
			Продолжить;
		КонецЕсли; 
		
		Если СтрДлина(ВИН) < 17 Тогда
			Продолжить;
		КонецЕсли; 
 		
		Если обЗначениеНеЗаполнено(Сумма) Тогда
 			Продолжить;
		КонецЕсли; 
 		
		Сообщить("НомерЗН = "+НомерЗН+"; ВИН = "+ВИН+"; Сумма = "+Сумма+"; Обрабатываемая cтрока = "+ОбрабатываемаяСтрока);
		
		ДатаНачала = ДобавитьМесяц(ТекущаяДата(),-24);
		ДатаОкончания = КонецДня(ТекущаяДата());
		
		СсылкаНаЗН = Документы.ЗаказНаряд.ПустаяСсылка();
		
		СсылкаНаЗН = НайтиЗН(НомерЗН,ВИН,ДатаНачала,ДатаОкончания);
		 
		//Если обЗначениеНеЗаполнено(СсылкаНаЗН)  Тогда
		//Продолжить;
		//Иначе
		//	Сообщить("Найден ЗН "+СсылкаНаЗН);
		//КонецЕсли; 
		
 
	  //Если Итератор = 1 тогда
	  //  	ТекСтрока.Сделка =  СсылкаНаЗН;
	  //  	ТекСтрока.СуммаПриход = Сумма;
	  //  	//ТекСтрока.Автоматически = Истина;
	  //  	ТекСтрока.НазначениеПлатежа	 = "НомерЗН = "+НомерЗН+"; ВИН = "+ВИН+"; Сумма = "+Сумма+"; Заказ-наряд = <<"+СсылкаНаЗН+">>; Cтрока = "+ОбрабатываемаяСтрока;
	  //	Итератор = Итератор + 1;
	  //  	Продолжить;
	  //  КонецЕсли;
		СтрокаТЧ = ЭтаФорма.Состав.Добавить();
		СтрокаТЧ.СтатьяДДС             = ТекСтрока.СтатьяДДС;
		СтрокаТЧ.Контрагент			   = СсылкаНаЗН.Контрагент; 
		СтрокаТЧ.ДоговорВзаиморасчетов = СсылкаНаЗН.ДоговорВзаиморасчетов; 
		СтрокаТЧ.Сделка 			   = СсылкаНаЗН;
		СтрокаТЧ.СуммаПриход		   = Сумма; 
 		СтрокаТЧ.НазначениеПлатежа	 = "НомерЗН = "+НомерЗН+"; ВИН = "+ВИН+"; Сумма = "+Сумма+"; Заказ-наряд = <<"+СсылкаНаЗН+">>; Cтрока = "+ОбрабатываемаяСтрока;
		СтрокаТЧ.КурсВалютыВзаиморасчетов = 1; 
		СтрокаТЧ.ACL	  			   = ТекСтрока.ACL; 
		СтрокаТЧ.ПлатежноеПоручениеОснование  = ТекСтрока.ПлатежноеПоручениеОснование; 
 		СтрокаТЧ.СтавкаНДС			   = Справочники.СтавкиНДС.БезНДС; 
		СтрокаТЧ.Автоматически = Истина;
		СтрокаТЧ.НомерАкта=ТекСтрока.НомерАкта;
 		Итератор = Итератор + 1;
	КонецЦикла;
   	
	Для Каждого Book Из Приложение.WorkBooks Цикл
		Book.Close(Ложь,"",Истина);
	КонецЦикла;
	Приложение.Quit();
	Приложение=Неопределено;				

	Возврат ВсеОК;
КонецФункции // ПрочитатьАналогиEXCEL()

Функция НайтиЗН(НомерЗН,ВИН,ДатаНачала,ДатаОкончания);
	
	СписокВидовРемонта = Новый СписокЗначений;
 	СписокВидовРемонта.Добавить(Справочники.ВидыРемонта.ГарантияПроизводителя);
	СписокВидовРемонта.Добавить(Справочники.ВидыРемонта.ГарантияДистирибьютера);
	СписокВидовРемонта.Добавить(Справочники.ВидыРемонта.ГарантияПроизводителяЛКП);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЗаказНаряд.Ссылка
		|ИЗ
		|	Документ.ЗаказНаряд КАК ЗаказНаряд
		|ГДЕ
		|	ЗаказНаряд.Дата МЕЖДУ &ДатаНачала И &ДатаОкончания
		|	И ЗаказНаряд.ВидРемонта В (&СписокВидовРемонта)
		|	И ЗаказНаряд.Проведен = ИСТИНА
		|	И ЗаказНаряд.Автомобиль.VIN = &ВИН
		|	И ЗаказНаряд.Номер Подобно &НомерЗН";
	
	Запрос.УстановитьПараметр("ДатаНачала", ДатаНачала);
	Запрос.УстановитьПараметр("ДатаОкончания", ДатаОкончания);
	Запрос.УстановитьПараметр("СписокВидовРемонта", СписокВидовРемонта);
	Запрос.УстановитьПараметр("ВИН", ВИН);
	Запрос.УстановитьПараметр("НомерЗН", "%%"+НомерЗН+"%%");
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		 Возврат ВыборкаДетальныеЗаписи.Ссылка;
	КонецЦикла;
	
	Возврат Документы.ЗаказНаряд.ПустаяСсылка();
 
КонецФункции // НайтиЗН()
//Бондаренко-- 20180327

//Гэндальф+++
Функция НеУказанДоговорВзаиморасчетов(РежимЗаписи)
	НеУказан =  Ложь;
	Если РежимЗаписи=РежимЗаписиДокумента.Проведение тогда
		Если ХозОперация=Справочники.ХозОперации.СтрокаБанковскойВыписки Тогда
			Если ДоговорВзаиморасчетов = Справочники.ДоговорыВзаиморасчетов.ПустаяСсылка() тогда
				НеУказан =  Истина;
				Сообщить("Не указан договор взаиморасчетов");
			КонецЕсли;	 
		Иначе
			Для Каждого стр из Состав цикл
				Если обЗначениеНеЗаполнено(стр.ДоговорВзаиморасчетов) тогда
					НеУказан =  Истина;
					Сообщить("В строке № " + стр.НомерСтроки + " не указан договор взаиморасчетов!");
				КонецЕсли;
 			КонецЦикла;	 
		КонецЕсли; 	 
	КонецЕсли;
	Возврат НеУказан;
КонецФункции
//Гэндальф---

Процедура СМГ_ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	Отказ = Отказ Или НеУказанДоговорВзаиморасчетов(РежимЗаписи);
	
	//Бондаренко++ 20231108
	Если Дата >= Дата(2023,11,1) Тогда
		НомераОшибочныхСтрок = "";      
		БылиОшибки = Ложь;
		Для каждого Стр Из Состав Цикл
			Если Стр.СуммаРасход = 0 Тогда
				Продолжить;
			КонецЕсли;	
			Если НЕ обЗначениеНеЗаполнено(Стр.Сделка) Тогда
				Продолжить;
			КонецЕсли;
			Если Стр.БезСчетаОтПоставщика Тогда
				Продолжить;
 			КонецЕсли;
			БылиОшибки = Истина;   
			Если СокрЛП(НомераОшибочныхСтрок) <> "" Тогда
				НомераОшибочныхСтрок = СокрЛП(НомераОшибочныхСтрок)+";"+СокрЛП(Стр.НомерСтроки);
			Иначе
				НомераОшибочныхСтрок = СокрЛП(Стр.НомерСтроки);				
			КонецЕсли;
		КонецЦикла;
		Если БылиОшибки Тогда
			СМГ_Сообщить("ОШИБКА! Есть строки с расходом, в которых не выбран счет от поставщика.",СтатусСообщения.ОченьВажное);
			СМГ_Сообщить("Номера строк:"+НомераОшибочныхСтрок,СтатусСообщения.ОченьВажное);
		КонецЕсли;             
	КонецЕсли;
	//Бондаренко 20231108
	
	//Бондаренко++ 20250416
	Если РежимЗаписи=РежимЗаписиДокумента.Проведение Тогда
		Если ХозОперация = Справочники.ХозОперации.СтрокаБанковскойВыписки Тогда
			Если Дата >= Дата(2025,04,15) Тогда
 				Если Состав.Количество() > 0 Тогда
					Для каждого Стр Из Состав Цикл
						//Бондаренко++ 20260303
						Если Стр.СтатьяДДС = Справочники.СтатьиДДС.ОплатаПоАгентскомуДоговоруРасход Тогда
							Продолжить;
 						КонецЕсли;
						//Бондаренко-- 20260303
					    Если обЗначениеНеЗаполнено(Стр.Сделка) Тогда
							Отказ = Истина;
							СМГ_Сообщить("ОШИБКА! Не заполнен реквизит в колонке ""Сделка"" в таблице ""Состав"" в строке № "+СокрЛП(Стр.НомерСтроки),СтатусСообщения.ОченьВажное);
	 					КонецЕсли;
	 				КонецЦикла;
				КонецЕсли;
			КонецЕсли;
	 	КонецЕсли;
	КонецЕсли;
 	//Бондаренко-- 20250416
	
	//Бондаренко++ 20260124
	Если РежимЗаписи<>РежимЗаписиДокумента.ОтменаПроведения Тогда
		Если Дата >= Дата(2026,1,1) Тогда
			Если Состав.Количество() > 0 Тогда
				Для каждого Стр Из Состав Цикл
					Если обЗначениеНеЗаполнено(Стр.ИдентификаторСтрокиВыписки) Тогда
						Стр.ИдентификаторСтрокиВыписки = Новый УникальныйИдентификатор();
					КонецЕсли;
				КонецЦикла;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	//Бондаренко-- 20260124
	
КонецПроцедуры

СообщениеОбОшибке = Неопределено;

////////////////////////////////////////////////////////////////////////////////
// ИСПОЛНЯЕМАЯ ЧАСТЬ МОДУЛЯ

// сохранение ссылки на коллекцию прав, настроек и окружения
Права = Неопределено;
#Если Клиент Тогда
Права = глПрава;
ОбработкаРасчетСкидок = Обработки.РасчетСкидок.Создать();
ОбработкаРасчетСкидок.НеРассчитыватьАвтоматическиеСкидки = Истина;
#КонецЕсли
