///////////////////////////////////////////////////////////////////////////////
// СИСТЕМНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

// Возвращает часто используемые настройки и значения
Функция глВНЗначениеПеременной(ИмяПараметра) Экспорт
	
	НайденноеЗначение = Неопределено;
	
	// При чтении 
	УстановитьПривилегированныйРежим(Истина);
	
	// Проверяет удоавлетворяет ли текущая ИБ параметрам уникальности
	Если ВРег(ИмяПараметра) = ВРег("ВеренПараметрУникальности") Тогда
		
		НайденноеЗначение	= ВеренПараметрУникальности();
		
	ИначеЕсли ВРег(ИмяПараметра) = ВРег("ИнтервалПроверкиПодпискиНаСобытия") Тогда
		
		НайденноеЗначение	= Renault_внОбщийМодуль.ПолучитьНастройкуЖурналаРегистрации(ИмяПараметра);
		Если НайденноеЗначение = 0 Тогда
			НайденноеЗначение = 900;
		КонецЕсли;
		
	ИначеЕсли ВРег(ИмяПараметра) = ВРег("ВестиИсториюИзменений") Тогда
		
		ВестиИсториюИзменений	= Renault_внОбщийМодуль.ПолучитьНастройкуЖурналаРегистрации("ВестиИсториюИзменений");
		Если ВестиИсториюИзменений = Неопределено Тогда
			НайденноеЗначение	= Ложь;
		Иначе
			НайденноеЗначение	= ВестиИсториюИзменений И Renault_внОбщийМодуль.ЕстьПользователи() И ВеренПараметрУникальности();
		КонецЕсли;
		
	Иначе
		
		// Запрос из настроек регистра
		НайденноеЗначение	= Renault_внОбщийМодуль.ПолучитьНастройкуЖурналаРегистрации(ИмяПараметра);
		
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Ложь);
		
	Возврат НайденноеЗначение;		
	
КонецФункции

// Возвращает Ложь или Истина в зависимости от того регистрировать ли события объекта метаданных или нет
Функция РегистрироватьСобытиеОбъекта(ПолноеИмя) Экспорт
	
	// Это объекты журнала регистрации
	Массив = Renault_внОбщийМодуль.МассивПредопределенныхНеРегистрируемыхОбъектов();	
	Если Массив.Найти(ПолноеИмя) <> Неопределено Тогда
		Возврат Ложь;
	КонецЕсли;
	
	// Смотрим в регистре не регистрируемых объектов
	Запрос = Новый Запрос(
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	внНеРегистрируемыеОбъекты.НеРегистрировать
		|ИЗ
		|	РегистрСведений.Renault_внНеРегистрируемыеОбъекты КАК внНеРегистрируемыеОбъекты
		|ГДЕ
		|	внНеРегистрируемыеОбъекты.МетаданныеОбъекта = &МетаданныеОбъекта
		|	И внНеРегистрируемыеОбъекты.ИмяТЧ = """"
		|	И внНеРегистрируемыеОбъекты.ИмяРеквизита = """""
	);
	Запрос.УстановитьПараметр("МетаданныеОбъекта", ПолноеИмя);	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Возврат НЕ Выборка.Следующий();
		
КонецФункции // РегистрироватьСобытиеОбъекта

// Функция позволяет определить запуск происходит в дубле информационной базы, где включен журнал регистрации или нет
Функция ВеренПараметрУникальности() Экспорт
	
	// Если стоит не ИспользоватьПараметрУникальностиИБ, то возвращаем всегда Истина и ничего не проверяем
	Если НЕ глВНЗначениеПеременной("ИспользоватьПараметрУникальностиИБ") Тогда
		
		Возврат Истина;
		
	Иначе
		
		ПУСписокСерверов	= НРег(глВНЗначениеПеременной("ПараметрУникальностиСписокСерверов"));
		ПУИмяБазы			= НРег(глВНЗначениеПеременной("ПараметрУникальностиИмяБазы"));
		
		ПУ					= Renault_внОбщийМодуль.ПараметрУникальностиИБ();
		ТекущийСервер		= ПУ.Сервер;
		ТекущееИмяБазы 		= ПУ.ИмяБазы;
		
		Если ПустаяСтрока(ПУСписокСерверов) Тогда
			
			Возврат ПУИмяБазы = ТекущееИмяБазы;
			
		Иначе
			МассивСерверов		= Renault_внОбщийМодуль.внРазложитьСтрокуВМассивПодстрок(ПУСписокСерверов, ";", Истина);
			Для Каждого Сервер Из МассивСерверов Цикл
				
				Если СокрЛП(Сервер) = ТекущийСервер И ПУИмяБазы = ТекущееИмяБазы Тогда
					Возврат Истина;
				КонецЕсли;
				
			КонецЦикла;
		КонецЕсли;
				
	КонецЕсли;
	
	Возврат Ложь;
	
КонецФункции // ВеренПараметрУникальности

// Возвращает число идентфикатор данной ИБ
Функция ПолучитьUIDИдентификаторИБ() Экспорт
			
	Возврат Renault_внОбщийМодуль.ПолучитьИдентификаторИБНаСервере();
	
КонецФункции // ПолучитьUIDИдентификаторИБ

// Возвращает таблицу с колонками МетаданныеОбъекта, ИмяТЧ, ИмяРеквизита с не регистрируемыми значениями
Функция НеРегистрируемыеОбъектыМетаданных(ПолноеИмя) Экспорт
	
	// Смотрим в регистре не регистрируемых объектов
	Запрос = Новый Запрос(
		"ВЫБРАТЬ
		|	внНеРегистрируемыеОбъекты.МетаданныеОбъекта,
		|	внНеРегистрируемыеОбъекты.ИмяТЧ КАК ИмяТЧ,
		|	внНеРегистрируемыеОбъекты.ИмяРеквизита КАК ИмяРеквизита
		|ИЗ
		|	РегистрСведений.Renault_внНеРегистрируемыеОбъекты КАК внНеРегистрируемыеОбъекты
		|ГДЕ
		|	внНеРегистрируемыеОбъекты.МетаданныеОбъекта = &МетаданныеОбъекта
		|
		|УПОРЯДОЧИТЬ ПО
		|	ИмяТЧ,
		|	ИмяРеквизита"
	);
	Запрос.УстановитьПараметр("МетаданныеОбъекта", ПолноеИмя);
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции // НеРегистрируемыеОбъектыМетаданных

// Возвращает таблицу с колонками Настройка, МетаданныеОбъекта, ИмяТЧ, ИмяРеквизита с подписками
// Настройка - ссылка на справочник внНастройкиПодписокНаСобытия
Функция ПодпискиНаСобытия(ПолноеИмя) Экспорт
	
	// Смотрим в справочнике
	Запрос = Новый Запрос(
		"ВЫБРАТЬ
		|	внНастройкиПодписокНаСобытияОбъекты.Ссылка КАК Настройка,
		|	внНастройкиПодписокНаСобытияОбъекты.МетаданныеОбъекта КАК МетаданныеОбъекта,
		|	внНастройкиПодписокНаСобытияОбъекты.ИмяТЧ КАК ИмяТЧ,
		|	внНастройкиПодписокНаСобытияОбъекты.ИмяРеквизита КАК ИмяРеквизита
		|ИЗ
		|	Справочник.Renault_внНастройкиПодписокНаСобытия.Объекты КАК внНастройкиПодписокНаСобытияОбъекты
		|ГДЕ
		|	внНастройкиПодписокНаСобытияОбъекты.МетаданныеОбъекта = &МетаданныеОбъекта
		|	И внНастройкиПодписокНаСобытияОбъекты.Ссылка.Включено = ИСТИНА
		|	И внНастройкиПодписокНаСобытияОбъекты.Ссылка.ПометкаУдаления = ЛОЖЬ
		|
		|УПОРЯДОЧИТЬ ПО
		|	ИмяТЧ,
		|	ИмяРеквизита"
	);
	Запрос.УстановитьПараметр("МетаданныеОбъекта", ПолноеИмя);
	
	Возврат Запрос.Выполнить().Выгрузить();

КонецФункции // ПодпискиНаСобытия

// Возвращает по идентификатору РИБ ссылку на узел РИБ
Функция ПолучитьУзелРИБПоОтправителю(Отправитель) Экспорт
		
	НайденнаяСсылка 					= Справочники.Renault_внУзлыРИБ.НайтиПоНаименованию(Строка(Отправитель), Истина);
	Если НайденнаяСсылка				= Справочники.Renault_внУзлыРИБ.ПустаяСсылка() Тогда
		НовыйЭлемент					= Справочники.Renault_внУзлыРИБ.СоздатьЭлемент();
		НовыйЭлемент.Наименование		= Строка(Отправитель);
		НовыйЭлемент.Записать();
		НайденнаяСсылка 				= НовыйЭлемент.Ссылка;
	КонецЕсли;
	
	Возврат НайденнаяСсылка;
	
КонецФункции // ПолучитьУзелРИБПоИдентификатору

// Истина если тип обмена в настрйоках "Полный обмен"
Функция ТипОбменаРИБПолный() Экспорт
	
	Возврат глВНЗначениеПеременной("ТипОбменаРИБ") = Перечисления.Renault_внТипОбменаРИБ.ПолныйОбмен;
	
КонецФункции // ТипОбменаРИБПолный

// Проверяет текущуая конфигурация использует БСП или нет
Функция КонфигурацияИспользуетБСП() Экспорт
	Возврат Ложь;
КонецФункции

// Получает имя компьютра из параметров сеанса для текущего пользователя
Функция ПолучитьИмяКомпьютера() Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	Попытка
		Результат = ПараметрыСеанса.Renault_внПараметрыКлиентаНаСервере.Получить("ИмяКомпьютера");
	Исключение
		Результат = ИмяКомпьютера();
	КонецПопытки;	
	УстановитьПривилегированныйРежим(Ложь);
	
	Возврат Результат;
	
КонецФункции
