// Модуль документа Корректировка реализации

////////////////////////////////////////////////////////////////////////////////
// ПЕРЕМЕННЫЕ ОБЪЕКТА

Перем Права Экспорт;                            // Переменная объекта - ссылка на коллекцию прав, настроек и переменных окружения
Перем РезультатОбработки Экспорт;               // Переменная для накопления результатов проведения по модулям наборов записей
Перем ОбработкаЗначенияСвойствОбъектов Экспорт; // Переменная для хранения значения свойств основания/объекта копирования

Перем ТекущаяВалютаДокумента Экспорт;           // Текущая валюта документа перед изменением
Перем ТекущийКурсДокумента Экспорт;             //Текущий курс документа перед изменением
Перем СуммаРазногласий;                         //Текущая сумма разногласий

Перем ИмяРеквизитаКода Экспорт;                 // Кэш права "РежимВыводаКодаВДокументах". Служит для настройки вывода кода/артикула в ТЧ

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ОБЩЕГО НАЗНАЧЕНИЯ

Функция КорректировкаНеДоступна(Основание)
	
	ТекстЗапроса = "
	|ВЫБРАТЬ
	|	Истина КАК ЕстьВозврат
	|ИЗ
	|	Документ.ВозвратОтПокупателя КАК ТаблицаОбъекта
	|ГДЕ
	|	ТаблицаОбъекта.ДокументОснование = &Основание
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Истина
	|ИЗ
	|	Документ.ВозвратОтПокупателя.Товары КАК ТаблицаОбъекта
	|ГДЕ
	|	ТаблицаОбъекта.ДокументПродажи = &Основание
	|";
	
	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.УстановитьПараметр("Основание", Основание);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Истина;
	КонецЕсли;
	
	Возврат Ложь;
	
КонецФункции // КорректировкаНеДоступна()

// Получение сделки по документу основания
//
// Параметры
//  Сделка  - ДокументСсылка - Ссылка на документ основания
//
// Возвращаемое значение:
//   ДокументСсылка   - Сделка в цепочке документов
//
Функция ПолучитьСделку(Знач Сделка)

	Если (НЕ обЗначениеНеЗаполнено(Сделка)) И ТипЗнч(Сделка)=Тип("ДокументСсылка.КорректировкаРеализации") Тогда 
		Сделка=ПолучитьСделку(Сделка.ДокументОснование);
	КонецЕсли;
	Если обЗначениеНеЗаполнено(Сделка) Тогда
		Сделка=Неопределено;
	КонецЕсли; 
	Возврат Сделка;
КонецФункции // ПолучитьСделку() 

// Расчет суммы документа
Функция РассчитатьСуммуВсего()Экспорт
	ВремСуммаНоменклатурыДокумента=Товары.Итог("СуммаВсего");
	Если ТипЗнч(Сделка)=Тип("ДокументСсылка.ЗаказНаряд") Тогда
		ВремСуммаРаботДокумента=Работы.Итог("СуммаВсего");
	Иначе
		ВремСуммаРаботДокумента=0;
	КонецЕсли; 
	ВремСуммаДокумента=ВремСуммаНоменклатурыДокумента+ВремСуммаРаботДокумента;
	Если СуммаНоменклатурыДокумента<>ВремСуммаНоменклатурыДокумента Тогда
		СуммаНоменклатурыДокумента=ВремСуммаНоменклатурыДокумента;
	КонецЕсли; 
	Если СуммаРаботДокумента<>ВремСуммаРаботДокумента Тогда
		СуммаРаботДокумента=ВремСуммаРаботДокумента;
	КонецЕсли; 
	Если СуммаДокумента<>ВремСуммаДокумента Тогда
		СуммаДокумента=ВремСуммаДокумента;
	КонецЕсли;
	Возврат СуммаДокумента;
КонецФункции

// возвращает выборку по шапке
// ДокументСсылка - Ссылка на документ для которого получаем шапку
Функция ПолучитьШапкуДокумента(ДокументСсылка)
	Запрос=Новый Запрос("
	|ВЫБРАТЬ
	|	Док.Ссылка КАК Ссылка,
	|	Док.Дата КАК Дата,
	|	Док.ВалютаДокумента КАК ВалютаДокумента,
	|	Док.КурсДокумента КАК КурсДокумента,
	|	Док.ТипЦен КАК ТипЦен,
	|	Док.ХозОперация КАК ХозОперация,
	|	Док.КурсВалютыУпр КАК КурсВалютыУпр,
	|	Док.КурсВалютыВзаиморасчетов КАК КурсВалютыВзаиморасчетов,
	|	Док.МоментВремени КАК МоментВремени,
	|	Док.ПодразделениеКомпании КАК ПодразделениеКомпании,
	/////////// ПРИВАТ ////////////
	|	Док.Контрагент КАК Контрагент,
	|	Док.ДоговорВзаиморасчетов КАК ДоговорВзаиморасчетов,
	|	Док.СкладКомпании КАК СкладКомпании,
	|	Док.СуммаНоменклатурыДокумента КАК СуммаНоменклатурыДокумента,
	|	"+?(ТипЗнч(Сделка)=Тип("ДокументСсылка.ЗаказНаряд"),"Док.СуммаРаботДокумента","0")+" КАК СуммаРаботДокумента,
	|	&СуммаРазногласий КАК СуммаДокумента,
	|	Док.ДокументОснование КАК ДокументОснование,
	|	Док.Сделка КАК Сделка
	|
	|ИЗ
	|	Документ."+Метаданные().Имя+" КАК Док
	|ГДЕ
	|	Док.Ссылка=&Ссылка
	|");
	Запрос.УстановитьПараметр("Ссылка",ДокументСсылка);
	Если ТипЗнч(Сделка)=Тип("ДокументСсылка.ЗаказНаряд") Тогда
		Запрос.УстановитьПараметр("СуммаРазногласий",Товары.Итог("СуммаВсегоРазница")+Работы.Итог("СуммаВсегоРазница"));
	Иначе
		Запрос.УстановитьПараметр("СуммаРазногласий",Товары.Итог("СуммаВсегоРазница"));
	КонецЕсли; 
	Выборка=Запрос.Выполнить().Выбрать(); Выборка.Следующий();
	
	Возврат Выборка;
КонецФункции

// формирует движения по регистру партий товаров с возвратом
Функция ПровестиВозвратТоваров(Отказ,ШапкаДокумента,Режим)
	ЕстьЗН = Ложь;
	
	// получим значения валют
	ВалютаУпр  = Константы.ВалютаУправленческогоУчетаКомпании.Получить();
	ВалютаРегл = Константы.ВалютаРегламентированногоУчетаОрганизаций.Получить();
	
	// составим списко документов движений
	ДокОснование = ДокументОснование;
	СписокОснований = Новый СписокЗначений;
	Пока Истина Цикл
		СписокОснований.Добавить(ДокОснование);
		Если ТипЗнч(ДокОснование) = Тип("ДокументСсылка.ЗаказНаряд") Тогда 
			ЕстьЗН = Истина; 
			ЦехОснования = ДокОснование.Цех;
			//Бондаренко++ 20220418                       
			Если ДокОснование.ВидРемонта = Справочники.ВидыРемонта.ДополнительноеОборудование Тогда
				СписокОснований = СМГ_ДополнитьСписокОснований(СписокОснований,ДокОснование);
 			КонецЕсли;
 			//Бондаренко-- 20220418			
 		КонецЕсли;
		Если ТипЗнч(ДокОснование) <> Тип("ДокументСсылка.КорректировкаРеализации") Тогда
			Прервать;
		КонецЕсли;
		ДокОснование = ДокОснование.ДокументОснование;
	КонецЦикла;
	
	////////////////////////////////
	// ВОЗВРАТ ТОВАРОВ ПО ПАРТИЯМ //
	////////////////////////////////
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	КорректировкаРеализацииТовары.Номенклатура,
	|	КорректировкаРеализацииТовары.ХарактеристикаНоменклатуры,
	|	СУММА(-КорректировкаРеализацииТовары.КоличествоРазница * КорректировкаРеализацииТовары.Коэффициент) КАК Количество
	|ИЗ
	|	Документ.КорректировкаРеализации.Товары КАК КорректировкаРеализацииТовары
	|ГДЕ
	|	КорректировкаРеализацииТовары.Ссылка = &Ссылка
	|	И КорректировкаРеализацииТовары.КоличествоРазница * КорректировкаРеализацииТовары.Коэффициент < 0
	|	И КорректировкаРеализацииТовары.Номенклатура.ВидНоменклатуры <> &Услуга
	|СГРУППИРОВАТЬ ПО
	|	КорректировкаРеализацииТовары.ХарактеристикаНоменклатуры,
	|	КорректировкаРеализацииТовары.Номенклатура";
	Запрос.УстановитьПараметр("Ссылка",Ссылка);
	Запрос.УстановитьПараметр("Услуга", Перечисления.ВидыНоменклатуры.Услуга);
	ТабДок = Запрос.Выполнить().Выгрузить();
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ПартииТоваровКомпании.Номенклатура,
	|	ПартииТоваровКомпании.ХарактеристикаНоменклатуры,
	|	ПартииТоваровКомпании.Партия,
	|	ПартииТоваровКомпании.СтатусПартии КАК СтатусПартии,
	|	СУММА(ПартииТоваровКомпании.Количество) КАК Количество,
	|	СУММА(ПартииТоваровКомпании.Сумма) КАК Сумма,
	|	СУММА(ПартииТоваровКомпании.СуммаУпр) КАК СуммаУпр,
	|	СУММА(ПартииТоваровКомпании.СуммаНДС) КАК СуммаНДС
	|ИЗ
	|	РегистрНакопления."+?(ЕстьЗН,"ТоварыВПроизводстве","ПартииТоваровКомпании")+" КАК ПартииТоваровКомпании
	|ГДЕ
	|	ПартииТоваровКомпании.ВидДвижения = &ВидДвижения
	|	И ПартииТоваровКомпании.Номенклатура В(&Номенклатура)
	|	И ПартииТоваровКомпании.Регистратор В(&Регистратор)
	|	И ПартииТоваровКомпании.Количество > 0
	|
	|СГРУППИРОВАТЬ ПО
	|	ПартииТоваровКомпании.ХарактеристикаНоменклатуры,
	|	ПартииТоваровКомпании.Номенклатура,
	|	ПартииТоваровКомпании.Партия,
	|	ПартииТоваровКомпании.СтатусПартии"
	+?(ЕстьЗН,"
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ПартииТоваровКомпании.Номенклатура,
	|	ПартииТоваровКомпании.ХарактеристикаНоменклатуры,
	|	ПартииТоваровКомпании.Партия,
	|	ПартииТоваровКомпании.СтатусПартии,
	|	СУММА(ПартииТоваровКомпании.Количество),
	|	СУММА(ПартииТоваровКомпании.Сумма),
	|	СУММА(ПартииТоваровКомпании.СуммаУпр),
	|	СУММА(ПартииТоваровКомпании.СуммаНДС)
	|ИЗ
	|	РегистрНакопления.ПартииТоваровКомпании КАК ПартииТоваровКомпании
	|ГДЕ
	|	ПартииТоваровКомпании.ВидДвижения = &ВидДвижения
	|	И ПартииТоваровКомпании.Номенклатура В(&Номенклатура)
	|	И ПартииТоваровКомпании.Регистратор В(&Регистратор)
	|
	|СГРУППИРОВАТЬ ПО
	|	ПартииТоваровКомпании.ХарактеристикаНоменклатуры,
	|	ПартииТоваровКомпании.Номенклатура,
	|	ПартииТоваровКомпании.Партия,
	|	ПартииТоваровКомпании.СтатусПартии,
	|	ПартииТоваровКомпании.ВидДвижения",
	"")
	+"
	|
	|УПОРЯДОЧИТЬ ПО
	|	СтатусПартии";
	Запрос.УстановитьПараметр("ВидДвижения"  , ВидДвиженияНакопления.Расход);
	Запрос.УстановитьПараметр("Номенклатура" , ТабДок.ВыгрузитьКолонку("Номенклатура"));
	Запрос.УстановитьПараметр("Регистратор"  , СписокОснований);
	
	ТабДвижений = Запрос.Выполнить().Выгрузить();
	
	// получим таблицу ручных характеристик
	ТаблицаРучныхХарактеристик=дкПолучитьНоменклатуруСРучнымСписаниемХарактеристик(Ссылка);
	ВсеОК = Истина; ТекстСообщения = "";
	Для Каждого СтрокаТовар Из ТабДок Цикл
		Если СтрокаТовар.Количество = 0 Тогда Продолжить; КонецЕсли;
		СтруктураОтбора=Новый Структура("Номенклатура");
		СтруктураОтбора.Номенклатура=СтрокаТовар.Номенклатура; 
		Если НЕ обЗначениеНеЗаполнено(СтрокаТовар.ХарактеристикаНоменклатуры) ИЛИ (ТаблицаРучныхХарактеристик<>Неопределено И ТаблицаРучныхХарактеристик.Найти(СтрокаТовар.Номенклатура,"Номенклатура")<>Неопределено) Тогда 
			СтруктураОтбора.Вставить("ХарактеристикаНоменклатуры",СтрокаТовар.ХарактеристикаНоменклатуры);
		КонецЕсли;

		МассивНайденныхСтрок=ТабДвижений.НайтиСтроки(СтруктураОтбора);
		НадоВернуть = СтрокаТовар.Количество;
		Для Сч = 0 По МассивНайденныхСтрок.ВГраница() Цикл
			Если НадоВернуть = 0 Тогда Прервать; КонецЕсли;
			ТекСтрока = МассивНайденныхСтрок[Сч];
			КоличествоВозвращаем = Мин(НадоВернуть, ТекСтрока.Количество);
			
			Если КоличествоВозвращаем =  ТекСтрока.Количество Тогда
				СуммаВозвращаем      = Окр(ТекСтрока.Сумма,2);
				СуммаВозвращаемУпр   = Окр(ТекСтрока.СуммаУпр,2);
				СуммаВозвращаемНДС   = Окр(ТекСтрока.СуммаНДС,2);
			Иначе
				СуммаВозвращаем      = Окр(?(ТекСтрока.Количество = 0, 0,ТекСтрока.Сумма/ТекСтрока.Количество*КоличествоВозвращаем),2);
				СуммаВозвращаемУпр   = Окр(?(ТекСтрока.Количество = 0, 0,ТекСтрока.СуммаУпр/ТекСтрока.Количество*КоличествоВозвращаем),2);
				СуммаВозвращаемНДС   = Окр(?(ТекСтрока.Количество = 0, 0,ТекСтрока.СуммаНДС/ТекСтрока.Количество*КоличествоВозвращаем),2);
			КонецЕсли;
			
			НоваяЗапись = Движения.ПартииТоваровКомпании.Добавить();
			НоваяЗапись.ВидДвижения = ВидДвиженияНакопления.Расход;
			НоваяЗапись.Регистратор = Ссылка;
			НоваяЗапись.Период      = Дата;
			// измерения
			НоваяЗапись.СкладКомпании              = СкладКомпании;
			НоваяЗапись.Номенклатура               = СтрокаТовар.Номенклатура;
			НоваяЗапись.ХарактеристикаНоменклатуры = ТекСтрока.ХарактеристикаНоменклатуры;
			НоваяЗапись.СтатусПартии               = Перечисления.СтатусыПартий.ТоварКупленный;
			НоваяЗапись.Партия                     = ТекСтрока.Партия;
			
			// ресурсы
			НоваяЗапись.Количество = -КоличествоВозвращаем;
			НоваяЗапись.Сумма      = -СуммаВозвращаем;
			НоваяЗапись.СуммаУпр   = -СуммаВозвращаемУпр;
			НоваяЗапись.СуммаНДС   = -СуммаВозвращаемНДС;
			
			// ресурсы
			НоваяЗапись.ХозОперация = ХозОперация;
			НоваяЗапись.Проект      = Проект;
			
			// уменьшим остатки
			НадоВернуть = НадоВернуть - КоличествоВозвращаем;
			Если КоличествоВозвращаем >= ТекСтрока.Количество Тогда
				ТабДвижений.Удалить(ТекСтрока);
			Иначе
				ТекСтрока.Количество = ТекСтрока.Количество - КоличествоВозвращаем;
				ТекСтрока.Сумма      = ТекСтрока.Сумма - СуммаВозвращаем;
				ТекСтрока.СуммаУпр   = ТекСтрока.СуммаУпр - СуммаВозвращаемУпр;
				ТекСтрока.СуммаНДС   = ТекСтрока.СуммаНДС - СуммаВозвращаемНДС;
			КонецЕсли;
		КонецЦикла;
		
		// не возвращаем не проданный товар
		Если НадоВернуть > 0 Тогда
			ВсеОК = Ложь;        
 			ТекстСообщения = ТекстСообщения + ?(ПустаяСтрока(ТекстСообщения),"",Символы.ПС) + "Товар <"+СтрокаТовар.Номенклатура+"> не был реализован в количестве " + СтрокаТовар.Количество;
		КонецЕсли;
	КонецЦикла;
	
	//Бондаренко++ 20220922
	Если НЕ РольДоступна("ПолныеПрава")  Тогда
		//Бондаренко-- 20220922	
		Если НЕ ВсеОК Тогда
			Отказ = Истина;
			дкСообщитьРезультат(ТекстСообщения,"Важное&Партии товаров компании:", ЭтотОбъект, СтрокаТовар.Номенклатура);
			Возврат НЕ Отказ;
		КонецЕсли;
		//Бондаренко++ 20220922	
	КонецЕсли;
	//Бондаренко-- 20220922
	
	Движения.ПартииТоваровКомпании.Записать();
 	
	////////////////////////////////////////////////
	// СПИСШЕМ ГТД ПО РЕГИСТРУ ГТД ПАРТИИ ТОВАРОВ //
	////////////////////////////////////////////////
	
	// получим таблицу партий
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ПартииТоваровКомпании.Номенклатура,
	|	ПартииТоваровКомпании.ХарактеристикаНоменклатуры,
	|	ПартииТоваровКомпании.Партия,
	|	-ПартииТоваровКомпании.Количество КАК Количество
	|ИЗ
	|	РегистрНакопления.ПартииТоваровКомпании КАК ПартииТоваровКомпании
	|ГДЕ
	|	ПартииТоваровКомпании.Регистратор = &Регистратор
	|	И ПартииТоваровКомпании.ВидДвижения = &ВидДвижения
	|	И ПартииТоваровКомпании.Количество < 0";
	
	Запрос.УстановитьПараметр("Регистратор", Ссылка);
	Запрос.УстановитьПараметр("ВидДвижения", ВидДвиженияНакопления.Расход);
	РезЗапроса = Запрос.Выполнить();
	
	// Получим список списанных ГТД
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ГТДПартийТоваровКомпании.Номенклатура,
	|	ГТДПартийТоваровКомпании.ХарактеристикаНоменклатуры,
	|	ГТДПартийТоваровКомпании.ГТД,
	|	ГТДПартийТоваровКомпании.Партия,
	|	СУММА(ГТДПартийТоваровКомпании.Количество) КАК Количество,
	|	СУММА(ГТДПартийТоваровКомпании.Количество) КАК КоличествоОсталось
	|ИЗ
	|	РегистрНакопления.ГТДПартийТоваровКомпании КАК ГТДПартийТоваровКомпании
	|ГДЕ
	|	ГТДПартийТоваровКомпании.Регистратор В (&СписокОснований)
	|
	|СГРУППИРОВАТЬ ПО
	|	ГТДПартийТоваровКомпании.ХарактеристикаНоменклатуры,
	|	ГТДПартийТоваровКомпании.ГТД,
	|	ГТДПартийТоваровКомпании.Номенклатура,
	|	ГТДПартийТоваровКомпании.Партия
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ТоварыВПроизводстве.Номенклатура,
	|	ТоварыВПроизводстве.ХарактеристикаНоменклатуры,
	|	ТоварыВПроизводстве.ГТД,
	|	ТоварыВПроизводстве.Партия,
	|	СУММА(ТоварыВПроизводстве.Количество) КАК Количество,
	|	СУММА(ТоварыВПроизводстве.Количество) КАК КоличествоОсталось
	|ИЗ
	|	РегистрНакопления.ТоварыВПроизводстве КАК ТоварыВПроизводстве
	|ГДЕ
	|	ТоварыВПроизводстве.Регистратор В (&СписокОснований)
	|
	|СГРУППИРОВАТЬ ПО
	|	ТоварыВПроизводстве.ХарактеристикаНоменклатуры,
	|	ТоварыВПроизводстве.Номенклатура,
	|	ТоварыВПроизводстве.Партия,
	|	ТоварыВПроизводстве.ГТД
	|";
	Запрос.УстановитьПараметр("СписокОснований",СписокОснований);
	РезультатЗапросаПоГТД = Запрос.Выполнить().Выгрузить();

	Если НЕ РезЗапроса.Пустой() Тогда
		Выборка = РезЗапроса.Выбрать();
		Пока Выборка.Следующий() Цикл
			НадоВернуть = Выборка.Количество;
			Если НадоВернуть = 0 Тогда Продолжить; КонецЕсли;
			
			// получм массив ГТД
			МассивГТД = РезультатЗапросаПоГТД.НайтиСтроки(Новый Структура("Номенклатура,ХарактеристикаНоменклатуры,Партия",Выборка.Номенклатура,Выборка.ХарактеристикаНоменклатуры,Выборка.Партия));
			Для Каждого стрГТД Из МассивГТД Цикл
				Если стрГТД.ГТД = справочники.ГТД.ПустаяСсылка() Тогда Продолжить; КонецЕсли;
				Если  НадоВернуть = 0 ИЛИ стрГТД.Количество = 0 Тогда Продолжить; КонецЕсли;
				КолвоСписываем = Мин(НадоВернуть,стрГТД.Количество);
				
				НоваяЗапись               = Движения.ГТДПартийТоваровКомпании.Добавить();
				НоваяЗапись.Период        = Дата;
				НоваяЗапись.ВидДвижения   = ВидДвиженияНакопления.Расход;
				НоваяЗапись.СкладКомпании = СкладКомпании;
				НоваяЗапись.Номенклатура  = стрГТД.Номенклатура;
				НоваяЗапись.ХарактеристикаНоменклатуры = стрГТД.ХарактеристикаНоменклатуры;
				НоваяЗапись.Партия = стрГТД.Партия;
				НоваяЗапись.ГТД = стрГТД.ГТД;
				НоваяЗапись.Количество = -КолвоСписываем;
				
				НадоВернуть = НадоВернуть - КолвоСписываем;
				стрГТД.Количество = стрГТД.Количество - КолвоСписываем;
				
				Если НадоВернуть = 0 Тогда Прервать; КонецЕсли;
			КонецЦикла;
		КонецЦикла;
	КонецЕсли;
	
	/////////////////////////////////////
	// ВОЗВРАТ ДОПРОДАЖА ПО СУБПОДРЯДУ //
	/////////////////////////////////////
	
	// получим субподрядные работы
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	КорректировкаРеализацииРаботы.Работа,
	|	КорректировкаРеализацииРаботы.Контрагент,
	|	КорректировкаРеализацииРаботы.ДоговорВзаиморасчетов,
	|	КорректировкаРеализацииРаботы.СуммаВсегоРазница,
	|	КорректировкаРеализацииРаботы.СуммаНДСРазница
	|ИЗ
	|	Документ.КорректировкаРеализации.Работы КАК КорректировкаРеализацииРаботы
	|ГДЕ
	|	КорректировкаРеализацииРаботы.Ссылка = &Ссылка
	|	И КорректировкаРеализацииРаботы.СуммаВсегоРазница <> 0
	|	И КорректировкаРеализацииРаботы.Контрагент <> ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)";
	Запрос.УстановитьПараметр("Ссылка",Ссылка);
	СубподрядДок = Запрос.Выполнить().Выгрузить();
	
	// получим движения по субподряду
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Субподряд.ПодразделениеКомпании,
	|	Субподряд.Контрагент,
	|	Субподряд.ДоговорВзаиморасчетов,
	|	Субподряд.ЗаказНаряд,
	|	Субподряд.Работа,
	|	СУММА(Субподряд.Сумма) КАК Сумма,
	|	СУММА(Субподряд.СуммаНДС) КАК СуммаНДС,
	|	СУММА(Субподряд.СуммаУпр) КАК СуммаУпр
	|ИЗ
	|	РегистрНакопления.Субподряд КАК Субподряд
	|ГДЕ
	|	Субподряд.Регистратор В(&Регистраторы)
	|	И Субподряд.Работа В(&Работы)
	|
	|СГРУППИРОВАТЬ ПО
	|	Субподряд.Работа,
	|	Субподряд.ЗаказНаряд,
	|	Субподряд.ДоговорВзаиморасчетов,
	|	Субподряд.ПодразделениеКомпании,
	|	Субподряд.Контрагент";
	Запрос.УстановитьПараметр("Регистраторы", СписокОснований);
	Запрос.УстановитьПараметр("Работы",СубподрядДок.ВыгрузитьКолонку("Работа"));
	ТаблицаДвижений = Запрос.Выполнить().Выгрузить();
	
	Для Каждого СтрокаДок Из СубподрядДок Цикл
		МассивДвиж = ТаблицаДвижений.НайтиСтроки(Новый Структура("Контрагент,ДоговорВзаиморасчетов,Работа",СтрокаДок.Контрагент,СтрокаДок.ДоговорВзаиморасчетов,СтрокаДок.Работа));
		Если МассивДвиж.Количество() = 0 Тогда Продолжить; КонецЕсли;
		
		ТекСтрока = МассивДвиж[0];
		
		// заполним регистр
		НоваяЗапись = Движения.Субподряд.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяЗапись,ТекСтрока);
		НоваяЗапись.Период = Дата;
		НоваяЗапись.Регистратор = Ссылка;
		НоваяЗапись.ХозОперация = ХозОперация;
		
		// суммовые показатели
		НоваяЗапись.Сумма    = обПересчет(СтрокаДок.СуммаВсегоРазница,ВалютаДокумента,Дата,ВалютаРегл,Дата);
		НоваяЗапись.СуммаНДС = обПересчет(СтрокаДок.СуммаНДСРазница,ВалютаДокумента,Дата,ВалютаРегл,Дата);
		НоваяЗапись.СуммаУпр = обПересчет(СтрокаДок.СуммаВсегоРазница,ВалютаДокумента,Дата,ВалютаУпр,Дата);
	КонецЦикла;
	
	
	/////////////////////
	// РЕГИСТР ПРОДАЖИ //
	/////////////////////
	
	// получим валюты
	врТаблицаГТД = Движения.ГТДПартийТоваровКомпании.Выгрузить();
	ТаблицаГТД = врТаблицаГТД.Скопировать();
	
	// таблица партий
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ПартииТоваровКомпании.Номенклатура,
	|	ПартииТоваровКомпании.ХарактеристикаНоменклатуры,
	|	ПартииТоваровКомпании.Партия,
	|	ПартииТоваровКомпании.СкладКомпании,
	|	СУММА(ПартииТоваровКомпании.Количество) КАК Количество,
	|	СУММА(ПартииТоваровКомпании.Сумма) КАК Сумма,
	|	СУММА(ПартииТоваровКомпании.СуммаУпр) КАК СуммаУпр,
	|	СУММА(ПартииТоваровКомпании.СуммаНДС) КАК СуммаНДС,
	|	ПартииТоваровКомпании.СтавкаНДС,
	|	ПартииТоваровКомпании.СтатусПартии
	|ИЗ
	|	РегистрНакопления.ПартииТоваровКомпании КАК ПартииТоваровКомпании
	|ГДЕ
	|	ПартииТоваровКомпании.Регистратор = &Регистратор
	|	И ПартииТоваровКомпании.ВидДвижения = &ВидДвижения
	|
	|СГРУППИРОВАТЬ ПО
	|	ПартииТоваровКомпании.ХарактеристикаНоменклатуры,
	|	ПартииТоваровКомпании.Номенклатура,
	|	ПартииТоваровКомпании.Партия,
	|	ПартииТоваровКомпании.СкладКомпании,
	|	ПартииТоваровКомпании.СтавкаНДС,
	|	ПартииТоваровКомпании.СтатусПартии";
	
	Запрос.УстановитьПараметр("Регистратор"  , Ссылка);
	Запрос.УстановитьПараметр("ВидДвижения"  , ВидДвиженияНакопления.Расход);
	ТаблПартий = Запрос.Выполнить().Выгрузить();
	
	// таблиа документа
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	КорректировкаРеализацииТовары.Номенклатура,
	|	КорректировкаРеализацииТовары.ХарактеристикаНоменклатуры,
	|	СУММА(КорректировкаРеализацииТовары.КоличествоРазница * КорректировкаРеализацииТовары.Коэффициент) КАК Количество,
	|	СУММА(КорректировкаРеализацииТовары.СуммаВсегоРазница) КАК СуммаВсего,
	|	СУММА(КорректировкаРеализацииТовары.СуммаВсего) КАК СуммаВсегоДляЦены,
	|	СУММА(КорректировкаРеализацииТовары.СуммаНДС) КАК СуммаНДС,
	|	СУММА(КорректировкаРеализацииТовары.СуммаНДСРазница) КАК СуммаНДСРазница,
	|	СУММА(КорректировкаРеализацииТовары.Количество) КАК КоличествоДляЦены,
	|	КорректировкаРеализацииТовары.СтавкаНДС,
	|	ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка) КАК Контрагент
	|ИЗ
	|	Документ.КорректировкаРеализации.Товары КАК КорректировкаРеализацииТовары
	|ГДЕ
	|	КорректировкаРеализацииТовары.Ссылка = &Ссылка
	|	И (КорректировкаРеализацииТовары.КоличествоРазница * КорректировкаРеализацииТовары.Коэффициент <> 0
	|			ИЛИ КорректировкаРеализацииТовары.СуммаВсегоРазница <> 0)
	|
	|СГРУППИРОВАТЬ ПО
	|	КорректировкаРеализацииТовары.ХарактеристикаНоменклатуры,
	|	КорректировкаРеализацииТовары.Номенклатура,
	|	КорректировкаРеализацииТовары.СтавкаНДС
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	КорректировкаРеализацииТовары.Работа,
	|	НЕОПРЕДЕЛЕНО,
	|	СУММА(КорректировкаРеализацииТовары.КоличествоРазница),
	|	СУММА(КорректировкаРеализацииТовары.СуммаВсегоРазница),
	|	СУММА(КорректировкаРеализацииТовары.СуммаВсего),
	|	СУММА(КорректировкаРеализацииТовары.СуммаНДС),
	|	СУММА(КорректировкаРеализацииТовары.СуммаНДСРазница),
	|	СУММА(КорректировкаРеализацииТовары.Количество),
	|	КорректировкаРеализацииТовары.СтавкаНДС,
	|	КорректировкаРеализацииТовары.Контрагент
	|ИЗ
	|	Документ.КорректировкаРеализации.Работы КАК КорректировкаРеализацииТовары
	|ГДЕ
	|	КорректировкаРеализацииТовары.Ссылка = &Ссылка
	|	И (КорректировкаРеализацииТовары.КоличествоРазница <> 0
	|			ИЛИ КорректировкаРеализацииТовары.СуммаВсегоРазница <> 0)
	|
	|СГРУППИРОВАТЬ ПО
	|	КорректировкаРеализацииТовары.Работа,
	|	КорректировкаРеализацииТовары.СтавкаНДС,
	|	КорректировкаРеализацииТовары.Контрагент";
	Запрос.УстановитьПараметр("Ссылка",Ссылка);
	ТабДок = Запрос.Выполнить().Выгрузить();
	
	
	// продажи партии
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Продажи.ПодразделениеКомпании,
	|	Продажи.Номенклатура,
	|	Продажи.Поставщик,
	|	Продажи.Покупатель,
	|	Продажи.СтатусПартии,
	|	Продажи.ДокументПродажи,
	|	Продажи.ДоговорВзаиморасчетов,
	|	Продажи.ХарактеристикаНоменклатуры,
	|	Продажи.СкладКомпании,
	|	Продажи.СтавкаНДС,
	|	Продажи.Партия,
	|	Продажи.Авторабота,
	|	Продажи.ГТД,
	|	Продажи.Проект,
	|	СУММА(Продажи.Количество) КАК Количество,
	|	СУММА(Продажи.Сумма) КАК Сумма,
	|	СУММА(Продажи.СуммаНДС) КАК СуммаНДС,
	|	СУММА(Продажи.СуммаСкидки) КАК СуммаСкидки,
	|	СУММА(Продажи.СуммаУпр) КАК СуммаУпр,
	|	СУММА(Продажи.СебестоимостьУпр) КАК СебестоимостьУпр,
	|	СУММА(Продажи.Себестоимость) КАК Себестоимость,
	|	СУММА(Продажи.СуммаНДСВходящий) КАК СуммаНДСВходящий
	|ИЗ
	|	РегистрНакопления.Продажи КАК Продажи
	|ГДЕ
	|	Продажи.Регистратор В(&Регистратор)
	|	И (Продажи.Номенклатура В(&Номенклатура) ИЛИ Продажи.Авторабота В(&Номенклатура))
	|
	|СГРУППИРОВАТЬ ПО
	|	Продажи.Проект,
	|	Продажи.ПодразделениеКомпании,
	|	Продажи.Номенклатура,
	|	Продажи.Поставщик,
	|	Продажи.Покупатель,
	|	Продажи.ГТД,
	|	Продажи.СтатусПартии,
	|	Продажи.ДокументПродажи,
	|	Продажи.ДоговорВзаиморасчетов,
	|	Продажи.ХарактеристикаНоменклатуры,
	|	Продажи.СкладКомпании,
	|	Продажи.СтавкаНДС,
	|	Продажи.Партия,
	|	Продажи.Авторабота";
	Запрос.УстановитьПараметр("Регистратор"  , СписокОснований);
	Запрос.УстановитьПараметр("Номенклатура" , ТабДок.ВыгрузитьКолонку("Номенклатура"));
	ТаблПродаж = Запрос.Выполнить().Выгрузить();
	ТекстСообщения = "";
	Для Каждого стрДок Из ТабДок Цикл
		СуммаРазница          = обПересчет(стрДок.СуммаВсего,ВалютаДокумента,Дата,ВалютаРегл,Дата);
		СуммаРазницаНДС       = обПересчет(стрДок.СуммаНДСРазница,ВалютаДокумента,Дата,ВалютаРегл,Дата);
		НадоСписатьКоличество = стрДок.Количество;
		СуммаНаЕд             = Окр(?(стрДок.КоличествоДляЦены=0,0,обПересчет(стрДок.СуммаВсегоДляЦены,ВалютаДокумента,Дата,ВалютаРегл,Дата)/стрДок.КоличествоДляЦены),2);
		СуммаНДСНаЕд          = Окр(?(стрДок.КоличествоДляЦены=0,0,обПересчет(стрДок.СуммаНДС,ВалютаДокумента,Дата,ВалютаРегл,Дата)/стрДок.КоличествоДляЦены),2);
		ЭтоРабота             = ТипЗнч(стрДок.Номенклатура) <> Тип("СправочникСсылка.Номенклатура");
		
		Если стрДок.Количество > 0 Тогда // увелечение количества(до продажа)
			стрПоиск      = Новый Структура("Номенклатура",стрДок.Номенклатура);
			Если НЕ обЗначениеНеЗаполнено(стрДок.ХарактеристикаНоменклатуры) Тогда
				стрПоиск.Вставить("ХарактеристикаНоменклатуры",стрДок.ХарактеристикаНоменклатуры);
			КонецЕсли;
			
			МассивСтрокПартий = ТаблПартий.НайтиСтроки(стрПоиск);
			// если услуга
			Если МассивСтрокПартий.Количество() = 0 Тогда
				НоваяЗапись = Движения.Продажи.Добавить();
				НоваяЗапись.Период                     = Дата;
				НоваяЗапись.Регистратор                = Ссылка;
				НоваяЗапись.ХозОперация                = ХозОперация;
				НоваяЗапись.ПодразделениеКомпании      = ПодразделениеКомпании;
				НоваяЗапись.Покупатель                 = Контрагент;
				НоваяЗапись.ДокументПродажи            = Сделка;
				НоваяЗапись.ДоговорВзаиморасчетов      = ДоговорВзаиморасчетов;
				НоваяЗапись.СкладКомпании              = ?(ЭтоРабота,ЦехОснования,СкладКомпании);
				НоваяЗапись.Номенклатура               = ?(ЭтоРабота,Справочники.Номенклатура.Авторабота,стрДок.Номенклатура);
				НоваяЗапись.Поставщик                  = стрДок.Контрагент;
				Если ЭтоРабота Тогда
					НоваяЗапись.Авторабота             = стрДок.Номенклатура;
				Иначе
					НоваяЗапись.ХарактеристикаНоменклатуры = стрДок.ХарактеристикаНоменклатуры;
				КонецЕсли;
				НоваяЗапись.СтатусПартии               = Перечисления.СтатусыПартий.ТоварКупленный;
				НоваяЗапись.СтавкаНДС                  = стрДок.СтавкаНДС;
				НоваяЗапись.Количество                 = НадоСписатьКоличество;
				
				
				НоваяЗапись.Сумма    = НадоСписатьКоличество*СуммаНаЕд;
				НоваяЗапись.СуммаНДС = НадоСписатьКоличество*СуммаНДСНаЕд;
				НоваяЗапись.СуммаУпр = обПересчет(НадоСписатьКоличество*СуммаНаЕд,ВалютаРегл,Дата,ВалютаУпр,Дата);
				
				СуммаРазница          = СуммаРазница - НадоСписатьКоличество*СуммаНаЕд;
				СуммаРазницаНДС       = СуммаРазницаНДС - НадоСписатьКоличество*СуммаНДСНаЕд;
			Иначе // если товар
				Для Каждого стрМассива Из МассивСтрокПартий Цикл
					// получим список ГТД для партии
					стрПоиск      = Новый Структура("Номенклатура",стрМассива.Номенклатура);
					Если НЕ обЗначениеНеЗаполнено(стрМассива.ХарактеристикаНоменклатуры) Тогда
						стрПоиск.Вставить("ХарактеристикаНоменклатуры",стрМассива.ХарактеристикаНоменклатуры);
					КонецЕсли;
					
					СебестоимостьРавнаПродаже = Ложь;
					Попытка
						Если стрМассива.СтатусПартии = Перечисления.СтатусыПартий.ТоварПринятыйКомиссия И (НЕ стрМассива.Партия.ДоговорВзаиморасчетов.КомиссияОтчетНаОснованииПродаж) Тогда
							СебестоимостьРавнаПродаже = Истина;
						КонецЕсли;
					Исключение
						СебестоимостьРавнаПродаже = Ложь;
					КонецПопытки;
					
					стрПоиск.Вставить("Партия",стрМассива.Партия);
					МассивГТД = ТаблицаГТД.НайтиСтроки(стрПоиск);
					Если МассивГТД.Количество() > 0 Тогда
						НадоОприходовать = стрМассива.Количество;
						Для Каждого стрГТД Из МассивГТД Цикл
							Если НадоОприходовать = 0 Тогда Прервать; КонецЕсли;
							Если стрГТД.Количество = 0 Тогда Продолжить; КонецЕсли;
							КоличествоСписываем = Мин(стрГТД.Количество,НадоОприходовать);
							
							НоваяЗапись = Движения.Продажи.Добавить();
							НоваяЗапись.Период                     = Дата;
							НоваяЗапись.Регистратор                = Ссылка;
							НоваяЗапись.ХозОперация                = ХозОперация;
							НоваяЗапись.ПодразделениеКомпании      = ПодразделениеКомпании;
							НоваяЗапись.Покупатель                 = Контрагент;
							НоваяЗапись.ДоговорВзаиморасчетов      = ДоговорВзаиморасчетов;
							НоваяЗапись.ДокументПродажи            = Сделка;
							НоваяЗапись.Номенклатура               = стрМассива.Номенклатура;
							НоваяЗапись.ХарактеристикаНоменклатуры = стрМассива.ХарактеристикаНоменклатуры;
							НоваяЗапись.СтатусПартии               = стрМассива.СтатусПартии;
							НоваяЗапись.ГТД                        = стрГТД.ГТД;
							НоваяЗапись.СкладКомпании              = СкладКомпании;
							НоваяЗапись.Партия                     = стрМассива.Партия;
							НоваяЗапись.СтавкаНДС                  = стрДок.СтавкаНДС;
							Попытка
								НоваяЗапись.Поставщик              = стрМассива.Партия.Контрагент;
							Исключение
							КонецПопытки;
							НоваяЗапись.Количество                 = КоличествоСписываем;
							
							НоваяЗапись.СебестоимостьУпр = ?(стрМассива.Количество=НоваяЗапись.Количество, стрМассива.СуммаУпр, стрМассива.СуммаУпр/стрМассива.Количество*НоваяЗапись.Количество);
							НоваяЗапись.Себестоимость    = ?(стрМассива.Количество=НоваяЗапись.Количество, стрМассива.Сумма,стрМассива.Сумма/стрМассива.Количество*НоваяЗапись.Количество);
							НоваяЗапись.СуммаНДСВходящий = ?(стрМассива.Количество=НоваяЗапись.Количество, стрМассива.СуммаНДС,стрМассива.СуммаНДС/стрМассива.Количество*НоваяЗапись.Количество);
							НоваяЗапись.Сумма            = КоличествоСписываем*СуммаНаЕд;
							НоваяЗапись.СуммаНДС         = КоличествоСписываем*СуммаНДСНаЕд;
							НоваяЗапись.СуммаУпр         = обПересчет(КоличествоСписываем*СуммаНаЕд,ВалютаРегл,Дата,ВалютаУпр,Дата);
							
							СуммаРазница    = СуммаРазница - КоличествоСписываем*СуммаНаЕд;
							СуммаРазницаНДС = СуммаРазницаНДС - КоличествоСписываем*СуммаНДСНаЕд;
							стрМассива.СуммаУпр = стрМассива.СуммаУпр - НоваяЗапись.СебестоимостьУпр;
							стрМассива.Сумма    = стрМассива.Сумма    - НоваяЗапись.Себестоимость;
							стрМассива.СуммаНДС = стрМассива.СуммаНДС - НоваяЗапись.СуммаНДСВходящий;
							НадоОприходовать  = НадоОприходовать - КоличествоСписываем;
							стрГТД.Количество = стрГТД.Количество - КоличествоСписываем;
							
							Если СебестоимостьРавнаПродаже Тогда
								СтавкаНДСВходящее   = Окр(НоваяЗапись.СуммаНДСВходящий/(НоваяЗапись.Себестоимость-НоваяЗапись.СуммаНДСВходящий), 2);
								СебестоимостьБезНДС = (НоваяЗапись.Сумма-НоваяЗапись.СуммаНДС);
								
								НоваяЗапись.Себестоимость    = НоваяЗапись.Сумма;
								НоваяЗапись.СебестоимостьУпр = НоваяЗапись.СуммаУпр;
								НоваяЗапись.СуммаНДСВходящий = Окр(СебестоимостьБезНДС*СтавкаНДСВходящее, 2);
							КонецЕсли;
							
						КонецЦикла;
						
						Если НадоОприходовать > 0 Тогда
							КоличествоСписываем = НадоОприходовать;
							НоваяЗапись = Движения.Продажи.Добавить();
							НоваяЗапись.Период                     = Дата;
							НоваяЗапись.Регистратор                = Ссылка;
							НоваяЗапись.ХозОперация                = ХозОперация;
							НоваяЗапись.ПодразделениеКомпании      = ПодразделениеКомпании;
							НоваяЗапись.Покупатель                 = Контрагент;
							НоваяЗапись.ДоговорВзаиморасчетов      = ДоговорВзаиморасчетов;
							НоваяЗапись.ДокументПродажи            = Сделка;
							НоваяЗапись.Номенклатура               = стрМассива.Номенклатура;
							НоваяЗапись.ХарактеристикаНоменклатуры = стрМассива.ХарактеристикаНоменклатуры;
							НоваяЗапись.СтатусПартии               = стрМассива.СтатусПартии;
							НоваяЗапись.СкладКомпании              = СкладКомпании;
							НоваяЗапись.Партия                     = стрМассива.Партия;
							НоваяЗапись.СтавкаНДС                  = стрДок.СтавкаНДС;
							Попытка
								НоваяЗапись.Поставщик              = стрМассива.Партия.Контрагент;
							Исключение
							КонецПопытки;
							НоваяЗапись.Количество                 = КоличествоСписываем;
							
							НоваяЗапись.СебестоимостьУпр = стрМассива.СуммаУпр;
							НоваяЗапись.Себестоимость    = стрМассива.Сумма;
							НоваяЗапись.СуммаНДСВходящий = стрМассива.СуммаНДС;
							НоваяЗапись.Сумма            = КоличествоСписываем*СуммаНаЕд;
							НоваяЗапись.СуммаНДС         = КоличествоСписываем*СуммаНДСНаЕд;
							НоваяЗапись.СуммаУпр         = обПересчет(КоличествоСписываем*СуммаНаЕд,ВалютаРегл,Дата,ВалютаУпр,Дата);
							
							Если СебестоимостьРавнаПродаже Тогда
								СтавкаНДСВходящее   = Окр(НоваяЗапись.СуммаНДСВходящий/(НоваяЗапись.Себестоимость-НоваяЗапись.СуммаНДСВходящий), 2);
								СебестоимостьБезНДС = (НоваяЗапись.Сумма-НоваяЗапись.СуммаНДС);
								
								НоваяЗапись.Себестоимость    = НоваяЗапись.Сумма;
								НоваяЗапись.СебестоимостьУпр = НоваяЗапись.СуммаУпр;
								НоваяЗапись.СуммаНДСВходящий = Окр(СебестоимостьБезНДС*СтавкаНДСВходящее, 2);
							КонецЕсли;
							
							СуммаРазница    = СуммаРазница - КоличествоСписываем*СуммаНаЕд;
							СуммаРазницаНДС = СуммаРазницаНДС - КоличествоСписываем*СуммаНДСНаЕд;
						КонецЕсли;
					Иначе
						КоличествоСписываем = стрМассива.Количество;
						НоваяЗапись = Движения.Продажи.Добавить();
						НоваяЗапись.Период                     = Дата;
						НоваяЗапись.Регистратор                = Ссылка;
						НоваяЗапись.ХозОперация                = ХозОперация;
						НоваяЗапись.ПодразделениеКомпании      = ПодразделениеКомпании;
						НоваяЗапись.Покупатель                 = Контрагент;
						НоваяЗапись.ДоговорВзаиморасчетов      = ДоговорВзаиморасчетов;
						НоваяЗапись.ДокументПродажи            = Сделка;
						НоваяЗапись.Номенклатура               = стрМассива.Номенклатура;
						НоваяЗапись.ХарактеристикаНоменклатуры = стрМассива.ХарактеристикаНоменклатуры;
						НоваяЗапись.СтатусПартии               = стрМассива.СтатусПартии;
						НоваяЗапись.СкладКомпании              = СкладКомпании;
						НоваяЗапись.Партия                     = стрМассива.Партия;
						НоваяЗапись.СтавкаНДС                  = стрДок.СтавкаНДС;
						Попытка
							НоваяЗапись.Поставщик              = стрМассива.Партия.Контрагент;
						Исключение
						КонецПопытки;
						НоваяЗапись.Количество                 = КоличествоСписываем;
						
						НоваяЗапись.СебестоимостьУпр = стрМассива.СуммаУпр;
						НоваяЗапись.Себестоимость    = стрМассива.Сумма;
						НоваяЗапись.СуммаНДСВходящий = стрМассива.СуммаНДС;
						НоваяЗапись.Сумма            = КоличествоСписываем*СуммаНаЕд;
						НоваяЗапись.СуммаНДС         = КоличествоСписываем*СуммаНДСНаЕд;
						НоваяЗапись.СуммаУпр         = обПересчет(КоличествоСписываем*СуммаНаЕд,ВалютаРегл,Дата,ВалютаУпр,Дата);
						
						Если СебестоимостьРавнаПродаже Тогда
							СтавкаНДСВходящее   = Окр(НоваяЗапись.СуммаНДСВходящий/(НоваяЗапись.Себестоимость-НоваяЗапись.СуммаНДСВходящий), 2);
							СебестоимостьБезНДС = (НоваяЗапись.Сумма-НоваяЗапись.СуммаНДС);
							
							НоваяЗапись.Себестоимость    = НоваяЗапись.Сумма;
							НоваяЗапись.СебестоимостьУпр = НоваяЗапись.СуммаУпр;
							НоваяЗапись.СуммаНДСВходящий = Окр(СебестоимостьБезНДС*СтавкаНДСВходящее, 2);
						КонецЕсли;
						
						СуммаРазница    = СуммаРазница - КоличествоСписываем*СуммаНаЕд;
						СуммаРазницаНДС = СуммаРазницаНДС - КоличествоСписываем*СуммаНДСНаЕд;
					КонецЕсли;
				КонецЦикла;
			КонецЕсли;
		Иначе // возврат товаров
			стрПоиск      = Новый Структура("Номенклатура",стрДок.Номенклатура);
			Если НЕ обЗначениеНеЗаполнено(стрДок.ХарактеристикаНоменклатуры) Тогда
				стрПоиск.Вставить("ХарактеристикаНоменклатуры",стрДок.ХарактеристикаНоменклатуры);
			КонецЕсли;
			
			МассивСтрокПартий = ТаблПартий.НайтиСтроки(стрПоиск);
			Если МассивСтрокПартий.Количество() = 0 Тогда
				НадоСписатьКоличество = -НадоСписатьКоличество;
				Если ЭтоРабота Тогда
					стрПоиск      = Новый Структура("Авторабота",стрДок.Номенклатура);
				Иначе
					стрПоиск      = Новый Структура("Номенклатура",стрДок.Номенклатура);
					Если НЕ обЗначениеНеЗаполнено(стрДок.ХарактеристикаНоменклатуры) Тогда
						стрПоиск.Вставить("ХарактеристикаНоменклатуры",стрДок.ХарактеристикаНоменклатуры);
					КонецЕсли;
				КонецЕсли;
				МассивСтрокПродаж = ТаблПродаж.НайтиСтроки(стрПоиск);
				Для Каждого стрПродаж Из МассивСтрокПродаж Цикл
					Если НадоСписатьКоличество = 0 Тогда Прервать; КонецЕсли;
					
					КоличествоСписываем = Мин(НадоСписатьКоличество,стрПродаж.Количество);
					Если КоличествоСписываем = стрПродаж.Количество Тогда
						СуммаСписываем    = -стрПродаж.Сумма;
						СуммаНДССписываем = -стрПродаж.СуммаНДС;
						СуммаУпрСписываем = -стрПродаж.СуммаУпр;
						
						СебестоимостьУпрСписываем = -стрПродаж.СебестоимостьУпр;
						СебестоимостьСписываем    = -стрПродаж.Себестоимость;
						СуммаНДСВходящийСписываем = -стрПродаж.СуммаНДСВходящий;
					Иначе
						СуммаСписываем    = -стрПродаж.Сумма/стрПродаж.Количество*КоличествоСписываем;
						СуммаНДССписываем = -стрПродаж.СуммаНДС/стрПродаж.Количество*КоличествоСписываем;
						СуммаУпрСписываем = -стрПродаж.СуммаУпр/стрПродаж.Количество*КоличествоСписываем;
						
						СебестоимостьУпрСписываем = -стрПродаж.СебестоимостьУпр/стрПродаж.Количество*КоличествоСписываем;
						СебестоимостьСписываем    = -стрПродаж.Себестоимость/стрПродаж.Количество*КоличествоСписываем;
						СуммаНДСВходящийСписываем = -стрПродаж.СуммаНДСВходящий/стрПродаж.Количество*КоличествоСписываем;
					КонецЕсли;
					
					
					НоваяЗапись = Движения.Продажи.Добавить();
					НоваяЗапись.Период                     = Дата;
					НоваяЗапись.Регистратор                = Ссылка;
					НоваяЗапись.ХозОперация                = ХозОперация;
					НоваяЗапись.ПодразделениеКомпании      = стрПродаж.ПодразделениеКомпании;
					НоваяЗапись.Покупатель                 = стрПродаж.Покупатель;
					НоваяЗапись.ДоговорВзаиморасчетов      = стрПродаж.ДоговорВзаиморасчетов;
					НоваяЗапись.ДокументПродажи            = стрПродаж.ДокументПродажи;
					НоваяЗапись.Номенклатура               = ?(ЭтоРабота,Справочники.Номенклатура.Авторабота,стрПродаж.Номенклатура);
					Если ЭтоРабота Тогда
						НоваяЗапись.Авторабота             = стрПродаж.Авторабота;
					Иначе
						НоваяЗапись.ХарактеристикаНоменклатуры = стрПродаж.ХарактеристикаНоменклатуры;
					КонецЕсли;
					НоваяЗапись.СтатусПартии               = стрПродаж.СтатусПартии;
					НоваяЗапись.СкладКомпании              = стрПродаж.СкладКомпании;
					НоваяЗапись.Партия                     = стрПродаж.Партия;
					НоваяЗапись.ГТД                        = стрПродаж.ГТД;
					НоваяЗапись.Поставщик                  = стрПродаж.Поставщик;
					НоваяЗапись.СтавкаНДС                  = стрПродаж.СтавкаНДС;
					НоваяЗапись.Количество                 = -КоличествоСписываем;
					
					НоваяЗапись.СебестоимостьУпр = СебестоимостьУпрСписываем;
					НоваяЗапись.Себестоимость    = СебестоимостьСписываем;
					НоваяЗапись.СуммаНДСВходящий = СуммаНДСВходящийСписываем;
					НоваяЗапись.Сумма            = СуммаСписываем;
					НоваяЗапись.СуммаНДС         = СуммаНДССписываем;
					НоваяЗапись.СуммаУпр         = СуммаУпрСписываем;
					
					НадоСписатьКоличество = НадоСписатьКоличество - КоличествоСписываем;
					СуммаРазница          = СуммаРазница - СуммаСписываем;
					СуммаРазницаНДС       = СуммаРазницаНДС - СуммаНДССписываем;
					
					стрПродаж.Количество = стрПродаж.Количество - КоличествоСписываем;
					Если стрПродаж.Количество = 0 Тогда
						ТаблПродаж.Удалить(стрПродаж);
					КонецЕсли;
				КонецЦикла;
			Иначе
				Для Каждого стрМассива Из МассивСтрокПартий Цикл
					НадоСписатьКоличество = -стрМассива.Количество;
					стрПоиск      = Новый Структура("Номенклатура,Партия",стрМассива.Номенклатура,стрМассива.Партия);
					Если НЕ обЗначениеНеЗаполнено(стрМассива.ХарактеристикаНоменклатуры) Тогда
						стрПоиск.Вставить("ХарактеристикаНоменклатуры",стрМассива.ХарактеристикаНоменклатуры);
					КонецЕсли;
					// списание с учетом ГТД
					// получим список ГТД для партии
					стрПоискГТД      = Новый Структура("Номенклатура",стрМассива.Номенклатура);
					Если НЕ обЗначениеНеЗаполнено(стрМассива.ХарактеристикаНоменклатуры) Тогда
						стрПоискГТД.Вставить("ХарактеристикаНоменклатуры",стрМассива.ХарактеристикаНоменклатуры);
					КонецЕсли;
					стрПоискГТД.Вставить("Партия",стрМассива.Партия);
					МассивГТД = ТаблицаГТД.НайтиСтроки(стрПоискГТД);
					
					Если МассивГТД.Количество() > 0  Тогда
						Для Каждого стрГТД Из МассивГТД Цикл
							Если НадоСписатьКоличество = 0 Тогда Прервать; КонецЕсли;
							стрПоиск.Вставить("ГТД",стрГТД.ГТД);
							МассивСтрокПродаж = ТаблПродаж.НайтиСтроки(стрПоиск);
							Для Каждого стрПродаж Из МассивСтрокПродаж Цикл
								Если НадоСписатьКоличество = 0 Тогда Прервать; КонецЕсли;
								
								КоличествоСписываем = Мин(НадоСписатьКоличество,стрПродаж.Количество);
								Если КоличествоСписываем = стрПродаж.Количество Тогда
									СуммаСписываем    = -стрПродаж.Сумма;
									СуммаНДССписываем = -стрПродаж.СуммаНДС;
									СуммаУпрСписываем = -стрПродаж.СуммаУпр;
									
									СебестоимостьУпрСписываем = -стрПродаж.СебестоимостьУпр;
									СебестоимостьСписываем    = -стрПродаж.Себестоимость;
									СуммаНДСВходящийСписываем = -стрПродаж.СуммаНДСВходящий;
								Иначе
									СуммаСписываем    = -стрПродаж.Сумма/стрПродаж.Количество*КоличествоСписываем;
									СуммаНДССписываем = -стрПродаж.СуммаНДС/стрПродаж.Количество*КоличествоСписываем;
									СуммаУпрСписываем = -стрПродаж.СуммаУпр/стрПродаж.Количество*КоличествоСписываем;
									
									СебестоимостьУпрСписываем = -стрПродаж.СебестоимостьУпр/стрПродаж.Количество*КоличествоСписываем;
									СебестоимостьСписываем    = -стрПродаж.Себестоимость/стрПродаж.Количество*КоличествоСписываем;
									СуммаНДСВходящийСписываем = -стрПродаж.СуммаНДСВходящий/стрПродаж.Количество*КоличествоСписываем;
								КонецЕсли;
								
								НоваяЗапись = Движения.Продажи.Добавить();
								НоваяЗапись.Период                     = Дата;
								НоваяЗапись.Регистратор                = Ссылка;
								НоваяЗапись.ХозОперация                = ХозОперация;
								НоваяЗапись.ПодразделениеКомпании      = стрПродаж.ПодразделениеКомпании;
								НоваяЗапись.Покупатель                 = стрПродаж.Покупатель;
								НоваяЗапись.ДоговорВзаиморасчетов      = стрПродаж.ДоговорВзаиморасчетов;
								НоваяЗапись.Номенклатура               = стрПродаж.Номенклатура;
								НоваяЗапись.ХарактеристикаНоменклатуры = стрПродаж.ХарактеристикаНоменклатуры;
								НоваяЗапись.СтатусПартии               = стрПродаж.СтатусПартии;
								НоваяЗапись.ДокументПродажи            = стрПродаж.ДокументПродажи;
								НоваяЗапись.СкладКомпании              = стрПродаж.СкладКомпании;
								НоваяЗапись.Партия                     = стрПродаж.Партия;
								НоваяЗапись.ГТД                        = стрПродаж.ГТД;
								НоваяЗапись.Поставщик                  = стрПродаж.Поставщик;
								НоваяЗапись.СтавкаНДС                  = стрПродаж.СтавкаНДС;
								НоваяЗапись.Количество                 = -КоличествоСписываем;
								
								НоваяЗапись.СебестоимостьУпр = СебестоимостьУпрСписываем;
								НоваяЗапись.Себестоимость    = СебестоимостьСписываем;
								НоваяЗапись.СуммаНДСВходящий = СуммаНДСВходящийСписываем;
								НоваяЗапись.Сумма            = СуммаСписываем;
								НоваяЗапись.СуммаНДС         = СуммаНДССписываем;
								НоваяЗапись.СуммаУпр         = СуммаУпрСписываем;
								
								НадоСписатьКоличество = НадоСписатьКоличество - КоличествоСписываем;
								СуммаРазница          = СуммаРазница - СуммаСписываем;
								СуммаРазницаНДС       = СуммаРазницаНДС - СуммаНДССписываем;
								
								стрПродаж.Количество = стрПродаж.Количество - КоличествоСписываем;
								Если стрПродаж.Количество = 0 Тогда
									ТаблПродаж.Удалить(стрПродаж);
								КонецЕсли;
							КонецЦикла;
						КонецЦикла;
					КонецЕсли;
					
					// списание без учета ГТД
					стрПоиск      = Новый Структура("Номенклатура,Партия",стрМассива.Номенклатура,стрМассива.Партия);
					Если НЕ обЗначениеНеЗаполнено(стрМассива.ХарактеристикаНоменклатуры) Тогда
						стрПоиск.Вставить("ХарактеристикаНоменклатуры",стрМассива.ХарактеристикаНоменклатуры);
					КонецЕсли;
					МассивСтрокПродаж = ТаблПродаж.НайтиСтроки(стрПоиск);
					Для Каждого стрПродаж Из МассивСтрокПродаж Цикл
						Если НадоСписатьКоличество = 0 Тогда Прервать; КонецЕсли;
						
						КоличествоСписываем = Мин(НадоСписатьКоличество,стрПродаж.Количество);
						Если КоличествоСписываем = стрПродаж.Количество Тогда
							СуммаСписываем    = -стрПродаж.Сумма;
							СуммаНДССписываем = -стрПродаж.СуммаНДС;
							СуммаУпрСписываем = -стрПродаж.СуммаУпр;
							
							СебестоимостьУпрСписываем = -стрПродаж.СебестоимостьУпр;
							СебестоимостьСписываем    = -стрПродаж.Себестоимость;
							СуммаНДСВходящийСписываем = -стрПродаж.СуммаНДСВходящий;
						Иначе
							СуммаСписываем    = -стрПродаж.Сумма/стрПродаж.Количество*КоличествоСписываем;
							СуммаНДССписываем = -стрПродаж.СуммаНДС/стрПродаж.Количество*КоличествоСписываем;
							СуммаУпрСписываем = -стрПродаж.СуммаУпр/стрПродаж.Количество*КоличествоСписываем;
							
							СебестоимостьУпрСписываем = -стрПродаж.СебестоимостьУпр/стрПродаж.Количество*КоличествоСписываем;
							СебестоимостьСписываем    = -стрПродаж.Себестоимость/стрПродаж.Количество*КоличествоСписываем;
							СуммаНДСВходящийСписываем = -стрПродаж.СуммаНДСВходящий/стрПродаж.Количество*КоличествоСписываем;
						КонецЕсли;
						
						НоваяЗапись = Движения.Продажи.Добавить();
						НоваяЗапись.Период                     = Дата;
						НоваяЗапись.Регистратор                = Ссылка;
						НоваяЗапись.ХозОперация                = ХозОперация;
						НоваяЗапись.ПодразделениеКомпании      = стрПродаж.ПодразделениеКомпании;
						НоваяЗапись.Покупатель                 = стрПродаж.Покупатель;
						НоваяЗапись.ДоговорВзаиморасчетов      = стрПродаж.ДоговорВзаиморасчетов;
						НоваяЗапись.Номенклатура               = стрПродаж.Номенклатура;
						НоваяЗапись.ХарактеристикаНоменклатуры = стрПродаж.ХарактеристикаНоменклатуры;
						НоваяЗапись.СтатусПартии               = стрПродаж.СтатусПартии;
						НоваяЗапись.ДокументПродажи            = стрПродаж.ДокументПродажи;
						НоваяЗапись.СкладКомпании              = стрПродаж.СкладКомпании;
						НоваяЗапись.Партия                     = стрПродаж.Партия;
						НоваяЗапись.ГТД                        = стрПродаж.ГТД;
						НоваяЗапись.Поставщик                  = стрПродаж.Поставщик;
						НоваяЗапись.СтавкаНДС                  = стрПродаж.СтавкаНДС;
						НоваяЗапись.Количество                 = -КоличествоСписываем;
						
						НоваяЗапись.СебестоимостьУпр = СебестоимостьУпрСписываем;
						НоваяЗапись.Себестоимость    = СебестоимостьСписываем;
						НоваяЗапись.СуммаНДСВходящий = СуммаНДСВходящийСписываем;
						НоваяЗапись.Сумма            = СуммаСписываем;
						НоваяЗапись.СуммаНДС         = СуммаНДССписываем;
						НоваяЗапись.СуммаУпр         = СуммаУпрСписываем;
						
						НадоСписатьКоличество = НадоСписатьКоличество - КоличествоСписываем;
						СуммаРазница          = СуммаРазница - СуммаСписываем;
						СуммаРазницаНДС       = СуммаРазницаНДС - СуммаНДССписываем;
						
						стрПродаж.Количество = стрПродаж.Количество - КоличествоСписываем;
						Если стрПродаж.Количество = 0 Тогда
							ТаблПродаж.Удалить(стрПродаж);
						КонецЕсли;
					КонецЦикла;
				КонецЦикла;
			КонецЕсли;
			
			Если НадоСписатьКоличество <> 0 Тогда
				ВсеОК = Ложь;
				ТекстСообщения = ТекстСообщения + ?(ПустаяСтрока(ТекстСообщения),"",Символы.ПС) + "Товар <"+стрДок.Номенклатура+"> не был реализован в количестве " + Строка(-стрДок.Количество);
			КонецЕсли;
		КонецЕсли;
		
		//Бондаренко++ 20220922
		Если НЕ РольДоступна("ПолныеПрава")  Тогда
			//Бондаренко-- 20220922	
			Если НЕ ВсеОК Тогда
				Отказ = Истина;
				дкСообщитьРезультат(ТекстСообщения,"Важное&Партии товаров компании:", ЭтотОбъект, стрДок.Номенклатура);
				Возврат НЕ Отказ;
			КонецЕсли;
			//Бондаренко++ 20220922
		КонецЕсли; 
		//Бондаренко-- 20220922	
		
		Если Окр(СуммаРазница,2) <> 0 ИЛИ Окр(СуммаРазницаНДС,2) <> 0 Тогда
			// получим движения по продажам
			
			Если ЭтоРабота Тогда
				стрПоиск      = Новый Структура("Авторабота",стрДок.Номенклатура);
			Иначе
				стрПоиск      = Новый Структура("Номенклатура",стрДок.Номенклатура);
				Если НЕ обЗначениеНеЗаполнено(стрДок.ХарактеристикаНоменклатуры) Тогда
					стрПоиск.Вставить("ХарактеристикаНоменклатуры",стрДок.ХарактеристикаНоменклатуры);
				КонецЕсли;
			КонецЕсли;
			МассивСтрок = ТаблПродаж.НайтиСтроки(стрПоиск);
			
			Если МассивСтрок.Количество() > 0 Тогда
				// получим количество всего
				КоличествоВсего = 0;
				Для Каждого стрМассива Из МассивСтрок Цикл
					КоличествоВсего = КоличествоВсего + стрМассива.Количество;
				КонецЦикла;
				
				Для Каждого стрМассива Из МассивСтрок Цикл
					Если КоличествоВсего = 0 ИЛИ (СуммаРазница = 0 И СуммаРазницаНДС = 0) Тогда Прервать; КонецЕсли;
					
					КолСписываем = Мин(КоличествоВсего,стрМассива.Количество);
					СуммаСпис    = Окр(?(КолСписываем = КоличествоВсего, СуммаРазница, СуммаРазница/КоличествоВсего*КолСписываем),2);
					СуммаСписНДС = Окр(?(КолСписываем = КоличествоВсего, СуммаРазницаНДС, СуммаРазницаНДС/КоличествоВсего*КолСписываем),2);
					
					Если СуммаСписНДС <> 0 ИЛИ СуммаСпис <> 0 Тогда
						// добавим запись
						НоваяЗапись = Движения.Продажи.Добавить();
						ЗаполнитьЗначенияСвойств(НоваяЗапись, стрМассива);
						НоваяЗапись.Регистратор = Ссылка;
						НоваяЗапись.Период      = Дата;
						НоваяЗапись.ХозОперация = ХозОперация;
						НоваяЗапись.Количество  = 0;
						
						НоваяЗапись.СебестоимостьУпр = 0;
						НоваяЗапись.Себестоимость    = 0;
						НоваяЗапись.СуммаНДСВходящий = 0;
						НоваяЗапись.СуммаСкидки      = 0;
						НоваяЗапись.Сумма            = СуммаСпис;
						НоваяЗапись.СуммаНДС         = СуммаСписНДС;
						НоваяЗапись.СуммаУпр         = обПересчет(СуммаСпис,ВалютаРегл,Дата,ВалютаУпр,Дата);
					КонецЕсли;
					
					КоличествоВсего = КоличествоВсего - КолСписываем;
					СуммаРазница    = СуммаРазница - СуммаСпис;
					СуммаРазницаНДС = СуммаРазницаНДС - СуммаСписНДС;
				КонецЦикла;
			Иначе
				//Иванченко 20250506 ++ 
				Если НоваяЗапись <> Неопределено Тогда  	
					НоваяЗапись.Сумма            = НоваяЗапись.Сумма + Окр(СуммаРазница,2);
					НоваяЗапись.СуммаНДС         = НоваяЗапись.СуммаНДС + Окр(СуммаРазницаНДС,2);
					НоваяЗапись.СуммаУпр         = НоваяЗапись.СуммаУпр + обПересчет(СуммаРазница,ВалютаРегл,Дата,ВалютаУпр,Дата); 
				КонецЕсли;  
				//Иванченко 20250506 -- 
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
КонецФункции

Функция ПровестиПоРеализованнымТоварам()
	Запрос = Новый Запрос;
	// получим таблицу документа
	Запрос.Текст =
	"ВЫБРАТЬ
	|	КорректировкаРеализацииТовары.Номенклатура,
	|	СУММА(КорректировкаРеализацииТовары.Количество*КорректировкаРеализацииТовары.Коэффициент) КАК Количество,
	|	СУММА(КорректировкаРеализацииТовары.СуммаВсего) КАК СуммаВсего,
	|	СУММА(КорректировкаРеализацииТовары.СуммаНДС) КАК СуммаНДС,
	|	КорректировкаРеализацииТовары.ХарактеристикаНоменклатуры
	|ИЗ
	|	Документ.КорректировкаРеализации.Товары КАК КорректировкаРеализацииТовары
	|ГДЕ
	|	(КорректировкаРеализацииТовары.КоличествоРазница <> 0 ИЛИ
	|	КорректировкаРеализацииТовары.СуммаВсегоРазница <> 0)
	|	И КорректировкаРеализацииТовары.Количество > 0
	|	И КорректировкаРеализацииТовары.Ссылка = &Регистратор
	|
	|СГРУППИРОВАТЬ ПО
	|	КорректировкаРеализацииТовары.Номенклатура,
	|	КорректировкаРеализацииТовары.ХарактеристикаНоменклатуры";
	Запрос.УстановитьПараметр("Регистратор",Ссылка);
	ТаблДок =  Запрос.Выполнить().Выгрузить();
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ПартииТоваровКомпании.СкладКомпании,
	|	ПартииТоваровКомпании.Номенклатура,
	|	ПартииТоваровКомпании.ХарактеристикаНоменклатуры,
	|	ПартииТоваровКомпании.СтатусПартии,
	|	ПартииТоваровКомпании.Партия,
	|	ПартииТоваровКомпании.Количество,
	|	ПартииТоваровКомпании.Сумма,
	|	ПартииТоваровКомпании.СуммаУпр,
	|	ПартииТоваровКомпании.ХозОперация,
	|	ПартииТоваровКомпании.СтавкаНДС,
	|	ПартииТоваровКомпании.Проект
	|ИЗ
	|	РегистрНакопления.ПартииТоваровКомпании КАК ПартииТоваровКомпании
	|ГДЕ
	|	ПартииТоваровКомпании.Регистратор = &Регистратор
	|	И ПартииТоваровКомпании.Номенклатура В(&Номенклатура)
	|	И ПартииТоваровКомпании.СтатусПартии = &СтатусПартии
	|	И ПартииТоваровКомпании.ВидДвижения = &ВидДвижения";
	
	Запрос.УстановитьПараметр("ВидДвижения"  , ВидДвиженияНакопления.Расход);
	Запрос.УстановитьПараметр("Номенклатура" , ТаблДок.ВыгрузитьКолонку("Номенклатура"));
	Запрос.УстановитьПараметр("Регистратор"  , Ссылка);
	Запрос.УстановитьПараметр("СтатусПартии" , Перечисления.СтатусыПартий.ТоварПринятыйКомиссия);
	ТаблДвижений = Запрос.Выполнить().Выгрузить();
	
	ТаблГТД = Движения.ГТДПартийТоваровКомпании.Выгрузить().Скопировать();
	
	Для каждого стрДвижений Из ТаблДвижений Цикл
		НадоОприходовать      = стрДвижений.Количество;
		НадоОприходоватьСумма = стрДвижений.СуммаУпр;
		
		// пройдемся по ГТД
		стрПоиск = Новый Структура;
		стрПоиск.Вставить("Номенклатура",стрДвижений.Номенклатура);
		стрПоиск.Вставить("Партия", стрДвижений.Партия);
		Если НЕ обЗначениеНеЗаполнено(стрДвижений.ХарактеристикаНоменклатуры) Тогда
			стрПоиск.Вставить("ХарактеристикаНоменклатуры",стрДвижений.ХарактеристикаНоменклатуры);
		КонецЕсли;
		МассивГТД = ТаблГТД.НайтиСтроки(стрПоиск);
		
		Для Каждого стрГТД Из МассивГТД Цикл
			Если стрГТД.Количество = 0 Тогда Продолжить; КонецЕсли;
			Если НадоОприходовать = 0 Тогда Прервать; КонецЕсли;
			
			КоличествоПриходуем = Мин(стрГТД.Количество, НадоОприходовать);
			СуммаПриходуем      = ?(НадоОприходовать = КоличествоПриходуем,НадоОприходоватьСумма,НадоОприходоватьСумма/НадоОприходовать*КоличествоПриходуем);
			
			
			// получим массивы строк
			МассивСХар   = ТаблДок.НайтиСтроки(Новый Структура("Номенклатура,ХарактеристикаНоменклатуры",стрДвижений.Номенклатура,стрДвижений.ХарактеристикаНоменклатуры));
			МассивБезХар = ТаблДок.НайтиСтроки(Новый Структура("Номенклатура",стрДвижений.Номенклатура));
			
			Если МассивСХар.Количество() > 0 Тогда
				ТекСтрока = МассивСХар[0];
			ИначеЕсли МассивБезХар.Количество() > 0 Тогда
				ТекСтрока = МассивБезХар[0];
			Иначе
				ТекСтрока = Неопределено;
			КонецЕсли;
			
			НоваяЗапись             = Движения.РеализованныеТовары.Добавить();
			НоваяЗапись.Регистратор = Ссылка;
			НоваяЗапись.Период      = Дата;
			
			// измерения
			НоваяЗапись.Контрагент = стрДвижений.Партия.Контрагент;
			НоваяЗапись.ДоговорВзаиморасчетов = стрДвижений.Партия.ДоговорВзаиморасчетов;
			НоваяЗапись.Номенклатура = стрДвижений.Номенклатура;
			НоваяЗапись.ХарактеристикаНоменклатуры = стрДвижений.ХарактеристикаНоменклатуры;
			НоваяЗапись.ДокументПередачи = стрДвижений.Партия;
			НоваяЗапись.ГТД = стрГТД.ГТД;
			
			// ресурсы
			
			НоваяЗапись.Количество = КоличествоПриходуем;
			НоваяЗапись.СуммаУпр   = СуммаПриходуем;
			
			Если ТекСтрока <> Неопределено Тогда
				Если КоличествоПриходуем = ТекСтрока.Количество Тогда
					СуммаПродажи = ТекСтрока.СуммаВсего;
				Иначе
					СуммаПродажи = ?(ТекСтрока.Количество = 0,0, ТекСтрока.СуммаВсего/ТекСтрока.Количество*КоличествоПриходуем);
				КонецЕсли;
				
				ВалютаУпр = Константы.ВалютаУправленческогоУчетаКомпании.Получить();
				Если ВалютаУпр = ВалютаДокумента Тогда
					НоваяЗапись.СуммаПродажи = СуммаПродажи;
				Иначе
					НоваяЗапись.СуммаПродажи = обПересчет(СуммаПродажи,ВалютаДокумента,КурсДокумента,ВалютаУпр,КурсВалютыУпр);
				КонецЕсли;
				
				//СебестоимостьРавнаПродаже
				Если (НЕ НоваяЗапись.ДоговорВзаиморасчетов.КомиссияОтчетНаОснованииПродаж) Тогда
					НоваяЗапись.СуммаУпр  = НоваяЗапись.СуммаПродажи;
				КонецЕсли;
				
			Иначе
				#Если Клиент Тогда
					Сообщить("Не удалось получить сумму продажи товара <"+стрДвижений.Номенклатура+">.",СтатусСообщения.Информация);
				#КонецЕсли
			КонецЕсли;
			
			// реквизиты
			НоваяЗапись.ХозОперация = ХозОперация;
			
			// уменьшем оприходованное
			НадоОприходовать      = НадоОприходовать - КоличествоПриходуем;
			НадоОприходоватьСумма = НадоОприходоватьСумма - СуммаПриходуем;
			Если КоличествоПриходуем = стрГТД.Количество Тогда
				ТаблГТД.Удалить(стрГТД);
			Иначе
				стрГТД.Количество = стрГТД.Количество - КоличествоПриходуем;
			КонецЕсли;
		КонецЦикла;
		
		Если НадоОприходовать > 0 Тогда
			// получим массивы строк
			МассивСХар   = ТаблДок.НайтиСтроки(Новый Структура("Номенклатура,ХарактеристикаНоменклатуры",стрДвижений.Номенклатура,стрДвижений.ХарактеристикаНоменклатуры));
			МассивБезХар = ТаблДок.НайтиСтроки(Новый Структура("Номенклатура",стрДвижений.Номенклатура));
			
			Если МассивСХар.Количество() > 0 Тогда
				ТекСтрока = МассивСХар[0];
			ИначеЕсли МассивБезХар.Количество() > 0 Тогда
				ТекСтрока = МассивБезХар[0];
			Иначе
				ТекСтрока = Неопределено;
			КонецЕсли;
			
			НоваяЗапись             = Движения.РеализованныеТовары.Добавить();
			НоваяЗапись.Регистратор = Ссылка;
			НоваяЗапись.Период      = Дата;
			
			// измерения
			НоваяЗапись.Контрагент = стрДвижений.Партия.Контрагент;
			НоваяЗапись.ДоговорВзаиморасчетов = стрДвижений.Партия.ДоговорВзаиморасчетов;
			НоваяЗапись.Номенклатура = стрДвижений.Номенклатура;
			НоваяЗапись.ХарактеристикаНоменклатуры = стрДвижений.ХарактеристикаНоменклатуры;
			НоваяЗапись.ДокументПередачи = стрДвижений.Партия;
			
			// ресурсы
			
			НоваяЗапись.Количество = НадоОприходовать;
			НоваяЗапись.СуммаУпр   = НадоОприходоватьСумма;
			
			Если ТекСтрока <> Неопределено Тогда
				Если НадоОприходовать = ТекСтрока.Количество Тогда
					СуммаПродажи = ТекСтрока.СуммаВсего;
				Иначе
					СуммаПродажи = ?(ТекСтрока.Количество = 0,0, ТекСтрока.СуммаВсего/ТекСтрока.Количество*НадоОприходовать);
				КонецЕсли;
				
				ВалютаУпр = Константы.ВалютаУправленческогоУчетаКомпании.Получить();
				Если ВалютаУпр = ВалютаДокумента Тогда
					НоваяЗапись.СуммаПродажи = СуммаПродажи;
				Иначе
					НоваяЗапись.СуммаПродажи = обПересчет(СуммаПродажи,ВалютаДокумента,КурсДокумента,ВалютаУпр,КурсВалютыУпр);
				КонецЕсли;
				
				//СебестоимостьРавнаПродаже
				Если (НЕ НоваяЗапись.ДоговорВзаиморасчетов.КомиссияОтчетНаОснованииПродаж) Тогда
					НоваяЗапись.СуммаУпр  = НоваяЗапись.СуммаПродажи;
				КонецЕсли;
				
			Иначе
				#Если Клиент Тогда
					Сообщить("Не удалось получить сумму продажи товара <"+стрДвижений.Номенклатура+">.",СтатусСообщения.Информация);
				#КонецЕсли
			КонецЕсли;
			
			// реквизиты
			НоваяЗапись.ХозОперация = ХозОперация;
		КонецЕсли;
		
		//// Пройдкмся по гтд
		//НадоОприходовать = стрДвижений.Количество;
		//
		//Если НадоОприходовать = 0 Тогда Продолжить; КонецЕсли;
		//// получим массивы строк
		//МассивСХар   = ТаблДок.НайтиСтроки(Новый Структура("Номенклатура,ХарактеристикаНоменклатуры",стрДвижений.Номенклатура,стрДвижений.ХарактеристикаНоменклатуры));
		//МассивБезХар = ТаблДок.НайтиСтроки(Новый Структура("Номенклатура",стрДвижений.Номенклатура));
		//
		//Если МассивСХар.Количество() > 0 Тогда
		//	ТекСтрока = МассивСХар[0];
		//ИначеЕсли МассивБезХар.Количество() > 0 Тогда
		//	ТекСтрока = МассивБезХар[0];
		//Иначе
		//	ТекСтрока = Неопределено;
		//КонецЕсли;
		//
		//НоваяЗапись             = Движения.РеализованныеТовары.Добавить();
		//НоваяЗапись.Регистратор = Ссылка;
		//НоваяЗапись.Период      = Дата;
		//
		//// измерения
		//НоваяЗапись.Контрагент = стрДвижений.Партия.Контрагент;
		//НоваяЗапись.ДоговорВзаиморасчетов = стрДвижений.Партия.ДоговорВзаиморасчетов;
		//НоваяЗапись.Номенклатура = стрДвижений.Номенклатура;
		//НоваяЗапись.ХарактеристикаНоменклатуры = стрДвижений.ХарактеристикаНоменклатуры;
		//НоваяЗапись.ДокументПередачи = стрДвижений.Партия;
		//
		//// ресурсы
		//
		//НоваяЗапись.Количество = стрДвижений.Количество;
		//НоваяЗапись.СуммаУпр   = стрДвижений.СуммаУпр;
		//
		//Если ТекСтрока <> Неопределено Тогда
		//	Если стрДвижений.Количество = ТекСтрока.Количество Тогда
		//		СуммаПродажи = ТекСтрока.СуммаВсего;
		//	Иначе
		//		СуммаПродажи = ?(ТекСтрока.Количество = 0,0, ТекСтрока.СуммаВсего/ТекСтрока.Количество*стрДвижений.Количество);
		//	КонецЕсли;
		//	
		//	ВалютаУпр = Константы.ВалютаУправленческогоУчетаКомпании.Получить();
		//	Если ВалютаУпр = ВалютаДокумента Тогда
		//		НоваяЗапись.СуммаПродажи = СуммаПродажи;
		//	Иначе
		//		НоваяЗапись.СуммаПродажи = обПересчет(СуммаПродажи,ВалютаДокумента,КурсДокумента,ВалютаУпр,КурсВалютыУпр);
		//	КонецЕсли;
		//Иначе
		//	#Если Клиент Тогда
		//		Сообщить("Не удалось получить сумму продажи товара <"+стрДвижений.Номенклатура+">.",СтатусСообщения.Информация);
		//	#КонецЕсли
		//КонецЕсли;
		//
		//// реквизиты
		//НоваяЗапись.ХозОперация = ХозОперация;
	КонецЦикла;
КонецФункции

// формирует движения документа по партионным регистрам
// Режим - режим проведения (оперативный/неоперативный)
// ДокументСсылка - ссылка на документ который надо допровести по партиям
// Возвращает Истина - все нормально, ложь - чего-то не так
Функция ПровестиПоПартиям(Режим,ДокументСсылка) Экспорт
	Отказ=Ложь;
	
	// Получим шапку документа
	ШапкаДокумента=ПолучитьШапкуДокумента(ДокументСсылка);
	
	ВедетсяБалансПоПодразделению=(Константы.СпособВеденияБаланса.Получить()=Перечисления.СпособВеденияБаланса.ПоПодразделению);
	
	// Проверим, если подразделение проводиться по партиям "отложенно", то дальше не идем
	НаборЗаписейДопроведениеПоПартиям=Движения.ДопроведениеПоПартиям;
	НаборЗаписейДопроведениеПоПартиям.ДокументОбъект=ЭтотОбъект;
	НаборЗаписейДопроведениеПоПартиям.ШапкаДокумента=ШапкаДокумента;
	Отказ=НЕ НаборЗаписейДопроведениеПоПартиям.Зафиксировать() ИЛИ Отказ;
	Если НаборЗаписейДопроведениеПоПартиям.НеПроводитьПартии Тогда
		НаборЗаписейДоходыИРасходы=Движения.ДоходыИРасходы;
		НаборЗаписейДоходыИРасходы.ДокументОбъект=ЭтотОбъект;
		Если ВедетсяБалансПоПодразделению Тогда
			НаборЗаписейДоходыИРасходы.Подразделение=ДоговорВзаиморасчетов.Подразделение;
		КонецЕсли;
		НаборЗаписейДоходыИРасходы.ШапкаДокумента=ШапкаДокумента;
		НаборЗаписейДоходыИРасходы.СтатьяДоходовИРасходов = Справочники.СтатьиДоходовИРасходов.СебестоимостьНеоприходованныхПартий;
		НаборЗаписейДоходыИРасходы.ВУпрВалюте = Ложь;
		НаборЗаписейДоходыИРасходы.Доход = СуммаРазногласий;
		НаборЗаписейДоходыИРасходы.Приход();
		Возврат НЕ Отказ;
	КонецЕсли;
	

	ПодразделениеСклад = обПолучитьБалансовоеПодразделение(ШапкаДокумента.СкладКомпании.Подразделение);
	ПодразделениеДоговорВзаиморасчетов = обПолучитьБалансовоеПодразделение(ШапкаДокумента.ДоговорВзаиморасчетов.Подразделение);
	БалансовыеПодразделенияНеРавны = (ПодразделениеДоговорВзаиморасчетов<>ПодразделениеСклад);
	
	// Проведем партии товаров проданные 
	НаборЗаписейПартии=Движения.ПартииТоваровКомпании;
	НаборЗаписейПартии.ДокументОбъект=ЭтотОбъект;
	НаборЗаписейПартии.СкладКомпании=ШапкаДокумента.СкладКомпании;
	НаборЗаписейПартии.ИмяРеквизитаДокумент="";
	НаборЗаписейПартии.ПоБазовомуКоличеству=Ложь;
	// Если и передаем товар на комиссию, то только собственный
	Если ШапкаДокумента.Сделка.ХозОперация=Справочники.ХозОперации.РеализацияТоваровКомиссия Тогда
		НаборЗаписейПартии.СтатусПартии=Перечисления.СтатусыПартий.ТоварКупленный;
	КонецЕсли;
	НаборЗаписейПартии.ШапкаДокумента=ШапкаДокумента;
	Отказ=НЕ НаборЗаписейПартии.Расход() ИЛИ Отказ;
	
	// вернем партии товаров компании
	ПровестиВозвратТоваров(Отказ,ШапкаДокумента,Режим);
     
	// добавим новые реализованные товары
	ПровестиПоРеализованнымТоварам();
	
	
	// Подготовим таблицу движений в разрезе подразделений только собственных списанных партий
	ТаблицаСписанийПартий = Движения.ПартииТоваровКомпании.Выгрузить();
	ТаблицаСписанийПартий.Свернуть("СкладКомпании,СтатусПартии","СуммаУпр");
	СтруктураОтбора=Новый Структура("СтатусПартии",Перечисления.СтатусыПартий.ТоварПринятыйКомиссия);
	МассивНайденныхСтрок=ТаблицаСписанийПартий.НайтиСтроки(СтруктураОтбора);
	Для Сч=0 По МассивНайденныхСтрок.ВГраница() Цикл
		ТаблицаСписанийПартий.Удалить(МассивНайденныхСтрок[Сч]);
	КонецЦикла;
	
	СебестоимостьУпр = ТаблицаСписанийПартий.Итог("СуммаУпр");
	
	НаборЗаписейДоходыИРасходы=Движения.ДоходыИРасходы;
	НаборЗаписейДоходыИРасходы.ДокументОбъект=ЭтотОбъект;
	// В случае если ведется баланс по подразделению передадим подразделение соответствующее корреспонденции
	Если ВедетсяБалансПоПодразделению Тогда
		НаборЗаписейДоходыИРасходы.Подразделение=ШапкаДокумента.СкладКомпании.Подразделение;
	КонецЕсли;
	НаборЗаписейДоходыИРасходы.СтатьяДоходовИРасходов=Справочники.СтатьиДоходовИРасходов.Себестоимость;
	НаборЗаписейДоходыИРасходы.ВУпрВалюте=Истина;
	НаборЗаписейДоходыИРасходы.Расход=СебестоимостьУпр;	
	НаборЗаписейДоходыИРасходы.ШапкаДокумента=ШапкаДокумента;
	Отказ=НЕ НаборЗаписейДоходыИРасходы.Приход() ИЛИ Отказ;
	
	// Подготовим таблицу движений в разрезе подразделений комиссионных товаров
	ТаблицаСписанийПартийРеализованных = Движения.РеализованныеТовары.Выгрузить();
	ТаблицаСписанийПартийРеализованных.Свернуть("ДоговорВзаиморасчетов","СуммаУпр");
	
	ОписаниеТипов=Новый ОписаниеТипов;
	ОписаниеТипов.Типы().Добавить(Тип("СправочникСсылка.ПодразделенияКомпании"));
	ТаблицаСписанийПартийРеализованных.Колонки.Добавить("Подразделение",ОписаниеТипов);
	Для Каждого СтрокаСписания Из ТаблицаСписанийПартийРеализованных Цикл
		СтрокаСписания.Подразделение = СтрокаСписания.ДоговорВзаиморасчетов.Подразделение;
	КонецЦикла;	
	ТаблицаСписанийПартийРеализованных.Свернуть("Подразделение","СуммаУпр");
	
	// В случае если ведется баланс по подразделению передадим подразделение соответствующее корреспонденции
	Если ВедетсяБалансПоПодразделению Тогда
		Для Каждого СтрокаСписания Из ТаблицаСписанийПартийРеализованных Цикл
			НаборЗаписейДоходыИРасходы=Движения.ДоходыИРасходы;
			НаборЗаписейДоходыИРасходы.ДокументОбъект=ЭтотОбъект;
			НаборЗаписейДоходыИРасходы.Подразделение=СтрокаСписания.Подразделение;
			НаборЗаписейДоходыИРасходы.СтатьяДоходовИРасходов=Справочники.СтатьиДоходовИРасходов.Себестоимость;
			НаборЗаписейДоходыИРасходы.ВУпрВалюте=Истина;
			НаборЗаписейДоходыИРасходы.Расход=СтрокаСписания.СуммаУпр;	
			НаборЗаписейДоходыИРасходы.ШапкаДокумента=ШапкаДокумента;
			Отказ=НЕ НаборЗаписейДоходыИРасходы.Приход() ИЛИ Отказ;
		КонецЦикла;
	Иначе
		НаборЗаписейДоходыИРасходы=Движения.ДоходыИРасходы;
		НаборЗаписейДоходыИРасходы.ДокументОбъект=ЭтотОбъект;
		НаборЗаписейДоходыИРасходы.СтатьяДоходовИРасходов=Справочники.СтатьиДоходовИРасходов.Себестоимость;
		НаборЗаписейДоходыИРасходы.ВУпрВалюте=Истина;
		НаборЗаписейДоходыИРасходы.Расход=ТаблицаСписанийПартийРеализованных.Итог("СуммаУпр");	
		НаборЗаписейДоходыИРасходы.ШапкаДокумента=ШапкаДокумента;
		Отказ=НЕ НаборЗаписейДоходыИРасходы.Приход() ИЛИ Отказ;
	КонецЕсли;
	
	//Доход от начисления дебиторской задолженности по отгруженному товару и оказанным услугам
	Запрос=Новый Запрос();
	ТекстЗапроса="
	|ВЫБРАТЬ
	|	ЕСТЬNULL(СУММА(КорректировкаРеализацииТовары.СуммаВсегоРазница),0) КАК СуммаТоваров,
	|	ЕСТЬNULL(СУММА(0),0) КАК СуммаУслуг
	|ИЗ
	|	Документ.КорректировкаРеализации.Товары КАК КорректировкаРеализацииТовары
	|ГДЕ
	|	КорректировкаРеализацииТовары.Ссылка = &ТекДок
	|	И КорректировкаРеализацииТовары.Номенклатура.ВидНоменклатуры <> ЗНАЧЕНИЕ(Перечисление.ВидыНоменклатуры.Услуга)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЕСТЬNULL(СУММА(0),0),
	|	ЕСТЬNULL(СУММА(КорректировкаРеализацииТовары.СуммаВсегоРазница),0)
	|ИЗ
	|	Документ.КорректировкаРеализации.Товары КАК КорректировкаРеализацииТовары
	|ГДЕ
	|	КорректировкаРеализацииТовары.Ссылка = &ТекДок
	|	И КорректировкаРеализацииТовары.Номенклатура.ВидНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ВидыНоменклатуры.Услуга)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЕСТЬNULL(СУММА(0),0),
	|	ЕСТЬNULL(СУММА(КорректировкаРеализацииРаботы.СуммаВсегоРазница),0)
	|ИЗ
	|	Документ.КорректировкаРеализации.Работы КАК КорректировкаРеализацииРаботы
	|ГДЕ
	|	КорректировкаРеализацииРаботы.Ссылка = &ТекДок";
	Запрос.Текст=ТекстЗапроса;
	Запрос.УстановитьПараметр("ТекДок",ШапкаДокумента.Ссылка);
	Выборка=Запрос.Выполнить().Выбрать();
	СуммаТоваров=0; СуммаУслуг=0;
	Пока Выборка.Следующий() Цикл
		СуммаТоваров=СуммаТоваров+Выборка.СуммаТоваров;
		СуммаУслуг=СуммаУслуг+Выборка.СуммаУслуг;
	КонецЦикла;
	
	ВУпрВалюте=(ВалютаДокумента=Константы.ВалютаУправленческогоУчетаКомпании.Получить());
	НаборЗаписейДоходыИРасходы=Движения.ДоходыИРасходы;
	НаборЗаписейДоходыИРасходы.ДокументОбъект=ЭтотОбъект;
	// В случае если ведется баланс по подразделению передадим подразделение соответствующее корреспонденции
	Если ВедетсяБалансПоПодразделению Тогда
		НаборЗаписейДоходыИРасходы.Подразделение=ШапкаДокумента.ДоговорВзаиморасчетов.Подразделение;
	КонецЕсли;
	НаборЗаписейДоходыИРасходы.ВУпрВалюте=ВУпрВалюте;
	НаборЗаписейДоходыИРасходы.СтатьяДоходовИРасходов=Справочники.СтатьиДоходовИРасходов.НачислениеДебиторскойЗадолженностиПоТовару;
	НаборЗаписейДоходыИРасходы.Доход=СуммаТоваров;
	НаборЗаписейДоходыИРасходы.ШапкаДокумента=ШапкаДокумента;
	Отказ=НЕ НаборЗаписейДоходыИРасходы.Приход() ИЛИ Отказ;
	
	НаборЗаписейДоходыИРасходы=Движения.ДоходыИРасходы;
	НаборЗаписейДоходыИРасходы.ДокументОбъект=ЭтотОбъект;
	// В случае если ведется баланс по подразделению передадим подразделение соответствующее корреспонденции
	Если ВедетсяБалансПоПодразделению Тогда
		НаборЗаписейДоходыИРасходы.Подразделение=ШапкаДокумента.ДоговорВзаиморасчетов.Подразделение;
	КонецЕсли;
	НаборЗаписейДоходыИРасходы.ВУпрВалюте=ВУпрВалюте;
	НаборЗаписейДоходыИРасходы.СтатьяДоходовИРасходов=Справочники.СтатьиДоходовИРасходов.НачислениеДебиторскойЗадолженностиПоУслугам;
	НаборЗаписейДоходыИРасходы.Доход=СуммаУслуг;
	НаборЗаписейДоходыИРасходы.ШапкаДокумента=ШапкаДокумента;
	Отказ=НЕ НаборЗаписейДоходыИРасходы.Приход() ИЛИ Отказ;
	
	// двигаем границу последовательности партий
	Если Режим<>РежимПроведенияДокумента.Оперативный ИЛИ ЗначениеЗаполнено(ДополнительныеСвойства.СкладКомпанииБыл) Тогда
		// если идет допроведение, то надо получить те значения которые были раньше
		Если Ссылка<>ДокументСсылка Тогда
			Запрос = Новый Запрос("ВЫБРАТЬ РАЗЛИЧНЫЕ СкладКомпании ИЗ РегистрНакопления.ПартииТоваровКомпании ГДЕ Регистратор=&Ссылка");
			Запрос.УстановитьПараметр("Ссылка",ДокументСсылка);
			Результат = Запрос.Выполнить(); СкладКомпанииБыл=Неопределено;
			Если НЕ Результат.Пустой() Тогда
				СкладКомпанииБыл = Результат.Выгрузить().ВыгрузитьКолонку("СкладКомпании");
			КонецЕсли;
			ДополнительныеСвойства.Вставить("СкладКомпанииБыл",СкладКомпанииБыл);
			ДополнительныеСвойства.МоментВремениБыл = ДокументСсылка.МоментВремени();
		КонецЕсли;
		НаборЗаписейГраницыПартий = РегистрыСведений.ГраницыПартий.СоздатьНаборЗаписей();
		Если Режим<>РежимПроведенияДокумента.Оперативный Тогда
			НаборЗаписейГраницыПартий.СкладКомпании		= ШапкаДокумента.СкладКомпании;
			НаборЗаписейГраницыПартий.МоментВремени		= ШапкаДокумента.Дата;
			НаборЗаписейГраницыПартий.СкладКомпанииБыл	= ДополнительныеСвойства.СкладКомпанииБыл;
			НаборЗаписейГраницыПартий.МоментВремениБыл	= ДополнительныеСвойства.МоментВремениБыл;
		Иначе
			НаборЗаписейГраницыПартий.СкладКомпании		= ДополнительныеСвойства.СкладКомпанииБыл;
			НаборЗаписейГраницыПартий.МоментВремени		= ДополнительныеСвойства.МоментВремениБыл;
			НаборЗаписейГраницыПартий.СкладКомпанииБыл	= Неопределено;
			НаборЗаписейГраницыПартий.МоментВремениБыл	= Неопределено;
		КонецЕсли;
		НаборЗаписейГраницыПартий.ДокументСсылка	= ШапкаДокумента.Ссылка;
		НаборЗаписейГраницыПартий.ИзменитьГраницу();
	КонецЕсли;
	
	Возврат НЕ Отказ;
КонецФункции

// Обработка изменения реквизитов документа
// Параметры
//  Имя			– Строка			– Имя реквизита документа с полным путем (например Товары.Номенклатура).
//  ЭтаФорма	– Форма				– Ссылка на форму документа.
//	Если значение неопределено, производится программная обработка реквизитов.
//  ТекСтрока	– СтрокаТабличнойЧасти – Ссылка на строку табличной части документа, реквизит которой обрабатывается.
//										 Имеет смысл только для табличных частей документов.
//  ДопПараметры– Структура			– Структура, содержащая дополнительные параметры обработки реквизита.
// Возвращаемое значение:
//   Булево   – Результат выполнения обработки.
Функция ОбработкаРеквизита(Имя,ТекСтрока=Неопределено,ЭтаФорма=Неопределено,ДопПараметры=Неопределено) Экспорт
	Если ДопПараметры=Неопределено Тогда
		ДопПараметры=Новый Структура;
	КонецЕсли;
	Если ТипЗнч(ДопПараметры)=Тип("Структура") Тогда
		ДопПараметры.Вставить("НеРассчитыватьСкидки",Истина);
	КонецЕсли; 
	
	// ОБРАБОТКА РЕКВИЗИТОВ ДОКУМЕНТА
	Если Имя="ВалютаДокумента" Тогда
		Попытка
			ТребуетсяПересчет=ДопПараметры.ТребуетсяПересчет;
		Исключение
			ТребуетсяПересчет=Ложь;
		КонецПопытки; 
		Рез=Истина;
		Если ТребуетсяПересчет И (НЕ обЗначениеНеЗаполнено(ТекущаяВалютаДокумента)) Тогда
			Для каждого СтрокаРабот Из Работы Цикл
				НоваяЦена=обПересчет(СтрокаРабот.Цена,ТекущаяВалютаДокумента,ТекущийКурсДокумента,ВалютаДокумента,КурсДокумента);
				Если НоваяЦена<>СтрокаРабот.Цена Тогда
					СтрокаРабот.Цена=НоваяЦена;
					Рез=ОбработкаРеквизита("Работы.Цена",СтрокаРабот,ЭтаФорма,ДопПараметры) И Рез;
				КонецЕсли;
			КонецЦикла; 
		КонецЕсли; 
		ТекущаяВалютаДокумента=ВалютаДокумента;
		ТекущийКурсДокумента=КурсДокумента;
		Возврат Рез;
		
	ИначеЕсли Имя="Организация" Тогда
		Рез=дкОбработкаРеквизита(ЭтотОбъект,Имя,ТекСтрока,ЭтаФорма,ДопПараметры);
		// Организация может является плательщиком НДС, а может и нет.. надо обработать таблицу работ
		ТаблицаРабот=ЭтотОбъект.Работы;
		ОсвобожденОтНДС=ЭтотОбъект.ПодразделениеКомпании.ОсвобожденОтНДС ИЛИ ЭтотОбъект.Организация.ОсвобожденОтНДС;
		Для Каждого СтрокаРабот Из ТаблицаРабот Цикл
			Если ОсвобожденОтНДС Тогда
				СтрокаРабот.СтавкаНДС=Справочники.СтавкиНДС.БезНДС;
			Иначе
				СтрокаРабот.СтавкаНДС=СтрокаРабот.Работа.Номенклатура.СтавкаНДС;
			КонецЕсли; 
			Рез=ЭтотОбъект.ОбработкаРеквизита("Работы.СтавкаНДС",СтрокаРабот,ЭтаФорма,ДопПараметры) И Рез;
		КонецЦикла;
		Возврат Рез;
		
	ИначеЕсли Имя="ПодразделениеКомпании" Тогда
		Рез=дкОбработкаРеквизита(ЭтотОбъект,Имя,ТекСтрока,ЭтаФорма,ДопПараметры);
		// Подразделение может является плательщиком НДС, а может и нет.. надо обработать таблицу работ
		ТаблицаРабот=ЭтотОбъект.Работы;
		ОсвобожденОтНДС=ЭтотОбъект.ПодразделениеКомпании.ОсвобожденОтНДС ИЛИ ЭтотОбъект.Организация.ОсвобожденОтНДС;
		Для Каждого СтрокаРабот Из ТаблицаРабот Цикл
			Если ОсвобожденОтНДС Тогда
				СтрокаРабот.СтавкаНДС=Справочники.СтавкиНДС.БезНДС;
			Иначе
				СтрокаРабот.СтавкаНДС=СтрокаРабот.Работа.Номенклатура.СтавкаНДС;
			КонецЕсли; 
			Рез=ЭтотОбъект.ОбработкаРеквизита("Работы.СтавкаНДС",СтрокаРабот,ЭтаФорма,ДопПараметры) И Рез;
		КонецЦикла;
		Возврат Рез;
		
	ИначеЕсли Имя="ДокументОснование" Тогда
		Если НЕ обЗначениеНеЗаполнено(ДокументОснование) Тогда
			Если ДокументОснование = Ссылка Тогда
				ДокументОснование = Неопределено;
				ОбработкаРеквизита("ДокументОснование");
				Сообщить("Ввод корректировки реализации на основании самой себя запрещен.",СтатусСообщения.Внимание);
				Возврат Истина;
			КонецЕсли;
			
			Если КорректировкаНеДоступна(ДокументОснование) Тогда
				Сообщить("На основании " + ДокументОснование + " введен возврат товаров. Ввод корректировки реализации невозможен.",СтатусСообщения.Внимание);
				ДокументОснование=Неопределено;
				ОбработкаРеквизита("ДокументОснование");
				Возврат Истина;
			КонецЕсли;
			
			Если ТипЗнч(ДокументОснование)=Тип("ДокументСсылка.ЗаказНаряд") И (ДокументОснование.ВидРемонта.ТипРемонта = Перечисления.ТипыРемонта.Бесплатный) Тогда
				Сообщить("В заказ-наряде выбран бесплатный ремонт. Нельзя заполнить корректировку реализации!",СтатусСообщения.Важное);
				ДокументОснование=Неопределено;
				ОбработкаРеквизита("ДокументОснование");
				Возврат Истина;
			КонецЕсли;
			
			Если ТипЗнч(ДокументОснование)=Тип("ДокументСсылка.ЗаказНаряд") И (ДокументОснование.Состояние <> Справочники.ВидыСостоянийЗаказНарядов.Закрыт) Тогда
				Сообщить("Заказ наряд не находится в состоянии ""Закрыт"". Нельзя заполнить корректировку реализации!",СтатусСообщения.Важное);
				ДокументОснование=Неопределено;
				ОбработкаРеквизита("ДокументОснование");
				Возврат Истина;
			КонецЕсли;
			
			Если НЕ ДокументОснование.Проведен Тогда
				Сообщить("Ввод корректировки реализации возможен только на основании проведенного документа.",СтатусСообщения.Внимание);
				ДокументОснование=Неопределено;
				ОбработкаРеквизита("ДокументОснование");
				Возврат Истина;
			КонецЕсли;
			
			Если ДокументОснование.ХозОперация = Справочники.ХозОперации.РеализацияТоваровКомиссия Тогда
				Сообщить("Ввод корректировки реализации невозможен на основании реализации товаров комиссия.",СтатусСообщения.Внимание);
				ДокументОснование=Неопределено;
				ОбработкаРеквизита("ДокументОснование");
				Возврат Истина;
			КонецЕсли;
		КонецЕсли;
		Рез=дкОбработкаРеквизита(ЭтотОбъект,Имя,ТекСтрока,ЭтаФорма,ДопПараметры);
		#Если Клиент Тогда
		Если ЭтаФорма<>Неопределено Тогда 
			Если Вопрос("Заполнить по документу-основания?",РежимДиалогаВопрос.ДаНет)=КодВозвратаДиалога.Да Тогда
				ЭтотОбъект.Заполнить(ДокументОснование);
				ЭтаФорма.УправлениеДиалогом();
				дкВывестиЗаголовокСуммаДокумента(ЭтаФорма);
			КонецЕсли;
		КонецЕсли; 
		#КонецЕсли
		Сделка=ПолучитьСделку(ДокументОснование);
		Возврат Рез;
		
	// ОБРАБОТКА РЕКВИЗИТОВ ТАБЛИЧНОЙ ЧАСТИ "ТОВАРЫ"
	
	ИначеЕсли Имя="Товары.Подтверждение" Тогда
		Если ТекСтрока.Подтверждение Тогда
			ТекСтрока.Количество=(ТекСтрока.КоличествоПоДокументуРеализации*ТекСтрока.КоэффициентПоДокументуРеализации)/ТекСтрока.Коэффициент;
			Рез=ОбработкаРеквизита("Товары.Количество",ТекСтрока,ЭтаФорма,ДопПараметры);
			ТекСтрока.СуммаВсего=ТекСтрока.СуммаВсегоПоДокументуРеализации;
			Рез=ОбработкаРеквизита("Товары.СуммаВсего",ТекСтрока,ЭтаФорма,ДопПараметры);
		Иначе
			ТекСтрока.Количество=0;
			Рез=ОбработкаРеквизита("Товары.Количество",ТекСтрока,ЭтаФорма,ДопПараметры);
		КонецЕсли; 
		Рез=ОбработкаРеквизита("Товары.РасчетРазницы",ТекСтрока,ЭтаФорма,ДопПараметры) И Рез;
		Возврат Рез;
		
	ИначеЕсли Имя = "Товары.Номенклатура" Тогда
		Рез = дкОбработкаРеквизита(ЭтотОбъект,Имя,ТекСтрока,ЭтаФорма,ДопПараметры);
		Если НЕ обДопустимаяСтрока(ТекСтрока) Тогда
			Возврат Рез;
		Иначе
			ТекСтрока.Подтверждение = Истина;
		КонецЕсли;
		Если ПустаяСтрока(ТекСтрока.ИдентификаторТовара) Тогда
			ТекСтрока.ИдентификаторТовара = Новый УникальныйИдентификатор;
		КонецЕсли;
	ИначеЕсли Имя="Товары.РасчетРазницы" Тогда
		Рез=Истина;
		Если обЗначениеНеЗаполнено(ТекСтрока) Тогда
			Возврат Рез;
		КонецЕсли;
		Если ТекСтрока.Коэффициент = 0 Тогда
			ТекСтрока.КоличествоРазница=0;
		Иначе
			ТекСтрока.КоличествоРазница=(ТекСтрока.Количество)-((ТекСтрока.КоличествоПоДокументуРеализации*ТекСтрока.КоэффициентПоДокументуРеализации)/ТекСтрока.Коэффициент);
		КонецЕсли;
		ТекСтрока.СуммаНДСРазница=ТекСтрока.СуммаНДС-ТекСтрока.СуммаНДСПоДокументуРеализации;
		ТекСтрока.СуммаВсегоРазница=ТекСтрока.СуммаВсего-ТекСтрока.СуммаВсегоПоДокументуРеализации;
		Возврат Рез;
		
	// ОБРАБОТКА РЕКВИЗИТОВ ТАБЛИЧНОЙ ЧАСТИ "РАБОТЫ"
	
	ИначеЕсли Имя="Работы.Подтверждение" Тогда
		Если ТекСтрока.Подтверждение Тогда
			ТекСтрока.Количество=ТекСтрока.КоличествоПоДокументуРеализации;
			ТекСтрока.Коэффициент=ТекСтрока.КоэффициентПоДокументуРеализации;
			Рез=ОбработкаРеквизита("Работы.Количество",ТекСтрока,ЭтаФорма,ДопПараметры);
			ТекСтрока.СуммаВсего=ТекСтрока.СуммаВсегоПоДокументуРеализации;
			Рез=ОбработкаРеквизита("Работы.СуммаВсего",ТекСтрока,ЭтаФорма,ДопПараметры);
		Иначе
			ТекСтрока.Количество=0;
			ТекСтрока.Коэффициент=0;
			Рез=ОбработкаРеквизита("Работы.Количество",ТекСтрока,ЭтаФорма,ДопПараметры);
		КонецЕсли; 
		Рез=ОбработкаРеквизита("Работы.РасчетРазницы",ТекСтрока,ЭтаФорма,ДопПараметры) И Рез;
		Возврат Рез;
	
	ИначеЕсли Имя="Работы.РасчетРазницы" Тогда
		Если обЗначениеНеЗаполнено(ТекСтрока) Тогда
			Возврат Истина;
		КонецЕсли;
		
		ТекСтрока.КоличествоРазница=ТекСтрока.Количество-ТекСтрока.КоличествоПоДокументуРеализации;
		ТекСтрока.КоэффициентРазница=ТекСтрока.Коэффициент-ТекСтрока.КоэффициентПоДокументуРеализации;
		ТекСтрока.СуммаНДСРазница=ТекСтрока.СуммаНДС-ТекСтрока.СуммаНДСПоДокументуРеализации;
		ТекСтрока.СуммаВсегоРазница=ТекСтрока.СуммаВсего-ТекСтрока.СуммаВсегоПоДокументуРеализации;
		Возврат Истина;
	
	ИначеЕсли Имя="Работы.Работа" Тогда
		//Проверим на повторение строки в таблице
		//Получим из формы последнюю текущую работу
		Если ТекСтрока.Количество=0 Тогда ТекСтрока.Количество=1; КонецЕсли;
		
		//Рассчитаем цену текущей работы
		ОбработкаРеквизита("РасчетЦеныРаботы",ТекСтрока,ЭтаФорма,ДопПараметры);
		//Заполнение ставок налогов
		Если ЭтотОбъект.ПодразделениеКомпании.ОсвобожденОтНДС ИЛИ ЭтотОбъект.Организация.ОсвобожденОтНДС Тогда
			ТекСтрока.СтавкаНДС=Справочники.СтавкиНДС.БезНДС;
		Иначе
			ТекСтрока.СтавкаНДС=ТекСтрока.Работа.Номенклатура.СтавкаНДС;
		КонецЕсли; 
		//Расчет сумм по строке
		Возврат ОбработкаРеквизита("Работы.Цена",ТекСтрока,ЭтаФорма,ДопПараметры);
		
	ИначеЕсли Имя="Работы.Количество" Тогда
		Возврат ОбработкаРеквизита("Работы.Коэффициент",ТекСтрока,ЭтаФорма,ДопПараметры);
		
	ИначеЕсли Имя="Работы.Нормочас" Тогда
		ТекСтрока.Цена=обПересчет(ТекСтрока.Нормочас.Цена,ТекСтрока.Нормочас.Валюта,Дата,ВалютаДокумента,КурсДокумента);
		Возврат ОбработкаРеквизита("Работы.Цена",ТекСтрока,ЭтаФорма,ДопПараметры);
		
	ИначеЕсли Имя="Работы.Коэффициент" Тогда
		Возврат ОбработкаРеквизита("Работы.Цена",ТекСтрока,ЭтаФорма,ДопПараметры);
		
	ИначеЕсли Имя="Работы.Цена" Тогда
		ТекСтрока.Сумма=ТекСтрока.Цена*ТекСтрока.Количество*ТекСтрока.Коэффициент;
		Возврат ОбработкаРеквизита("Работы.Сумма",ТекСтрока,ЭтаФорма,ДопПараметры);
	ИначеЕсли Имя="Работы.Сумма" Тогда
		Если ТекСтрока.Количество*ТекСтрока.Коэффициент <> 0 Тогда
			ТекСтрока.Цена=ТекСтрока.Сумма/(ТекСтрока.Количество*ТекСтрока.Коэффициент);
		КонецЕсли;
		
		// расчет суммы всего и суммы ндс
		ЦенаВключаетНДС = ТипЦен.ЦенаВключаетНДС;
		ТекСтрока.СуммаНДС   = ТекСтрока.Сумма/(100+?(ЦенаВключаетНДС,ТекСтрока.СтавкаНДС.Ставка,0))*ТекСтрока.СтавкаНДС.Ставка;
		Если ЦенаВключаетНДС Тогда
			ТекСтрока.СуммаВсего = ТекСтрока.Сумма;
		Иначе
			ТекСтрока.СуммаВсего = ТекСтрока.Сумма + ТекСтрока.СуммаНДС;
		КонецЕсли;
		Возврат Истина;
	ИначеЕсли Имя="Работы.ПроцентСкидки" Тогда
		Рез=Истина;
		Возврат Рез;
		
	ИначеЕсли Имя="Работы.СуммаСкидки" Тогда
		Попытка	// Определим необходимость обратного расчета процента скидки.
			ПересчитыватьПроцентСкидки=ДопПараметры.ПересчитыватьПроцентСкидки;
		Исключение 
			ПересчитыватьПроцентСкидки=Истина;	
		КонецПопытки;
		Если ПересчитыватьПроцентСкидки Тогда
			ТекСтрока_СуммаБезСкидки=дкПолучитьСуммуСтрокиБезСкидки(ЭтотОбъект,ТекСтрока);
			ТекСтрока.ПроцентСкидки=?(ТекСтрока_СуммаБезСкидки=0,0,Окр(ТекСтрока.СуммаСкидки*100/ТекСтрока_СуммаБезСкидки,2));
		КонецЕсли;
		// Выполним расчет итоговой суммы скидки на документ.
		СуммаСкидкиНаценкиРабот=Работы.Итог("СуммаСкидки");
		СуммаСкидкиНаценкиРабот=СуммаСкидкиНаценкиРабот+Работы.Итог("СуммаСкидкиСтроки");
		// Ничего делать не будем - весь расчет от НДС зависит (включено или нет)
		Возврат ОбработкаРеквизита("Работы.СтавкаНДС",ТекСтрока,ЭтаФорма,ДопПараметры);
		
	ИначеЕсли Имя="Работы.СуммаВсего" Тогда
		//Получим новую сумму скидки как процент от суммы всего (уже со скидкой)
		СуммаБезСкидки = ТекСтрока.СуммаВсего;
		//Получим новую сумму НДС как процент от суммы всего
		СуммаБезСкидкиБезНДС=Окр((100*СуммаБезСкидки)/(100+ТекСтрока.СтавкаНДС.Ставка),2);
		СуммаБезНДС=Окр((100*ТекСтрока.СуммаВсего)/(100+ТекСтрока.СтавкаНДС.Ставка),2);
		СуммаНДСБезСкидки=СуммаБезСкидки-СуммаБезСкидкиБезНДС;
		ТекСтрока.СуммаНДС=ТекСтрока.СуммаВсего-СуммаБезНДС;
		Если ЭтотОбъект.ТипЦен.ЦенаВключаетНДС Тогда
			//Цена уже содержит НДС
			//Получим сумму как разницу суммы всего и суммы скидки
			ТекСтрока.Сумма=СуммаБезСкидки;
		Иначе
			//НДС в цену не включен
			//Получим сумму как разницу суммы всего и суммы скидки и суммы НДС
			ТекСтрока.Сумма=СуммаБезСкидки-СуммаНДСБезСкидки;
		КонецЕсли;
		ТекСтрока.Цена=?(ТекСтрока.Количество*ТекСтрока.Коэффициент=0,0,ТекСтрока.Сумма/(ТекСтрока.Количество*ТекСтрока.Коэффициент));
		Возврат Истина;
		
	ИначеЕсли Имя="Работы.СтавкаНДС" Тогда
		СуммаСоСкидкой=дкПолучитьСуммуСтрокиСоСкидкой(ЭтотОбъект,ТекСтрока);
		СтавкаНДС=ТекСтрока.СтавкаНДС.Ставка;
		ТекСтрока.СуммаНДС=Окр((СуммаСоСкидкой*СтавкаНДС)/(100+СтавкаНДС),2);
		ТекСтрока.СуммаВсего=СуммаСоСкидкой;
		Возврат Истина;
		
	ИначеЕсли Имя="Работы.СуммаНДС" Тогда
		Возврат Истина;
		
	ИначеЕсли Имя="РасчетЦеныРаботы" Тогда
		//Расчет цены работы
		Если обЗначениеНеЗаполнено(ТекСтрока.Работа) Тогда Возврат Ложь; КонецЕсли;
		//Если работа задана - получим ее цену согласно класса автомобиля (если автомобиль выбран)
		Если обЗначениеНеЗаполнено(Автомобиль) Тогда
			ВариантКомплектации = Справочники.Модели.ПустаяСсылка();
		Иначе
			Если ЗначениеЗаполнено(Автомобиль.ВариантКомплектации) Тогда
				ВариантКомплектации = Автомобиль.ВариантКомплектации;
			Иначе
				ВариантКомплектации = Автомобиль.Модель;
			КонецЕсли;
		КонецЕсли;
		ЦенаРаботы = орПолучитьЦенуАвтоработы(ТипЦенРабот, ТекСтрока.Работа, ВариантКомплектации, ДоговорВзаиморасчетов, Справочники.Цеха.ПустаяСсылка(), Справочники.ВидыРемонта.ПустаяСсылка(),, ВалютаДокумента, КурсДокумента);
		ТекСтрока.Нормочас=ЦенаРаботы.Нормочас;
		ТекСтрока.Коэффициент=?(обЗначениеНеЗаполнено(ЦенаРаботы.НормаВремени),ТекСтрока.Коэффициент,ЦенаРаботы.НормаВремени);
		ТекСтрока.Цена=ЦенаРаботы.Цена;
		Возврат Истина;
		
	Иначе Возврат дкОбработкаРеквизита(ЭтотОбъект,Имя,ТекСтрока,ЭтаФорма,ДопПараметры);
	КонецЕсли;
КонецФункции // ОбработкаРеквизита()

// Заполнение свойств из документа основания
Процедура ЗаполнитьСвойстваНаОсновании(Основание) Экспорт
	//Зарезервировано для описания заполнения свойств из свойств основания
КонецПроцедуры

Функция ТоварыДляУКД(Корректировка)
	
	Запрос = Новый Запрос(
		"ВЫБРАТЬ
		|	КорректировкаРеализацииТовары.Номенклатура КАК Номенклатура,
		|	КорректировкаРеализацииТовары.Количество КАК Количество,
		|	КорректировкаРеализацииТовары.КоличествоРазница КАК КоличествоРазница,
		|	КорректировкаРеализацииТовары.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
		|	КорректировкаРеализацииТовары.Коэффициент КАК Коэффициент,
		|	0 КАК КоэффициентРазница,
		|	КорректировкаРеализацииТовары.Цена КАК Цена,
		|	КорректировкаРеализацииТовары.Сумма КАК Сумма,
		|	КорректировкаРеализацииТовары.СтавкаНДС КАК СтавкаНДС,
		|	КорректировкаРеализацииТовары.СуммаНДС КАК СуммаНДС,
		|	КорректировкаРеализацииТовары.СуммаНДСРазница КАК СуммаНДСРазница,
		|	КорректировкаРеализацииТовары.СуммаВсего КАК СуммаВсего,
		|	КорректировкаРеализацииТовары.СуммаВсегоРазница КАК СуммаВсегоРазница,
		|	КорректировкаРеализацииТовары.Номенклатура.Артикул КАК ТоварКод,
		|	0 КАК НомерСтроки
		|ИЗ
		|	Документ.КорректировкаРеализации.Товары КАК КорректировкаРеализацииТовары
		|ГДЕ
		|	КорректировкаРеализацииТовары.Ссылка = &Корректировка
		|	И (КорректировкаРеализацииТовары.Количество <> КорректировкаРеализацииТовары.КоличествоПоДокументуРеализации
		|			ИЛИ КорректировкаРеализацииТовары.ЕдиницаИзмерения <> КорректировкаРеализацииТовары.ЕдиницаИзмеренияПоДокументуРеализации
		|			ИЛИ КорректировкаРеализацииТовары.Коэффициент <> КорректировкаРеализацииТовары.КоэффициентПоДокументуРеализации
		|			ИЛИ КорректировкаРеализацииТовары.СтавкаНДС <> КорректировкаРеализацииТовары.СтавкаНДСПоДокументуРеализации
		|			ИЛИ КорректировкаРеализацииТовары.СуммаНДС <> КорректировкаРеализацииТовары.СуммаНДСПоДокументуРеализации
		|			ИЛИ КорректировкаРеализацииТовары.СуммаВсего <> КорректировкаРеализацииТовары.СуммаВсегоПоДокументуРеализации)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	КорректировкаРеализацииРаботы.Работа,
		|	КорректировкаРеализацииРаботы.Количество,
		|	КорректировкаРеализацииРаботы.КоличествоРазница,
		|	ЗНАЧЕНИЕ(Справочник.ЕдиницыИзмерения.ПустаяСсылка),
		|	КорректировкаРеализацииРаботы.Коэффициент,
		|	КорректировкаРеализацииРаботы.КоэффициентРазница,
		|	КорректировкаРеализацииРаботы.Цена,
		|	КорректировкаРеализацииРаботы.Сумма,
		|	КорректировкаРеализацииРаботы.СтавкаНДС,
		|	КорректировкаРеализацииРаботы.СуммаНДС,
		|	КорректировкаРеализацииРаботы.СуммаНДСРазница,
		|	КорректировкаРеализацииРаботы.СуммаВсего,
		|	КорректировкаРеализацииРаботы.СуммаВсегоРазница,
		|	КорректировкаРеализацииРаботы.Работа.Артикул,
		|	0
		|ИЗ
		|	Документ.КорректировкаРеализации.Работы КАК КорректировкаРеализацииРаботы
		|ГДЕ
		|	КорректировкаРеализацииРаботы.Ссылка = &Корректировка
		|	И (КорректировкаРеализацииРаботы.Количество <> КорректировкаРеализацииРаботы.КоличествоПоДокументуРеализации
		|			ИЛИ КорректировкаРеализацииРаботы.Коэффициент <> КорректировкаРеализацииРаботы.КоэффициентПоДокументуРеализации
		|			ИЛИ КорректировкаРеализацииРаботы.СтавкаНДС <> КорректировкаРеализацииРаботы.СтавкаНДСПоДокументуРеализации
		|			ИЛИ КорректировкаРеализацииРаботы.СуммаНДС <> КорректировкаРеализацииРаботы.СуммаНДСПоДокументуРеализации
		|			ИЛИ КорректировкаРеализацииРаботы.СуммаВсего <> КорректировкаРеализацииРаботы.СуммаВсегоПоДокументуРеализации)"
	);
	Запрос.УстановитьПараметр("Корректировка", Корректировка);
	Возврат ЗаполнитьНомераСтрокВТаблице(Запрос.Выполнить().Выгрузить());
	
КонецФункции

Функция ЗаполнитьНомераСтрокВТаблице(Знач Таблица)
	
	НомераСтрок = Новый Массив();
	НомерСтроки = 1;
	
	Пока НомерСтроки <= Таблица.Количество() Цикл
		
		НомераСтрок.Добавить(НомерСтроки);
		НомерСтроки = НомерСтроки + 1;
		
	КонецЦикла;
	
	Таблица.ЗагрузитьКолонку(НомераСтрок, "НомерСтроки");
	
	Возврат Таблица;
	
КонецФункции

////////////////////////////////////////////////////////////////////////////////
// ЭКСПОРТНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ ДОПОЛНИТЕЛЬНЫХ МЕТОДОВ ОБЪЕКТА

// Возвращает соответствие в котором перечислены виды номенклатуры, которые нельзя вводить
// в таблицу товаров. Если таких нет, то возвращает неопределено
Функция ПолучитьСоответствиеЗапрещенныхВидовНоменклатуры() Экспорт
	Результат=Неопределено;
	Результат=Новый Соответствие();
	//Результат.Вставить(Перечисления.ВидыНоменклатуры.Услуга,0);
	Результат.Вставить(Перечисления.ВидыНоменклатуры.ПрочиеАктивы,0);
	Возврат Результат;
КонецФункции

// Возвращает структуру обязательных / уникальных реквизитов документа
// Возвращаемая структура содержит строковые идентификаторы реквизитов или вложенные структуры для табличных частей
// Для реквизита значение структуры содержит число 1-Обязательный, 2-Уникальный, 3-Уникальный и обязательный
Функция ПолучитьОбязательныеРеквизиты() Экспорт
	// Обязательные реквизиты документа
	ОбязательныеРеквизиты=Новый Структура();
	ОбязательныеРеквизиты.Вставить("Организация",1);
	ОбязательныеРеквизиты.Вставить("ПодразделениеКомпании",1);
	ОбязательныеРеквизиты.Вставить("Автор",1);
	ОбязательныеРеквизиты.Вставить("ДокументОснование",1);
	ОбязательныеРеквизиты.Вставить("Сделка",1);
	ОбязательныеРеквизиты.Вставить("ТипЦен",1);
	ОбязательныеРеквизиты.Вставить("ХозОперация",1);
	ОбязательныеРеквизиты.Вставить("ВалютаДокумента",1);
	ОбязательныеРеквизиты.Вставить("КурсДокумента",1);
	ОбязательныеРеквизиты.Вставить("Контрагент",1);
	ОбязательныеРеквизиты.Вставить("ДоговорВзаиморасчетов",1);
  	ОбязательныеРеквизиты.Вставить("СкладКомпании",1);
   	
	// Обязательные поля таблицы товаров
	ОбязательныеТовары=Новый Структура();
	ОбязательныеТовары.Вставить("Номенклатура",3);
	ОбязательныеТовары.Вставить("ЕдиницаИзмерения",3);
	ОбязательныеТовары.Вставить("Коэффициент",1);
	ОбязательныеТовары.Вставить("ХарактеристикаНоменклатуры",2);
	ОбязательныеРеквизиты.Вставить("Товары",ОбязательныеТовары);
	
	Если ТипЗнч(Сделка)=Тип("ДокументСсылка.ЗаказНаряд") Тогда
		ОбязательныеРаботы=Новый Структура();
		ОбязательныеРаботы.Вставить("Работа",3);
		ОбязательныеРаботы.Вставить("Нормочас",1);
		ОбязательныеРеквизиты.Вставить("Работы",ОбязательныеРаботы);
	КонецЕсли;
	
	// Обязательные поля таблицы "Коды маркировки"
	ОбязательныеКодыМаркировки = Новый Структура();
	ОбязательныеКодыМаркировки.Вставить("КодМаркировки",3);
	ОбязательныеРеквизиты.Вставить("КодыМаркировки", ОбязательныеКодыМаркировки);
	
	Возврат ОбязательныеРеквизиты;
КонецФункции

// Проверяет корректность заполнения объекта.
// Возвращает Истина если все заполнено корректно и Ложь иначе.
// В случае некорректного заполнения формирует строку описанием возникших ошибок "Ошибки"
// На вход может быть передана структура ДопРеквизиты с дополнительными реквизитами для проверки
// может управляться булевыми флагами выполняемых проверок Заполнение, Уникальность
// (могут быть и другие необязательные)
// Обычно выполняется универсальным обработчиком, но могут быть добавлены доп. проверки
Функция ПроверитьКорректность(Ошибки="", ДопРеквизиты=Неопределено, Заполнение=Истина, Уникальность=Истина) Экспорт
	// Здесь могут быть определены дополнительные к стандартным обязательным реквизитам условия проверки
	Результат = дкПроверитьКорректность(ЭтотОбъект, Ошибки, ДопРеквизиты, Заполнение, Уникальность);
	
	// Проведем проверку соответствия организации документа организациям некоторых реквизитов документа.
	// Такую проверку необходимо осуществлять, если баланс в системе ведется по организации, 
	// или если установлен способ контроля корректности договора и склада документа. 
	// Причем, если способ контроля выбран "Контроль по организации и подразделению", то
	// дополнительно осуществляется проверка соответствия подразделений.
	Если Результат Тогда
		СпособКонтроляКорректности = обПраво("КонтрольКорректностиДоговораИСкладаДокумента", Права,,ЭтотОбъект);
		КонтрольОтсутствует        = (СпособКонтроляКорректности=Перечисления.СпособКонтроляКорректностиДоговораИСкладаДокумента.КонтрольОтсутствует);
		БалансВедетсяПоОрганизации = (Константы.СпособВеденияБаланса.Получить()=Перечисления.СпособВеденияБаланса.ПоОрганизации);

		Если БалансВедетсяПоОрганизации Или Не КонтрольОтсутствует Тогда
			КонтрольПоПодразделению = (СпособКонтроляКорректности=Перечисления.СпособКонтроляКорректностиДоговораИСкладаДокумента.КонтрольПоОрганизацииИПодразделению);
			
			КонтролируемыеРеквизиты = Новый Структура();
			
			КонтролируемыеРеквизитыШапки = Новый Структура();
			КонтролируемыеРеквизитыШапки.Вставить("ДоговорВзаиморасчетов",КонтрольПоПодразделению);
			КонтролируемыеРеквизиты.Вставить("КонтролируемыеРеквизитыШапки",КонтролируемыеРеквизитыШапки);
		
			Результат = дкПроверитьКорректностьПоОрганизации(ЭтотОбъект,КонтролируемыеРеквизиты,Ошибки) и Результат;
		КонецЕсли;  		
	КонецЕсли;	
	
	Возврат Результат;
КонецФункции
 
// Функция проверяет, допустимо ли изменение объекта
// Возвращает Истина, если изменения возможны, ложь иначе
// Если изменения доступны частично, возвращает ложь и структуру блокируемых на изменение реквизитов,
Функция ДоступностьИзменения(БлокироватьРеквизиты=Неопределено) Экспорт
    // Здесь может быть прописано определение наличия ссылок, блокирующих изменение объекта
	Возврат Истина;
КонецФункции

// Возвращает список возможных хозяйственных операций документа
// Возвращаемое значение: СписокЗначений. 
// Строка списка: Значение - имя предопределенного элемента; 
//				  Представление - красивое его представление
// 				  "Помеченная" строка - ХО по умолчанию.
Функция ПолучитьСписокХозОпераций() Экспорт
	СписокХозОпераций = Новый СписокЗначений;
	СписокХозОпераций.Добавить("КорректировкаРеализацииИсправлениеВПервичныхДокументах","Исправление в первичных документах",Истина);
	СписокХозОпераций.Добавить("КорректировкаРеализацииКорректировкаПоСогласованиюСторон","Корректировка по согласованию сторон",Ложь);
	Возврат СписокХозОпераций;
КонецФункции

#Если Клиент Тогда
////////////////////////////////////////////////////////////////////////////////
// ЭКСПОРТНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ ПЕЧАТИ ДОКУМЕНТА

// Процедура осуществляет печать документа. Можно направить печать на 
// экран или принтер, а также распечатать необходимое количество копий.
// Параметры: НазваниеМакета - строка, название макета, если пусто - то по умолчанию,
//   Документ - сюда можно передать уже созданный табличный документ для заполнения
Функция Печать(НазваниеПечатнойФормы="", КоличествоЭкземпляров=0, НаПринтер=Ложь, Документ=Неопределено) Экспорт
	// Вызов конкретно печатной формы и печать результата прописано в общем модуле
	// здесь могут быть вставлены дополнительные механизмы
	Возврат дкПечать(ЭтотОбъект, НазваниеПечатнойФормы, КоличествоЭкземпляров, НаПринтер, Документ);
КонецФункции

// Формирует табличный документ 
// 
// Параметры:
//  ТабДокумент - табличный документ.
//
// Возвращаемое значение:
//  ТабДокумент - возвращает сформированный табличный документ.
//
Функция ПечатьРасходнаяНаклодная(ТабДокумент) Экспорт
	Макет = ПолучитьМакет("РеализацияТоваров");
	
	//для начала настроим макет
	ОбластьШапкаТаблицы = дкПривестиМакетПечатнойФормы(ЭтотОбъект,Макет);
	
	ВалютаПечатногоДокумента=зфВыборВалютыПечатногоДокумента(ЭтотОбъект);
	Если ВалютаПечатногоДокумента = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	ФорматВыводаСуммы = обПраво("ФорматВыводаСуммы",Права,,ЭтотОбъект);
	Если ПустаяСтрока(ФорматВыводаСуммы) Тогда
		ФорматВыводаСуммы = ФорматВыводаСуммы + "ЧДЦ=2; ЧН=0,00";
	КонецЕсли;
	
	//вывод заголовка документа
	ОбластьМакета = Макет.ПолучитьОбласть("Заголовок");
	ОбластьМакета.Параметры.Заполнить(ЭтотОбъект);
	ОбластьМакета.Параметры.ВалютаДокумента = ВалютаПечатногоДокумента;
	Если ХозОперация=Справочники.ХозОперации.АктОбОказанииУслуг Тогда
		ТекстЗаголовка = ХозОперация.Наименование+" № "+дкПолучитьНомерДляПечати(ЭтотОбъект)+" от "+Формат(Дата,"ДФ=dd.MM.yyyy");
	Иначе
		ТекстЗаголовка = дкПолучитьПредставление(ЭтотОбъект);
	КонецЕсли; 
	ОбластьМакета.Параметры.ТекстЗаголовка = ТекстЗаголовка;
	
	ДополнительныеПараметры = спСоздатьПараметрыПолученияПредставления();
	ДополнительныеПараметры.Вставить("ИспользоватьКПППодразделения");
	ДополнительныеПараметры.Вставить("ПодразделениеКомпании", ПодразделениеКомпании);
	ОбластьМакета.Параметры.ПредставлениеПоставщика = спПолучитьПредставление(Организация, , ДополнительныеПараметры);
	ОбластьМакета.Параметры.ПредставлениеПокупателя = спПолучитьПредставление(Контрагент);
	ОбластьМакета.Параметры.ПредставлениеСклада = спПолучитьНаименование(СкладКомпании);
	//вывод свойств
	СтрокаСвойств = дкПолучитьСтрокуСвойствДокумента(ЭтотОбъект);
	ОбластьМакета.Параметры.СтрокаСвойств = СтрокаСвойств;
	ТабДокумент.Вывести(ОбластьМакета);
	НомерСтраницы = 2;
	НомерСтраницыПред = НомерСтраницы;
    //                        
    Если ХозОперация = Справочники.ХозОперации.АктОбОказанииУслуг Тогда
        ОбластьШапкаТаблицы.Параметры.Товар = "Услуга";
    Иначе
        ОбластьШапкаТаблицы.Параметры.Товар = "Товар";
    КонецЕсли;
	
	//теперь выводим шапку
	ТабДокумент.Вывести(ОбластьШапкаТаблицы);
	
	//готовим области строки
	ОбластьМакета = Макет.ПолучитьОбласть("Строка");
	
	ОбластьМакетаИтогоПоСтранице = Макет.ПолучитьОбласть("ИтогоПоСтранице");
	СтруктураИтоговПоСтранице = Новый Структура("ВалютаДокумента,СуммаНДС,СуммаВсего",ВалютаПечатногоДокумента,0,0,0);
	//заполним параметры шапки таблицы для следующего листа
	ОбластьШапкаТаблицы.Параметры.ТекстЗаголовка = ТекстЗаголовка;
	ОбластьШапкаТаблицы.Параметры.НомерСтраницы = "Страница: " + НомерСтраницы; 
		
	Если ХозОперация=Справочники.ХозОперации.АктОбОказанииУслуг Тогда
		ОбластьПодвал = Макет.ПолучитьОбласть("ПодвалАкта");
	Иначе
		ОбластьПодвал = Макет.ПолучитьОбласть("Подвал");
	КонецЕсли;	
	
	//перебор строк
	ВыборкаТабличнойЧасти=ЭтотОбъект.Товары.Выгрузить();
	зфПерерасчетТаблицыТоваров(ВыборкаТабличнойЧасти,ЭтотОбъект,ВалютаПечатногоДокумента);
	Для каждого СтрокаТабличнойЧасти Из ВыборкаТабличнойЧасти Цикл
		Если НЕ СтрокаТабличнойЧасти.Количество > 0 Тогда Продолжить; КонецЕсли;
		//заполняем данные строки
		СтруктураСтроки = дкПолучитьПредставлениеДанныхТоварнойСтроки(СтрокаТабличнойЧасти,ЭтотОбъект);
		ОбластьМакета.Параметры.Заполнить(СтруктураСтроки);
		
		//доп. области
		мсвДопОбластиПодвала = Неопределено;
		Если ВыборкаТабличнойЧасти.Индекс(СтрокаТабличнойЧасти) = ВыборкаТабличнойЧасти.Количество()-1 Тогда
			мсвДопОбластиПодвала = Новый Массив;
			мсвДопОбластиПодвала.Добавить(ОбластьПодвал);
		КонецЕсли;		
		
		//выводим строку, делая проверку попадания на лист
		НомерСтраницы = дкВывестиГоризонтальнуюОбласть(ТабДокумент, ОбластьМакета, ОбластьШапкаТаблицы, ОбластьМакетаИтогоПоСтранице,
			НомерСтраницы, СтруктураИтоговПоСтранице, ЭтотОбъект, мсвДопОбластиПодвала);
		
		//инициализация итогов по странице
		Если НомерСтраницы <> НомерСтраницыПред Тогда
			СтруктураИтоговПоСтранице = Новый Структура("ВалютаДокумента,СуммаНДС,СуммаВсего",ВалютаПечатногоДокумента,0,0,0);
			НомерСтраницыПред = НомерСтраницы;
			ОбластьШапкаТаблицы.Параметры.НомерСтраницы = "Страница: " + НомерСтраницы; 
		КонецЕсли;
		//добавляем итоги
		дкДобавитьИтогиПоСтранице(СтрокаТабличнойЧасти,СтруктураИтоговПоСтранице);
		
	КонецЦикла;
	
	//выводим последний подвал, если страниц больше единицы
	Если НомерСтраницы > 2 Тогда
		дкВывестиИтогиПоСтранице(ТабДокумент,ОбластьМакетаИтогоПоСтранице,СтруктураИтоговПоСтранице,ЭтотОбъект);
	КонецЕсли;
	
	//итоги
	
	ОбластьПодвал.Параметры.ВалютаДокумента = ВалютаПечатногоДокумента;
	СуммаВсего = ВыборкаТабличнойЧасти.Итог("СуммаВсего");
	ОбластьПодвал.Параметры.СуммаВсего = Формат(СуммаВсего,ФорматВыводаСуммы);
	НДСВсего = ВыборкаТабличнойЧасти.Итог("СуммаНДС");
	ОбластьПодвал.Параметры.НДСВсего = Формат(НДСВсего,ФорматВыводаСуммы);
	ОбластьПодвал.Параметры.СуммаПрописью = "Всего наименований "+ВыборкаТабличнойЧасти.Количество()+" на сумму " + обЧислоПрописью(СуммаВсего,ВалютаПечатногоДокумента);
	
	// Выводим представления и расшифровки подписей
	Отпустил = дкОтветственноеЛицо(ЭтотОбъект,"Отпустил");
	Отпустил.ОтпустилПредставление = ?(обЗначениеНеЗаполнено(Отпустил.Отпустил),"","/ "+ Отпустил.ОтпустилПредставление);
	ОбластьПодвал.Параметры.Заполнить(Отпустил);
	Получил  = дкОтветственноеЛицо(ЭтотОбъект,"Получил");
	Получил.ПолучилПредставление = ?(обЗначениеНеЗаполнено(Получил.Получил),"","/ "+ Получил.ПолучилПредставление);
	ОбластьПодвал.Параметры.Заполнить(Получил);
	
	НомерСтраницы = дкВывестиГоризонтальнуюОбласть(ТабДокумент, ОбластьПодвал, , , НомерСтраницы,,ЭтотОбъект);
	
	Возврат ТабДокумент;
КонецФункции // ПечатьРеализацияТоваров()

// Формирует печатную форму "ТОРГ-12"
// 
// Параметры:
//  ТабДокумент - табличный документ.
//
// Возвращаемое значение:
//  ТабДокумент - возвращает сформированный табличный документ.
//
Функция ПечатьТОРГ12(ТабДокумент) Экспорт
	ФорматВыводаСуммы = обПраво("ФорматВыводаСуммы", Права,,ЭтотОбъект);
	ФорматВыводаКоличества = обПраво("ФорматВыводаКоличества", Права,,ЭтотОбъект);
	
	// Получим валюту регламентированного учета для перерасчета цены и суммы
	ВалютаРегл = Константы.ВалютаРегламентированногоУчетаОрганизаций.Получить();
	
	// Зададим параметры макета
	ТабДокумент.ПолеСверху = 0;
	ТабДокумент.ПолеСлева  = 0;
	ТабДокумент.ПолеСнизу  = 0;
	ТабДокумент.ПолеСправа = 0;
	ТабДокумент.ОриентацияСтраницы = ОриентацияСтраницы.Ландшафт;
	
	Макет = ПолучитьОбщийМакет("ТОРГ12");
	
	ОбластьМакета = Макет.ПолучитьОбласть("Шапка");
	ОбластьМакета.Параметры.Заполнить(ЭтотОбъект);
	
	СтруктураПредставления1=Новый Структура(
		"Наименование,ИНН,КПП,АдресЮридический,ТелефонРабочий,БанковскийСчет,Банк,БИК,КоррСчет",
		"","ИНН ","КПП ","","тел.: ","р/с ","в банке ","БИК ","к/с "
	);
	СтруктураПредставления2=Новый Структура(
		"Наименование,ИНН,КПП,АдресФактический,ТелефонРабочий,БанковскийСчет,Банк,БИК,КоррСчет",
		"","ИНН ","КПП ","","тел.: ","р/с ","в банке ","БИК ","к/с "
	);
	
	// получим р/с из свойств документа
	РасчетныйСчетДокумента=обПолучитьЗначениеСвойства(ЭтотОбъект, "РасчетныйСчет", Неопределено);
	
	// Правим, что автоматом не заполнилось, или заполнилось неправильно
	ДополнительныеПараметры = спСоздатьПараметрыПолученияПредставления();
	ДополнительныеПараметры.ДляПечати = Истина;
	ДополнительныеПараметры.РасчетныйСчетДокумента = РасчетныйСчетДокумента;
	ОбластьМакета.Параметры.ОрганизацияПредставление= спПолучитьПредставление(
		ОбластьМакета.Параметры.ПодразделениеКомпании, СтруктураПредставления2, ДополнительныеПараметры);
	ОбластьМакета.Параметры.Поставщик				= обПолучитьЗначениеСвойства(ЭтотОбъект,"ПоставщикОрганизация",ЭтотОбъект.Организация);
	ОбластьМакета.Параметры.ПоставщикПредставление	= спПолучитьПредставление(ОбластьМакета.Параметры.Поставщик,СтруктураПредставления2);
	
	ОбластьМакета.Параметры.Грузополучатель				= обПолучитьЗначениеСвойства(ЭтотОбъект,"Грузополучатель",ЭтотОбъект.Контрагент);
	ОбластьМакета.Параметры.ГрузополучательПредставление= спПолучитьПредставление(ОбластьМакета.Параметры.Грузополучатель,СтруктураПредставления2);
	ОбластьМакета.Параметры.Плательщик					= обПолучитьЗначениеСвойства(ЭтотОбъект,"Плательщик",ЭтотОбъект.Контрагент);
	ОбластьМакета.Параметры.ПлательщикПредставление		= спПолучитьПредставление(ОбластьМакета.Параметры.Плательщик,СтруктураПредставления1);
	
	//дальше заполнить Шапку
	ОбластьМакета.Параметры.КодПоОКПО				= ЭтотОбъект.Организация.КодПоОКПО;
	ОбластьМакета.Параметры.ВидДеятельностиПоОКДП	= ЭтотОбъект.Организация.КодПоОКДП;
	ОбластьМакета.Параметры.ГрузополучательПоОКПО	= ОбластьМакета.Параметры.Грузополучатель.КодПоОКПО;
	ОбластьМакета.Параметры.ПоставщикПоОКПО			= ОбластьМакета.Параметры.Поставщик.КодПоОКПО;
	ОбластьМакета.Параметры.ПлательщикПоОКПО		= ОбластьМакета.Параметры.Плательщик.КодПоОКПО;
	
	ОбластьМакета.Параметры.ДокументОснованиеПредставление = ДоговорВзаиморасчетов.Наименование;
	ОбластьМакета.Параметры.ДокументОснование = ДоговорВзаиморасчетов;
	ОбластьМакета.Параметры.ОснованиеДата = "";
	ОбластьМакета.Параметры.ОснованиеНомер = ""; 
	
	ОбластьМакета.Параметры.Номер = дкПолучитьНомерДляПечати(ЭтотОбъект);	
	ТабДокумент.Вывести(ОбластьМакета);
	
	НомерСтраницы	= 2;
	НомерСтраницыПред = НомерСтраницы;
	КоличествоСтрокНаТекущейСтранице=0;
	
	ОбластьЗаголовокТаблицы	= Макет.ПолучитьОбласть("ЗаголовокТаблицы");
	ОбластьСтрока			= Макет.ПолучитьОбласть("Строка");
	ОбластьИтоги			= Макет.ПолучитьОбласть("ИтогоПоСтранице");
	ОбластьВсего			= Макет.ПолучитьОбласть("Всего");
	//!!! TimR: В новой пф данное поле не выводится
	//ОбластьВсегоСтавкаНДС	= Макет.ПолучитьОбласть("ВсегоСтавкаНДС");
	
	СтруктураИтоговПоСтранице = Новый Структура("ИтогКоличествоПоСтранице,ИтогСуммыПоСтранице,ИтогНДСПоСтранице,ИтогСуммыСНДСПоСтранице",0,0,0,0);		

	ОбластьЗаголовокТаблицы.Параметры.валюта=ВалютаРегл;
	ТабДокумент.Вывести(ОбластьЗаголовокТаблицы);	
	
	ОбластьПодвал = Макет.ПолучитьОбласть("Подвал");
	
	//заполним параметры шапки таблицы для следующего листа
	ОбластьЗаголовокТаблицы.Параметры.НомерСтраницы = "Страница: " + НомерСтраницы; 

	ВыборкаСтрок = ЭтотОбъект.Товары;
	
	КоличествоСтрок = ВыборкаСтрок.Количество();

	// инициализация итогов по документу
	ИтогоКоличество = 0;
	ИтогоСумма      = 0;
	ИтогоНДС        = 0;
	ИтогоСуммаСНДС  = 0;
	
	СоответствиеИтоговПоставкамНДС = Новый Соответствие();
	КолвоИтогБаз = 0;
	// Выводим многострочную часть документа
	Для каждого СтрокаТоваров Из ВыборкаСтрок Цикл
		Если НЕ СтрокаТоваров.Количество > 0 Тогда Продолжить; КонецЕсли;
		//заполняем данные строки
		СтруктураСтроки = дкПолучитьПредставлениеДанныхТоварнойСтроки(СтрокаТоваров,ЭтотОбъект);
		ОбластьСтрока.Параметры.Заполнить(СтруктураСтроки);
		ОбластьСтрока.Параметры.Код							= дкПолучитьЗначениеКолонкиКода(СтрокаТоваров.Номенклатура,,ЭтотОбъект);
		ОбластьСтрока.Параметры.БазоваяЕдиницаНаименование	= СтрокаТоваров.ЕдиницаИзмерения;
		ОбластьСтрока.Параметры.БазоваяЕдиницаКодПоОКЕИ		= СтрокаТоваров.ЕдиницаИзмерения.ЕдиницаПоКлассификатору.Код;
		ОбластьСтрока.Параметры.Количество					= Формат(СтрокаТоваров.Количество*СтрокаТоваров.Коэффициент,ФорматВыводаКоличества);
		ОбластьСтрока.Параметры.КоличествоМест				= Формат(СтрокаТоваров.Количество,ФорматВыводаКоличества);
		ОбластьСтрока.Параметры.КоличествоВОдномМесте		= Формат(СтрокаТоваров.Коэффициент,ФорматВыводаКоличества);
		ОбластьСтрока.Параметры.ТоварНаименование 			= СтруктураСтроки.ТоварНаименование + ?(ЗначениеЗаполнено(СтрокаТоваров.Номенклатура.Артикул), ", "+СтрокаТоваров.Номенклатура.Артикул, "");

		// Пересчитаем сумму в соответствии с регламентированной валютой
		СуммаВсего = Окр(обПересчет(СтрокаТоваров.СуммаВсего, ВалютаДокумента, КурсДокумента, ВалютаРегл, Дата), 2);
		СуммаНДС   = Окр(обПересчет(СтрокаТоваров.СуммаНДС, ВалютаДокумента, КурсДокумента, ВалютаРегл, Дата), 2);
		СуммаБезНДС = СуммаВсего - СуммаНДС;
		
		ОбластьСтрока.Параметры.СуммаВсего  = Формат(СуммаВсего, ФорматВыводаСуммы);
		ОбластьСтрока.Параметры.СуммаНДС    = Формат(СуммаНДС, ФорматВыводаСуммы);
		ОбластьСтрока.Параметры.СуммаБезНДС = Формат(СуммаБезНДС, ФорматВыводаСуммы);
		
		// Рассчитаем цену.
		ОбластьСтрока.Параметры.ЦенаБезНДС = Формат(СуммаБезНДС / (СтрокаТоваров.Количество * ?(СтрокаТоваров.Коэффициент = 0, 1, СтрокаТоваров.Коэффициент)), ФорматВыводаСуммы);
		
		//доп. области
		мсвДопОбластиПодвала = Неопределено;
		Если ВыборкаСтрок.Индекс(СтрокаТоваров) = ВыборкаСтрок.Количество()-1 Тогда
			мсвДопОбластиПодвала = Новый Массив;
			мсвДопОбластиПодвала.Добавить(ОбластьВсего);
			//!!! TimR: В новой пф данное поле не выводится
			//мсвДопОбластиПодвала.Добавить(ОбластьВсегоСтавкаНДС);
			мсвДопОбластиПодвала.Добавить(ОбластьПодвал);
		КонецЕсли;
		
		Если КоличествоСтрокНаТекущейСтранице=0 Тогда
			ТабДокумент.Вывести(ОбластьСтрока);
		Иначе
			//выводим строку, делая проверку попадания на лист		
			НомерСтраницы = дкВывестиГоризонтальнуюОбласть(ТабДокумент, ОбластьСтрока, ОбластьЗаголовокТаблицы, ОбластьИтоги,
				НомерСтраницы, СтруктураИтоговПоСтранице, ЭтотОбъект, мсвДопОбластиПодвала);
		КонецЕсли; 
		
		// увеличим итоги по странице
		СтруктураСтрокиИтогов = Новый Структура("ИтогКоличествоПоСтранице,ИтогСуммыПоСтранице,ИтогНДСПоСтранице,ИтогСуммыСНДСПоСтранице");
		КолвоИтогБаз = КолвоИтогБаз + СтрокаТоваров.Количество*СтрокаТоваров.Коэффициент;
		СтруктураСтрокиИтогов.ИтогКоличествоПоСтранице = СтрокаТоваров.Количество*СтрокаТоваров.Коэффициент;
		СтруктураСтрокиИтогов.ИтогСуммыПоСтранице      = СуммаБезНДС;
		СтруктураСтрокиИтогов.ИтогНДСПоСтранице		   = СуммаНДС;
		СтруктураСтрокиИтогов.ИтогСуммыСНДСПоСтранице  = СуммаВсего;
		
		//инициализация итогов по странице
		Если НомерСтраницы <> НомерСтраницыПред Тогда
			СтруктураИтоговПоСтранице = Новый Структура("ИтогКоличествоПоСтранице,ИтогСуммыПоСтранице,ИтогНДСПоСтранице,ИтогСуммыСНДСПоСтранице",0,0,0,0);
			НомерСтраницыПред = НомерСтраницы;
			КоличествоСтрокНаТекущейСтранице=0;
			ОбластьЗаголовокТаблицы.Параметры.НомерСтраницы = "Страница: " + НомерСтраницы; 
		Иначе
			КоличествоСтрокНаТекущейСтранице=КоличествоСтрокНаТекущейСтранице+1;
		КонецЕсли;
		//добавляем итоги
		дкДобавитьИтогиПоСтранице(СтруктураСтрокиИтогов,СтруктураИтоговПоСтранице);
		
		// итоги по ставкам НДС
		Если НЕ обЗначениеНеЗаполнено(СтрокаТоваров.СтавкаНДС) Тогда
			Если СоответствиеИтоговПоставкамНДС[СтрокаТоваров.СтавкаНДС] = Неопределено Тогда
				СоответствиеИтоговПоставкамНДС.Вставить(СтрокаТоваров.СтавкаНДС,0);
			КонецЕсли;
			СоответствиеИтоговПоставкамНДС[СтрокаТоваров.СтавкаНДС] = СоответствиеИтоговПоставкамНДС[СтрокаТоваров.СтавкаНДС] + СтрокаТоваров.СуммаНДС;
		КонецЕсли;
		
		//Сформируем итоги по документу
		ИтогоСумма      = ИтогоСумма + СуммаБезНДС;
		ИтогоНДС        = ИтогоНДС + СуммаНДС;
		ИтогоСуммаСНДС  = ИтогоСуммаСНДС + СуммаВсего;
		
	КонецЦикла;
	
	//выводим последний подвал, если страниц больше единицы
	Если НомерСтраницы > 1 Тогда
		дкВывестиИтогиПоСтранице(ТабДокумент,ОбластьИтоги,СтруктураИтоговПоСтранице,ЭтотОбъект);
	КонецЕсли;
	
	// Выводим итоги по документу в целом
	ОбластьВсего.Параметры.ИтогКоличество = Формат(КолвоИтогБаз,   ФорматВыводаКоличества);
	ОбластьВсего.Параметры.ИтогСуммы      = Формат(ИтогоСумма,     ФорматВыводаСуммы);
	ОбластьВсего.Параметры.ИтогНДС        = Формат(ИтогоНДС,       ФорматВыводаСуммы);
	ОбластьВсего.Параметры.ИтогСуммыСНДС  = Формат(ИтогоСуммаСНДС, ФорматВыводаСуммы);
	ТабДокумент.Вывести(ОбластьВсего);
	
	//!!! TimR: В новой пф данное поле не выводится
	//// выведем итоги по ставкам НДС
	//Для Каждого ЭлементСоответствия Из СоответствиеИтоговПоставкамНДС Цикл
	//	ОбластьВсегоСтавкаНДС.Параметры.СтавкаНДС = "Итого по ставке НДС: "
	//	+дкПолучитьПредставлениеСтавкиНДС(ЭлементСоответствия.Ключ,"%");
	//	ОбластьВсегоСтавкаНДС.Параметры.ИтогНДС = ЭлементСоответствия.Значение;
	//	НомерСтраницы = дкВывестиГоризонтальнуюОбласть(ТабДокумент, ОбластьВсегоСтавкаНДС, , , НомерСтраницы,,ЭтотОбъект);
	//КонецЦикла;
	
	// Выводим подвал документа
	ОбластьПодвал.Параметры.Заполнить(ЭтотОбъект);
	ОбластьПодвал.Параметры.КоличествоПорядковыхНомеровЗаписейПрописью = ЧислоПрописью(КоличествоСтрок, ,",,,,,,,,0");
	ОбластьПодвал.Параметры.СуммаПрописью = обЧислоПрописью(ИтогоСуммаСНДС,ВалютаРегл);
	
	Доверенность = обПолучитьЗначениеСвойства(ЭтотОбъект,"Доверенность");
	Если НЕ обЗначениеНеЗаполнено(Доверенность) Тогда
		ОбластьПодвал.Параметры.ДоверенностьНомер = ?(ПустаяСтрока(Доверенность.Серия),"",Доверенность.Серия + "-") + Доверенность.Номер;
		ОбластьПодвал.Параметры.ДоверенностьДата  = Доверенность.ДатаВыдачи;
		ОбластьПодвал.Параметры.ДоверенностьВыдана= Доверенность.КемВыдан;
		ВладелецДоверенности = Доверенность.Владелец;
		Если ТипЗнч(ВладелецДоверенности)=Тип("СправочникСсылка.Контрагенты") ИЛИ
			 ТипЗнч(ВладелецДоверенности)=Тип("СправочникСсылка.Организации") Тогда
			ОбластьПодвал.Параметры.ДоверенностьЧерезКого = спПолучитьНаименование(ВладелецДоверенности);
		ИначеЕсли ТипЗнч(ВладелецДоверенности)=Тип("СправочникСсылка.Сотрудники") Тогда
			ОбластьПодвал.Параметры.ДоверенностьЧерезКого = ?(обЗначениеНеЗаполнено(ВладелецДоверенности.Должность),"",спПолучитьНаименование(ВладелецДоверенности.Должность)+", ")+спПолучитьНаименование(ВладелецДоверенности);
		КонецЕсли;
	КонецЕсли; 
	
	ДатаОтгрузки=обПолучитьЗначениеСвойства(ЭтотОбъект,"ДатаОтгрузки",Дата('00010101'));
	ДатаОтгрузки=?(обЗначениеНеЗаполнено(ДатаОтгрузки),"""___""____________ 20___",Формат(ДатаОтгрузки,"ДФ=dd.MM.yyyy"));
	ОбластьПодвал.Параметры.ДатаОтгрузки = ДатаОтгрузки;
	
	// Заполним информацию о руководителях организации
	Руководитель = дкОтветственноеЛицо(ЭтотОбъект,Перечисления.ВидыОбъектовСведений.Руководитель);
	ОбластьПодвал.Параметры.Заполнить(Руководитель);
	
	ГлавныйБухгалтер = дкОтветственноеЛицо(ЭтотОбъект,Перечисления.ВидыОбъектовСведений.ГлавныйБухгалтер);
	ОбластьПодвал.Параметры.Заполнить(ГлавныйБухгалтер);
	
	Отпустил = дкОтветственноеЛицо(ЭтотОбъект,"Отпустил");
	ОбластьПодвал.Параметры.Заполнить(Отпустил);
	
	Получил = дкОтветственноеЛицо(ЭтотОбъект,"Получил");
	ОбластьПодвал.Параметры.Заполнить(Получил);
	
	НомерСтраницы = дкВывестиГоризонтальнуюОбласть(ТабДокумент, ОбластьПодвал, , , НомерСтраницы,,ЭтотОбъект);
	
	ТабДокумент.АвтоМасштаб = Истина;
	
	Возврат ТабДокумент;
КонецФункции // ПечатьТОРГ12()

// Формирует печатную форму "УПД"
// Возвращает сформированный табличный документ:
Функция ПечатьУПД(ТабДокумент) Экспорт
	
	ТабДокумент = дкПечатьУПД(ЭтотОбъект,ТабДокумент);
	Возврат ТабДокумент;
	
КонецФункции //ПечатьУПД()

// Формирует печатную форму "УКД"
// Возвращает сформированный табличный документ:
Функция ПечатьУКД(ТабДокумент) Экспорт
	
	ТабДокумент = дкПечатьУКД(ЭтотОбъект, ТабДокумент);
	
	Возврат ТабДокумент;
КонецФункции // ПечатьУКД

// Функция получения данных для УКД.
//
Функция ПолучитьДанныеДляПечатиУКД() Экспорт
	
	ДокументФактура = Документы.СчетФактураВыданный.НайтиПоРеквизиту("ДокументОснование", ЭтотОбъект.Ссылка);
	ДокументОбъект = ДокументФактура;
	ДанныеОбъекта = Новый Структура();
	
	// Сформируем статус документа
	Если ДокументФактура <> Документы.СчетФактураВыданный.ПустаяСсылка() И НЕ ДокументФактура.ПометкаУдаления Тогда
		Статус = 1;
		ДокументОбъект = ДокументФактура;
	Иначе
		Статус = 2;
		ДокументОбъект = ЭтотОбъект;
	КонецЕсли;
	
	Если Дата < Дата('20210701') Тогда
		ТаблицаТоваров = ТоварыДляУКД(ЭтотОбъект.Ссылка);
	Иначе
		ТаблицаТоваров = Документы.СчетФактураВыданный.ПолучитьДанныеДляЗаполненияПФКорректировки(ЭтотОбъект);
	КонецЕсли;
	
	// данные документа
	ДанныеОбъекта.Вставить("Дата"                   	, ДокументОбъект.Дата);
	ДанныеОбъекта.Вставить("Номер"                  	, дкПолучитьНомерДляПечати(ДокументОбъект));
	ДанныеОбъекта.Вставить("ХозОперация"            	, ДокументОбъект.ХозОперация);
	ДанныеОбъекта.Вставить("ДокументОснование"      	, ДокументОбъект.ДокументОснование);
	ДанныеОбъекта.Вставить("ВалютаДокумента"      		, ЭтотОбъект.ВалютаДокумента);
	ДанныеОбъекта.Вставить("Поставщик"              	, ДокументОбъект.Организация);
	ДанныеОбъекта.Вставить("ПодразделениеКомпании"  	, ДокументОбъект.ПодразделениеКомпании);
	ДанныеОбъекта.Вставить("Покупатель"              	, ДокументОбъект.Контрагент);
	ДанныеОбъекта.Вставить("Организация"              	, ЭтотОбъект.Организация);
	ДанныеОбъекта.Вставить("ДоговорВзаиморасчетов"     	, ?(ЗначениеЗаполнено(ДокументОбъект.ДоговорВзаиморасчетов), ЭтотОбъект.ДоговорВзаиморасчетов, "--"));
	ДанныеОбъекта.Вставить("Товары"              		, ТаблицаТоваров);
	ДанныеОбъекта.Вставить("Статус"              		, Статус);
	ДанныеОбъекта.Вставить("Ссылка"              		, ДокументОбъект.Ссылка);
	ДанныеОбъекта.Вставить("ИдентификаторГосударственногоКонтракта", ЭтотОбъект.ИдентификаторГосударственногоКонтракта);
	ДанныеОбъекта.Вставить("ДатаОтгрузки", Неопределено);
	
	Если Статус = 1 Тогда
		ДанныеОбъекта.Вставить("НомерИсходногоДокумента",
			?(ЗначениеЗаполнено(ДокументОбъект.НомерИсходногоДокумента),
				дкПолучитьНомерДляПечати(ДокументОбъект,,"НомерИсходногоДокумента"),
				"--"));
		ДанныеОбъекта.Вставить("ДатаИсходногоДокумента",
			?(ЗначениеЗаполнено(ДокументОбъект.ДатаИсходногоДокумента), ДокументОбъект.ДатаИсходногоДокумента, "--"));
		ДанныеОбъекта.Вставить("ПлатежноРасчетныеДокументы" , ДокументОбъект.ПлатежноРасчетныеДокументы);
	КонецЕсли;
	
	// Свойства
	ДанныеОбъекта.Вставить("Руководитель"     		, дкОтветственноеЛицо(ЭтотОбъект.ДокументОснование, Перечисления.ВидыОбъектовСведений.Руководитель));
	ДанныеОбъекта.Вставить("ГлавныйБухгалтер" 		, дкОтветственноеЛицо(ЭтотОбъект.ДокументОснование, Перечисления.ВидыОбъектовСведений.ГлавныйБухгалтер));
	ДанныеОбъекта.Вставить("Менеджер" 				, дкОтветственноеЛицо(ДокументОбъект, "Менеджер"));
	
	Возврат ДанныеОбъекта;
	
КонецФункции

// Возвращает доступные варианты печати документа
// Возвращаемое значение: Структура, каждая строка которой
// соответствует одному из вариантов печати
// Первый элемент структуры - форма по умолчанию
Функция ПолучитьСписокПечатныхФорм() Экспорт
	СтруктураМакетов=Новый Структура();
	СтруктураМакетов.Вставить("РасходнаяНаклодная", "Расходная накладная");
	СтруктураМакетов.Вставить("ТОРГ12", "ТОРГ-12 (Товарная накладная)");
	СтруктураМакетов.Вставить("УПД"                , "Универсальный передаточный документ");
	СтруктураМакетов.Вставить("УКД"                , "Универсальный корректировочный документ");
	Возврат СтруктураМакетов;
КонецФункции

#КонецЕсли
// Если Клиент Тогда - завершена клиентская часть

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ

Процедура ПриУстановкеНовогоНомера(СтандартнаяОбработка, Префикс)
	Если НЕ дкПриУстановкеНовогоНомера(ЭтотОбъект, СтандартнаяОбработка, Префикс) Тогда Возврат; КонецЕсли;
КонецПроцедуры

// Процедура - обработчик ввода на основании
Процедура ОбработкаЗаполнения(Основание) 
	
	//Иванченко 20241126 ++ 
	Если ТипЗнч(Основание) = Тип("ДокументСсылка.РеализацияТоваров") Тогда	
		ХозОперация = Справочники.ХозОперации.КорректировкаРеализацииКорректировкаПоСогласованиюСторон;
	КонецЕсли;	
	//Иванченко 20241126 --
	
	//Бондаренко++ 20251016
	Если ТипЗнч(Основание) = Тип("ДокументСсылка.ЗаказНаряд") Тогда	
		СкладКомпании = Основание.Цех.СкладКомпании;
	КонецЕсли;	
	//Бондаренко-- 20251016
	
	//Иванченко 20250415 ++ 
	Если ТипЗнч(Основание) = Тип("ДокументСсылка.ОтчетКомитенту") И Основание.ХозОперация = Справочники.ХозОперации.ОтчетАгента Тогда  
		ХозОперация = Справочники.ХозОперации.КорректировкаРеализацииКорректировкаПоСогласованиюСторон;	
		ДоговорВзаиморасчетов = Основание.ДоговорВзаиморасчетов; 
		ДокументОснование = Основание; 
		//Иванченко 20250422 ++			
		ПоДокументуРеализации = Ложь;
		//Иванченко 20250422 --		
	КонецЕсли;
	//Иванченко 20250415 --
	
	Если ТипЗнч(Основание) = Тип("Структура") Тогда
		Возврат;
	КонецЕсли;
	
	Если Основание<>Неопределено Тогда
		Если Основание <> ДокументОснование ТОгда
			Пока Истина Цикл
				// проверим введенные на основании корректировки
				Корректировка     = Неопределено;
				МассивВидов       = Новый Массив(1); 
				МассивВидов[0]    = "КорректировкаРеализации";
				МассивПодчиненных = дкПолучитьМассивПодчиненных(Основание, МассивВидов, Истина);
				
				Если ЗначениеЗаполнено(МассивПодчиненных) И МассивПодчиненных.Количество()>0 Тогда
					Основание = МассивПодчиненных[0].Ссылка;
				Иначе
					Прервать;
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
		
		Если Основание = Ссылка Тогда
			Сообщить("Ввод корректировки реализации на основании самой себя запрещен.",СтатусСообщения.Внимание);
			Основание=Неопределено;
			ДокументОснование=Неопределено;
			дкОтменаВводаДокумента(ЭтотОбъект);
			Возврат;
		КонецЕсли;
		
		Если НЕ Основание.Проведен Тогда
			Сообщить("Ввод корректировки реализации возможен только на основании проведенного документа.",СтатусСообщения.Внимание);
			Основание=Неопределено;
			ДокументОснование=Неопределено;
			дкОтменаВводаДокумента(ЭтотОбъект);
			Возврат;
		КонецЕсли;
		
		Если Основание.ХозОперация = Справочники.ХозОперации.РеализацияТоваровКомиссия Тогда
			Сообщить("Ввод корректировки реализации не возможен на основании реализации товаров комиссия.",СтатусСообщения.Внимание);
			Основание         = Неопределено;
			ДокументОснование = Неопределено;
			дкОтменаВводаДокумента(ЭтотОбъект);
			Возврат;
		КонецЕсли;
		
		Если КорректировкаНеДоступна(Основание) Тогда
			Сообщить("На основании " + Основание + " введен возврат товаров. Ввод корректировки реализации невозможен.",СтатусСообщения.Внимание);
			Основание         = Неопределено;
			ДокументОснование = Неопределено;
			дкОтменаВводаДокумента(ЭтотОбъект);
			Возврат;
		КонецЕсли;
	КонецЕсли;
	
	Если ТипЗнч(Основание)=Тип("ДокументСсылка.ЗаказНаряд") И (Основание.ВидРемонта.ТипРемонта = Перечисления.ТипыРемонта.Бесплатный) Тогда
		#Если Клиент Тогда
			Сообщить("В заказ-наряде выбран бесплатный ремонт. Нельзя создать корректировку реализации!",СтатусСообщения.Важное);
			дкОтменаВводаДокумента(ЭтотОбъект);
			Основание=Неопределено;
			ДокументОснование=Неопределено;
			Возврат;
		#КонецЕсли
	КонецЕсли;
	
	Если ТипЗнч(Основание)=Тип("ДокументСсылка.ЗаказНаряд") И (Основание.Состояние <> Справочники.ВидыСостоянийЗаказНарядов.Закрыт) Тогда
		#Если Клиент Тогда
			Сообщить("В заказ-наряде не находится в состоянии ""Закрыт"". Нельзя создать корректировку реализации!",СтатусСообщения.Важное);
			дкОтменаВводаДокумента(ЭтотОбъект);
			Основание=Неопределено;
			ДокументОснование=Неопределено;
			Возврат;
		#КонецЕсли
	КонецЕсли;

	
	Сделка=ПолучитьСделку(Основание);
	
	Товары.Очистить();
	Работы.Очистить(); 
	
	Если НЕ дкОбработкаЗаполнения(ЭтотОбъект, Основание) Тогда Возврат; КонецЕсли;
	
	ПоДокументуРеализации=Истина;
	
	// Перезаполним контрагента и договор
	Если ЗначениеЗаполнено(Основание)
		И (Контрагент <> Основание.Контрагент
		ИЛИ ДоговорВзаиморасчетов <> Основание.ДоговорВзаиморасчетов) Тогда
		Контрагент = Основание.Контрагент;
		ОбработкаРеквизита("Контрагент");
		ДопПараметры=Новый Структура;
		ДопПараметры.Вставить("НеПерезаполнятьПоДоговоруВзаиморасчетов",Истина);
		ДоговорВзаиморасчетов = Основание.ДоговорВзаиморасчетов;
		ОбработкаРеквизита("ДоговорВзаиморасчетов",,, ДопПараметры);
	КонецЕсли;
	
	Если ТипЗнч(Основание)=Тип("ДокументСсылка.ЗаказНаряд") ИЛИ ТипЗнч(Основание)=Тип("ДокументСсылка.КорректировкаРеализации") Тогда
		Для каждого СтрокаТЧ Из Работы Цикл
			Если ПоДокументуРеализации Тогда
				СтрокаТЧ.ПоДокументуРеализации=Истина;
			КонецЕсли; 
			СтрокаТЧ.Подтверждение=Истина;
			СтрокаТЧ.КоличествоПоДокументуРеализации=СтрокаТЧ.Количество;
			СтрокаТЧ.КоэффициентПоДокументуРеализации=СтрокаТЧ.Коэффициент;
			СтрокаТЧ.СтавкаНДСПоДокументуРеализации=СтрокаТЧ.СтавкаНДС;
			СтрокаТЧ.СуммаНДСПоДокументуРеализации=СтрокаТЧ.СуммаНДС;
			СтрокаТЧ.СуммаВсегоПоДокументуРеализации=СтрокаТЧ.СуммаВсего;
		КонецЦикла; 
	КонецЕсли;
	Для каждого СтрокаТЧ Из Работы Цикл	
		СтрокаТЧ.Цена=?(СтрокаТЧ.Количество*СтрокаТЧ.Коэффициент=0,0,СтрокаТЧ.Сумма/(СтрокаТЧ.Количество*СтрокаТЧ.Коэффициент));
		ОбработкаРеквизита("Работы.РасчетРазницы",СтрокаТЧ);
	КонецЦикла; 
	
	ПерваяКорректировка = (ТипЗнч(Основание) <> Тип("ДокументСсылка.КорректировкаРеализации"));
	
	Если ПерваяКорректировка Тогда
		
		// Заполним коды маркировки
		Если ТипЗнч(Основание) = Тип("ДокументСсылка.ЗаказНаряд") Тогда
			// Получим коды маркировки для ЗН
			Запрос = Новый Запрос;
			Запрос.Текст = "ВЫБРАТЬ
			               |	МаркировкаТоваровВПроизводстве.Номенклатура КАК Номенклатура,
			               |	МаркировкаТоваровВПроизводстве.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
			               |	МаркировкаТоваровВПроизводстве.КодМаркировки КАК КодМаркировки,
			               |	МаркировкаТоваровВПроизводстве.Количество КАК Количество
			               |ИЗ
			               |	РегистрНакопления.МаркировкаТоваровВПроизводстве КАК МаркировкаТоваровВПроизводстве
			               |ГДЕ
			               |	МаркировкаТоваровВПроизводстве.Регистратор = &Основание";
			Запрос.УстановитьПараметр("Основание", Основание);
			ТаблицаКодовМаркировок = Запрос.Выполнить().Выгрузить();
		Иначе
			ТаблицаКодовМаркировок = Новый ТаблицаЗначений;
			ТаблицаКодовМаркировок.Колонки.Добавить("Номенклатура", Новый ОписаниеТипов("СправочникСсылка.Номенклатура"));
			ТаблицаКодовМаркировок.Колонки.Добавить("ХарактеристикаНоменклатуры", Новый ОписаниеТипов("СправочникСсылка.ХарактеристикиНоменклатуры"));
			ТаблицаКодовМаркировок.Колонки.Добавить("КодМаркировки", Новый ОписаниеТипов("Строка",, Новый КвалификаторыСтроки(200)));
			ТаблицаКодовМаркировок.Колонки.Добавить("ЕдиницаИзмерения", Новый ОписаниеТипов("СправочникСсылка.ЕдиницыИзмерения"));
			ТаблицаКодовМаркировок.Колонки.Добавить("СтавкаНДС", Новый ОписаниеТипов("СправочникСсылка.СтавкиНДС"));
			
			Для Каждого ТекущаяСтрока Из Товары Цикл
				НайденныеСтроки = КодыМаркировки.НайтиСтроки(Новый Структура("ИдентификаторТовара", ТекущаяСтрока.ИдентификаторТовара));
				Для Каждого ТекущаяСтрокаМаркировки Из НайденныеСтроки Цикл
					НоваяСтрока = ТаблицаКодовМаркировок.Добавить();
					ЗаполнитьЗначенияСвойств(НоваяСтрока, ТекущаяСтрока);
					НоваяСтрока.КодМаркировки = ТекущаяСтрокаМаркировки.КодМаркировки;
				КонецЦикла;
			КонецЦикла;
			
		КонецЕсли;
		
		Товары.Свернуть("Номенклатура,ЕдиницаИзмерения,Коэффициент,СтавкаНДС,ХарактеристикаНоменклатуры","Количество,Сумма,СуммаНДС,СуммаВсего");
	КонецЕсли;
	
	Для каждого СтрокаТЧ Из Товары Цикл
		СтрокаТЧ.Цена  = ?(СтрокаТЧ.Количество <> 0, СтрокаТЧ.Сумма/СтрокаТЧ.Количество, 0);
		Если ПоДокументуРеализации Тогда
			СтрокаТЧ.ПоДокументуРеализации=Истина;
		КонецЕсли; 
		СтрокаТЧ.Подтверждение=Истина;
		
		// Заполним доп. поля для товарной строки
		Если ПустаяСтрока(СтрокаТЧ.ИдентификаторТовара) Тогда
			СтрокаТЧ.ИдентификаторТовара = Новый УникальныйИдентификатор;
		КонецЕсли;
		
		СтрокаТЧ.КоличествоПоДокументуРеализации=СтрокаТЧ.Количество;
		СтрокаТЧ.ЕдиницаИзмеренияПоДокументуРеализации=СтрокаТЧ.ЕдиницаИзмерения;
		СтрокаТЧ.КоэффициентПоДокументуРеализации=СтрокаТЧ.Коэффициент;
		СтрокаТЧ.СтавкаНДСПоДокументуРеализации=СтрокаТЧ.СтавкаНДС;
		СтрокаТЧ.СуммаНДСПоДокументуРеализации=СтрокаТЧ.СуммаНДС;
		СтрокаТЧ.СуммаВсегоПоДокументуРеализации=СтрокаТЧ.СуммаВсего;
		ОбработкаРеквизита("Товары.СуммаВсего",СтрокаТЧ);
		ОбработкаРеквизита("Товары.РасчетРазницы",СтрокаТЧ);
	КонецЦикла; 
	ПустыеСтроки=Товары.НайтиСтроки(Новый Структура("Количество",0));
	Для каждого ПустаяСтрока Из ПустыеСтроки Цикл
		Товары.Удалить(ПустаяСтрока);
	КонецЦикла; 
	ПустыеСтроки=Работы.НайтиСтроки(Новый Структура("Количество",0));
	Для каждого ПустаяСтрока Из ПустыеСтроки Цикл
		Работы.Удалить(ПустаяСтрока);
	КонецЦикла; 
	
	// Заполним коды маркировки
	Если ПерваяКорректировка Тогда
		КодыМаркировки.Очистить();
		
		СтруктураПоиска = Новый Структура("Номенклатура,ХарактеристикаНоменклатуры");
		
		Если НЕ ТипЗнч(Основание) = Тип("ДокументСсылка.ЗаказНаряд") Тогда
			СтруктураПоиска.Вставить("ЕдиницаИзмерения");
			СтруктураПоиска.Вставить("СтавкаНДС");
		КонецЕсли;
		
		Для Каждого ТекущаяСтрока Из Товары Цикл
			
			// Найдем коды маркировки для строки
			ЗаполнитьЗначенияСвойств(СтруктураПоиска, ТекущаяСтрока);
			НайденныеСтроки = ТаблицаКодовМаркировок.НайтиСтроки(СтруктураПоиска);
			МассивУдалить = Новый Массив;
			КоличествоМарок = 0;
			КоличествоТовара = ТекущаяСтрока.Количество * ТекущаяСтрока.Коэффициент;
			
			// Заполним по текущей строки
			Для Каждого ТекущаяМаркировка Из НайденныеСтроки Цикл
				КоличествоМарок = КоличествоМарок + 1;
				НоваяСтрока = КодыМаркировки.Добавить();
				НоваяСтрока.ИдентификаторТовара = ТекущаяСтрока.ИдентификаторТовара;
				НоваяСтрока.КодМаркировки = ТекущаяМаркировка.КодМаркировки;
				МассивУдалить.Добавить(ТекущаяМаркировка);
				Если КоличествоТовара = КоличествоМарок Тогда
					Прервать;
				КонецЕсли;
			КонецЦикла;
			
			// Уберем из рассмотрения ранее указанные марки
			Для Каждого ТекущаяМаркировка Из МассивУдалить Цикл
				ТаблицаКодовМаркировок.Удалить(ТекущаяМаркировка);
			КонецЦикла;
			
		КонецЦикла;
		
	КонецЕсли;    
	
	//Иванченко 20250422 ++   
	Если ТипЗнч(Основание) = Тип("ДокументСсылка.ОтчетКомитенту") И Основание.ХозОперация = Справочники.ХозОперации.ОтчетАгента Тогда  		
		МассивВознаграждение = Основание.Товары.ВыгрузитьКолонку("Вознаграждение");  
		Товары.ЗагрузитьКолонку(МассивВознаграждение, "Цена");
		Товары.ЗагрузитьКолонку(МассивВознаграждение, "Сумма");   
		//Иванченко 20250422 ++  
		Товары.ЗагрузитьКолонку(МассивВознаграждение, "СуммаВсегоДоКорректировки"); 
		Товары.ЗагрузитьКолонку(МассивВознаграждение, "СуммаВсегоПоДокументуРеализации"); 
		//Иванченко 20250422 --	
		Товары.ЗагрузитьКолонку(МассивВознаграждение, "СуммаВсего"); 
		
		Для каждого Строка Из Товары Цикл  
			//Иванченко 20250422 ++  		
			Строка.КоличествоДоКорректировки = 1;
			Строка.КоличествоПоДокументуРеализации = 1; 
			//Иванченко 20250422 --		
			Строка.Количество = 1;	
			Строка.СуммаНДС = Окр((Строка.СуммаВсего * Строка.СтавкаНДС.Ставка)/(100+Строка.СтавкаНДС.Ставка),2)
		КонецЦикла;		
		
	КонецЕсли;
	//Иванченко 20250422 --	
  	
	ТекущаяВалютаДокумента=ВалютаДокумента;
	ТекущийКурсДокумента=КурсДокумента;
	
	ИдентификаторГосударственногоКонтракта = ?(ЗначениеЗаполнено(ИдентификаторГосударственногоКонтракта),
		ИдентификаторГосударственногоКонтракта,
		ДоговорВзаиморасчетов.ИдентификаторГосударственногоКонтракта);
	
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	Если НЕ дкПриКопировании(ЭтотОбъект, ОбъектКопирования) Тогда Возврат; КонецЕсли;
	КодыМаркировки.Очистить();
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ТипЗнч(Сделка)<>Тип("ДокументСсылка.ЗаказНаряд") Тогда
		Если Работы.Количество()>0 Тогда
			Работы.Очистить();
		КонецЕсли; 
	КонецЕсли; 
	
	//Бондаренко++ 20251016
	Если СкладКомпании.Организация <> Организация Тогда
		СМГ_Сообщить("ОШИБКА! Организация Склада компании '"+СокрЛП(СкладКомпании)+"' равна '"+СокрЛП(СкладКомпании.Организация)+
		"' и не соответствует Организации документа, равной '"+СокрЛП(Организация)+"'",СтатусСообщения.ОченьВажное);
		Отказ = Истина;	
	КонецЕсли;
	//Бондаренко-- 20251016
	
	// проверим хоз. операции
	// составим список документов движений
	Если ХозОперация = Справочники.ХозОперации.КорректировкаРеализацииКорректировкаПоСогласованиюСторон Тогда		
		// заполним значение до корректировки
		Для Каждого стрТовары Из Товары Цикл
			стрТовары.КоличествоДоКорректировки = стрТовары.КоличествоПоДокументуРеализации;
			стрТовары.СуммаВсегоДоКорректировки = стрТовары.СуммаВсегоПоДокументуРеализации;
			стрТовары.СуммаНДСДоКорректировки   = стрТовары.СуммаНДСПоДокументуРеализации;
		КонецЦикла;
		
		Для Каждого стрРаботы Из Работы Цикл
			стрРаботы.КоличествоДоКорректировки = стрРаботы.КоличествоПоДокументуРеализации;
			стрРаботы.СуммаВсегоДоКорректировки = стрРаботы.СуммаВсегоПоДокументуРеализации;
			стрРаботы.СуммаНДСДоКорректировки   = стрРаботы.СуммаНДСПоДокументуРеализации;
		КонецЦикла;
		
	ИначеЕсли ХозОперация = Справочники.ХозОперации.КорректировкаРеализацииИсправлениеВПервичныхДокументах Тогда
		
		// проверим введенные на основании корректировки
		МассивВидов = Новый Массив(1); 
		МассивВидов[0] = "КорректировкаРеализации";
		МассивПодчиненных = дкПолучитьМассивПодчиненных(ДокументОснование, МассивВидов, Истина);
		
		ЕстьКорректировка = Ложь;
		
		Если НЕ обЗначениеНеЗаполнено(МассивПодчиненных) И МассивПодчиненных.Количество()>0 Тогда
			Для Каждого Корректировка Из МассивПодчиненных Цикл
				Если НЕ Корректировка.Ссылка = Ссылка
					И НЕ Корректировка.ХозОперация = Справочники.ХозОперации.КорректировкаРеализацииКорректировкаПоСогласованиюСторон Тогда
					ЕстьКорректировка = Истина;
					Прервать;
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
		
		Если ЕстьКорректировка Тогда
			Сообщить("К документу """+Строка(ДокументОснование)+""" введено больше одного корректировочного документа с хоз. операцей ""Исправление первичных документов"". 
					|Каждую последующую корректировку следует вводить на основании предыдущей.");
			Отказ = Истина;
		КонецЕсли;
		
		
	КонецЕсли;
	
	ДополнительныеСвойства.Вставить("ДоговорВзаиморасчетовБыл");
	ДополнительныеСвойства.Вставить("СкладКомпанииБыл");
	ДополнительныеСвойства.Вставить("ЗаказБыл");
	ДополнительныеСвойства.Вставить("МоментВремениБыл");
	
	Если НЕ дкПередЗаписью(ЭтотОбъект, Отказ, РежимЗаписи, РежимПроведения) Тогда Возврат; КонецЕсли;
	
	// получим старые значения, влияющие на границы последовательности
	Если НЕ Отказ И Проведен И РежимЗаписи=РежимЗаписиДокумента.Проведение Тогда
		
		БылиДвижения = Ложь;
		Запрос = Новый Запрос();
		Запрос.УстановитьПараметр("Ссылка",Ссылка);
		
		// взаиморасчеты
		Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ ДоговорВзаиморасчетов ИЗ РегистрНакопления.ВзаиморасчетыКомпании ГДЕ Регистратор=&Ссылка";
		Результат = Запрос.Выполнить();
		Если НЕ Результат.Пустой() Тогда
			БылиДвижения = Истина;
			ДополнительныеСвойства.Вставить("ДоговорВзаиморасчетовБыл", Результат.Выгрузить().ВыгрузитьКолонку("ДоговорВзаиморасчетов"));
		КонецЕсли;
		
		// партии
		Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ СкладКомпании ИЗ РегистрНакопления.ПартииТоваровКомпании ГДЕ Регистратор=&Ссылка";
		Результат = Запрос.Выполнить();
		Если НЕ Результат.Пустой() Тогда
			БылиДвижения = Истина;
			ДополнительныеСвойства.Вставить("СкладКомпанииБыл", Результат.Выгрузить().ВыгрузитьКолонку("СкладКомпании"));
		КонецЕсли;
		
		// Заказы
		Запрос.Текст  = "ВЫБРАТЬ РАЗЛИЧНЫЕ
		                      |	Заказы.Заказ КАК Заказ
		                      |ИЗ
		                      |	(ВЫБРАТЬ
		                      |		ЗаказыПокупателей.Заказ КАК Заказ
		                      |	ИЗ
		                      |		РегистрНакопления.ЗаказыПокупателей КАК ЗаказыПокупателей
		                      |	ГДЕ
		                      |		ЗаказыПокупателей.Регистратор = &Ссылка
		                      |	
		                      |	ОБЪЕДИНИТЬ
		                      |	
		                      |	ВЫБРАТЬ
		                      |		ЗаказыРаспределение.ЗаказПокупателя
		                      |	ИЗ
		                      |		РегистрНакопления.ЗаказыРаспределение КАК ЗаказыРаспределение
		                      |	ГДЕ
		                      |		ЗаказыРаспределение.Регистратор = &Ссылка
		                      |	
		                      |	ОБЪЕДИНИТЬ
		                      |	
		                      |	ВЫБРАТЬ
		                      |		ЗаказыРаспределение.ЗаказПоставщика
		                      |	ИЗ
		                      |		РегистрНакопления.ЗаказыРаспределение КАК ЗаказыРаспределение
		                      |	ГДЕ
		                      |		ЗаказыРаспределение.Регистратор = &Ссылка) КАК Заказы";
		Результат = Запрос.Выполнить();
		Если НЕ Результат.Пустой() Тогда
			БылиДвижения = Истина;
			ДополнительныеСвойства.Вставить("ЗаказБыл", Результат.Выгрузить().ВыгрузитьКолонку("Заказ"));
		КонецЕсли;
		
		// прошлый момент времени
		Если БылиДвижения Тогда
			Запрос.Текст = "ВЫБРАТЬ МоментВремени ИЗ Документ."+Метаданные().Имя+" ГДЕ Ссылка=&Ссылка";
			ДополнительныеСвойства.Вставить("МоментВремениБыл",Запрос.Выполнить().Выгрузить().Получить(0).МоментВремени);
		КонецЕсли;
	КонецЕсли;
	
	РассчитатьСуммуВсего();    
	//Иванченко 20250619 ++    
	КонтролируемыеРеквизиты = Новый Структура();  
	
	КонтролируемыеРеквизитыШапки = Новый Структура();
	КонтролируемыеРеквизитыШапки.Вставить("СкладКомпании", Ложь);
	
	КонтролируемыеРеквизиты.Вставить("КонтролируемыеРеквизитыШапки",КонтролируемыеРеквизитыШапки);	
	
	//Иванченко 20250804 ++
	////Иванченко 20250619 ++
	////Отказ = дкПроверитьКорректностьПоОрганизации(ЭтотОбъект,КонтролируемыеРеквизиты, "");  
	//Отказ = НЕ дкПроверитьКорректностьПоОрганизации(ЭтотОбъект,КонтролируемыеРеквизиты, "");
	//  //Иванченко 20250626 ++
	//  //Отказ = дкПроверитьКорректностьПоОрганизации(ЭтотОбъект,КонтролируемыеРеквизиты, "");  
	//  Отказ = НЕ дкПроверитьКорректностьПоОрганизации(ЭтотОбъект,КонтролируемыеРеквизиты, "");
	//  //Иванченко 20250619 --  
	////Иванченко 20250619 --
	Если НЕ (ДокументОснование.ХозОперация = Справочники.ХозОперации.АктОбОказанииУслуг ИЛИ ТипЗнч(ДокументОснование) = Тип("ДокументСсылка.ОтчетКомитенту")) Тогда  
		Отказ = НЕ дкПроверитьКорректностьПоОрганизации(ЭтотОбъект,КонтролируемыеРеквизиты, "");
	КонецЕсли;
	//Иванченко 20250804 --	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	Если НЕ дкПриЗаписи(ЭтотОбъект, Отказ) Тогда Возврат; КонецЕсли; 
	
	//Иванченко 20241129 ++  
	СМ_ПриЗаписи();
	//Иванченко 20241129 --	
	
КонецПроцедуры   

//Иванченко 20241129 ++ 
Процедура СМ_ПриЗаписи()
	Если ЭтотОбъект.ОбменДанными.Загрузка Тогда
		Возврат;
 	КонецЕсли;
	
	СФ_выданный = Неопределено;
	
	Если ТипЗнч(ДокументОснование) = Тип("ДокументСсылка.РеализацияТоваров") И ЗначениеЗаполнено(ДокументОснование.СуммаНДС) Тогда
		СФ_выданный = Документы.СчетФактураВыданный.СоздатьДокумент(); 
		СФ_выданный.Комментарий = "Автоматически создан "+СокрЛП(ТекущаяДата());
 	КонецЕсли;
 	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	СчетФактураВыданный.Ссылка КАК СФ,
	|	СчетФактураВыданный.ДокументОснование,
	|	СчетФактураВыданный.Проведен
	|ИЗ
	|	Документ.СчетФактураВыданный КАК СчетФактураВыданный
	|ГДЕ
	|	СчетФактураВыданный.ДокументОснование = &ДокументОснование";
	
	Запрос.УстановитьПараметр("ДокументОснование", ЭтотОбъект.Ссылка);
 	 
 	Результат = Запрос.Выполнить();		
	ВыборкаДетальныеЗаписи = Результат.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		СФ_выданный = ВыборкаДетальныеЗаписи.СФ.ПолучитьОбъект();
		Если СФ_выданный.ДоговорВзаиморасчетов <> ЭтотОбъект.ДоговорВзаиморасчетов Тогда
			Попытка
				СФ_выданный.Контрагент = ЭтотОбъект.Контрагент;
				СФ_выданный.ДоговорВзаиморасчетов = ЭтотОбъект.ДоговорВзаиморасчетов;
				СФ_выданный.Грузополучатель = ЭтотОбъект.Контрагент;
				СФ_выданный.Записать(РежимЗаписиДокумента.Запись);
			Исключение
	 		КонецПопытки;
		КонецЕсли;            
  		Прервать;
	КонецЦикла; 
	
	Если СФ_выданный = Неопределено Тогда
		Возврат;
 	КонецЕсли;
 	
	СФ_выданный.Заполнить(ЭтотОбъект.Ссылка);
 	СФ_выданный.Дата = ЭтотОбъект.Дата;      
	 	
	ФлЭтотОбъектПроведен = ЭтотОбъект.Проведен;
	ФлЭтотОбъектПометкаУдаления = ЭтотОбъект.ПометкаУдаления;
	
	СФ_выданный.Проведен = ФлЭтотОбъектПроведен;			
	СФ_выданный.ПометкаУдаления = ФлЭтотОбъектПометкаУдаления;
	
	Если ФлЭтотОбъектПометкаУдаления Тогда               
		СФ_выданный.Записать(РежимЗаписиДокумента.Запись); 
	ИначеЕсли ФлЭтотОбъектПроведен Тогда
		СФ_выданный.Записать(РежимЗаписиДокумента.Проведение); 					
	Иначе
		СФ_выданный.Записать(РежимЗаписиДокумента.ОтменаПроведения); 					 
	КонецЕсли;
	
КонецПроцедуры	
//Иванченко 20241129 --

Процедура ПередУдалением(Отказ)
	Если НЕ дкПередУдалением(ЭтотОбъект, Отказ) Тогда Возврат; КонецЕсли;
КонецПроцедуры

Процедура ОбработкаУдаленияПроведения(Отказ)
	Если НЕ дкОбработкаУдаленияПроведения(ЭтотОбъект, Отказ) Тогда Возврат; КонецЕсли;
	
	//Удалим накопление сумм
	НаборЗаписейНакоплениеСумм=РегистрыСведений.НакоплениеСумм.СоздатьНаборЗаписей();
	НаборЗаписейНакоплениеСумм.ДокументОбъект=ЭтотОбъект;
	НаборЗаписейНакоплениеСумм.ОтменаПроведения();
	
	// Удалим введенные в оборот коды маркировки
	НаборЗаписейСостоянияКодовМаркировки = РегистрыСведений.СостоянияКодовМаркировки.СоздатьНаборЗаписей();
	НаборЗаписейСостоянияКодовМаркировки.ДокументОбъект = ЭтотОбъект;
	НаборЗаписейСостоянияКодовМаркировки.ОтменаПроведения();
	
КонецПроцедуры

// Получаем таблицу товаров которые надо оприходовать на остатки
//
// Возвращаемое значение:
//  ТаблицаТоваров - таблица значений.
//
Функция ПолучитьТаблицуТоваровВозврат()
	// Нам фактически надо сформировать таблицу товаров которые были проданы, что бы их заново оприходовать
	// Все из-за автоматического списания характеристик
	ЗапросСписание=Новый Запрос("
	|ВЫБРАТЬ
	|	ДокументТовары.Номенклатура КАК Номенклатура
	|ПОМЕСТИТЬ ТаблицаНоменклатуры
	|ИЗ
	|	Документ.КорректировкаРеализации.Товары КАК ДокументТовары
	|ГДЕ
	|	ДокументТовары.Ссылка=&Ссылка
	|	И ДокументТовары.Номенклатура.ВидНоменклатуры <> ЗНАЧЕНИЕ(Перечисление.ВидыНоменклатуры.Услуга)
	|	И ДокументТовары.КоличествоРазница < 0
	|;
	|
	|ВЫБРАТЬ
	|	ОстаткиТоваровКомпании.Номенклатура КАК Номенклатура,
	|	ОстаткиТоваровКомпании.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	|	ОстаткиТоваровКомпании.Регистратор КАК ДокументПродажи,
	|	ОстаткиТоваровКомпании.Количество КАК Количество
	|ИЗ
	|	РегистрНакопления.ОстаткиТоваровКомпании КАК ОстаткиТоваровКомпании
	|ГДЕ
	|	ОстаткиТоваровКомпании.Регистратор В (&ДокументПродажи)
	|	И ОстаткиТоваровКомпании.Номенклатура В (
	|		ВЫБРАТЬ Номенклатура
	|		ИЗ ТаблицаНоменклатуры
	|	)
	|	И ОстаткиТоваровКомпании.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|ДЛЯ ИЗМЕНЕНИЯ РегистрНакопления.ОстаткиТоваровКомпании
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ТоварыВПроизводстве.Номенклатура КАК Номенклатура,
	|	ТоварыВПроизводстве.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	|	ТоварыВПроизводстве.Регистратор КАК ДокументПродажи,
	|	ТоварыВПроизводстве.Количество КАК Количество
	|ИЗ
	|	РегистрНакопления.ТоварыВПроизводстве КАК ТоварыВПроизводстве
	|ГДЕ
	|	ТоварыВПроизводстве.Регистратор В (&ДокументПродажи)
	|	И ТоварыВПроизводстве.Номенклатура В (
	|		ВЫБРАТЬ Номенклатура
	|		ИЗ ТаблицаНоменклатуры
	|	)
	|	И ТоварыВПроизводстве.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|ДЛЯ ИЗМЕНЕНИЯ РегистрНакопления.ТоварыВПроизводстве
	|
	//|УПОРЯДОЧИТЬ ПО
	//|	ОстаткиТоваровКомпании.НомерСтроки Убыв,
	//|	ТоварыВПроизводстве.НомерСтроки Убыв
	|");
	ЗапросСписание.УстановитьПараметр("Ссылка",Ссылка);
	СписокДокументовОснований=Новый СписокЗначений;
	Основание=ДокументОснование;
	Пока НЕ обЗначениеНеЗаполнено(Основание) Цикл
		СписокДокументовОснований.Добавить(Основание);
		Основание=Основание.ДокументОснование;
	КонецЦикла; 
	ЗапросСписание.УстановитьПараметр("ДокументПродажи",СписокДокументовОснований);
	ТаблицаСписания=ЗапросСписание.Выполнить().Выгрузить();
	ТаблицаСписания.Свернуть("Номенклатура,ХарактеристикаНоменклатуры,ДокументПродажи","Количество");
	// Получим таблицу документа
	ЗапросТоваров=Новый Запрос("
	|ВЫБРАТЬ
	|	ДокументТовары.Номенклатура КАК Номенклатура,
	|	ДокументТовары.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	|	ДокументТовары.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	-ДокументТовары.КоличествоРазница*ДокументТовары.Коэффициент КАК Количество,
	|	ДокументТовары.Цена КАК Цена
	|ИЗ
	|	Документ.КорректировкаРеализации.Товары КАК ДокументТовары
	|ГДЕ
	|	ДокументТовары.Ссылка=&Ссылка
	|	И ДокументТовары.Номенклатура.ВидНоменклатуры <> ЗНАЧЕНИЕ(Перечисление.ВидыНоменклатуры.Услуга)
	|	И ДокументТовары.КоличествоРазница < 0
	|");
	ЗапросТоваров.УстановитьПараметр("Ссылка",Ссылка);
	//ТаблицаДокумента=Товары.Выгрузить();
	ТаблицаДокумента=ЗапросТоваров.Выполнить().Выгрузить();
	ТаблицаДокумента.Свернуть("Номенклатура,ХарактеристикаНоменклатуры,ЕдиницаИзмерения","Количество,Цена");
	ТаблицаДокумента.Сортировать("Номенклатура Возр,ХарактеристикаНоменклатуры Убыв");
	
	// Создадим и заполним таблицу товаров
	ТаблицаТоваров=Новый ТаблицаЗначений();
	ТаблицаТоваров.Колонки.Добавить("Номенклатура");
	ТаблицаТоваров.Колонки.Добавить("ХарактеристикаНоменклатуры");
	ТаблицаТоваров.Колонки.Добавить("СкладКомпании");
	ТаблицаТоваров.Колонки.Добавить("Количество");
	ТаблицаТоваров.Колонки.Добавить("Резерв");
	ТаблицаТоваров.Колонки.Добавить("ЦенаРозничная");
	
	ТаблицаРучныхХарактеристик = дкПолучитьНоменклатуруСРучнымСписаниемХарактеристик(Ссылка);
	Розничный = СкладКомпании.Розничный;
	
	Для Каждого СтрокаТовар Из ТаблицаДокумента Цикл
		Если СтрокаТовар.Номенклатура.ВидНоменклатуры=Перечисления.ВидыНоменклатуры.Услуга Тогда
			Продолжить;
		КонецЕсли; 
		СтуктураОтбора=Новый Структура("Номенклатура",СтрокаТовар.Номенклатура);
		Если НЕ обЗначениеНеЗаполнено(СтрокаТовар.ХарактеристикаНоменклатуры) ИЛИ (ТаблицаРучныхХарактеристик<>Неопределено И ТаблицаРучныхХарактеристик.Найти(СтрокаТовар.Номенклатура,"Номенклатура")<>Неопределено) Тогда
			СтуктураОтбора.Вставить("ХарактеристикаНоменклатуры",СтрокаТовар.ХарактеристикаНоменклатуры);
		КонецЕсли;
		МассивНайденныхСтрок = ТаблицаСписания.НайтиСтроки(СтуктураОтбора);
		НадоВернуть    = СтрокаТовар.Количество;
		Для Сч=0 по МассивНайденныхСтрок.ВГраница() Цикл
			
			ТекСтрока = МассивНайденныхСтрок[Сч];
			КоличествоКПоступлению = Мин(НадоВернуть, ТекСтрока.Количество);
			
			НоваяСтрока=ТаблицаТоваров.Добавить();
			НоваяСтрока.Номенклатура               = ТекСтрока.Номенклатура;
			НоваяСтрока.ХарактеристикаНоменклатуры = ТекСтрока.ХарактеристикаНоменклатуры;
			НоваяСтрока.СкладКомпании              = СкладКомпании;
			НоваяСтрока.Количество                 = КоличествоКПоступлению;
			НоваяСтрока.Резерв                     = 0;
			НоваяСтрока.ЦенаРозничная = 0;
			
			Если ТекСтрока.Количество > НадоВернуть Тогда
				ТекСтрока.Количество = ТекСтрока.Количество - НадоВернуть;
			Иначе
				// Удалим ненужную строку
				ТаблицаСписания.Удалить(ТекСтрока);
			КонецЕсли;
			
			НадоВернуть = НадоВернуть - КоличествоКПоступлению;
			Если НадоВернуть<=0 Тогда
				Прервать;
			КонецЕсли;
		КонецЦикла;
		// Может еще что-то осталось
		Если НадоВернуть>0 Тогда
			НоваяСтрока=ТаблицаТоваров.Добавить();
			НоваяСтрока.Номенклатура               = СтрокаТовар.Номенклатура;
			НоваяСтрока.ХарактеристикаНоменклатуры = СтрокаТовар.ХарактеристикаНоменклатуры;
			НоваяСтрока.СкладКомпании              = СкладКомпании;
			НоваяСтрока.Количество                 = НадоВернуть;
			НоваяСтрока.Резерв                     = 0;
			НоваяСтрока.ЦенаРозничная  = 0;
		КонецЕсли;
	КонецЦикла;
	ТаблицаТоваров.Свернуть("Номенклатура,ХарактеристикаНоменклатуры,СкладКомпании,ЦенаРозничная","Количество, Резерв");
	
	Возврат ТаблицаТоваров;
КонецФункции // ПолучитьТаблицуТоваров()

Процедура ОбработкаПроведения(Отказ, Режим)  
	
	Если НЕ дкОбработкаПроведения(ЭтотОбъект, Отказ, Режим) Тогда Возврат; КонецЕсли;
	
	ВедетсяБалансПоПодразделению=(Константы.СпособВеденияБаланса.Получить()=Перечисления.СпособВеденияБаланса.ПоПодразделению);
	
	СуммаРазногласий=Товары.Итог("СуммаВсегоРазница")+Работы.Итог("СуммаВсегоРазница");
	
	Если Сделка.ХозОперация <> Справочники.ХозОперации.РеализацияТоваровКомиссия Тогда
		Если СуммаРазногласий<>0 Тогда
			НаборЗаписейВзаиморасчеты=Движения.ВзаиморасчетыКомпании;
			НаборЗаписейВзаиморасчеты.ДокументОбъект=ЭтотОбъект;
			НаборЗаписейВзаиморасчеты.РежимПроведения=Режим;
			НаборЗаписейВзаиморасчеты.Контрагент=Контрагент;
			НаборЗаписейВзаиморасчеты.ДоговорВзаиморасчетов=ДоговорВзаиморасчетов;
			НаборЗаписейВзаиморасчеты.Сделка=Сделка;
			НаборЗаписейВзаиморасчеты.ВзаиморасчетыСПокупателем=Истина;
			НаборЗаписейВзаиморасчеты.АвтоЗакрытиеСделок=АвтоЗакрытиеСделок;
			НаборЗаписейВзаиморасчеты.СуммаДоходаРасходаСуммовыхРазниц=0;
			НаборЗаписейВзаиморасчеты.СписатьНераспределеннуюСуммуПоСделке=Истина;
			НаборЗаписейВзаиморасчеты.РежимКорректировки = Истина;
			Если СуммаРазногласий > 0 Тогда
				НаборЗаписейВзаиморасчеты.Сумма=СуммаРазногласий;
				Отказ = НЕ НаборЗаписейВзаиморасчеты.Приход() ИЛИ Отказ;
			Иначе
				НаборЗаписейВзаиморасчеты.Сумма=-СуммаРазногласий;
				Отказ = НЕ НаборЗаписейВзаиморасчеты.Расход() ИЛИ Отказ;
			КонецЕсли;
			// Доходы и расходы по суммовым разницам
			СуммаДоходаРасходаСуммовыхРазниц=НаборЗаписейВзаиморасчеты.СуммаДоходаРасходаСуммовыхРазниц;
			Если СуммаДоходаРасходаСуммовыхРазниц<>0 Тогда
				НаборЗаписейДиР = Движения.ДоходыИРасходы;
				НаборЗаписейДиР.ДокументОбъект = ЭтотОбъект;
				// В случае если ведется баланс по подразделению передадим подразделение соответствующее корреспонденции
				Если ВедетсяБалансПоПодразделению Тогда
					НаборЗаписейДиР.Подразделение  = ДоговорВзаиморасчетов.Подразделение;
				КонецЕсли;
				НаборЗаписейДиР.СтатьяДоходовИРасходов = Справочники.СтатьиДоходовИРасходов.СуммовыеРазницы;
				НаборЗаписейДиР.ВУпрВалюте = Истина;
				Если СуммаДоходаРасходаСуммовыхРазниц<0 Тогда
					НаборЗаписейДиР.Расход = -СуммаДоходаРасходаСуммовыхРазниц;
				Иначе
					НаборЗаписейДиР.Доход = СуммаДоходаРасходаСуммовыхРазниц;
				КонецЕсли;
				Отказ = НЕ НаборЗаписейДиР.Приход() ИЛИ Отказ;
			КонецЕсли;
		КонецЕсли; 
	КонецЕсли;
	//Закрываем заказы покупателя по FIFO
	ТекстЗапроса="
	|ВЫБРАТЬ
	|	ДокументТовары.Номенклатура КАК Номенклатура,
	|	ДокументТовары.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	|	ДокументТовары.КоличествоРазница*ДокументТовары.Коэффициент КАК Количество,
	|	ДокументТовары.Цена КАК ЦенаРозничная,
	|	0 КАК Резерв,
	|	ДокументТовары.СуммаВсегоРазница КАК Сумма
	|ИЗ
	|	Документ.КорректировкаРеализации.Товары КАК ДокументТовары
	|ГДЕ
	|	ДокументТовары.Ссылка=&Ссылка
	|	И ДокументТовары.Номенклатура.ВидНоменклатуры <> ЗНАЧЕНИЕ(Перечисление.ВидыНоменклатуры.Услуга)
	|	И ДокументТовары.КоличествоРазница > 0
	|";
	Запрос=Новый Запрос(ТекстЗапроса);
	Запрос.УстановитьПараметр("Ссылка",Ссылка);
	//Закрываем заказы
	НаборЗаписейЗаказыПокупателей = Движения.ЗаказыПокупателей;
	НаборЗаписейЗаказыПокупателей.РежимПроведения = Режим;
	НаборЗаписейЗаказыПокупателей.ДокументОбъект = ЭтотОбъект;
	НаборЗаписейЗаказыПокупателей.РезультатЗапросаПоТоварам = Запрос.Выполнить();
	НаборЗаписейЗаказыПокупателей.Контрагент = Контрагент;
	НаборЗаписейЗаказыПокупателей.Заказ = Неопределено;
	НаборЗаписейЗаказыПокупателей.СкладКомпании = СкладКомпании;
	НаборЗаписейЗаказыПокупателей.Заказывать = Истина;
	НаборЗаписейЗаказыПокупателей.Резервировать = Истина;
	НаборЗаписейЗаказыПокупателей.ПоБазовомуКоличеству=Истина;
	Отказ=НЕ НаборЗаписейЗаказыПокупателей.ЗакрытиеЗаказовПокупателя() ИЛИ Отказ;
	//Если было списание резервов то таблица товаров содержит списанные резервы
	РезультатЗапросаПоТоварам=НаборЗаписейЗаказыПокупателей.РезультатЗапросаПоТоварам;

	//Снимаем распределение заказов покупателя
	РезультатЗакрытияЗаказов=НаборЗаписейЗаказыПокупателей.Выгрузить();
	КолонкаКоличества=РезультатЗакрытияЗаказов.Колонки.Найти("Заказано");
	КолонкаКоличества.Имя="Количество"; КолонкаКоличества.Заголовок="Количество";
	РезультатЗакрытияЗаказов.Свернуть("Заказ,Контрагент,Номенклатура,ХарактеристикаНоменклатуры","Количество,Резерв");
	Для каждого СтрокаЗаказа Из РезультатЗакрытияЗаказов Цикл
		СтрокаЗаказа.Количество=-(СтрокаЗаказа.Количество-СтрокаЗаказа.Резерв);
	КонецЦикла; 
	НаборЗаписейРаспределениеЗаказов = Движения.ЗаказыРаспределение;
	НаборЗаписейРаспределениеЗаказов.РежимПроведения = Режим;
	НаборЗаписейРаспределениеЗаказов.ДокументОбъект = ЭтотОбъект;
	НаборЗаписейРаспределениеЗаказов.РезультатЗапросаПоТоварам = РезультатЗакрытияЗаказов;
	НаборЗаписейРаспределениеЗаказов.ЗаказПокупателя = "Заказ";
	НаборЗаписейРаспределениеЗаказов.ЗаказПоставщика = Неопределено;
	НаборЗаписейРаспределениеЗаказов.Контрагент = Контрагент;
	НаборЗаписейРаспределениеЗаказов.ПоБазовомуКоличеству=Истина;
	Отказ=НЕ НаборЗаписейРаспределениеЗаказов.КорректировкаРаспределения() ИЛИ Отказ;
	
	// Проведем остатки товаров (расход)
	НаборЗаписейОстатки=Движения.ОстаткиТоваровКомпании;
	НаборЗаписейОстатки.РежимПроведения=Режим;
	НаборЗаписейОстатки.ДокументОбъект=ЭтотОбъект;
	НаборЗаписейОстатки.РезультатЗапросаПоТоварам=РезультатЗапросаПоТоварам;
	НаборЗаписейОстатки.СкладКомпании=СкладКомпании;
	НаборЗаписейОстатки.Приходовать=Истина;
	НаборЗаписейОстатки.Контрагент=Контрагент;
	НаборЗаписейОстатки.ПоБазовомуКоличеству=Истина;
	НаборЗаписейОстатки.ДвиженияПоРознице=СкладКомпании.Розничный;
	НаборЗаписейОстатки.ИмяРеквизитаЦенаРозничная="Цена";
	НаборЗаписейОстатки.Резервировать=РезультатЗапросаПоТоварам<>Неопределено;
	Отказ=НЕ НаборЗаписейОстатки.Расход() ИЛИ Отказ;
	Если Отказ Тогда
		// Выведем сообщения об ошибках и предупреждениях
		дкВыводРезультатовОбработки(ЭтотОбъект,Отказ);
		Возврат; // Дальше смысла не имеет
	КонецЕсли;
	
	// Проведем остатки товаров (возврат)
	НаборЗаписейОстатки=Движения.ОстаткиТоваровКомпании;
	НаборЗаписейОстатки.ДокументОбъект=ЭтотОбъект;
	НаборЗаписейОстатки.СкладКомпании=СкладКомпании;
	НаборЗаписейОстатки.РезультатЗапросаПоТоварам=ПолучитьТаблицуТоваровВозврат();
	НаборЗаписейОстатки.ПоБазовомуКоличеству=Истина;
	НаборЗаписейОстатки.Контрагент=Контрагент;
	НаборЗаписейОстатки.ДвиженияПоРознице=Ложь;
	НаборЗаписейОстатки.РазрешитьПереоценку = Ложь;
	Отказ=НЕ НаборЗаписейОстатки.Приход() ИЛИ Отказ;
	
	// Проведем партии товаров                               
 	Отказ = НЕ ПровестиПоПартиям(Режим,Ссылка) ИЛИ Отказ;
	
	
	
	Если НЕ Отказ Тогда
		//Сформируем сумму накопления
		КоличествоНоменклатуры=Товары.Итог("КоличествоРазница");
		Если КоличествоНоменклатуры<>0 Тогда
			НаборЗаписейНакоплениеСумм=РегистрыСведений.НакоплениеСумм.СоздатьНаборЗаписей();
			НаборЗаписейНакоплениеСумм.ДокументОбъект=ЭтотОбъект;
			НаборЗаписейНакоплениеСумм.Контрагент=Контрагент;
			НаборЗаписейНакоплениеСумм.КоличествоНоменклатуры=КоличествоНоменклатуры;
			НаборЗаписейНакоплениеСумм.Карточка=Карточка;
			НаборЗаписейНакоплениеСумм.Сторно=Ложь;
			Отказ=НЕ НаборЗаписейНакоплениеСумм.НакоплениеСуммы() ИЛИ Отказ;
		КонецЕсли; 
	КонецЕсли;
	
	// Запишим коды маркировки
	Если НЕ Отказ Тогда
		
		// Отменим записи состояний документа
		НаборЗаписейСостоянияКодовМаркировки = РегистрыСведений.СостоянияКодовМаркировки.СоздатьНаборЗаписей();
		НаборЗаписейСостоянияКодовМаркировки.ДокументОбъект = ЭтотОбъект;
		НаборЗаписейСостоянияКодовМаркировки.ОтменаПроведения();
		
		ТаблицаМаркировки = НаборЗаписейСостоянияКодовМаркировки.ТаблицаКодовМаркировки();
		
		ТаблицаМаркировки.Колонки.Добавить("GTIN", Новый ОписаниеТипов("Строка",, Новый КвалификаторыСтроки(50)));
		ТаблицаМаркировки.Колонки.Добавить("СерийныйНомер", Новый ОписаниеТипов("Строка",, Новый КвалификаторыСтроки(50)));
		
		ОбъектШК = Обработки.ШтрихКоды.Создать();
		
		// Разберем маркировку на состовляющие для поиска
		Для Каждого ТекущийКодМаркировки Из ТаблицаМаркировки Цикл
			
			Если НЕ ЗначениеЗаполнено(ТекущийКодМаркировки.КодМаркировки) Тогда
				Продолжить;
			КонецЕсли;
			
			СтруктураМаркировки = ОбъектШК.РазобратьСтрокуШтрихкодаGS1(ТекущийКодМаркировки.КодМаркировки);
			
			Если НЕ СтруктураМаркировки.Разобран Тогда
				Продолжить;
			КонецЕсли;
			
			ТекущийКодМаркировки.GTIN = СтруктураМаркировки.ДанныеШтрихкода["01"].Значение;
			ТекущийКодМаркировки.СерийныйНомер = СтруктураМаркировки.ДанныеШтрихкода["21"].Значение;
			
		КонецЦикла;
		
		ТекущиеСтатусыМаркировки = РегистрыСведений.СостоянияКодовМаркировки.ТекущиеСтатусыКодовМаркировки(ТаблицаМаркировки, МоментВремени());
		
		// Проверим коды на выбытие
		СостоянияВОбороте = Перечисления.СостоянияКодовМаркировки.СостоянияВводаВОборотМаркировки();
		
		// Коды Маркировок, которые надо вывести из оборота
		ТаблицаВывода = ТекущиеСтатусыМаркировки.СкопироватьКолонки();
		
		// Таблица маркирвки, которые необходимо вернуть
		ТаблицаВвода = ТекущиеСтатусыМаркировки.СкопироватьКолонки();
		ТаблицаНеПодтвержденных = ТекущиеСтатусыМаркировки.СкопироватьКолонки();
		
		Для Каждого ТекущаяСтрока Из ТекущиеСтатусыМаркировки Цикл
			СтрокаМаркировки = КодыМаркировки.Найти(ТекущаяСтрока.КодМаркировки, "КодМаркировки");
			СтрокаТоваров = Товары.Найти(СтрокаМаркировки.ИдентификаторТовара, "ИдентификаторТовара");
			ЭтоВозврат = СтрокаМаркировки.Возврат;
			Если СостоянияВОбороте.Найти(ТекущаяСтрока.Состояние) <> Неопределено И НЕ ЭтоВозврат Тогда
				НоваяСтрока = ТаблицаВывода.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрока, ТекущаяСтрока);
			ИначеЕсли СостоянияВОбороте.Найти(ТекущаяСтрока.Состояние) = Неопределено И ЭтоВозврат Тогда
				НоваяСтрока = ТаблицаВвода.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрока, ТекущаяСтрока);
			ИначеЕсли СтрокаТоваров <> Неопределено И НЕ СтрокаТоваров.Подтверждение Тогда
				НоваяСтрока = ТаблицаНеПодтвержденных.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрока, ТекущаяСтрока);
			КонецЕсли;
		КонецЦикла;
		
		// Для перемаркируемых поставим ссотояние выбытия из оборота
		ОчищатьЗаписи = Истина;
		УдалятьДвижения = Истина;
		НаборЗаписейСостоянияКодовМаркировки = РегистрыСведений.СостоянияКодовМаркировки.СоздатьНаборЗаписей();
		НаборЗаписейСостоянияКодовМаркировки.Организация = Организация;
		НаборЗаписейСостоянияКодовМаркировки.РежимПроведения = Режим;
		
		// Выведем указанную маркировку из оборота
		Если ТаблицаВывода.Количество() > 0 Тогда
			СостояниеКодаМаркировки = ?(Контрагент.ФормаСобственности = Перечисления.ФормыСобственности.ЧастноеЛицо,
				Перечисления.СостоянияКодовМаркировки.ВыведенИзОборотаРозничнаяПродажа,
				Перечисления.СостоянияКодовМаркировки.ПередачаДругомуСобственнику);
			НаборЗаписейСостоянияКодовМаркировки.ДокументОбъект = ЭтотОбъект;
			НаборЗаписейСостоянияКодовМаркировки.Состояние = СостояниеКодаМаркировки;
			НаборЗаписейСостоянияКодовМаркировки.РезультатЗапросаПоКодамМаркировки = ТаблицаВывода;
			Отказ = НЕ НаборЗаписейСостоянияКодовМаркировки.СостояниеКодовМаркировки() ИЛИ Отказ;
			ОчищатьЗаписи = Ложь;
			УдалятьДвижения = Ложь;
		КонецЕсли;
		
		// Введем в оборот возврат
		Если ТаблицаВвода.Количество() > 0 Тогда
			НаборЗаписейСостоянияКодовМаркировки.ДокументОбъект = ЭтотОбъект;
			НаборЗаписейСостоянияКодовМаркировки.Состояние = Перечисления.СостоянияКодовМаркировки.ВведенВОборотПриВозврате;
			НаборЗаписейСостоянияКодовМаркировки.РезультатЗапросаПоКодамМаркировки = ТаблицаВвода;
			НаборЗаписейСостоянияКодовМаркировки.ОчищатьЗаписи = ОчищатьЗаписи;
			НаборЗаписейСостоянияКодовМаркировки.УдалятьДвижения = УдалятьДвижения;
			Отказ = НЕ НаборЗаписейСостоянияКодовМаркировки.СостояниеКодовМаркировки() ИЛИ Отказ;
		КонецЕсли;
		
		// Для неподтверженных товаров с кодами сделаем в обороте
		Если ТаблицаНеПодтвержденных.Количество() > 0 Тогда
			НаборЗаписейСостоянияКодовМаркировки.ДокументОбъект = ЭтотОбъект;
			НаборЗаписейСостоянияКодовМаркировки.Состояние = Перечисления.СостоянияКодовМаркировки.ВведенВОборот;
			НаборЗаписейСостоянияКодовМаркировки.РезультатЗапросаПоКодамМаркировки = ТаблицаНеПодтвержденных;
			НаборЗаписейСостоянияКодовМаркировки.ОчищатьЗаписи = ОчищатьЗаписи;
			НаборЗаписейСостоянияКодовМаркировки.УдалятьДвижения = УдалятьДвижения;
			Если НЕ НаборЗаписейСостоянияКодовМаркировки.СостояниеКодовМаркировки() Тогда
				Отказ = Истина;
			КонецЕсли;
		КонецЕсли;
		
	КонецЕсли;
	
	// Двигаем границу последовательности взаиморасчетов
	ДвигаемГраницу = (Режим<>РежимПроведенияДокумента.Оперативный И Движения.ВзаиморасчетыКомпании.Количество()>0);
	Если ДвигаемГраницу ИЛИ ЗначениеЗаполнено(ДополнительныеСвойства.ДоговорВзаиморасчетовБыл) Тогда
		НаборЗаписейГраницыВзаиморасчетов = РегистрыСведений.ГраницыВзаиморасчетов.СоздатьНаборЗаписей();
		Если ДвигаемГраницу Тогда
			ТаблицаДоговоров = Движения.ВзаиморасчетыКомпании.Выгрузить();
			ТаблицаДоговоров.Свернуть("ДоговорВзаиморасчетов","");
			НаборЗаписейГраницыВзаиморасчетов.ДоговорВзаиморасчетов = ТаблицаДоговоров.ВыгрузитьКолонку("ДоговорВзаиморасчетов");
			НаборЗаписейГраницыВзаиморасчетов.МоментВремени = Дата;
			НаборЗаписейГраницыВзаиморасчетов.ДоговорВзаиморасчетовБыл = ДополнительныеСвойства.ДоговорВзаиморасчетовБыл;
			НаборЗаписейГраницыВзаиморасчетов.МоментВремениБыл = ДополнительныеСвойства.МоментВремениБыл;
		Иначе
			НаборЗаписейГраницыВзаиморасчетов.ДоговорВзаиморасчетов = ДополнительныеСвойства.ДоговорВзаиморасчетовБыл;
			НаборЗаписейГраницыВзаиморасчетов.МоментВремени = ДополнительныеСвойства.МоментВремениБыл;
			НаборЗаписейГраницыВзаиморасчетов.ДоговорВзаиморасчетовБыл = Неопределено;
			НаборЗаписейГраницыВзаиморасчетов.МоментВремениБыл = Неопределено;
		КонецЕсли;
		НаборЗаписейГраницыВзаиморасчетов.ДокументСсылка = Ссылка;
		НаборЗаписейГраницыВзаиморасчетов.ИзменитьГраницу();
	КонецЕсли;
	
	// двигаем границу последовательности заказов
	ДвигаемГраницу = (Режим<>РежимПроведенияДокумента.Оперативный И (Движения.ЗаказыПокупателей.Количество()>0 ИЛИ Движения.ЗаказыРаспределение.Количество()>0));
	Если ДвигаемГраницу ИЛИ ЗначениеЗаполнено(ДополнительныеСвойства.ЗаказБыл) Тогда
		НаборЗаписейГраницыЗаказы = РегистрыСведений.ГраницыЗаказы.СоздатьНаборЗаписей();
		Если ДвигаемГраницу Тогда
			ТаблицаЗаказов = Движения.ЗаказыПокупателей.Выгрузить();
			ТаблицаЗаказов.Колонки.Удалить("Заказ");
			ТаблицаЗаказов.Колонки.Добавить("Заказ",Новый ОписаниеТипов("ДокументСсылка.ЗаказПокупателя,ДокументСсылка.ЗаказВнутренний,ДокументСсылка.ЗаказПоставщику"));
			ТаблицаЗаказов.ЗагрузитьКолонку(Движения.ЗаказыПокупателей.ВыгрузитьКолонку("Заказ"),"Заказ");
			Для каждого СтрокаЗаказа Из Движения.ЗаказыРаспределение Цикл
				НоваяСтрока=ТаблицаЗаказов.Добавить();
				НоваяСтрока.Заказ=СтрокаЗаказа.ЗаказПокупателя;
				НоваяСтрока=ТаблицаЗаказов.Добавить();
				НоваяСтрока.Заказ=СтрокаЗаказа.ЗаказПоставщика;
			КонецЦикла; 
			ТаблицаЗаказов.Свернуть("Заказ","");
			НаборЗаписейГраницыЗаказы.Заказ = ТаблицаЗаказов.ВыгрузитьКолонку("Заказ");
			НаборЗаписейГраницыЗаказы.МоментВремени = Дата;
			НаборЗаписейГраницыЗаказы.ЗаказБыл = ДополнительныеСвойства.ЗаказБыл;
			НаборЗаписейГраницыЗаказы.МоментВремениБыл = ДополнительныеСвойства.МоментВремениБыл;
		Иначе
			НаборЗаписейГраницыЗаказы.Заказ = ДополнительныеСвойства.ЗаказБыл;
			НаборЗаписейГраницыЗаказы.МоментВремени = ДополнительныеСвойства.МоментВремениБыл;
			НаборЗаписейГраницыЗаказы.ЗаказБыл = Неопределено;
			НаборЗаписейГраницыЗаказы.МоментВремениБыл = Неопределено;
		КонецЕсли;
		НаборЗаписейГраницыЗаказы.ДокументСсылка = Ссылка;
		НаборЗаписейГраницыЗаказы.ИзменитьГраницу();
	КонецЕсли;
	
	// Выведем сообщения об ошибках и предупреждениях
	дкВыводРезультатовОбработки(ЭтотОбъект,Отказ);
КонецПроцедуры // ОбработкаПроведения 

//Бондаренко++ 20220418 

Функция СМГ_ДополнитьСписокОснований(СписокОснований,ДокОснование)
	
	СпОснВрем = СписокОснований;
	
 	СписокКомплектацийАвтомобиля = СМГ_ПолучитьСписокКомплектацийИзРегистра(ДокОснование);			
	
	Если СписокКомплектацийАвтомобиля.Количество() > 0 Тогда
		Для каждого Элем Из СписокКомплектацийАвтомобиля Цикл
			СпОснВрем.Добавить(Элем.Значение);
		КонецЦикла;
	КонецЕсли;
	
	Возврат СпОснВрем;

КонецФункции // СМГ_ДополнитьСписокОснований(СписокОснований,ДокОснование)

Функция СМГ_ПолучитьСписокКомплектацийИзРегистра(ДокОсн)
	
	СпЗнач = Новый СписокЗначений;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	КомплектацияАвтомобилей.Регистратор КАК Ссылка,
		|	КомплектацияАвтомобилей.Период,
		|	КомплектацияАвтомобилей.Автомобиль
		|ИЗ
		|	РегистрНакопления.КомплектацияАвтомобилей КАК КомплектацияАвтомобилей
		|ГДЕ
		|	КомплектацияАвтомобилей.Автомобиль = &Автомобиль
		|	И КомплектацияАвтомобилей.Период <= &Период";
	
	Запрос.УстановитьПараметр("Автомобиль", ДокОсн.Автомобиль); 
 	Запрос.УстановитьПараметр("Период", ДокОсн.Дата);	
 	
	СпЗнач.ЗагрузитьЗначения(Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка"));
	
	Возврат СпЗнач;
 
КонецФункции // СМГ_ПолучитьСписокКомплектаций(Автомобиль)
 //Бондаренко-- 20220418
 
 
////////////////////////////////////////////////////////////////////////////////
// ИСПОЛНЯЕМАЯ ЧАСТЬ МОДУЛЯ

// сохранение ссылки на коллекцию прав, настроек и окружения
Права = Неопределено;
#Если Клиент Тогда
Права = глПрава;
#КонецЕсли