Функция ВернутьXMLкакСтрокуXTDO() Экспорт
	
 ТЧ_Авто = ПолучитьТаблицуАвто();
 
 ЗаписьXML  = Новый ЗаписьXML;
 ЗаписьXML.УстановитьСтроку();
 
 ЗаписьXML.ЗаписатьОбъявлениеXML();
 
 ОбъявленияXDTO = ФабрикаXDTO.Создать(ФабрикаXDTO.Тип("http://aaa24.ru", "car"));
 
 //ОбъявленияXDTO = ФабрикаXDTO.Создать(ФабрикаXDTO.Тип("http://autoload.avito.ru/format/schema.xsd", "ads"));
  
 Для Каждого СтрокаАвто из ТЧ_Авто Цикл
  
  //  СтрокаПрайсXDTO = ФабрикаXDTO.Создать(ФабрикаXDTO.Тип("http://autoload.avito.ru", "ad"));
  
  //СтрокаПрайсXDTO.ID = XMLСтрока(СтрокаАвто.Авто);
   
  //ТЧ = ПолучитьИзображения(СтрокаЦен.Номенклатура);
  //Если НЕ ТЧ.Количество() = 0 Тогда
  // Для Каждого СтрТЧ Из ТЧ Цикл
  //  
  //  мДанные = СтрТЧ.Ссылка.ХранилищеФайла.Получить();
  //  Если НЕ ЗначениеЗаполнено(мДанные) Тогда
  //   Продолжить;
  //  КонецЕсли;
  //  КартинкаXDTO = ФабрикаXDTO.Создать(ФабрикаXDTO.Тип("http://start1c.blogspot.ru", "NomenclatureImage"));
  //  КартинкаXDTO.binImage = Base64Строка(мДанные);
  //  НоменклатураXDTO.nomenclatureImage.Добавить(КартинкаXDTO);
  // КонецЦикла;
  //КонецЕсли;
  
 // СтрокаПрайсXDTO.nomenclature = НоменклатураXDTO; 
 // СтрокаПрайсXDTO.price = XMLСтрока(СтрокаЦен.Цена);
 // ПрайсXDTO.priceString.Добавить(СтрокаПрайсXDTO);
 // 
 КонецЦикла;
 
 //ФабрикаXDTO.ЗаписатьXML(ЗаписьXML, ОбъявленияXDTO);
 
 СтрокаXML = ЗаписьXML.Закрыть();
 
 Возврат СтрокаXML;
      
 КонецФункции 

Функция ПолучитьТаблицуАвто() Экспорт

   	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПодразделенияКомпании.Ссылка
		|ИЗ
		|	Справочник.ПодразделенияКомпании КАК ПодразделенияКомпании
		|ГДЕ
		|	ПодразделенияКомпании.Родитель В(&СписокРодителейПодразделений)";
	
	Запрос.УстановитьПараметр("СписокРодителейПодразделений", СписокПодразделений);
	
	СпПодразделений = Новый СписокЗначений;
	СпПодразделений.ЗагрузитьЗначения(Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка"));
	
   	ТЗ = Новый ТаблицаЗначений;
	
	Запрос = Новый Запрос;
		
 	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ОстаткиАвтомобилейОстатки.Автомобиль,
		|	ОстаткиАвтомобилейОстатки.Автомобиль.VIN КАК VIN,
		|	СУММА(ОстаткиАвтомобилейОстатки.КоличествоОстаток) КАК Остаток,
		|	ЦенаАвто.Цена КАК Цена,
		|	ХарАвто.Значение КАК ВидАвто,
		|	ОстаткиАвтомобилейОстатки.СкладКомпании.Подразделение.ДилерскийЦентр КАК ДилерскийЦентр,
		|	ОстаткиАвтомобилейОстатки.Автомобиль.Модель.Марка КАК Марка,
		|	ОстаткиАвтомобилейОстатки.Автомобиль.Модель КАК Модель,
		|	ОстаткиАвтомобилейОстатки.Автомобиль.ВариантКомплектации КАК ВариантКомплектации,
		|	ОстаткиАвтомобилейОстатки.Автомобиль.Цвет.ЦветАвтоРу КАК ЦветАвтоРу,
		|	ОстаткиАвтомобилейОстатки.Автомобиль.Цвет.ОкраскаМеталлик КАК ОкраскаМеталлик,
		|	ПробегиАвто.Значение КАК Пробег
		|ИЗ
		|	РегистрНакопления.ОстаткиАвтомобилей.Остатки КАК ОстаткиАвтомобилейОстатки
		|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		|			ЦеныАвтомобилейСрезПоследних.Цена КАК Цена,
		|			ЦеныАвтомобилейСрезПоследних.Автомобиль КАК Автомобиль,
		|			ЦеныАвтомобилейСрезПоследних.ВариантКомплектации КАК ВариантКомплектации,
		|			ЦеныАвтомобилейСрезПоследних.ТипЦен КАК ТипЦен
		|		ИЗ
		|			РегистрСведений.ЦеныАвтомобилей.СрезПоследних КАК ЦеныАвтомобилейСрезПоследних
		|		ГДЕ
		|			ЦеныАвтомобилейСрезПоследних.ТипЦен = ЗНАЧЕНИЕ(Справочник.ТипыЦен.ОсновнойТипЦенПродажи)) КАК ЦенаАвто
		|		ПО ОстаткиАвтомобилейОстатки.Автомобиль = ЦенаАвто.Автомобиль
		|			И ОстаткиАвтомобилейОстатки.Автомобиль.ВариантКомплектации = ЦенаАвто.Автомобиль.ВариантКомплектации
		|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		|			АвтомобилиСрезПоследних.Автомобиль КАК Автомобиль,
		|			АвтомобилиСрезПоследних.ВидЗначения КАК ВидЗначения,
		|			АвтомобилиСрезПоследних.Значение КАК Значение
		|		ИЗ
		|			РегистрСведений.Автомобили.СрезПоследних КАК АвтомобилиСрезПоследних
		|		ГДЕ
		|			АвтомобилиСрезПоследних.ВидЗначения = ЗНАЧЕНИЕ(Перечисление.ДополнительнаяИнформацияАвтомобилей.ВидАвтомобиля)) КАК ХарАвто
		|		ПО ОстаткиАвтомобилейОстатки.Автомобиль = ХарАвто.Автомобиль
		|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		|			АвтомобилиСрезПоследних.Автомобиль КАК Автомобиль,
		|			АвтомобилиСрезПоследних.ВидЗначения КАК ВидЗначения,
		|			АвтомобилиСрезПоследних.Значение КАК Значение
		|		ИЗ
		|			РегистрСведений.Автомобили.СрезПоследних КАК АвтомобилиСрезПоследних
		|		ГДЕ
		|			АвтомобилиСрезПоследних.ВидЗначения = ЗНАЧЕНИЕ(Перечисление.ДополнительнаяИнформацияАвтомобилей.Пробег)) КАК ПробегиАвто
		|		ПО ОстаткиАвтомобилейОстатки.Автомобиль = ПробегиАвто.Автомобиль
		|ГДЕ
		|	ОстаткиАвтомобилейОстатки.КоличествоОстаток > 0
		|	И ХарАвто.Значение = ЗНАЧЕНИЕ(Перечисление.ВидАвтомобиля.Новый)
		|	И ОстаткиАвтомобилейОстатки.СкладКомпании.Подразделение В(&СпПодразделений)
		|
		|СГРУППИРОВАТЬ ПО
		|	ОстаткиАвтомобилейОстатки.Автомобиль,
		|	ОстаткиАвтомобилейОстатки.Автомобиль.VIN,
		|	ЦенаАвто.Цена,
		|	ХарАвто.Значение,
		|	ОстаткиАвтомобилейОстатки.СкладКомпании.Подразделение.ДилерскийЦентр,
		|	ОстаткиАвтомобилейОстатки.Автомобиль.Цвет.ЦветАвтоРу,
		|	ОстаткиАвтомобилейОстатки.Автомобиль.Цвет.ОкраскаМеталлик,
		|	ПробегиАвто.Значение,
		|	ОстаткиАвтомобилейОстатки.Автомобиль.ВариантКомплектации,
		|	ОстаткиАвтомобилейОстатки.Автомобиль.Модель
		|
		|УПОРЯДОЧИТЬ ПО
		|	VIN";
	
	Запрос.УстановитьПараметр("СпПодразделений",СпПодразделений);
     	
 	ТЗ = Запрос.Выполнить().Выгрузить();
	
	Если обПраво("ДоступКЗначимымОбработкам") Тогда
		ТЗ.ВыбратьСтроку(ТЗ.Количество());
 	КонецЕсли; 
	
	Возврат ТЗ;
	
	// //ВремФайл = Новый Файл;
	//XML=Новый ЗаписьXML();
	//
	////ИмяВремФайл = СокрЛП(КаталогВременныхФайлов()+"For_Avto_RU.xml");
	////  
	////XML.ОткрытьФайл(ИмяВремФайл);
	//
	//XML.УстановитьСтроку("UTF8");
	//XML.ЗаписатьОбъявлениеXML();
	//
	//XML.ЗаписатьНачалоЭлемента("Catalog");
	////XML.ЗаписатьАтрибут("xmlns:xsi", "https:www.w3.org/2001/XMLSchema-instance");
	//
	//XML.ЗаписатьНачалоЭлемента("creation");
	//XML.ЗаписатьТекст(Формат(ТекущаяДата(),"ДФ=yyyy-MM-dd")+" "+Формат(ТекущаяДата(),"ДЛФ=T"));
	//XML.ЗаписатьКонецЭлемента(); //creation
	//
	//XML.ЗаписатьНачалоЭлемента("Cars");
	//
	//Для каждого Стр1 Из ТЗ Цикл
	//	
	//	Если обЗначениеНеЗаполнено(Стр1.Цена) Тогда
	//		Продолжить;
	//	КонецЕсли; 
	//	
	//	Если обЗначениеНеЗаполнено(Стр1.Автомобиль.Модель.Марка.МаркаАвтоРу) Тогда
	//		Продолжить;
	//	КонецЕсли; 
	//	
	//	Если обЗначениеНеЗаполнено(Стр1.Автомобиль.МодельАвтоРу) Тогда
	//		Продолжить;
	//	КонецЕсли; 

	//	
	// 	XML.ЗаписатьНачалоЭлемента("сar");
	//	XML.ЗаписатьНачалоЭлемента("mаrk_id");             XML.ЗаписатьТекст(Стр1.Автомобиль.Модель.Марка.МаркаАвтоРу.Наименование);                            XML.ЗаписатьКонецЭлемента();
	//	XML.ЗаписатьНачалоЭлемента("folder_id");           XML.ЗаписатьТекст(Стр1.Автомобиль.МодельАвтоРу.Наименование);                                        XML.ЗаписатьКонецЭлемента();
	//	XML.ЗаписатьНачалоЭлемента("modification_id");     XML.ЗаписатьТекст(Стр1.Автомобиль.МодификацияАвтоРу.Наименование);                                   XML.ЗаписатьКонецЭлемента();
	//	XML.ЗаписатьНачалоЭлемента("copmplectation_name"); XML.ЗаписатьТекст(Стр1.Автомобиль.КомплектацияАвтоРу.Наименование);                                                                               XML.ЗаписатьКонецЭлемента();
	//	XML.ЗаписатьНачалоЭлемента("body_type");           XML.ЗаписатьТекст(СокрЛП(Стр1.Автомобиль.ТипКузоваСайт));                                            XML.ЗаписатьКонецЭлемента();
	// 	XML.ЗаписатьНачалоЭлемента("wheel");               XML.ЗаписатьТекст(СокрЛП(Стр1.Автомобиль.Руль));                                                     XML.ЗаписатьКонецЭлемента();
	// 	XML.ЗаписатьНачалоЭлемента("color");               XML.ЗаписатьТекст(СокрЛП(Стр1.Автомобиль.ЦветАвтоРу));                                                 XML.ЗаписатьКонецЭлемента();
	//	XML.ЗаписатьНачалоЭлемента("metallic");            XML.ЗаписатьТекст(СокрЛП(Стр1.Автомобиль.ОкраскаМеталлик));                                            XML.ЗаписатьКонецЭлемента();
	//    XML.ЗаписатьНачалоЭлемента("availability");        XML.ЗаписатьТекст("В наличии");                                                                        XML.ЗаписатьКонецЭлемента();
	//	XML.ЗаписатьНачалоЭлемента("custom");              XML.ЗаписатьТекст("Растаможен");                                                                       XML.ЗаписатьКонецЭлемента();
	//	XML.ЗаписатьНачалоЭлемента("state");               XML.ЗаписатьТекст(СокрЛП(Стр1.Автомобиль.Состояние));                                                  XML.ЗаписатьКонецЭлемента();
	//	XML.ЗаписатьНачалоЭлемента("owners_number");       XML.ЗаписатьТекст("Не было владельцев");                                                               XML.ЗаписатьКонецЭлемента();
	//	XML.ЗаписатьНачалоЭлемента("run");                 XML.ЗаписатьТекст("0");                                                                                XML.ЗаписатьКонецЭлемента();
	// 	XML.ЗаписатьНачалоЭлемента("year");                XML.ЗаписатьТекст(Формат(Стр1.Автомобиль.ГодВыпуска,"ДФ=yyyy"));                                       XML.ЗаписатьКонецЭлемента();
	//	XML.ЗаписатьНачалоЭлемента("registry_year");       XML.ЗаписатьТекст(Формат(Стр1.Автомобиль.ГодВыпуска,"ДФ=yyyy"));                                       XML.ЗаписатьКонецЭлемента();
	//	XML.ЗаписатьНачалоЭлемента("doors_count");         XML.ЗаписатьТекст(СокрЛП(Стр1.Автомобиль.КоличествоДверей));                                           XML.ЗаписатьКонецЭлемента();
	//	XML.ЗаписатьНачалоЭлемента("currency");            XML.ЗаписатьТекст("RUR");                                                                              XML.ЗаписатьКонецЭлемента();
	//	XML.ЗаписатьНачалоЭлемента("vin");                 XML.ЗаписатьТекст(Стр1.Автомобиль.VIN);                                                                XML.ЗаписатьКонецЭлемента();
	//	
	//	Попытка
	//		ЦенаМинимальная =  СокрЛП(Число(СтрЗаменить(Стр1.Цена,Символы.НПП,""))-Число(СтрЗаменить(Стр1.СкидкаМаксимальная,Символы.НПП,"")));         
	// 	Исключение
	//		ЦенаМинимальная = СокрЛП(Число(СтрЗаменить(Стр1.Цена,Символы.НПП,"")));
	//	КонецПопытки; 
	//	 
	//	XML.ЗаписатьНачалоЭлемента("price");               XML.ЗаписатьТекст(СокрЛП(СтрЗаменить(ЦенаМинимальная,Символы.НПП,"")));                                XML.ЗаписатьКонецЭлемента(); 
	//	XML.ЗаписатьНачалоЭлемента("special_price");       XML.ЗаписатьТекст(СокрЛП(СтрЗаменить(Стр1.СпециальнаяЦена,Символы.НПП,"")));                           XML.ЗаписатьКонецЭлемента(); 
	//	XML.ЗаписатьНачалоЭлемента("credit_discount");     XML.ЗаписатьТекст(СокрЛП(СтрЗаменить(Стр1.СкидкаПриПокупкеВКредит,Символы.НПП,"")));                   XML.ЗаписатьКонецЭлемента(); 
	//	XML.ЗаписатьНачалоЭлемента("insurance_discount");  XML.ЗаписатьТекст(СокрЛП(СтрЗаменить(Стр1.СкидкаПриСтраховании,Символы.НПП,"")));                      XML.ЗаписатьКонецЭлемента();  
	//	XML.ЗаписатьНачалоЭлемента("tradein_discount");    XML.ЗаписатьТекст(СокрЛП(СтрЗаменить(Стр1.СкидаПриПокупкеВТрейдИн,Символы.НПП,"")));                   XML.ЗаписатьКонецЭлемента();  
	//	XML.ЗаписатьНачалоЭлемента("max_discount");        XML.ЗаписатьТекст(СокрЛП(СтрЗаменить(Стр1.СкидкаМаксимальная,Символы.НПП,"")));                        XML.ЗаписатьКонецЭлемента(); 

	//   	XML.ЗаписатьНачалоЭлемента("images");
	//	
	//	ёё = 0;
	//	
	//	Для каждого СтрТЧ Из Стр1.Автомобиль.ПутьКФото Цикл
	//		
	//		Сообщить(СтрТЧ.Путь);
	//		
	//		ёё = ёё + 1;
	//		
	//		Если обЗначениеНеЗаполнено(СтрТЧ.URL) Тогда
	//			Продолжить;
	//		КонецЕсли; 
	//		XML.ЗаписатьНачалоЭлемента("url");
	//		XML.ЗаписатьТекст(СокрЛП(СтрТЧ.URL));                            							
	//		XML.ЗаписатьКонецЭлемента(); //url	
	//	КонецЦикла; 
	//	
	//	XML.ЗаписатьКонецЭлемента(); //images	
	//	
	//	XML.ЗаписатьНачалоЭлемента("video");                 XML.ЗаписатьТекст(Стр1.Автомобиль.СсылкаНаВидео); 	XML.ЗаписатьКонецЭлемента(); 
	// 	//XML.ЗаписатьНачалоЭлемента("comment");   	         XML.ЗаписатьТекст(СокрЛП(Слоган));	              	XML.ЗаписатьКонецЭлемента();	 //comment
	//	
	//	XML.ЗаписатьКонецЭлемента(); //Car

	// КонецЦикла; 
	//
	//XML.ЗаписатьКонецЭлемента();	 //Cars
	//
	//XML.ЗаписатьКонецЭлемента();         //Catalog
	//
	//XMLТекст = XML.Закрыть();
	//
	// Возврат XMLТекст;

КонецФункции // ВернутьXMLкакСтроку()
 