Процедура ПриУстановкеНовогоНомера(СтандартнаяОбработка, Префикс)	
	Префикс = DMS_ОбщегоНазначенияСервер.ПолучитьПрефикс();
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)  	
	Если ОбменДанными.Загрузка Тогда 		
		Возврат;  		
	КонецЕсли;
КонецПроцедуры

Процедура ПриЗаписи(Отказ)  	
	Если ОбменДанными.Загрузка Тогда 		
		Возврат;  		
	КонецЕсли;
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, Режим)

	// регистр Renault_Промоакции
	Движения.Renault_Промоакции.Записывать = Истина;
	Движения.Renault_Промоакции.Очистить();
	Для Каждого ТекСтрокаТовары Из Товары Цикл
		Движение = Движения.Renault_Промоакции.Добавить();
		Движение.Период = ДатаНачала;
		Движение.Акция = Ссылка;
		Движение.Номенклатура = ТекСтрокаТовары.Номенклатура;
		Движение.Значение = ТекСтрокаТовары.Значение;
		Движение.ДатаОкончания = ДатаОкончания;
	КонецЦикла;

КонецПроцедуры
