
////#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("АвтоТест") Тогда
		Возврат;
	КонецЕсли; 
	
	Если Параметры.Отбор.Свойство("РекламнаяКампания") Тогда
		РекламнаяКампания = Параметры.Отбор.РекламнаяКампания;
	КонецЕсли; 
	
	Если ЗначениеЗаполнено(РекламнаяКампания) Тогда
		ЗаполнитьМакетыНаФорме();
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "Запись_Макеты" 
		И Параметр = РекламнаяКампания Тогда
		
		ОчиститьЭлементыФормыИРеквизитыНаСервере();
		ЗаполнитьМакетыНаФорме();
		
	КонецЕсли; 
	
	Если ИмяСобытия = "Запись_ПрисоединенныйФайл" Тогда
		
		Модифицированность = Истина;
		СсылкаНаФайл = ?(ТипЗнч(Источник) = Тип("Массив"), Источник[0], Источник);
		
		Если ЗначениеЗаполнено(ТекущийМакет) Тогда
			
			Успешно = ЗаписатьФайлКартинкиМакета(ТекущийМакет,СсылкаНаФайл);
			
			Если Успешно Тогда
				
				ИдентификаторМакета = СтрЗаменить(ВРег(Строка(ТекущийМакет.УникальныйИдентификатор())), "-", "x");
				
				ИмяИзображения = "Изображение_" + ИдентификаторМакета;
				                           
				ЭтаФорма[ИмяИзображения] = ПолучитьНавигационнуюСсылку(СсылкаНаФайл, "ФайлХранилище");				
				
				ИзменитьДекорацииИзображения(СсылкаНаФайл,ИдентификаторМакета);
				
				ТекущийМакет = Неопределено;
				
			Иначе 
				Предупреждение("Произошла ошибка при записи изображения(см. журнал регистрации)",15,"Внимание");
			КонецЕсли; 
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

////#КонецОбласти

////#Область ОбработчикиСобытийРеквизитовФормы

&НаКлиенте
Процедура РекламнаяКампанияНажатие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ПараметрыФормы = Новый Структура("Ключ",РекламнаяКампания);
	ОткрытьФорму("Документ.DMS_РекламнаяКампания.ФормаОбъекта",ПараметрыФормы,ЭтаФорма);
	
КонецПроцедуры

////#КонецОбласти

////#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ПрикрепитьМакет(Команда)
	
	ПараметрыФормы = Новый Структура("РекламнаяКампания", РекламнаяКампания);
	ОткрытьФорму("Справочник.DMS_МакетыРекламнойКампании.Форма.ФормаЭлемента", ПараметрыФормы, ЭтаФорма);
	
КонецПроцедуры

////#КонецОбласти

////#Область ПодключаемыеКоманды

&НаКлиенте
Процедура Подключаемый_КомандаНажатиеСогласовать(Команда) 
	
	ИдентификаторМакета = СтрЗаменить(НРег(СтрЗаменить(Команда.Имя,"КомандаСогласовать_","")), "x", "-");
	
	СсылкаНаМакет = ПолучитьМакетПоУникальномуИдентификатору(ИдентификаторМакета);
	
	СсылкаБизнесПроцесс = ОтправитьНаСогласованиеНаСервере(СсылкаНаМакет);
	
	ПараметрыФормы = Новый Структура("Ключ",СсылкаБизнесПроцесс);	
	ОткрытьФорму("БизнесПроцесс.DMS_СогласованиеМакетовРекламнойКампании.Форма.ФормаБизнесПроцесса",ПараметрыФормы,ЭтаФорма);
	
	ИзменитьИнформациюОСтатусе(Команда.Имя,ИдентификаторМакета);
	
КонецПроцедуры // Подключаемый_КомандаНажатиеСогласовать()

&НаКлиенте
Процедура Подключаемый_ПриНажатииЗагрузитьИзображение(Команда)
	
	ИдентификаторМакета = СтрЗаменить(НРег(СтрЗаменить(Команда.Имя,"ДекорацияИмяИзображения_","")), "x", "-");
	
	ТекущийМакет = Неопределено;
	
	СсылкаНаМакет = ПолучитьМакетПоУникальномуИдентификатору(ИдентификаторМакета);
	
	ТекущийМакет = СсылкаНаМакет;
	
    ИдентификаторФайла = Новый УникальныйИдентификатор;
    ДобавитьФайлы(СсылкаНаМакет, ИдентификаторФайла,ИдентификаторМакета);
		                                               
КонецПроцедуры // Подключаемый_ПриНажатииНаИзображение()
 
&НаКлиенте
Процедура Подключаемый_ПриНажатииНаИзображение(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ИдентификаторМакета = СтрЗаменить(НРег(СтрЗаменить(Элемент.Имя,"Изображение_","")), "x", "-");
	
	СсылкаНаМакет = ПолучитьМакетПоУникальномуИдентификатору(ИдентификаторМакета);
	
	ПросмотретьПрисоединенныйФайл(Элемент.Имя, Элемент.Имя,СсылкаНаМакет,
		НСтр("ru='Отсутствует изображение для просмотра';en='No picture to show'"));
	
КонецПроцедуры // Подключаемый_ПриНажатииНаИзображение()

////#КонецОбласти

////#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ЗаполнитьМакетыНаФорме()
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("РекламнаяКампания", РекламнаяКампания);
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	МакетыКампании.Ссылка КАК Макет,
		|	МакетыКампании.Наименование КАК Наименование,
		|	МакетыКампании.ФайлКартинки КАК ФайлКартинки,
		|	МакетыКампании.Согласован КАК Согласован,
		|	СтатусыМакетов.Статус КАК Статус,
		|	МакетыКампании.ДатаРегистрации КАК ДатаРегистрации
		|ИЗ
		|	Справочник.DMS_МакетыРекламнойКампании КАК МакетыКампании
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.DMS_СтатусыМакетовРекламныхКампаний.СрезПоследних(, ) КАК СтатусыМакетов
		|		ПО (СтатусыМакетов.МакетРекламнойКампании = МакетыКампании.Ссылка)
		|			И (СтатусыМакетов.РекламнаяКампания = МакетыКампании.РекламнаяКампания)
		|ГДЕ
		|	МакетыКампании.РекламнаяКампания = &РекламнаяКампания
		|
		|УПОРЯДОЧИТЬ ПО
		|	Макет
		|АВТОУПОРЯДОЧИВАНИЕ";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаМакетов = РезультатЗапроса.Выбрать();
	
	// Создание реквизитов.
	ДобавляемыеРеквизиты = Новый Массив;
	
	Пока ВыборкаМакетов.Следующий() Цикл
		
		ИдентификаторМакета = СтрЗаменить(ВРег(Строка(ВыборкаМакетов.Макет.УникальныйИдентификатор())), "-", "x");
		
		//Реквизит "Макет"
		ИмяМакета = "Макет_" + ИдентификаторМакета;
		                                               
		ТипЗначенияМакета = Новый ОписаниеТипов("СправочникСсылка.DMS_МакетыРекламнойКампании");
			
		РеквизитМакет = Новый РеквизитФормы(ИмяМакета, ТипЗначенияМакета,,"", Ложь);
		
		ДобавляемыеРеквизиты.Добавить(РеквизитМакет);
		
		//Реквизит "ДатаРегистрации"
		ИмяМакета = "ДатаРегистрации_" + ИдентификаторМакета;
		                                               
		ТипЗначенияДатыРегистрации = Новый ОписаниеТипов("Строка",,,,Новый КвалификаторыСтроки(15));
			
		РеквизитДатаРегистрации = Новый РеквизитФормы(ИмяМакета, ТипЗначенияДатыРегистрации,,"", Ложь);
		
		ДобавляемыеРеквизиты.Добавить(РеквизитДатаРегистрации);
		
		//Реквизит "Изображение"
		ИмяИзображения = "Изображение_" + ИдентификаторМакета;
		                                               
		ТипЗначенияИзображения = Новый ОписаниеТипов("Строка",,,,Новый КвалификаторыСтроки(0));
			
		РеквизитИзображение = Новый РеквизитФормы(ИмяИзображения, ТипЗначенияИзображения,,"", Ложь);
		
		ДобавляемыеРеквизиты.Добавить(РеквизитИзображение);
		
		//Для каждого ТекущаяСтрока Из ВыборкаМакетов.Макет.КонтактнаяИнформация Цикл
		//	
		//	//Реквизит "Адрес"
		//	ИмяАдреса = "Адрес"+Формат(ТекущаяСтрока.НомерСтроки,"ЧЦ=10; ЧН=0; ЧГ=")+"_" + ИдентификаторМакета;
		//	
		//	ТипЗначенияАдреса = Новый ОписаниеТипов("Строка",,,,Новый КвалификаторыСтроки(0));
		//	
		//	РеквизитИзображение = Новый РеквизитФормы(ИмяАдреса, ТипЗначенияАдреса,,"", Ложь);
		//	
		//	ДобавляемыеРеквизиты.Добавить(РеквизитИзображение);
		//	
		//КонецЦикла; 
		
	КонецЦикла; 	
	
   	ИзменитьРеквизиты(ДобавляемыеРеквизиты);
	
	ВыборкаМакетов.Сбросить();
	
	НомерТекущейГруппы = 1;
	
	Пока ВыборкаМакетов.Следующий() Цикл
		
		Родитель = Элементы["ГруппаСписокМакетов"+Формат(НомерТекущейГруппы,"ЧЦ=1; ЧН=0; ЧГ=")];
		
		ИдентификаторМакета = СтрЗаменить(ВРег(Строка(ВыборкаМакетов.Макет.УникальныйИдентификатор())), "-", "x");
		
		//Группа макета общая
		ГруппаМакетаОбщая = Элементы.Добавить("ГруппаМакетаОбщая_"+ИдентификаторМакета,Тип("ГруппаФормы"),Родитель);
		ГруппаМакетаОбщая.Вид = ВидГруппыФормы.ОбычнаяГруппа;
		ГруппаМакетаОбщая.Группировка = ГруппировкаПодчиненныхЭлементовФормы.Горизонтальная;
		ГруппаМакетаОбщая.Отображение = ОтображениеОбычнойГруппы.СильноеВыделение;
		ГруппаМакетаОбщая.ШиринаПодчиненныхЭлементов = ШиринаПодчиненныхЭлементовФормы.Одинаковая;
		
		//Группа макета
		ГруппаМакета = Элементы.Добавить("ГруппаМакета_"+ИдентификаторМакета,Тип("ГруппаФормы"),ГруппаМакетаОбщая);
		ГруппаМакета.Вид = ВидГруппыФормы.ОбычнаяГруппа;
		
		//Элемент формы "Макет"
		
		ИмяМакета = "Макет_" + ИдентификаторМакета;
		
		Элемент = Элементы.Добавить(ИмяМакета, Тип("ПолеФормы"),ГруппаМакета);
 		Элемент.ПутьКДанным 			  = ИмяМакета;
		Элемент.Вид 					  = ВидПоляФормы.ПолеНадписи;
		Элемент.Гиперссылка 			  = Истина;
		Элемент.РастягиватьПоГоризонтали  = Ложь;
		Элемент.ПоложениеЗаголовка  	  = ПоложениеЗаголовкаЭлементаФормы.Нет;
		
		ЭтаФорма[ИмяМакета] = ВыборкаМакетов.Макет;
		
		//Элемент формы "ДатаРегистрации"
		
		ИмяДекорацииДатаРегистрации = "ДекорацияДатаРегистрации_" + ИдентификаторМакета;
		
		Элемент = Элементы.Добавить(ИмяДекорацииДатаРегистрации, Тип("ДекорацияФормы"),ГруппаМакета);
		Элемент.Заголовок 			  	  = "Дата регистрации:";
		Элемент.РастягиватьПоГоризонтали  = Ложь;
		Элемент.ЦветТекста				  = ЦветаСтиля.DMS_ПоясняющийТекст;
		Элемент.Ширина				      = 15;
		
		ИмяМакета = "ДатаРегистрации_" + ИдентификаторМакета;
		
		Элемент = Элементы.Добавить(ИмяМакета, Тип("ПолеФормы"),ГруппаМакета);
 		Элемент.ПутьКДанным 			  = ИмяМакета;
		Элемент.Вид 					  = ВидПоляФормы.ПолеНадписи;
		Элемент.Гиперссылка 			  = Ложь;
		Элемент.РастягиватьПоГоризонтали  = Ложь;
		Элемент.ПоложениеЗаголовка  	  = ПоложениеЗаголовкаЭлементаФормы.Нет;
		
		ЭтаФорма[ИмяМакета] = Формат(ВыборкаМакетов.ДатаРегистрации,"ДФ=dd.MM.yyyy; ДП='Нет даты'");
		
		//Элемент формы "Изображение"
		
		ИмяИзображения = "Изображение_" + ИдентификаторМакета;
		
		Элемент = Элементы.Добавить(ИмяИзображения, Тип("ПолеФормы"),ГруппаМакета);
 		Элемент.ПутьКДанным 			  = ИмяИзображения;
		Элемент.Вид 					  = ВидПоляФормы.ПолеКартинки;
		Элемент.Гиперссылка 			  = Истина;
		Элемент.РастягиватьПоГоризонтали  = Ложь;
		Элемент.РастягиватьПоВертикали	  = Ложь;
		Элемент.ПоложениеЗаголовка  	  = ПоложениеЗаголовкаЭлементаФормы.Нет;
		Элемент.РазмерКартинки      	  = РазмерКартинки.Пропорционально;
		Элемент.Ширина      			  = 15;
		Элемент.Высота		         	  = 5;
		Элемент.ТекстНевыбраннойКартинки  = "<Нет изображения>";
		Элемент.УстановитьДействие("Нажатие","Подключаемый_ПриНажатииНаИзображение");
		
		Если ЗначениеЗаполнено(ВыборкаМакетов.ФайлКартинки) Тогда
			
			ЭтаФорма[ИмяИзображения] = ПолучитьНавигационнуюСсылку(ВыборкаМакетов.ФайлКартинки, "ФайлХранилище");
			
			//Элемент формы "Имя изображения"
			ИмяДекорацииИмяИзображения = "ДекорацияИмяИзображения_" + ИдентификаторМакета;
			
			Элемент = Элементы.Добавить(ИмяДекорацииИмяИзображения, Тип("ДекорацияФормы"),ГруппаМакета);
			Элемент.Заголовок 			  	  = СокрЛП(ВыборкаМакетов.ФайлКартинки.Наименование)+"."+СокрЛП(ВыборкаМакетов.ФайлКартинки.Расширение);
			Элемент.РастягиватьПоГоризонтали  = Ложь;
			Элемент.ЦветТекста				  = ЦветаСтиля.ТекстИнформационнойНадписи;
			Элемент.Ширина				      = 15;
			
			//Элемент формы "Размер изображения"
			ИмяДекорацииРазмерИзображения = "ДекорацияРазмерИзображения_" + ИдентификаторМакета;
			
			Элемент = Элементы.Добавить(ИмяДекорацииРазмерИзображения, Тип("ДекорацияФормы"),ГруппаМакета);
			Элемент.Заголовок 			  	  = ПолучитьСтроковоеПредставлениеРазмераФайла(ВыборкаМакетов.ФайлКартинки.Размер);
			Элемент.РастягиватьПоГоризонтали  = Ложь;
			Элемент.ЦветТекста				  = ЦветаСтиля.ТекстИнформационнойНадписи;
			Элемент.Ширина				      = 15;
			
		Иначе
			
			//Элемент формы "Имя изображения"
			ИмяДекорацииИмяИзображения = "ДекорацияИмяИзображения_" + ИдентификаторМакета;
			
			Элемент = Элементы.Добавить(ИмяДекорацииИмяИзображения, Тип("ДекорацияФормы"),ГруппаМакета);
			Элемент.Заголовок 			  	  = "Загрузить изображение";
			Элемент.РастягиватьПоГоризонтали  = Ложь;
			Элемент.ЦветТекста				  = ЦветаСтиля.ТекстИнформационнойНадписи;
			Элемент.Ширина				      = 15;
			Элемент.Гиперссылка				  = Истина;
			Элемент.УстановитьДействие("Нажатие","Подключаемый_ПриНажатииЗагрузитьИзображение");
			
			ЭтаФорма[ИмяИзображения] = "";
			
		Конецесли;
		
		Если Не ВыборкаМакетов.Согласован И (ВыборкаМакетов.Статус = Справочники.DMS_СтатусыМакетовРекламнойКампании.Заявлен 
			Или ВыборкаМакетов.Статус = Справочники.DMS_СтатусыМакетовРекламнойКампании.БезДействия) Тогда
			
			// Команда "Согласовать"
			
			ИмяКомандыСогласовать = "КомандаСогласовать_"+ИдентификаторМакета;
			
			ДобавляемаяКомандаСогласовать = Команды.Добавить(ИмяКомандыСогласовать);
			ДобавляемаяКомандаСогласовать.Действие = "Подключаемый_КомандаНажатиеСогласовать";
			
			НовыйЭлемент = Элементы.Добавить(ИмяКомандыСогласовать, Тип("КнопкаФормы"), ГруппаМакета);
			НовыйЭлемент.Заголовок   = "Согласовать";	
			НовыйЭлемент.ИмяКоманды  = ИмяКомандыСогласовать;	
			НовыйЭлемент.Картинка    = БиблиотекаКартинок.Утвержден;	
			НовыйЭлемент.Отображение = ОтображениеКнопки.КартинкаИТекст;
			
		Иначе 
			
			//Элемент формы "ДекорацияНаСогласовании"
			ИмяДекорацииНаСогласовании = "ДекорацияНаСогласовании_" + ИдентификаторМакета;
			
			Элемент = Элементы.Добавить(ИмяДекорацииНаСогласовании, Тип("ДекорацияФормы"),ГруппаМакета);
			Элемент.Заголовок 			  	  = "<"+СокрЛП(ВыборкаМакетов.Статус)+">";
			Элемент.РастягиватьПоГоризонтали  = Ложь;
			Элемент.Шрифт			     	  = Новый Шрифт(ШрифтыСтиля.ОбычныйШрифтТекста,,,,,Истина);
			Элемент.ЦветТекста				  = WebЦвета.Зеленый;
			Элемент.Ширина				  	  = 30;
			
		КонецЕсли; 
		
		//Группа КИ макета
		ГруппаКИМакета = Элементы.Добавить("ГруппаКИМакета_"+ИдентификаторМакета,Тип("ГруппаФормы"),ГруппаМакетаОбщая);
		ГруппаКИМакета.Вид = ВидГруппыФормы.ОбычнаяГруппа;
			
		//Элемент формы "ИмяДекорации"
		ИмяДекорацииПлощадка = "ДекорацияПлощадка_" + ИдентификаторМакета;
		
		Элемент = Элементы.Добавить(ИмяДекорацииПлощадка, Тип("ДекорацияФормы"),ГруппаКИМакета);
		Элемент.Заголовок 			  	  = "Площадка:";
		Элемент.РастягиватьПоГоризонтали  = Ложь;
		Элемент.Шрифт			     	  = ШрифтыСтиля.КрупныйШрифтТекста;
		Элемент.ЦветТекста				  = ЦветаСтиля.ТекстИнформационнойНадписи;
		
		////Элемент формы "ИмяДекорацииНетПлощадки"
		//Если ВыборкаМакетов.Макет.КонтактнаяИнформация.Количество() = 0 Тогда
		//	
		//	ИмяДекорацииНетПлощадки = "ДекорацияНетПлощадки_" + ИдентификаторМакета;
		//	
		//	Элемент = Элементы.Добавить(ИмяДекорацииНетПлощадки, Тип("ДекорацияФормы"),ГруппаКИМакета);
		//	Элемент.Заголовок 			  	  = "<Данных нет>";
		//	Элемент.РастягиватьПоГоризонтали  = Ложь;
		//	Элемент.Шрифт			     	  = Новый Шрифт(ШрифтыСтиля.ОбычныйШрифтТекста,,,,,Истина);
		//	Элемент.ЦветТекста				  = ЦветаСтиля.ТекстИнформационнойНадписи;
		//	
		//КонецЕсли; 
		
		//Для каждого ТекущаяСтрока Из ВыборкаМакетов.Макет.КонтактнаяИнформация Цикл
		//	
		//	//Элемент формы "Адрес"
		//	ИмяАдреса = "Адрес"+Формат(ТекущаяСтрока.НомерСтроки,"ЧЦ=10; ЧН=0; ЧГ=")+"_" + ИдентификаторМакета;
		//	
		//	Элемент = Элементы.Добавить(ИмяАдреса, Тип("ПолеФормы"),ГруппаКИМакета);
		//	Элемент.ПутьКДанным 			  = ИмяАдреса;
		//	Элемент.Вид 					  = ВидПоляФормы.ПолеНадписи;
		//	Элемент.РастягиватьПоГоризонтали  = Ложь;
		//	Элемент.ПоложениеЗаголовка  	  = ПоложениеЗаголовкаЭлементаФормы.Нет;
		//	Элемент.ЦветТекста				  = ЦветаСтиля.ТекстИнформационнойНадписи;
		//	Элемент.Гиперссылка				  = Истина;
		//	
		//	ЭтаФорма[ИмяАдреса] = СокрЛП(ТекущаяСтрока.Представление);
		//	
		//КонецЦикла; 
		
		НомерТекущейГруппы = ?(НомерТекущейГруппы = 3,1,НомерТекущейГруппы + 1);
		
	КонецЦикла;

КонецПроцедуры // ЗаполнитьМакетыНаФорме()

&НаСервере
Функция НавигационнаяСсылкаКартинки(ФайлКартинки, ИдентификаторФормы)
	
	УстановитьПривилегированныйРежим(Истина);
	
	Попытка
		АдресКартинки = ПолучитьНавигационнуюСсылку(ФайлКартинки, ИдентификаторФормы).СсылкаНаДвоичныеДанныеФайла;
	Исключение
		Renault_ОбщегоНазначенияКлиентСервер.СообщитьПользователю(КраткоеПредставлениеОшибки(ИнформацияОбОшибке()));
		АдресКартинки = "";
	КонецПопытки;
	
	Возврат АдресКартинки;
		
КонецФункции

&НаСервереБезКонтекста
// Получает строковое представление размера файла.
//
// Параметры:
//  РазмерВБайтах - Число - размер в байтах вложенного файла электронного письма.
//
// Возвращаемое значение:
//   Строка   - строковое представление размера вложенного файла электронного письма.
//
Функция ПолучитьСтроковоеПредставлениеРазмераФайла(РазмерВБайтах) Экспорт
	
	РазмерМб = РазмерВБайтах / (1024*1024);
	Если РазмерМб > 1 Тогда
		СтрокаРазмер = Формат(РазмерМб,"ЧДЦ=1") + " " + НСтр("ru='Мб';en='MB'");
	Иначе
		СтрокаРазмер = Формат(РазмерВБайтах /1024,"ЧДЦ=0; ЧН=0") + " " + НСтр("ru='Кб';en='KB'");
	КонецЕсли;
	
	Возврат СтрокаРазмер;
	
КонецФункции

&НаКлиенте
Процедура ПросмотретьПрисоединенныйФайл(ИмяРеквизитаОбъекта, ИмяРеквизитаФормы,ВладелецПрисоединенныйФайл, ТекстСообщенияОбОшибке)
	
	ОчиститьСообщения();
	
	Если ЗначениеЗаполнено(ЭтаФорма[ИмяРеквизитаОбъекта]) Тогда
		
		ДанныеФайла = ПолучитьДанныеПрисоединенногоФайла(ВладелецПрисоединенныйФайл.ФайлКартинки);
		
		ИмяВременногоФайла =  ПолучитьИмяВременногоФайла(ДанныеФайла.Расширение);
		ДанныеФайла.Файл.Записать(ИмяВременногоФайла);
		
		ЗапуститьПриложение(ИмяВременногоФайла);
		
		// УдалитьФайлы(ИмяВременногоФайла);
		
	Иначе
		Renault_ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщенияОбОшибке,, ИмяРеквизитаФормы);
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьДанныеПрисоединенногоФайла(ПрисоединенныйФайл)

	Возврат Новый Структура("Файл,Расширение",ПрисоединенныйФайл.ФайлХранилище.Получить(),ПрисоединенныйФайл.Расширение)

КонецФункции // ПолучитьДанныеПрисоединенногоФайла()

&НаСервереБезКонтекста
Функция ПолучитьМакетПоУникальномуИдентификатору(СтрокаУИ)

	Возврат Справочники.DMS_МакетыРекламнойКампании.ПолучитьСсылку(Новый УникальныйИдентификатор(СтрокаУИ));	

КонецФункции // ПолучитьМакетПоУникальномуИдентификатору()	

&НаСервереБезКонтекста
Функция ОтправитьНаСогласованиеНаСервере(Ссылка)
		
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Предмет", Ссылка);
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ ПЕРВЫЕ 2
		|	СогласованиеМакетов.Ссылка КАК Ссылка
		|ИЗ
		|	БизнесПроцесс.DMS_СогласованиеМакетовРекламнойКампании КАК СогласованиеМакетов
		|ГДЕ
		|	СогласованиеМакетов.Предмет = &Предмет
		|	И НЕ СогласованиеМакетов.ПометкаУдаления
		|	И НЕ СогласованиеМакетов.Стартован
		|	И НЕ СогласованиеМакетов.Завершен
		|
		|УПОРЯДОЧИТЬ ПО
		|	Ссылка
		|АВТОУПОРЯДОЧИВАНИЕ";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		Возврат ВыборкаДетальныеЗаписи.Ссылка;
	КонецЕсли; 
	
	БизнесПроцесс = БизнесПроцессы.DMS_СогласованиеМакетовРекламнойКампании.СоздатьБизнесПроцесс();
	БизнесПроцесс.Заполнить(Ссылка);
	
	БизнесПроцессСсылка = БизнесПроцессы.DMS_СогласованиеМакетовРекламнойКампании.ПолучитьСсылку();
	БизнесПроцесс.УстановитьСсылкуНового(БизнесПроцессСсылка);
	БизнесПроцесс.ОбменДанными.Загрузка = Истина;
	БизнесПроцесс.Записать();
	
	Возврат БизнесПроцессСсылка;
	
КонецФункции

&НаСервере
Процедура ОчиститьЭлементыФормыИРеквизитыНаСервере()
	
	Элементы.ГруппаСписокМакетов.Видимость = Ложь;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("РекламнаяКампания", РекламнаяКампания);
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	МакетыКампании.Ссылка КАК Макет
		|ИЗ
		|	Справочник.DMS_МакетыРекламнойКампании КАК МакетыКампании
		|ГДЕ
		|	МакетыКампании.РекламнаяКампания = &РекламнаяКампания
		|
		|УПОРЯДОЧИТЬ ПО
		|	Макет
		|АВТОУПОРЯДОЧИВАНИЕ";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаМакетов = РезультатЗапроса.Выбрать();
	
	УдаляемыеРеквизиты = Новый Массив;
	
	Пока ВыборкаМакетов.Следующий() Цикл
		
		ИдентификаторМакета = СтрЗаменить(ВРег(Строка(ВыборкаМакетов.Макет.УникальныйИдентификатор())), "-", "x");
		
		//Удаление команд
		
		КомандаКУдалению = "КомандаСогласовать_"+ИдентификаторМакета;
		
		Если Элементы.Найти(КомандаКУдалению) <> Неопределено Тогда
			УдалитьКоманду(КомандаКУдалению);
		КонецЕсли; 
		
		//Удаление декораций         
		
		ДекорацияКУдалению = "ДекорацияНетПлощадки_"+ИдентификаторМакета;
		
		Если Элементы.Найти(ДекорацияКУдалению) <> Неопределено Тогда
			УдалитьЭлементФормы(ДекорацияКУдалению);
		КонецЕсли; 
		
		ДекорацияКУдалению = "ДекорацияПлощадка_"+ИдентификаторМакета;
		
		Если Элементы.Найти(ДекорацияКУдалению) <> Неопределено Тогда      
			УдалитьЭлементФормы(ДекорацияКУдалению);
		КонецЕсли; 
		
		ДекорацияКУдалению = "ДекорацияНаСогласовании_"+ИдентификаторМакета;
		
		Если Элементы.Найти(ДекорацияКУдалению) <> Неопределено Тогда
			УдалитьЭлементФормы(ДекорацияКУдалению);
		КонецЕсли; 
		
		ДекорацияКУдалению = "ДекорацияИмяИзображения_"+ИдентификаторМакета;
		
		Если Элементы.Найти(ДекорацияКУдалению) <> Неопределено Тогда
			УдалитьЭлементФормы(ДекорацияКУдалению);
		КонецЕсли; 
		
		ДекорацияКУдалению = "ДекорацияРазмерИзображения_"+ИдентификаторМакета;
		
		Если Элементы.Найти(ДекорацияКУдалению) <> Неопределено Тогда
			УдалитьЭлементФормы(ДекорацияКУдалению);
		КонецЕсли; 
		
		//Удаление элементов формы и реквизитов
		
		РеквизитИЭлементКУдалению = "Изображение_"+ИдентификаторМакета;
		
		Если Элементы.Найти(РеквизитИЭлементКУдалению) <> Неопределено Тогда
			УдалитьЭлементИРеквизитыФормы(РеквизитИЭлементКУдалению,УдаляемыеРеквизиты);
		КонецЕсли; 
		
		РеквизитИЭлементКУдалению = "Макет_"+ИдентификаторМакета;
		
		Если Элементы.Найти(РеквизитИЭлементКУдалению) <> Неопределено Тогда
			УдалитьЭлементИРеквизитыФормы(РеквизитИЭлементКУдалению,УдаляемыеРеквизиты);
		КонецЕсли; 
		
		//Для каждого ТекущаяСтрока Из ВыборкаМакетов.Макет.КонтактнаяИнформация Цикл
		//	
		//	//Реквизит "Адрес"
		//	УдалитьЭлементИРеквизитыФормы = "Адрес"+Формат(ТекущаяСтрока.НомерСтроки,"ЧЦ=10; ЧН=0; ЧГ=")+"_" + ИдентификаторМакета;
		//	
		//	Если Элементы.Найти(УдалитьЭлементИРеквизитыФормы) <> Неопределено Тогда
		//		УдалитьЭлементИРеквизитыФормы(УдалитьЭлементИРеквизитыФормы,УдаляемыеРеквизиты);
		//	КонецЕсли; 
		//	
		//КонецЦикла; 
		
		//Удаление группа
		
		ГруппаКУдалению = "ГруппаКИМакета_"+ИдентификаторМакета;
		
		Если Элементы.Найти(ГруппаКУдалению) <> Неопределено Тогда
			УдалитьЭлементФормы(ГруппаКУдалению);
		КонецЕсли; 
		
		ГруппаКУдалению = "ГруппаМакета_"+ИдентификаторМакета;
		
		Если Элементы.Найти(ГруппаКУдалению) <> Неопределено Тогда
			УдалитьЭлементФормы(ГруппаКУдалению);
		КонецЕсли; 
		
		ГруппаКУдалению = "ГруппаМакетаОбщая_"+ИдентификаторМакета;
		
		Если Элементы.Найти(ГруппаКУдалению) <> Неопределено Тогда
			УдалитьЭлементФормы(ГруппаКУдалению);
		КонецЕсли; 
		
	КонецЦикла;
	
	Если УдаляемыеРеквизиты.Количество() > 0 Тогда
		ИзменитьРеквизиты(, УдаляемыеРеквизиты);
	КонецЕсли;
	
	Элементы.ГруппаСписокМакетов.Видимость = Истина;
	
КонецПроцедуры // ОчиститьЭлементыФормыИРеквизитыНаСервере()

&НаСервере
Процедура УдалитьЭлементФормы(ИмяЭлементыФормы)
	
	Элементы.Удалить(Элементы[ИмяЭлементыФормы]);	
	
КонецПроцедуры // УдалитьКоманду()

&НаСервере
Процедура УдалитьЭлементИРеквизитыФормы(ИмяЭлементыФормы,УдаляемыеРеквизиты)
	
	УдаляемыеРеквизиты.Добавить(ИмяЭлементыФормы);
	Элементы.Удалить(Элементы[ИмяЭлементыФормы]);	
	
КонецПроцедуры // УдалитьКоманду()

&НаСервере
Процедура УдалитьКоманду(ИмяКоманды)
	
	ЭтаФорма.Команды.Удалить(ЭтаФорма.Команды.Найти(ИмяКоманды));
	Элементы.Удалить(Элементы[ИмяКоманды]);	
	
КонецПроцедуры // УдалитьКоманду()

&НаСервереБезКонтекста
Функция ЗаписатьФайлКартинкиМакета(Макет,Картинка)
	
	Попытка
		ОбъектМакет = Макет.ПолучитьОбъект();
		ОбъектМакет.ФайлКартинки = Картинка;
		ОбъектМакет.Записать();
	Исключение
		ЗаписьЖурналаРегистрации("Запись изображения в макет",УровеньЖурналаРегистрации.Ошибка,,Макет,КраткоеПредставлениеОшибки(ИнформацияОбОшибке()));
		Возврат Ложь;
	КонецПопытки;
	
	Возврат Истина;
	
КонецФункции // ЗаписатьФайлКартинкиМакета()

&НаСервере
Процедура ИзменитьДекорацииИзображения(СсылкаНаФайл,ИдентификаторМакета)
	
	//Элемент формы "Имя изображения"
	ИмяДекорацииИмяИзображения = "ДекорацияИмяИзображения_" + ИдентификаторМакета;
	
	Элемент = Элементы[ИмяДекорацииИмяИзображения];
	Элемент.Заголовок 			  	  = СокрЛП(СсылкаНаФайл.Наименование)+"."+СокрЛП(СсылкаНаФайл.Расширение);
	Элемент.РастягиватьПоГоризонтали  = Ложь;
	Элемент.ЦветТекста				  = ЦветаСтиля.ТекстИнформационнойНадписи;
	Элемент.Ширина				      = 15;
	Элемент.Гиперссылка 			  = Ложь;
	
	Родитель = Элемент.Родитель;
	
	//Элемент формы "Размер изображения"
	ИмяДекорацииРазмерИзображения = "ДекорацияРазмерИзображения_" + ИдентификаторМакета;
	
	Элемент = Элементы.Добавить(ИмяДекорацииРазмерИзображения, Тип("ДекорацияФормы"),Родитель);
	Элемент.Заголовок 			  	  = ПолучитьСтроковоеПредставлениеРазмераФайла(СсылкаНаФайл.Размер);
	Элемент.РастягиватьПоГоризонтали  = Ложь;
	Элемент.ЦветТекста				  = ЦветаСтиля.ТекстИнформационнойНадписи;
	Элемент.Ширина				      = 15;
	
	ИмяКомандыСогласовать 	   = "КомандаСогласовать_"      + ИдентификаторМакета;
	ИмяДекорацииНаСогласовании = "ДекорацияНаСогласовании_" + ИдентификаторМакета;
	
	Если Элементы.Найти(ИмяКомандыСогласовать) <> Неопределено Тогда
		Элементы.Переместить(Элемент,Родитель,Элементы[ИмяКомандыСогласовать]);
	КонецЕсли; 
	
	Если Элементы.Найти(ИмяДекорацииНаСогласовании) <> Неопределено Тогда
		Элементы.Переместить(Элемент,Родитель,Элементы[ИмяДекорацииНаСогласовании]);
	КонецЕсли; 
	
КонецПроцедуры // ИзменитьДекорацииИзображения()

&НаКлиенте
Процедура ДобавитьФайлы(СсылкаНаМакет, ИдентификаторФайла,ИдентификаторМакета)
	                 
	ВладелецФайла = ТекущийМакет;
	ИдентификаторФормы = ИдентификаторФайла;
	
	Фильтр = DMS_РекламныеКампанииКлиент.ФильтрФайловИзображений();
	
	ВыборФайла = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	ВыборФайла.МножественныйВыбор = Истина;
	ВыборФайла.Заголовок = НСтр("ru='Выбор файла';en='file selection'");
	ВыборФайла.Фильтр = ?(ЗначениеЗаполнено(Фильтр), Фильтр, НСтр("ru='Все файлы';en='All files'") + " (*.*)|*.*");
	
	Если ВыборФайла.Выбрать() Тогда
		ПрисоединенныеФайлыМассив = Новый Массив;
		ПоместитьВыбранныеФайлыВХранилище(
		ВыборФайла.ВыбранныеФайлы,
		ВладелецФайла,
		ПрисоединенныеФайлыМассив,
		ИдентификаторФормы);
		
		Если ПрисоединенныеФайлыМассив.Количество() = 1 Тогда
			ПрисоединенныйФайл = ПрисоединенныеФайлыМассив[0];
			
			ПоказатьОповещениеПользователя(
			НСтр("ru='Создание:';en='Creature:'"),
			ПолучитьНавигационнуюСсылку(ПрисоединенныйФайл),
			ПрисоединенныйФайл,
			БиблиотекаКартинок.Информация32);
			
			мИдентификаторМакета = СтрЗаменить(ВРег(ИдентификаторМакета), "-", "x");
			
			Этаформа["Изображение_"+мИдентификаторМакета] = ПолучитьНавигационнуюСсылку(ПрисоединенныйФайл, "ФайлХранилище");
			
			ПараметрыФормы = Новый Структура("Ключ", ПрисоединенныйФайл);
			ОткрытьФорму("Справочник.DMS_МакетыРекламнойКампанииПрисоединенныеФайлы.ФормаОбъекта", ПараметрыФормы, ЭтаФорма);
			
		КонецЕсли;
		
		Если ПрисоединенныеФайлыМассив.Количество() > 0 Тогда
			ОповеститьОбИзменении(ПрисоединенныеФайлыМассив[0]);
			Оповестить("Запись_ПрисоединенныйФайл", Новый Структура("ЭтоНовый", Истина), ПрисоединенныеФайлыМассив);
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры // ДобавитьФайлы()

&НаКлиенте
Процедура ПоместитьВыбранныеФайлыВХранилище(Знач ВыбранныеФайлы,
                                            Знач ВладелецФайла,
                                            ПрисоединенныеФайлыМассив,
                                            Знач ИдентификаторФормы) Экспорт
		
	ДвоичныйФайл = Новый ДвоичныеДанные(ВыбранныеФайлы[0]);
	
	Файл = Новый Файл(ВыбранныеФайлы[0]);	
	
	СтруктураФайла = Новый Структура("Файл,Имя,Размер,Расширение",ДвоичныйФайл,Файл.ИмяБезРасширения,Файл.Размер(),Файл.Расширение);
	
	ПрисоединенныйФайл = СоздатьПрисоединенныйФайл(СтруктураФайла,ВладелецФайла);
	
	ПрисоединенныеФайлыМассив.Добавить(ПрисоединенныйФайл);
	
	Файл = Неопределено;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция СоздатьПрисоединенныйФайл(СтруктураФайла,ВладелецФайла)
		
	ОбъектФайл = Справочники.DMS_МакетыРекламнойКампанииПрисоединенныеФайлы.СоздатьЭлемент();
	ОбъектФайл.ВладелецФайла = ВладелецФайла;
	ОбъектФайл.Наименование  = СтруктураФайла.Имя;
	ОбъектФайл.Размер 		 = СтруктураФайла.Размер;
	ОбъектФайл.Расширение    = СтрЗаменить(СтруктураФайла.Расширение,".","");
	ОбъектФайл.ФайлХранилище = Новый ХранилищеЗначения(СтруктураФайла.Файл,Новый СжатиеДанных(9));
	
	ОбъектФайл.ОбменДанными.Загрузка = Истина;
	ОбъектФайл.Записать();
	
	ОбъектВладелец = ВладелецФайла.ПолучитьОбъект();
	ОбъектВладелец.ФайлКартинки = ОбъектФайл.Ссылка;
	ОбъектФайл.ОбменДанными.Загрузка = Истина;
	ОбъектВладелец.Записать();
	
	Возврат ОбъектФайл.Ссылка;
	
КонецФункции // СоздатьПрисоединенныйФайл()

&НаСервере
Процедура ИзменитьИнформациюОСтатусе(Знач ИмяКоманды,Знач ИдентификаторМакета)
	
	// Команда "Согласовать"
	
	ИмяКомандыСогласовать = "КомандаСогласовать_"+ИдентификаторМакета;
	
	мИдентификаторМакета = СтрЗаменить(ВРег(ИдентификаторМакета), "-", "x");
	
	ГруппаМакета = Элементы[ИмяКоманды].Родитель;
	
	УдалитьКоманду(ИмяКоманды);
		
	//Элемент формы "ДекорацияНаСогласовании"
	ИмяДекорацииНаСогласовании = "ДекорацияНаСогласовании_" + мИдентификаторМакета;
	
	Элемент = Элементы.Добавить(ИмяДекорацииНаСогласовании, Тип("ДекорацияФормы"),ГруппаМакета);
	Элемент.Заголовок 			  	  = "<На согласовании>";
	Элемент.РастягиватьПоГоризонтали  = Ложь;
	Элемент.Шрифт			     	  = Новый Шрифт(ШрифтыСтиля.ОбычныйШрифтТекста,,,,,Истина);
	Элемент.ЦветТекста				  = WebЦвета.Зеленый;
	Элемент.Ширина				  	  = 30;
	
КонецПроцедуры // ИзменитьИнформациюОСтатусе()
 
////#КонецОбласти

