
Перем ЗаказНаряд Экспорт;

Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)
	
	Если Не Renault_РаботаСПравамиПользователя.ЕстьПравоОткрытияПодсистемыСтрахования(ПараметрыСеанса.Пользователь) тогда
		Сообщить("Недостаточно прав доступа.");
		СтандартнаяОбработка = Ложь;
		Отказ = Истина;
		Возврат;
	КонецЕсли;	
	
	Если ЗаказНаряд <> Неопределено Тогда 
		Отбор = КомпоновщикНастроек.Настройки.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		Отбор.Использование  = Истина;
		Отбор.ВидСравнения 	 = ВидСравненияКомпоновкиДанных.Равно;
		Отбор.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("ДокументЗаказНаряд");
		Отбор.ПравоеЗначение = ЗаказНаряд;		
	КонецЕсли;
	
КонецПроцедуры
Функция ЗаполнитьНачальныеНастройки() Экспорт КонецФункции //затычка
