
//Бондаренко++ 20201030
Функция ПолучитьАвтомобилиДляТестДрайва() Экспорт 
	Запрос=Новый Запрос;
	Запрос.Текст="ВЫБРАТЬ
	|	ЗначенияСвойствОбъектов.Объект КАК Автомобиль
	|ИЗ
	|	РегистрСведений.ЗначенияСвойствОбъектов КАК ЗначенияСвойствОбъектов
	|ГДЕ
	|	ЗначенияСвойствОбъектов.Объект ССЫЛКА Справочник.Автомобили
	|	И ЗначенияСвойствОбъектов.Свойство = ЗНАЧЕНИЕ(ПланВидовХарактеристик.СвойстваОбъектов.ИспользоватьДляТестДрайва)
	|	И ЗначенияСвойствОбъектов.Значение = ИСТИНА";
	СписокАвто = Новый СписокЗначений;
	СписокАвто.ЗагрузитьЗначения(Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Автомобиль")); 
	Возврат СписокАвто;
КонецФункции
//Бондаренко-- 20201030

//Бондаренко++ 20220315
Функция ПолучитьСписокМарокИзЗапроса(HTTPRequest) Экспорт
	
	сзБренды = Неопределено;
	
	СтрокаБрендов = HTTPRequest.ПараметрыЗапроса.Получить("brand");
	
	Если СтрокаБрендов <> Неопределено  Тогда
		
		сзБренды = Новый СписокЗначений;
		сзБренды.ЗагрузитьЗначения(обМояРазложитьСтрокуВМассивПодстрок(СтрокаБрендов,","));
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	Марка.Ссылка КАК Марка,
		|	Марка.Наименование
		|ИЗ
		|	Справочник.Марка КАК Марка
		|ГДЕ
		|	Марка.Наименование В (&СписокНаименованийБрендов)";
		
		Запрос.УстановитьПараметр("СписокНаименованийБрендов", сзБренды);
		
		сзБренды.ЗагрузитьЗначения(Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Марка"));
		
	КонецЕсли;
	
	Возврат сзБренды;
	
КонецФункции  
//Бондаренко-- 20220315

//Бондаренко++ 20220424
Функция ДополнитьТаблицуЗаказамиПоставщику(ТЗ,СписокПодразделений) Экспорт
	
	ТаблицаИсточник = Новый ТаблицаЗначений;
	
	Запрос = Новый Запрос;
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ЗаказыПоставщикамНаАвтомобилиОстатки.Автомобиль,
	|	ЗаказыПоставщикамНаАвтомобилиОстатки.Автомобиль.VIN КАК VIN,
	|	СУММА(ЗаказыПоставщикамНаАвтомобилиОстатки.КоличествоОстаток) КАК Остаток,
	|	ЦенаАвто.Цена + ЦенаАвто.Автомобиль.СтоимостьДопОборудования КАК Цена,
	|	ХарАвто.Значение КАК ВидАвто,
	|	ЗаказыПоставщикамНаАвтомобилиОстатки.ЗаказПоставщику.ПодразделениеКомпании КАК Подразделение,
	|	ЗаказыПоставщикамНаАвтомобилиОстатки.ЗаказПоставщику.ПодразделениеКомпании.ДилерскийЦентр КАК ДилерскийЦентр,
	|	ЗаказыПоставщикамНаАвтомобилиОстатки.Автомобиль.Модель.МодельАвтоРу.МаркаАвтоРу КАК МаркаАвтоРу,
	|	ЗаказыПоставщикамНаАвтомобилиОстатки.Автомобиль.Модель.МодельАвтоРу КАК МодельАвтоРу,
	|	ЗаказыПоставщикамНаАвтомобилиОстатки.Автомобиль.ВариантКомплектации.МодификацияАвтоРу КАК МодификацияАвтоРу,
	|	ЗаказыПоставщикамНаАвтомобилиОстатки.Автомобиль.ВариантКомплектации.КомплектацияАвтоРу КАК КомплектацияАвтоРу,
	|	ЗаказыПоставщикамНаАвтомобилиОстатки.Автомобиль.СпециальнаяЦена КАК СпециальнаяЦена,
	|	ЗаказыПоставщикамНаАвтомобилиОстатки.Автомобиль.СкидкаПриПокупкеВКредит КАК СкидкаПриПокупкеВКредит,
	|	ЗаказыПоставщикамНаАвтомобилиОстатки.Автомобиль.СкидкаПриСтраховании КАК СкидкаПриСтраховании,
	|	ЗаказыПоставщикамНаАвтомобилиОстатки.Автомобиль.СкидаПриПокупкеВТрейдИн КАК СкидаПриПокупкеВТрейдИн,
	|	ЗаказыПоставщикамНаАвтомобилиОстатки.Автомобиль.СкидкаМаксимальная КАК СкидкаМаксимальная,
	|	ЗаказыПоставщикамНаАвтомобилиОстатки.Автомобиль.Цвет.ЦветАвтоРу КАК ЦветАвтоРу,
	|	ЗаказыПоставщикамНаАвтомобилиОстатки.Автомобиль.Цвет.ОкраскаМеталлик КАК ОкраскаМеталлик,
	|	ЗаказыПоставщикамНаАвтомобилиОстатки.Автомобиль.ВариантКомплектации.Руль КАК Руль,
	|	ЗаказыПоставщикамНаАвтомобилиОстатки.Автомобиль.ВариантКомплектации.КоличествоДверей КАК КоличествоДверей,
	|	ЗаказыПоставщикамНаАвтомобилиОстатки.Автомобиль.Модель.КатегорияТС,
	|	ПробегиАвто.Значение КАК Пробег,
	|	ЗаказыПоставщикамНаАвтомобилиОстатки.Автомобиль.Состояние КАК Состояние,
	|	ЗаказыПоставщикамНаАвтомобилиОстатки.Автомобиль.КоличествоВладельцевПоПТС КАК КоличествоВладельцев,
	|	ЗаказыПоставщикамНаАвтомобилиОстатки.Автомобиль.ВариантКомплектации.ТипКузова.ТипКузоваАвтоРу КАК ТипКузоваВариантаКомплектации,
	|	ЗаказыПоставщикамНаАвтомобилиОстатки.Автомобиль.Модель.ТипКузова.ТипКузоваАвтоРу КАК ТипКузоваМодели,
	|	ЗаказыПоставщикамНаАвтомобилиОстатки.Автомобиль.Цвет.Артикул,
	|	ЗаказыПоставщикамНаАвтомобилиОстатки.Автомобиль.ВариантКомплектации.Артикул,
	|	""На заказ"" КАК Доступность,
	|	ЗаказыПоставщикамНаАвтомобилиОстатки.ЗаказПоставщику КАК ЗаказПоставщикуНаАвто,
	|	ЗаказыПоставщикамНаАвтомобилиОстатки.ЗаказПоставщику.ВнешнийНомерЗаказа КАК ВнешнийНомерЗаказа,
	|	ЗаказыПоставщикамНаАвтомобилиОстатки.Автомобиль.Модель.Марка КАК Марка,
	|	""В пути"" КАК МестоАвто
	|ИЗ
	|	РегистрНакопления.ЗаказыПоставщикамНаАвтомобили.Остатки КАК ЗаказыПоставщикамНаАвтомобилиОстатки
	|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|			ЦеныАвтомобилейСрезПоследних.Цена КАК Цена,
	|			ЦеныАвтомобилейСрезПоследних.Автомобиль КАК Автомобиль,
	|			ЦеныАвтомобилейСрезПоследних.ВариантКомплектации КАК ВариантКомплектации,
	|			ЦеныАвтомобилейСрезПоследних.ТипЦен КАК ТипЦен
	|		ИЗ
	|			РегистрСведений.ЦеныАвтомобилей.СрезПоследних КАК ЦеныАвтомобилейСрезПоследних
	|		ГДЕ
	|			ЦеныАвтомобилейСрезПоследних.ТипЦен = ЗНАЧЕНИЕ(Справочник.ТипыЦен.ОсновнойТипЦенПродажи)) КАК ЦенаАвто
	|		ПО ЗаказыПоставщикамНаАвтомобилиОстатки.Автомобиль = ЦенаАвто.Автомобиль
	|			И ЗаказыПоставщикамНаАвтомобилиОстатки.Автомобиль.ВариантКомплектации = ЦенаАвто.Автомобиль.ВариантКомплектации
	|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|			АвтомобилиСрезПоследних.Автомобиль КАК Автомобиль,
	|			АвтомобилиСрезПоследних.ВидЗначения КАК ВидЗначения,
	|			АвтомобилиСрезПоследних.Значение КАК Значение
	|		ИЗ
	|			РегистрСведений.Автомобили.СрезПоследних КАК АвтомобилиСрезПоследних
	|		ГДЕ
	|			АвтомобилиСрезПоследних.ВидЗначения = ЗНАЧЕНИЕ(Перечисление.ДополнительнаяИнформацияАвтомобилей.ВидАвтомобиля)) КАК ХарАвто
	|		ПО ЗаказыПоставщикамНаАвтомобилиОстатки.Автомобиль = ХарАвто.Автомобиль
	|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|			АвтомобилиСрезПоследних.Автомобиль КАК Автомобиль,
	|			АвтомобилиСрезПоследних.ВидЗначения КАК ВидЗначения,
	|			АвтомобилиСрезПоследних.Значение КАК Значение
	|		ИЗ
	|			РегистрСведений.Автомобили.СрезПоследних КАК АвтомобилиСрезПоследних
	|		ГДЕ
	|			АвтомобилиСрезПоследних.ВидЗначения = ЗНАЧЕНИЕ(Перечисление.ДополнительнаяИнформацияАвтомобилей.Пробег)) КАК ПробегиАвто
	|		ПО ЗаказыПоставщикамНаАвтомобилиОстатки.Автомобиль = ПробегиАвто.Автомобиль
	|ГДЕ
	|	ЗаказыПоставщикамНаАвтомобилиОстатки.КоличествоОстаток > 0
	|	И (ХарАвто.Значение = ЗНАЧЕНИЕ(Перечисление.ВидАвтомобиля.Новый)
	|			ИЛИ ХарАвто.Значение ЕСТЬ NULL)
	|	И ЗаказыПоставщикамНаАвтомобилиОстатки.ЗаказПоставщику.ПодразделениеКомпании В(&СписокПодразделений)
	|	И ЗаказыПоставщикамНаАвтомобилиОстатки.Автомобиль.Модель.КатегорияТС = ЗНАЧЕНИЕ(Справочник.КатегорииТранспортныхСредств.АвтомобилиЛегковые)
	|
	|СГРУППИРОВАТЬ ПО
	|	ЗаказыПоставщикамНаАвтомобилиОстатки.Автомобиль,
	|	ХарАвто.Значение,
	|	ЗаказыПоставщикамНаАвтомобилиОстатки.ЗаказПоставщику.ПодразделениеКомпании.ДилерскийЦентр,
	|	ЗаказыПоставщикамНаАвтомобилиОстатки.Автомобиль.Модель.МодельАвтоРу.МаркаАвтоРу,
	|	ЗаказыПоставщикамНаАвтомобилиОстатки.Автомобиль.Модель.МодельАвтоРу,
	|	ЗаказыПоставщикамНаАвтомобилиОстатки.Автомобиль.ВариантКомплектации.МодификацияАвтоРу,
	|	ЗаказыПоставщикамНаАвтомобилиОстатки.Автомобиль.СпециальнаяЦена,
	|	ЗаказыПоставщикамНаАвтомобилиОстатки.Автомобиль.СкидкаПриПокупкеВКредит,
	|	ЗаказыПоставщикамНаАвтомобилиОстатки.Автомобиль.СкидкаПриСтраховании,
	|	ЗаказыПоставщикамНаАвтомобилиОстатки.Автомобиль.СкидаПриПокупкеВТрейдИн,
	|	ЗаказыПоставщикамНаАвтомобилиОстатки.Автомобиль.СкидкаМаксимальная,
	|	ЗаказыПоставщикамНаАвтомобилиОстатки.Автомобиль.ВариантКомплектации.КомплектацияАвтоРу,
	|	ЗаказыПоставщикамНаАвтомобилиОстатки.Автомобиль.Цвет.ЦветАвтоРу,
	|	ЗаказыПоставщикамНаАвтомобилиОстатки.Автомобиль.Цвет.ОкраскаМеталлик,
	|	ЗаказыПоставщикамНаАвтомобилиОстатки.Автомобиль.ВариантКомплектации.Руль,
	|	ЗаказыПоставщикамНаАвтомобилиОстатки.Автомобиль.ВариантКомплектации.КоличествоДверей,
	|	ПробегиАвто.Значение,
	|	ЗаказыПоставщикамНаАвтомобилиОстатки.Автомобиль.Состояние,
	|	ЗаказыПоставщикамНаАвтомобилиОстатки.Автомобиль.КоличествоВладельцевПоПТС,
	|	ЗаказыПоставщикамНаАвтомобилиОстатки.Автомобиль.ВариантКомплектации.ТипКузова.ТипКузоваАвтоРу,
	|	ЗаказыПоставщикамНаАвтомобилиОстатки.ЗаказПоставщику.ПодразделениеКомпании,
	|	ЗаказыПоставщикамНаАвтомобилиОстатки.Автомобиль.Модель.ТипКузова.ТипКузоваАвтоРу,
	|	ЗаказыПоставщикамНаАвтомобилиОстатки.Автомобиль.Цвет.Артикул,
	|	ЗаказыПоставщикамНаАвтомобилиОстатки.Автомобиль.ВариантКомплектации.Артикул,
	|	ЗаказыПоставщикамНаАвтомобилиОстатки.Автомобиль.Модель.КатегорияТС,
	|	ЦенаАвто.Цена + ЦенаАвто.Автомобиль.СтоимостьДопОборудования,
	|	ЗаказыПоставщикамНаАвтомобилиОстатки.Автомобиль.VIN,
	|	ЗаказыПоставщикамНаАвтомобилиОстатки.ЗаказПоставщику,
	|	ЗаказыПоставщикамНаАвтомобилиОстатки.ЗаказПоставщику.ВнешнийНомерЗаказа,
	|	ЗаказыПоставщикамНаАвтомобилиОстатки.Автомобиль.Модель.Марка
	|
	|УПОРЯДОЧИТЬ ПО
	|	VIN";
	
	Запрос.УстановитьПараметр("СписокПодразделений",СписокПодразделений);
	
	ТаблицаИсточник = Запрос.Выполнить().Выгрузить(); 
	
	Если ТаблицаИсточник.Количество() > 0 Тогда
		Для Каждого СтрокаТаблицыИсточник Из ТаблицаИсточник Цикл 
			НайденнаяСтрока = ТЗ.Найти(СтрокаТаблицыИсточник.VIN, "VIN");
			Если НайденнаяСтрока = Неопределено Тогда
				ЗаполнитьЗначенияСвойств(ТЗ.Добавить(), СтрокаТаблицыИсточник);
			КонецЕсли;	
		КонецЦикла;
	КонецЕсли;
	
	Возврат ТЗ;
	
КонецФункции // ДополнитьТаблицуЗаказамиПоставщику(ТЗ,СписокПодр)()
//Бондаренко-- 20220424  

//Бондаренко++ 20220627
Функция ДополнитьТаблицуЗаказамиПоставщикуКоммерция(ТЗ,СписокПодразделений) Экспорт
	
	ТаблицаИсточник = Новый ТаблицаЗначений;
	
	Запрос = Новый Запрос;
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ЗаказыПоставщикамНаАвтомобилиОстатки.Автомобиль,
	|	ЗаказыПоставщикамНаАвтомобилиОстатки.Автомобиль.VIN КАК VIN,
	|	СУММА(ЗаказыПоставщикамНаАвтомобилиОстатки.КоличествоОстаток) КАК Остаток,
	|	ЦенаАвто.Цена + ЦенаАвто.Автомобиль.СтоимостьДопОборудования КАК Цена,
	|	ХарАвто.Значение КАК ВидАвто,
	|	ЗаказыПоставщикамНаАвтомобилиОстатки.ЗаказПоставщику.ПодразделениеКомпании КАК Подразделение,
	|	ЗаказыПоставщикамНаАвтомобилиОстатки.ЗаказПоставщику.ПодразделениеКомпании.ДилерскийЦентр КАК ДилерскийЦентр,
	|	ЗаказыПоставщикамНаАвтомобилиОстатки.Автомобиль.Модель.МодельАвтоРу.МаркаАвтоРу КАК МаркаАвтоРу,
	|	ЗаказыПоставщикамНаАвтомобилиОстатки.Автомобиль.Модель.МодельАвтоРу КАК МодельАвтоРу,
	|	ЗаказыПоставщикамНаАвтомобилиОстатки.Автомобиль.ВариантКомплектации.МодификацияАвтоРу КАК МодификацияАвтоРу,
	|	ЗаказыПоставщикамНаАвтомобилиОстатки.Автомобиль.ВариантКомплектации.КомплектацияАвтоРу КАК КомплектацияАвтоРу,
	|	ЗаказыПоставщикамНаАвтомобилиОстатки.Автомобиль.СпециальнаяЦена КАК СпециальнаяЦена,
	|	ЗаказыПоставщикамНаАвтомобилиОстатки.Автомобиль.СкидкаПриПокупкеВКредит КАК СкидкаПриПокупкеВКредит,
	|	ЗаказыПоставщикамНаАвтомобилиОстатки.Автомобиль.СкидкаПриСтраховании КАК СкидкаПриСтраховании,
	|	ЗаказыПоставщикамНаАвтомобилиОстатки.Автомобиль.СкидаПриПокупкеВТрейдИн КАК СкидаПриПокупкеВТрейдИн,
	|	ЗаказыПоставщикамНаАвтомобилиОстатки.Автомобиль.СкидкаМаксимальная КАК СкидкаМаксимальная,
	|	ЗаказыПоставщикамНаАвтомобилиОстатки.Автомобиль.Цвет.ЦветАвтоРу КАК ЦветАвтоРу,
	|	ЗаказыПоставщикамНаАвтомобилиОстатки.Автомобиль.Цвет.ОкраскаМеталлик КАК ОкраскаМеталлик,
	|	ЗаказыПоставщикамНаАвтомобилиОстатки.Автомобиль.ВариантКомплектации.Руль КАК Руль,
	|	ЗаказыПоставщикамНаАвтомобилиОстатки.Автомобиль.ВариантКомплектации.КоличествоДверей КАК КоличествоДверей,
	|	ЗаказыПоставщикамНаАвтомобилиОстатки.Автомобиль.Модель.КатегорияТС,
	|	ПробегиАвто.Значение КАК Пробег,
	|	ЗаказыПоставщикамНаАвтомобилиОстатки.Автомобиль.Состояние КАК Состояние,
	|	ЗаказыПоставщикамНаАвтомобилиОстатки.Автомобиль.КоличествоВладельцевПоПТС КАК КоличествоВладельцев,
	|	ЗаказыПоставщикамНаАвтомобилиОстатки.Автомобиль.ВариантКомплектации.ТипКузова.ТипКузоваАвтоРу КАК ТипКузоваВариантаКомплектации,
	|	ЗаказыПоставщикамНаАвтомобилиОстатки.Автомобиль.Модель.ТипКузова.ТипКузоваАвтоРу КАК ТипКузоваМодели,
	|	ЗаказыПоставщикамНаАвтомобилиОстатки.Автомобиль.Цвет.Артикул,
	|	ЗаказыПоставщикамНаАвтомобилиОстатки.Автомобиль.ВариантКомплектации.Артикул,
	|	""На заказ"" КАК Доступность,
	|	ЗаказыПоставщикамНаАвтомобилиОстатки.ЗаказПоставщику КАК ЗаказПоставщикуНаАвто,
	|	ЗаказыПоставщикамНаАвтомобилиОстатки.ЗаказПоставщику.ВнешнийНомерЗаказа КАК ВнешнийНомерЗаказа,
	|	ЗаказыПоставщикамНаАвтомобилиОстатки.Автомобиль.Модель.Марка КАК Марка,
	|	""В пути"" КАК МестоАвто
	|ИЗ
	|	РегистрНакопления.ЗаказыПоставщикамНаАвтомобили.Остатки КАК ЗаказыПоставщикамНаАвтомобилиОстатки
	|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|			ЦеныАвтомобилейСрезПоследних.Цена КАК Цена,
	|			ЦеныАвтомобилейСрезПоследних.Автомобиль КАК Автомобиль,
	|			ЦеныАвтомобилейСрезПоследних.ВариантКомплектации КАК ВариантКомплектации,
	|			ЦеныАвтомобилейСрезПоследних.ТипЦен КАК ТипЦен
	|		ИЗ
	|			РегистрСведений.ЦеныАвтомобилей.СрезПоследних КАК ЦеныАвтомобилейСрезПоследних
	|		ГДЕ
	|			ЦеныАвтомобилейСрезПоследних.ТипЦен = ЗНАЧЕНИЕ(Справочник.ТипыЦен.ОсновнойТипЦенПродажи)) КАК ЦенаАвто
	|		ПО ЗаказыПоставщикамНаАвтомобилиОстатки.Автомобиль = ЦенаАвто.Автомобиль
	|			И ЗаказыПоставщикамНаАвтомобилиОстатки.Автомобиль.ВариантКомплектации = ЦенаАвто.Автомобиль.ВариантКомплектации
	|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|			АвтомобилиСрезПоследних.Автомобиль КАК Автомобиль,
	|			АвтомобилиСрезПоследних.ВидЗначения КАК ВидЗначения,
	|			АвтомобилиСрезПоследних.Значение КАК Значение
	|		ИЗ
	|			РегистрСведений.Автомобили.СрезПоследних КАК АвтомобилиСрезПоследних
	|		ГДЕ
	|			АвтомобилиСрезПоследних.ВидЗначения = ЗНАЧЕНИЕ(Перечисление.ДополнительнаяИнформацияАвтомобилей.ВидАвтомобиля)) КАК ХарАвто
	|		ПО ЗаказыПоставщикамНаАвтомобилиОстатки.Автомобиль = ХарАвто.Автомобиль
	|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|			АвтомобилиСрезПоследних.Автомобиль КАК Автомобиль,
	|			АвтомобилиСрезПоследних.ВидЗначения КАК ВидЗначения,
	|			АвтомобилиСрезПоследних.Значение КАК Значение
	|		ИЗ
	|			РегистрСведений.Автомобили.СрезПоследних КАК АвтомобилиСрезПоследних
	|		ГДЕ
	|			АвтомобилиСрезПоследних.ВидЗначения = ЗНАЧЕНИЕ(Перечисление.ДополнительнаяИнформацияАвтомобилей.Пробег)) КАК ПробегиАвто
	|		ПО ЗаказыПоставщикамНаАвтомобилиОстатки.Автомобиль = ПробегиАвто.Автомобиль
	|ГДЕ
	|	ЗаказыПоставщикамНаАвтомобилиОстатки.КоличествоОстаток > 0
	|	И (ХарАвто.Значение = ЗНАЧЕНИЕ(Перечисление.ВидАвтомобиля.Новый)
	|			ИЛИ ХарАвто.Значение ЕСТЬ NULL)
	|	И ЗаказыПоставщикамНаАвтомобилиОстатки.ЗаказПоставщику.ПодразделениеКомпании В(&СписокПодразделений)
	|	И ЗаказыПоставщикамНаАвтомобилиОстатки.Автомобиль.Модель.КатегорияТС <> ЗНАЧЕНИЕ(Справочник.КатегорииТранспортныхСредств.АвтомобилиЛегковые)
	|
	|СГРУППИРОВАТЬ ПО
	|	ЗаказыПоставщикамНаАвтомобилиОстатки.Автомобиль,
	|	ХарАвто.Значение,
	|	ЗаказыПоставщикамНаАвтомобилиОстатки.ЗаказПоставщику.ПодразделениеКомпании.ДилерскийЦентр,
	|	ЗаказыПоставщикамНаАвтомобилиОстатки.Автомобиль.Модель.МодельАвтоРу.МаркаАвтоРу,
	|	ЗаказыПоставщикамНаАвтомобилиОстатки.Автомобиль.Модель.МодельАвтоРу,
	|	ЗаказыПоставщикамНаАвтомобилиОстатки.Автомобиль.ВариантКомплектации.МодификацияАвтоРу,
	|	ЗаказыПоставщикамНаАвтомобилиОстатки.Автомобиль.СпециальнаяЦена,
	|	ЗаказыПоставщикамНаАвтомобилиОстатки.Автомобиль.СкидкаПриПокупкеВКредит,
	|	ЗаказыПоставщикамНаАвтомобилиОстатки.Автомобиль.СкидкаПриСтраховании,
	|	ЗаказыПоставщикамНаАвтомобилиОстатки.Автомобиль.СкидаПриПокупкеВТрейдИн,
	|	ЗаказыПоставщикамНаАвтомобилиОстатки.Автомобиль.СкидкаМаксимальная,
	|	ЗаказыПоставщикамНаАвтомобилиОстатки.Автомобиль.ВариантКомплектации.КомплектацияАвтоРу,
	|	ЗаказыПоставщикамНаАвтомобилиОстатки.Автомобиль.Цвет.ЦветАвтоРу,
	|	ЗаказыПоставщикамНаАвтомобилиОстатки.Автомобиль.Цвет.ОкраскаМеталлик,
	|	ЗаказыПоставщикамНаАвтомобилиОстатки.Автомобиль.ВариантКомплектации.Руль,
	|	ЗаказыПоставщикамНаАвтомобилиОстатки.Автомобиль.ВариантКомплектации.КоличествоДверей,
	|	ПробегиАвто.Значение,
	|	ЗаказыПоставщикамНаАвтомобилиОстатки.Автомобиль.Состояние,
	|	ЗаказыПоставщикамНаАвтомобилиОстатки.Автомобиль.КоличествоВладельцевПоПТС,
	|	ЗаказыПоставщикамНаАвтомобилиОстатки.Автомобиль.ВариантКомплектации.ТипКузова.ТипКузоваАвтоРу,
	|	ЗаказыПоставщикамНаАвтомобилиОстатки.ЗаказПоставщику.ПодразделениеКомпании,
	|	ЗаказыПоставщикамНаАвтомобилиОстатки.Автомобиль.Модель.ТипКузова.ТипКузоваАвтоРу,
	|	ЗаказыПоставщикамНаАвтомобилиОстатки.Автомобиль.Цвет.Артикул,
	|	ЗаказыПоставщикамНаАвтомобилиОстатки.Автомобиль.ВариантКомплектации.Артикул,
	|	ЗаказыПоставщикамНаАвтомобилиОстатки.Автомобиль.Модель.КатегорияТС,
	|	ЦенаАвто.Цена + ЦенаАвто.Автомобиль.СтоимостьДопОборудования,
	|	ЗаказыПоставщикамНаАвтомобилиОстатки.Автомобиль.VIN,
	|	ЗаказыПоставщикамНаАвтомобилиОстатки.ЗаказПоставщику,
	|	ЗаказыПоставщикамНаАвтомобилиОстатки.ЗаказПоставщику.ВнешнийНомерЗаказа,
	|	ЗаказыПоставщикамНаАвтомобилиОстатки.Автомобиль.Модель.Марка
	|
	|УПОРЯДОЧИТЬ ПО
	|	VIN";
	
	Запрос.УстановитьПараметр("СписокПодразделений",СписокПодразделений);
	
	ТаблицаИсточник = Запрос.Выполнить().Выгрузить(); 
	
	Если ТаблицаИсточник.Количество() > 0 Тогда
		Для Каждого СтрокаТаблицыИсточник Из ТаблицаИсточник Цикл 
			НайденнаяСтрока = ТЗ.Найти(СтрокаТаблицыИсточник.VIN, "VIN");
			Если НайденнаяСтрока = Неопределено Тогда
				ЗаполнитьЗначенияСвойств(ТЗ.Добавить(), СтрокаТаблицыИсточник);
			КонецЕсли;	
		КонецЦикла;
	КонецЕсли;
	
	Возврат ТЗ;
	
КонецФункции // ДополнитьТаблицуЗаказамиПоставщику(ТЗ,СписокПодр)()
//Бондаренко-- 20220627  

//Бондаренко++ 20220602
Функция ДополнитьЗаказамиПоставщикуПоМаркам(ТЗ,СписокПодразделений,СписокМарок) Экспорт
	
	ТаблицаИсточник = Новый ТаблицаЗначений;
	
	Запрос = Новый Запрос;
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ЗаказыПоставщикамНаАвтомобилиОстатки.Автомобиль,
	|	ЗаказыПоставщикамНаАвтомобилиОстатки.Автомобиль.VIN КАК VIN,
	|	СУММА(ЗаказыПоставщикамНаАвтомобилиОстатки.КоличествоОстаток) КАК Остаток,
	|	ЦенаАвто.Цена + ЦенаАвто.Автомобиль.СтоимостьДопОборудования КАК Цена,
	|	ХарАвто.Значение КАК ВидАвто,
	|	ЗаказыПоставщикамНаАвтомобилиОстатки.ЗаказПоставщику.ПодразделениеКомпании КАК Подразделение,
	|	ЗаказыПоставщикамНаАвтомобилиОстатки.ЗаказПоставщику.ПодразделениеКомпании.ДилерскийЦентр КАК ДилерскийЦентр,
	|	ЗаказыПоставщикамНаАвтомобилиОстатки.Автомобиль.Модель.МодельАвтоРу.МаркаАвтоРу КАК МаркаАвтоРу,
	|	ЗаказыПоставщикамНаАвтомобилиОстатки.Автомобиль.Модель.МодельАвтоРу КАК МодельАвтоРу,
	|	ЗаказыПоставщикамНаАвтомобилиОстатки.Автомобиль.ВариантКомплектации.МодификацияАвтоРу КАК МодификацияАвтоРу,
	|	ЗаказыПоставщикамНаАвтомобилиОстатки.Автомобиль.ВариантКомплектации.КомплектацияАвтоРу КАК КомплектацияАвтоРу,
	|	ЗаказыПоставщикамНаАвтомобилиОстатки.Автомобиль.СпециальнаяЦена КАК СпециальнаяЦена,
	|	ЗаказыПоставщикамНаАвтомобилиОстатки.Автомобиль.СкидкаПриПокупкеВКредит КАК СкидкаПриПокупкеВКредит,
	|	ЗаказыПоставщикамНаАвтомобилиОстатки.Автомобиль.СкидкаПриСтраховании КАК СкидкаПриСтраховании,
	|	ЗаказыПоставщикамНаАвтомобилиОстатки.Автомобиль.СкидаПриПокупкеВТрейдИн КАК СкидаПриПокупкеВТрейдИн,
	|	ЗаказыПоставщикамНаАвтомобилиОстатки.Автомобиль.СкидкаМаксимальная КАК СкидкаМаксимальная,
	|	ЗаказыПоставщикамНаАвтомобилиОстатки.Автомобиль.Цвет.ЦветАвтоРу КАК ЦветАвтоРу,
	|	ЗаказыПоставщикамНаАвтомобилиОстатки.Автомобиль.Цвет.ОкраскаМеталлик КАК ОкраскаМеталлик,
	|	ЗаказыПоставщикамНаАвтомобилиОстатки.Автомобиль.ВариантКомплектации.Руль КАК Руль,
	|	ЗаказыПоставщикамНаАвтомобилиОстатки.Автомобиль.ВариантКомплектации.КоличествоДверей КАК КоличествоДверей,
	|	ЗаказыПоставщикамНаАвтомобилиОстатки.Автомобиль.Модель.КатегорияТС,
	|	ПробегиАвто.Значение КАК Пробег,
	|	ЗаказыПоставщикамНаАвтомобилиОстатки.Автомобиль.Состояние КАК Состояние,
	|	ЗаказыПоставщикамНаАвтомобилиОстатки.Автомобиль.КоличествоВладельцевПоПТС КАК КоличествоВладельцев,
	|	ЗаказыПоставщикамНаАвтомобилиОстатки.Автомобиль.ВариантКомплектации.ТипКузова.ТипКузоваАвтоРу КАК ТипКузоваВариантаКомплектации,
	|	ЗаказыПоставщикамНаАвтомобилиОстатки.Автомобиль.Модель.ТипКузова.ТипКузоваАвтоРу КАК ТипКузоваМодели,
	|	ЗаказыПоставщикамНаАвтомобилиОстатки.Автомобиль.Цвет.Артикул,
	|	ЗаказыПоставщикамНаАвтомобилиОстатки.Автомобиль.ВариантКомплектации.Артикул,
	|	""На заказ"" КАК Доступность,
	|	ЗаказыПоставщикамНаАвтомобилиОстатки.ЗаказПоставщику КАК ЗаказПоставщикуНаАвто,
	|	ЗаказыПоставщикамНаАвтомобилиОстатки.ЗаказПоставщику.ВнешнийНомерЗаказа КАК ВнешнийНомерЗаказа,
	|	ЗаказыПоставщикамНаАвтомобилиОстатки.Автомобиль.Модель.Марка КАК Марка,
	|	""В пути"" КАК МестоАвто
	|ИЗ
	|	РегистрНакопления.ЗаказыПоставщикамНаАвтомобили.Остатки КАК ЗаказыПоставщикамНаАвтомобилиОстатки
	|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|			ЦеныАвтомобилейСрезПоследних.Цена КАК Цена,
	|			ЦеныАвтомобилейСрезПоследних.Автомобиль КАК Автомобиль,
	|			ЦеныАвтомобилейСрезПоследних.ВариантКомплектации КАК ВариантКомплектации,
	|			ЦеныАвтомобилейСрезПоследних.ТипЦен КАК ТипЦен
	|		ИЗ
	|			РегистрСведений.ЦеныАвтомобилей.СрезПоследних КАК ЦеныАвтомобилейСрезПоследних
	|		ГДЕ
	|			ЦеныАвтомобилейСрезПоследних.ТипЦен = ЗНАЧЕНИЕ(Справочник.ТипыЦен.ОсновнойТипЦенПродажи)) КАК ЦенаАвто
	|		ПО ЗаказыПоставщикамНаАвтомобилиОстатки.Автомобиль = ЦенаАвто.Автомобиль
	|			И ЗаказыПоставщикамНаАвтомобилиОстатки.Автомобиль.ВариантКомплектации = ЦенаАвто.Автомобиль.ВариантКомплектации
	|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|			АвтомобилиСрезПоследних.Автомобиль КАК Автомобиль,
	|			АвтомобилиСрезПоследних.ВидЗначения КАК ВидЗначения,
	|			АвтомобилиСрезПоследних.Значение КАК Значение
	|		ИЗ
	|			РегистрСведений.Автомобили.СрезПоследних КАК АвтомобилиСрезПоследних
	|		ГДЕ
	|			АвтомобилиСрезПоследних.ВидЗначения = ЗНАЧЕНИЕ(Перечисление.ДополнительнаяИнформацияАвтомобилей.ВидАвтомобиля)) КАК ХарАвто
	|		ПО ЗаказыПоставщикамНаАвтомобилиОстатки.Автомобиль = ХарАвто.Автомобиль
	|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|			АвтомобилиСрезПоследних.Автомобиль КАК Автомобиль,
	|			АвтомобилиСрезПоследних.ВидЗначения КАК ВидЗначения,
	|			АвтомобилиСрезПоследних.Значение КАК Значение
	|		ИЗ
	|			РегистрСведений.Автомобили.СрезПоследних КАК АвтомобилиСрезПоследних
	|		ГДЕ
	|			АвтомобилиСрезПоследних.ВидЗначения = ЗНАЧЕНИЕ(Перечисление.ДополнительнаяИнформацияАвтомобилей.Пробег)) КАК ПробегиАвто
	|		ПО ЗаказыПоставщикамНаАвтомобилиОстатки.Автомобиль = ПробегиАвто.Автомобиль
	|ГДЕ
	|	ЗаказыПоставщикамНаАвтомобилиОстатки.КоличествоОстаток > 0
	|	И (ХарАвто.Значение = ЗНАЧЕНИЕ(Перечисление.ВидАвтомобиля.Новый)
	|			ИЛИ ХарАвто.Значение ЕСТЬ NULL)
	|	И ЗаказыПоставщикамНаАвтомобилиОстатки.ЗаказПоставщику.ПодразделениеКомпании В(&СписокПодразделений)
	|	И ЗаказыПоставщикамНаАвтомобилиОстатки.Автомобиль.Модель.КатегорияТС = ЗНАЧЕНИЕ(Справочник.КатегорииТранспортныхСредств.АвтомобилиЛегковые)
	|	И ЗаказыПоставщикамНаАвтомобилиОстатки.Автомобиль.Модель.Марка В(&СписокМарок)
	|
	|СГРУППИРОВАТЬ ПО
	|	ЗаказыПоставщикамНаАвтомобилиОстатки.Автомобиль,
	|	ХарАвто.Значение,
	|	ЗаказыПоставщикамНаАвтомобилиОстатки.ЗаказПоставщику.ПодразделениеКомпании.ДилерскийЦентр,
	|	ЗаказыПоставщикамНаАвтомобилиОстатки.Автомобиль.Модель.МодельАвтоРу.МаркаАвтоРу,
	|	ЗаказыПоставщикамНаАвтомобилиОстатки.Автомобиль.Модель.МодельАвтоРу,
	|	ЗаказыПоставщикамНаАвтомобилиОстатки.Автомобиль.ВариантКомплектации.МодификацияАвтоРу,
	|	ЗаказыПоставщикамНаАвтомобилиОстатки.Автомобиль.СпециальнаяЦена,
	|	ЗаказыПоставщикамНаАвтомобилиОстатки.Автомобиль.СкидкаПриПокупкеВКредит,
	|	ЗаказыПоставщикамНаАвтомобилиОстатки.Автомобиль.СкидкаПриСтраховании,
	|	ЗаказыПоставщикамНаАвтомобилиОстатки.Автомобиль.СкидаПриПокупкеВТрейдИн,
	|	ЗаказыПоставщикамНаАвтомобилиОстатки.Автомобиль.СкидкаМаксимальная,
	|	ЗаказыПоставщикамНаАвтомобилиОстатки.Автомобиль.ВариантКомплектации.КомплектацияАвтоРу,
	|	ЗаказыПоставщикамНаАвтомобилиОстатки.Автомобиль.Цвет.ЦветАвтоРу,
	|	ЗаказыПоставщикамНаАвтомобилиОстатки.Автомобиль.Цвет.ОкраскаМеталлик,
	|	ЗаказыПоставщикамНаАвтомобилиОстатки.Автомобиль.ВариантКомплектации.Руль,
	|	ЗаказыПоставщикамНаАвтомобилиОстатки.Автомобиль.ВариантКомплектации.КоличествоДверей,
	|	ПробегиАвто.Значение,
	|	ЗаказыПоставщикамНаАвтомобилиОстатки.Автомобиль.Состояние,
	|	ЗаказыПоставщикамНаАвтомобилиОстатки.Автомобиль.КоличествоВладельцевПоПТС,
	|	ЗаказыПоставщикамНаАвтомобилиОстатки.Автомобиль.ВариантКомплектации.ТипКузова.ТипКузоваАвтоРу,
	|	ЗаказыПоставщикамНаАвтомобилиОстатки.ЗаказПоставщику.ПодразделениеКомпании,
	|	ЗаказыПоставщикамНаАвтомобилиОстатки.Автомобиль.Модель.ТипКузова.ТипКузоваАвтоРу,
	|	ЗаказыПоставщикамНаАвтомобилиОстатки.Автомобиль.Цвет.Артикул,
	|	ЗаказыПоставщикамНаАвтомобилиОстатки.Автомобиль.ВариантКомплектации.Артикул,
	|	ЗаказыПоставщикамНаАвтомобилиОстатки.Автомобиль.Модель.КатегорияТС,
	|	ЦенаАвто.Цена + ЦенаАвто.Автомобиль.СтоимостьДопОборудования,
	|	ЗаказыПоставщикамНаАвтомобилиОстатки.Автомобиль.VIN,
	|	ЗаказыПоставщикамНаАвтомобилиОстатки.ЗаказПоставщику,
	|	ЗаказыПоставщикамНаАвтомобилиОстатки.ЗаказПоставщику.ВнешнийНомерЗаказа,
	|	ЗаказыПоставщикамНаАвтомобилиОстатки.Автомобиль.Модель.Марка
	|
	|УПОРЯДОЧИТЬ ПО
	|	VIN УБЫВ";
	
	Запрос.УстановитьПараметр("СписокПодразделений",СписокПодразделений);
	Запрос.УстановитьПараметр("СписокМарок",СписокМарок);
	
	ТаблицаИсточник = Запрос.Выполнить().Выгрузить(); 
	
	Если ТаблицаИсточник.Количество() > 0 Тогда
		Для Каждого СтрокаТаблицыИсточник Из ТаблицаИсточник Цикл
			Если СокрЛП(СтрокаТаблицыИсточник.VIN) <> "" Тогда
				НайденнаяСтрока = ТЗ.Найти(СтрокаТаблицыИсточник.VIN, "VIN");
			Иначе	
				НайденнаяСтрока = ТЗ.Найти(СтрокаТаблицыИсточник.ВнешнийНомерЗаказа, "ВнешнийНомерЗаказа");
			КонецЕсли;
			Если НайденнаяСтрока = Неопределено Тогда
				НовСтрока = ТЗ.Добавить();
				ЗаполнитьЗначенияСвойств(НовСтрока, СтрокаТаблицыИсточник);
				//Бондаренко++ 20230714
				Если ( СтрокаТаблицыИсточник.Марка = Справочники.Марка.CHANGAN ) И ( СтрокаТаблицыИсточник.ЗаказПоставщикуНаАвто.СтатусАвтомобиля <> Справочники.СтатусыАвтомобилей.Фейк ) Тогда
					НовСтрока.МестоАвто = "В наличии";
				КонецЕсли;
				//Бондаренко-- 20230714
				//Бондаренко++ 20230823
				Если СтрокаТаблицыИсточник.Марка = Справочники.Марка.CHERY Тогда
					НовСтрока.МестоАвто = "В наличии";
				КонецЕсли;
				//Бондаренко-- 20230823
			КонецЕсли;	
		КонецЦикла;
	КонецЕсли;
	
	Возврат ТЗ;
	
КонецФункции // ДополнитьЗаказамиПоставщикуПоМаркам(ТЗ,СписокПодразделений,СписокМарок)
//Бондаренко-- 20220602  

Функция ПолучитьТаблицуЛичногоКабинетаАвтоРуИзЗапроса(HTTPRequest) Экспорт
	
	КодЛичногоКабинета = HTTPRequest.ПараметрыURL["UnitCode"];
	
	Запрос = Новый Запрос;
	Запрос.Текст =	"ВЫБРАТЬ
	              	|	СМ_ЛичныеКабинеты_АвтоРуМарки.Ссылка.Код КАК КодЛичногоКабинета,
	              	|	СМ_ЛичныеКабинеты_АвтоРуМарки.Ссылка.Ссылка КАК ЛичныйКабинет,
	              	|	СМ_ЛичныеКабинеты_АвтоРуМарки.Марка,
	              	|	СМ_ЛичныеКабинеты_АвтоРуМарки.ПредставлениеТелефона,
	              	|	СМ_ЛичныеКабинеты_АвтоРуПодразделения.Подразделение,
	              	|	СМ_ЛичныеКабинеты_АвтоРуМарки.Адрес
	              	|ИЗ
	              	|	Справочник.СМ_ЛичныеКабинеты_АвтоРу.Марки КАК СМ_ЛичныеКабинеты_АвтоРуМарки
	              	|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	              	|			СМ_ЛичныеКабинеты_АвтоРуПодразделения.Ссылка КАК Ссылка,
	              	|			СМ_ЛичныеКабинеты_АвтоРуПодразделения.ИдентификаторМарки КАК ИдентификаторМарки,
	              	|			СМ_ЛичныеКабинеты_АвтоРуПодразделения.Подразделение КАК Подразделение
	              	|		ИЗ
	              	|			Справочник.СМ_ЛичныеКабинеты_АвтоРу.Подразделения КАК СМ_ЛичныеКабинеты_АвтоРуПодразделения) КАК СМ_ЛичныеКабинеты_АвтоРуПодразделения
	              	|		ПО СМ_ЛичныеКабинеты_АвтоРуМарки.Ссылка = СМ_ЛичныеКабинеты_АвтоРуПодразделения.Ссылка
	              	|			И СМ_ЛичныеКабинеты_АвтоРуМарки.ИдентификаторМарки = СМ_ЛичныеКабинеты_АвтоРуПодразделения.ИдентификаторМарки
	              	|ГДЕ
	              	|	СМ_ЛичныеКабинеты_АвтоРуМарки.Ссылка.Код = &КодЛичногоКабинета";
	
	Запрос.УстановитьПараметр("КодЛичногоКабинета", КодЛичногоКабинета);
	
	ТЗ = Запрос.Выполнить().Выгрузить();
	
	Возврат ТЗ;
	
КонецФункции  //ПолучитьСписокПодразделенийЛичногоКабинетаИзЗапроса  

//Бондаренко++ 20220610
Функция ПолучитьXMLОбъявленийAutoruLk(ТаблицаВыгрузкиПолная, HTTPRequest) Экспорт
	
	XML_Полный=Новый ЗаписьXML();
	XML_Полный.УстановитьСтроку(Новый ПараметрыЗаписиXML("UTF-8","1.0",false));
	XML_Полный.ЗаписатьОбъявлениеXML();
	XML_Полный.ЗаписатьНачалоЭлемента("Data");
	XML_Полный.ЗаписатьНачалоЭлемента("Cars");
	
	СписокМарок = Новый СписокЗначений();
	ТаблицаМарок = ТаблицаВыгрузкиПолная.Скопировать();
	ТаблицаМарок.Свернуть("Марка","");
	СписокМарок.ЗагрузитьЗначения(ТаблицаМарок.ВыгрузитьКолонку("Марка"));	
	
	Если СписокМарок.Количество() > 0 Тогда
		Для каждого ЭлСпискаМарок Из СписокМарок Цикл
			
			ПараметрыОтбора = Новый Структура("Марка",ЭлСпискаМарок.Значение);
			ТаблицаВыгрузки = ТаблицаВыгрузкиПолная.Скопировать(ПараметрыОтбора);			
			
			XML_Полный = ПолучитьXMLAutoruLkПоМарке(ТаблицаВыгрузки, HTTPRequest,XML_Полный);
			
		КонецЦикла;
	КонецЕсли;
	
	XML_Полный.ЗаписатьКонецЭлемента();     //Data
	XML_Полный.ЗаписатьКонецЭлемента();     //Cars
	XMLТекст = XML_Полный.Закрыть();
	
	Возврат XMLТекст;
	
КонецФункции // ПолучитьXMLОбъявленийAutoruLk(ТаблицаВыгрузки, HTTPRequest)
//Бондаренко-- 20220610

//Бондаренко++ 20230314
Функция ПолучитьXMLОбъявленийAutoruLk1(ТаблицаВыгрузкиПолная, HTTPRequest) Экспорт
	
	XML_Полный=Новый ЗаписьXML();
	XML_Полный.УстановитьСтроку(Новый ПараметрыЗаписиXML("UTF-8","1.0",false));
	XML_Полный.ЗаписатьОбъявлениеXML();
	XML_Полный.ЗаписатьНачалоЭлемента("Data");
	XML_Полный.ЗаписатьНачалоЭлемента("Cars");
	
	СписокМарок = Новый СписокЗначений();
	ТаблицаМарок = ТаблицаВыгрузкиПолная.Скопировать();
	ТаблицаМарок.Свернуть("Марка","");
	СписокМарок.ЗагрузитьЗначения(ТаблицаМарок.ВыгрузитьКолонку("Марка"));	
	
	Если СписокМарок.Количество() > 0 Тогда
		Для каждого ЭлСпискаМарок Из СписокМарок Цикл
			
			ПараметрыОтбора = Новый Структура("Марка",ЭлСпискаМарок.Значение);
			ТаблицаВыгрузки = ТаблицаВыгрузкиПолная.Скопировать(ПараметрыОтбора);			
			
			XML_Полный = ПолучитьXMLAutoruLk1ПоМарке(ТаблицаВыгрузки, HTTPRequest,XML_Полный);
			
		КонецЦикла;
	КонецЕсли;
	
	XML_Полный.ЗаписатьКонецЭлемента();     //Data
	XML_Полный.ЗаписатьКонецЭлемента();     //Cars
	XMLТекст = XML_Полный.Закрыть();
	
	Возврат XMLТекст;
	
КонецФункции // ПолучитьXMLОбъявленийAutoruLk1(ТаблицаВыгрузки, HTTPRequest)
//Бондаренко-- 20230314


Функция ПолучитьXMLAutoruLkПоМарке(ТаблицаВыгрузки, HTTPRequest, XML) Экспорт
	
	//Бондаренко++ 20201030
	СписокАвтоТестДрайва = ПолучитьАвтомобилиДляТестДрайва();
	//Бондаренко-- 20201030 
	
	//Бондаренко++ 20220613
	СписокВыгруженныхАвто = Новый СписокЗначений; 
	//Бондаренко-- 20220613
	
	ТЗ = Новый ТаблицаЗначений;                                                         
	
	СписокМарокЗапроса = Новый СписокЗначений;
	СписокМарокЗапроса.ЗагрузитьЗначения(ТаблицаВыгрузки.ВыгрузитьКолонку("Марка"));
	
	тзПодразделение = ТаблицаВыгрузки.Скопировать(,"Подразделение");
	тзПодразделение.Свернуть("Подразделение");
	СписокПодразделений = Новый СписокЗначений;
	СписокПодразделений.ЗагрузитьЗначения(тзПодразделение.ВыгрузитьКолонку("Подразделение"));
	
	СписокПодразделений = ПолучитьПолныйСписокПодразделений(СписокПодразделений);
	                                  
	Запрос = Новый Запрос;
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ОстаткиАвтомобилейОстатки.Автомобиль КАК Автомобиль,
	|	ОстаткиАвтомобилейОстатки.Автомобиль.VIN КАК VIN,
	|	СУММА(ОстаткиАвтомобилейОстатки.КоличествоОстаток) КАК Остаток,
	|	ЦенаАвто.Цена + ЦенаАвто.Автомобиль.СтоимостьДопОборудования КАК Цена,
	|	ХарАвто.Значение КАК ВидАвто,
	|	ОстаткиАвтомобилейОстатки.СкладКомпании.Подразделение КАК Подразделение,
	|	ОстаткиАвтомобилейОстатки.СкладКомпании.Подразделение.ДилерскийЦентр КАК ДилерскийЦентр,
	|	ОстаткиАвтомобилейОстатки.Автомобиль.Модель.МодельАвтоРу.МаркаАвтоРу КАК МаркаАвтоРу,
	|	ОстаткиАвтомобилейОстатки.Автомобиль.Модель.МодельАвтоРу КАК МодельАвтоРу,
	|	ОстаткиАвтомобилейОстатки.Автомобиль.ВариантКомплектации.МодификацияАвтоРу КАК МодификацияАвтоРу,
	|	ОстаткиАвтомобилейОстатки.Автомобиль.ВариантКомплектации.КомплектацияАвтоРу КАК КомплектацияАвтоРу,
	|	ОстаткиАвтомобилейОстатки.Автомобиль.СпециальнаяЦена КАК СпециальнаяЦена,
	|	ОстаткиАвтомобилейОстатки.Автомобиль.СкидкаПриПокупкеВКредитМаркетинг КАК СкидкаПриПокупкеВКредитМаркетинг,
	|	ОстаткиАвтомобилейОстатки.Автомобиль.СкидкаПриПокупкеВКредит КАК СкидкаПриПокупкеВКредит,
	|	ОстаткиАвтомобилейОстатки.Автомобиль.СкидкаПриСтраховании КАК СкидкаПриСтраховании,
	|	ОстаткиАвтомобилейОстатки.Автомобиль.СкидаПриПокупкеВТрейдИнМаркетинг КАК СкидаПриПокупкеВТрейдИнМаркетинг,
	|	ОстаткиАвтомобилейОстатки.Автомобиль.СкидаПриПокупкеВТрейдИн КАК СкидаПриПокупкеВТрейдИн,
	|	ОстаткиАвтомобилейОстатки.Автомобиль.СкидкаМаксимальнаяМаркетинг КАК СкидкаМаксимальнаяМаркетинг,
	|	ОстаткиАвтомобилейОстатки.Автомобиль.СкидкаМаксимальная КАК СкидкаМаксимальная,
	|	ОстаткиАвтомобилейОстатки.Автомобиль.Цвет.ЦветАвтоРу КАК ЦветАвтоРу,
	|	ОстаткиАвтомобилейОстатки.Автомобиль.Цвет.ОкраскаМеталлик КАК ОкраскаМеталлик,
	|	ОстаткиАвтомобилейОстатки.Автомобиль.ВариантКомплектации.Руль КАК Руль,
	|	ОстаткиАвтомобилейОстатки.Автомобиль.ВариантКомплектации.КоличествоДверей КАК КоличествоДверей,
	|	ОстаткиАвтомобилейОстатки.Автомобиль.Модель.КатегорияТС КАК АвтомобильМодельКатегорияТС,
	|	ПробегиАвто.Значение КАК Пробег,
	|	ОстаткиАвтомобилейОстатки.Автомобиль.Состояние КАК Состояние,
	|	ОстаткиАвтомобилейОстатки.Автомобиль.КоличествоВладельцевПоПТС КАК КоличествоВладельцев,
	|	ОстаткиАвтомобилейОстатки.Автомобиль.ВариантКомплектации.ТипКузова.ТипКузоваАвтоРу КАК ТипКузоваВариантаКомплектации,
	|	ОстаткиАвтомобилейОстатки.Автомобиль.Модель.ТипКузова.ТипКузоваАвтоРу КАК ТипКузоваМодели,
	|	""                    "" КАК ВнешнийНомерЗаказа,
	|	ОстаткиАвтомобилейОстатки.Автомобиль.Модель.Марка КАК Марка,
	|	""В наличии"" КАК МестоАвто,
	|	ОстаткиАвтомобилейОстатки.Автомобиль.ВариантКомплектации.Артикул КАК BrandComplectationCode,
	|	ОстаткиАвтомобилейОстатки.Автомобиль.Цвет.Артикул КАК BrandColorCode
	|ИЗ
	|	РегистрНакопления.ОстаткиАвтомобилей.Остатки КАК ОстаткиАвтомобилейОстатки
	|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|			ЦеныАвтомобилейСрезПоследних.Цена КАК Цена,
	|			ЦеныАвтомобилейСрезПоследних.Автомобиль КАК Автомобиль,
	|			ЦеныАвтомобилейСрезПоследних.ВариантКомплектации КАК ВариантКомплектации,
	|			ЦеныАвтомобилейСрезПоследних.ТипЦен КАК ТипЦен
	|		ИЗ
	|			РегистрСведений.ЦеныАвтомобилей.СрезПоследних КАК ЦеныАвтомобилейСрезПоследних
	|		ГДЕ
	|			ЦеныАвтомобилейСрезПоследних.ТипЦен = ЗНАЧЕНИЕ(Справочник.ТипыЦен.ОсновнойТипЦенПродажи)) КАК ЦенаАвто
	|		ПО ОстаткиАвтомобилейОстатки.Автомобиль = ЦенаАвто.Автомобиль
	|			И ОстаткиАвтомобилейОстатки.Автомобиль.ВариантКомплектации = ЦенаАвто.Автомобиль.ВариантКомплектации
	|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|			АвтомобилиСрезПоследних.Автомобиль КАК Автомобиль,
	|			АвтомобилиСрезПоследних.ВидЗначения КАК ВидЗначения,
	|			АвтомобилиСрезПоследних.Значение КАК Значение
	|		ИЗ
	|			РегистрСведений.Автомобили.СрезПоследних КАК АвтомобилиСрезПоследних
	|		ГДЕ
	|			АвтомобилиСрезПоследних.ВидЗначения = ЗНАЧЕНИЕ(Перечисление.ДополнительнаяИнформацияАвтомобилей.ВидАвтомобиля)) КАК ХарАвто
	|		ПО ОстаткиАвтомобилейОстатки.Автомобиль = ХарАвто.Автомобиль
	|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|			АвтомобилиСрезПоследних.Автомобиль КАК Автомобиль,
	|			АвтомобилиСрезПоследних.ВидЗначения КАК ВидЗначения,
	|			АвтомобилиСрезПоследних.Значение КАК Значение
	|		ИЗ
	|			РегистрСведений.Автомобили.СрезПоследних КАК АвтомобилиСрезПоследних
	|		ГДЕ
	|			АвтомобилиСрезПоследних.ВидЗначения = ЗНАЧЕНИЕ(Перечисление.ДополнительнаяИнформацияАвтомобилей.Пробег)) КАК ПробегиАвто
	|		ПО ОстаткиАвтомобилейОстатки.Автомобиль = ПробегиАвто.Автомобиль
	|ГДЕ
	|	ОстаткиАвтомобилейОстатки.КоличествоОстаток > 0
	|	И (ХарАвто.Значение = ЗНАЧЕНИЕ(Перечисление.ВидАвтомобиля.Новый)
	|			ИЛИ ХарАвто.Значение = ЗНАЧЕНИЕ(Перечисление.ВидАвтомобиля.АвтомобильСПробегом))
	|	И ОстаткиАвтомобилейОстатки.СкладКомпании.Подразделение В(&СписокПодразделений)
	|	И ОстаткиАвтомобилейОстатки.Автомобиль.Модель.КатегорияТС = ЗНАЧЕНИЕ(Справочник.КатегорииТранспортныхСредств.АвтомобилиЛегковые)
	|	И ОстаткиАвтомобилейОстатки.Автомобиль.Модель.Марка В(&СписокМарокЗапроса)
	|
	|СГРУППИРОВАТЬ ПО
	|	ОстаткиАвтомобилейОстатки.Автомобиль,
	|	ОстаткиАвтомобилейОстатки.Автомобиль.VIN,
	|	ХарАвто.Значение,
	|	ОстаткиАвтомобилейОстатки.СкладКомпании.Подразделение.ДилерскийЦентр,
	|	ОстаткиАвтомобилейОстатки.Автомобиль.Модель.МодельАвтоРу.МаркаАвтоРу,
	|	ОстаткиАвтомобилейОстатки.Автомобиль.Модель.МодельАвтоРу,
	|	ОстаткиАвтомобилейОстатки.Автомобиль.ВариантКомплектации.МодификацияАвтоРу,
	|	ОстаткиАвтомобилейОстатки.Автомобиль.СпециальнаяЦена,
	|	ОстаткиАвтомобилейОстатки.Автомобиль.СкидкаПриПокупкеВКредит,
	|	ОстаткиАвтомобилейОстатки.Автомобиль.СкидкаПриСтраховании,
	|	ОстаткиАвтомобилейОстатки.Автомобиль.СкидаПриПокупкеВТрейдИн,
	|	ОстаткиАвтомобилейОстатки.Автомобиль.СкидкаМаксимальная,
	|	ОстаткиАвтомобилейОстатки.Автомобиль.ВариантКомплектации.КомплектацияАвтоРу,
	|	ОстаткиАвтомобилейОстатки.Автомобиль.Цвет.ЦветАвтоРу,
	|	ОстаткиАвтомобилейОстатки.Автомобиль.Цвет.ОкраскаМеталлик,
	|	ОстаткиАвтомобилейОстатки.Автомобиль.ВариантКомплектации.Руль,
	|	ОстаткиАвтомобилейОстатки.Автомобиль.ВариантКомплектации.КоличествоДверей,
	|	ПробегиАвто.Значение,
	|	ОстаткиАвтомобилейОстатки.Автомобиль.Состояние,
	|	ОстаткиАвтомобилейОстатки.Автомобиль.КоличествоВладельцевПоПТС,
	|	ОстаткиАвтомобилейОстатки.Автомобиль.ВариантКомплектации.ТипКузова.ТипКузоваАвтоРу,
	|	ОстаткиАвтомобилейОстатки.СкладКомпании.Подразделение,
	|	ОстаткиАвтомобилейОстатки.Автомобиль.Модель.ТипКузова.ТипКузоваАвтоРу,
	|	ОстаткиАвтомобилейОстатки.Автомобиль.Модель.КатегорияТС,
	|	ЦенаАвто.Цена + ЦенаАвто.Автомобиль.СтоимостьДопОборудования,
	|	ОстаткиАвтомобилейОстатки.Автомобиль.Модель.Марка,
	|	ОстаткиАвтомобилейОстатки.Автомобиль.СкидкаМаксимальнаяМаркетинг,
	|	ОстаткиАвтомобилейОстатки.Автомобиль.СкидкаПриПокупкеВКредитМаркетинг,
	|	ОстаткиАвтомобилейОстатки.Автомобиль.СкидаПриПокупкеВТрейдИнМаркетинг
	|
	|УПОРЯДОЧИТЬ ПО
	|	VIN";
	
	Запрос.УстановитьПараметр("СписокПодразделений",СписокПодразделений);
	Запрос.УстановитьПараметр("СписокМарокЗапроса",СписокМарокЗапроса);
	
	ТЗ = Запрос.Выполнить().Выгрузить(); 
	
	//Бондаренко++ 20220424
	ТЗ = ДополнитьЗаказамиПоставщикуПоМаркам(ТЗ,СписокПодразделений,СписокМарокЗапроса); 
	//Бондаренко-- 20220424	
	
	//СписокМарок = Новый СписокЗначений;
	
	Для каждого Стр1 Из ТЗ Цикл
		
		//Бондаренко++ 20220713
		Если НЕ Стр1.Автомобиль.ВыгружатьАвтомобильНаСайт Тогда
			Продолжить;	
		КонецЕсли; 
		//Бондаренко-- 20220713
		
		Если СписокАвтоТестДрайва.НайтиПоЗначению(Стр1.Автомобиль) <> Неопределено Тогда
			Продолжить;
		КонецЕсли; 
		
		//Бондаренко++ 20230126
		Если АвтомобильНовый(Стр1.Автомобиль) Тогда 
		//Если АвтомобильНовый(Стр1.Автомобиль) Тогда
			//Ничего не делаем
		Иначе
			//пропускаем все б/у непараллельного импорта
			Продолжить;		
 		КонецЕсли;
 		//Бондаренко-- 20230126
		
		//Бондаренко++ 20220613
		Если СписокВыгруженныхАвто.НайтиПоЗначению(Стр1.Автомобиль) <> Неопределено Тогда
			Продолжить;		
		КонецЕсли; 
  		СписокВыгруженныхАвто.Добавить(Стр1.Автомобиль);		
		//Бондаренко-- 20220613
		
		XML.ЗаписатьНачалоЭлемента("car");
		XML.ЗаписатьНачалоЭлемента("mark_id");             XML.ЗаписатьТекст(Стр1.Автомобиль.Модель.Марка.МаркаАвтоРу.Наименование);                 XML.ЗаписатьКонецЭлемента();
		XML.ЗаписатьНачалоЭлемента("folder_id");           XML.ЗаписатьТекст(Стр1.Автомобиль.Модель.МодельАвтоРу.Наименование);                      XML.ЗаписатьКонецЭлемента();
		XML.ЗаписатьНачалоЭлемента("modification_id");     XML.ЗаписатьТекст(Стр1.Автомобиль.ВариантКомплектации.МодификацияАвтоРу.Наименование);    XML.ЗаписатьКонецЭлемента();
		XML.ЗаписатьНачалоЭлемента("complectation_name");  XML.ЗаписатьТекст(Стр1.Автомобиль.ВариантКомплектации.КомплектацияАвтоРу.Наименование);   XML.ЗаписатьКонецЭлемента();
		
		//Бондаренко++ 20260212
		XML.ЗаписатьНачалоЭлемента("BrandComplectationCode"); XML.ЗаписатьТекст(Стр1.Автомобиль.ВариантКомплектации.Артикул);                        XML.ЗаписатьКонецЭлемента();
		XML.ЗаписатьНачалоЭлемента("BrandColorCode");         XML.ЗаписатьТекст(Стр1.Автомобиль.Цвет.Артикул);                                       XML.ЗаписатьКонецЭлемента();
		//Бондаренко-- 20260212
		
		Если НЕ обЗначениеНеЗаполнено(Стр1.Автомобиль.ВариантКомплектации.ТипКузова.ТипКузоваАвтоРу) Тогда
			XML.ЗаписатьНачалоЭлемента("body_type");       XML.ЗаписатьТекст(СокрЛП(Стр1.Автомобиль.ВариантКомплектации.ТипКузова.ТипКузоваАвтоРу)); XML.ЗаписатьКонецЭлемента();
		ИначеЕсли НЕ обЗначениеНеЗаполнено(Стр1.Автомобиль.Модель.ТипКузова.ТипКузоваАвтоРу) Тогда
			XML.ЗаписатьНачалоЭлемента("body_type");       XML.ЗаписатьТекст(СокрЛП(Стр1.Автомобиль.Модель.ТипКузова.ТипКузоваАвтоРу));              XML.ЗаписатьКонецЭлемента();
		КонецЕсли; 
		
		XML.ЗаписатьНачалоЭлемента("wheel");               XML.ЗаписатьТекст(СокрЛП(Стр1.Руль));                                                     XML.ЗаписатьКонецЭлемента();
		XML.ЗаписатьНачалоЭлемента("color");               XML.ЗаписатьТекст(СокрЛП(Стр1.ЦветАвтоРу));                                               XML.ЗаписатьКонецЭлемента();
		XML.ЗаписатьНачалоЭлемента("metallic");            XML.ЗаписатьТекст(СокрЛП(Нрег(Стр1.Автомобиль.Цвет.ОкраскаМеталлик)));                    XML.ЗаписатьКонецЭлемента();
		
		//Бондаренко++ 20230823
		Если НЕ Стр1.Марка = Справочники.Марка.CHERY Тогда
		//Бондаренко-- 20230823	
			Если СокрЛП(Стр1.МестоАвто) = "В пути" Тогда
				XML.ЗаписатьНачалоЭлемента("availability"); XML.ЗаписатьТекст("На заказ");                                                           XML.ЗаписатьКонецЭлемента();
			Иначе
				XML.ЗаписатьНачалоЭлемента("availability"); XML.ЗаписатьТекст(СокрЛП(Стр1.МестоАвто));                                               XML.ЗаписатьКонецЭлемента();
			КонецЕсли;
		//Бондаренко++ 20230823
		Иначе
			XML.ЗаписатьНачалоЭлемента("availability");    XML.ЗаписатьТекст("В наличии");                                                           XML.ЗаписатьКонецЭлемента();
		КонецЕсли;
		//Бондаренко-- 20230823
		
		XML.ЗаписатьНачалоЭлемента("custom");              XML.ЗаписатьТекст("Растаможен");                                                          XML.ЗаписатьКонецЭлемента();
		XML.ЗаписатьНачалоЭлемента("state");               XML.ЗаписатьТекст(СокрЛП(Стр1.Состояние));                                                XML.ЗаписатьКонецЭлемента();
		XML.ЗаписатьНачалоЭлемента("owners_number");       XML.ЗаписатьТекст("Не было владельцев");                                                  XML.ЗаписатьКонецЭлемента();
		//XML.ЗаписатьНачалоЭлемента("run");               XML.ЗаписатьТекст(СокрЛП(Стр1.Пробег));                                                   XML.ЗаписатьКонецЭлемента();
		XML.ЗаписатьНачалоЭлемента("run");                 XML.ЗаписатьТекст("0");                                                                   XML.ЗаписатьКонецЭлемента();
		
		//Бондаренко++ 20220629
		Если обЗначениеНеЗаполнено(Стр1.Автомобиль.ГодВыпуска) Тогда
			ГодВыпуска_ = НачалоГода(ТекущаяДата());	
		Иначе		
			ГодВыпуска_ = Стр1.Автомобиль.ГодВыпуска;		
		КонецЕсли;             
		//Бондаренко-- 20220629
		XML.ЗаписатьНачалоЭлемента("year");                XML.ЗаписатьТекст(Формат(ГодВыпуска_,"ДФ=yyyy"));                                         XML.ЗаписатьКонецЭлемента();
		
		//XML.ЗаписатьНачалоЭлемента("registry_year");     XML.ЗаписатьТекст(Формат(Стр1.Автомобиль.ГодВыпуска,"ДФ=yyyy"));                          XML.ЗаписатьКонецЭлемента();
		XML.ЗаписатьНачалоЭлемента("doors_count");         XML.ЗаписатьТекст(СокрЛП(Стр1.КоличествоДверей));                                         XML.ЗаписатьКонецЭлемента();
		XML.ЗаписатьНачалоЭлемента("currency");            XML.ЗаписатьТекст("RUR");                                                                 XML.ЗаписатьКонецЭлемента();
		XML.ЗаписатьНачалоЭлемента("vin");                 XML.ЗаписатьТекст(Стр1.Автомобиль.VIN);                                                   XML.ЗаписатьКонецЭлемента();
		
 		XML.ЗаписатьНачалоЭлемента("price");                 XML.ЗаписатьТекст(СокрЛП(СтрЗаменить(Цел(Стр1.Цена*0.99),Символы.НПП,"")));                       XML.ЗаписатьКонецЭлемента(); 
		
		XML.ЗаписатьНачалоЭлемента("online_view_available"); XML.ЗаписатьТекст("true");                                                              XML.ЗаписатьКонецЭлемента(); 
		XML.ЗаписатьНачалоЭлемента("booking_allowed");       XML.ЗаписатьТекст("true");                                                              XML.ЗаписатьКонецЭлемента(); 
		
		XML.ЗаписатьНачалоЭлемента("special_price");       XML.ЗаписатьТекст(СокрЛП(СтрЗаменить(Стр1.СпециальнаяЦена,Символы.НПП,"")));              XML.ЗаписатьКонецЭлемента(); 
		//Иванченко 20250206 ++
		//БЫЛО
		//XML.ЗаписатьНачалоЭлемента("credit_discount");     XML.ЗаписатьТекст(СокрЛП(СтрЗаменить(Стр1.СкидкаПриПокупкеВКредит,Символы.НПП,"")));      XML.ЗаписатьКонецЭлемента();
		//XML.ЗаписатьНачалоЭлемента("insurance_discount");  XML.ЗаписатьТекст(СокрЛП(СтрЗаменить(Стр1.СкидкаПриСтраховании,Символы.НПП,"")));         XML.ЗаписатьКонецЭлемента();  
		//XML.ЗаписатьНачалоЭлемента("tradein_discount");    XML.ЗаписатьТекст(СокрЛП(СтрЗаменить(Стр1.СкидаПриПокупкеВТрейдИн,Символы.НПП,"")));      XML.ЗаписатьКонецЭлемента();  
		//XML.ЗаписатьНачалоЭлемента("max_discount");        XML.ЗаписатьТекст(СокрЛП(СтрЗаменить(Стр1.СкидкаМаксимальная,Символы.НПП,"")));           XML.ЗаписатьКонецЭлемента(); 	
		//СТАЛО
		Если ЗначениеЗаполнено(Стр1.СкидкаПриПокупкеВКредитМаркетинг)Тогда
			XML.ЗаписатьНачалоЭлемента("credit_discount");     XML.ЗаписатьТекст(СокрЛП(СтрЗаменить(Стр1.СкидкаПриПокупкеВКредитМаркетинг,Символы.НПП,"")));      XML.ЗаписатьКонецЭлемента();
		Иначе	
			XML.ЗаписатьНачалоЭлемента("credit_discount");     XML.ЗаписатьТекст(СокрЛП(СтрЗаменить(Стр1.СкидкаПриПокупкеВКредит,Символы.НПП,"")));      XML.ЗаписатьКонецЭлемента();
		КонецЕсли;  
		
		XML.ЗаписатьНачалоЭлемента("insurance_discount");  XML.ЗаписатьТекст(СокрЛП(СтрЗаменить(Стр1.СкидкаПриСтраховании,Символы.НПП,"")));         XML.ЗаписатьКонецЭлемента();  
		
		Если ЗначениеЗаполнено(Стр1.СкидаПриПокупкеВТрейдИнМаркетинг)Тогда
			XML.ЗаписатьНачалоЭлемента("tradein_discount");    XML.ЗаписатьТекст(СокрЛП(СтрЗаменить(Стр1.СкидаПриПокупкеВТрейдИнМаркетинг,Символы.НПП,"")));      XML.ЗаписатьКонецЭлемента();  
		Иначе				
			XML.ЗаписатьНачалоЭлемента("tradein_discount");    XML.ЗаписатьТекст(СокрЛП(СтрЗаменить(Стр1.СкидаПриПокупкеВТрейдИн,Символы.НПП,"")));      XML.ЗаписатьКонецЭлемента();  
		КонецЕсли;  
		
		Если ЗначениеЗаполнено(Стр1.СкидкаМаксимальнаяМаркетинг)Тогда
			XML.ЗаписатьНачалоЭлемента("max_discount");        XML.ЗаписатьТекст(СокрЛП(СтрЗаменить(Стр1.СкидкаМаксимальнаяМаркетинг,Символы.НПП,"")));           XML.ЗаписатьКонецЭлемента(); 
		Иначе							
			XML.ЗаписатьНачалоЭлемента("max_discount");        XML.ЗаписатьТекст(СокрЛП(СтрЗаменить(Стр1.СкидкаМаксимальная,Символы.НПП,"")));           XML.ЗаписатьКонецЭлемента(); 
		КонецЕсли; 	
		//Иванченко 20250206 --	
		Если Стр1.Автомобиль.ПутьКФото.Количество() > 0 Тогда
			XML.ЗаписатьНачалоЭлемента("images");
			Для каждого СтрТЧ Из Стр1.Автомобиль.ПутьКФото Цикл
				XML.ЗаписатьНачалоЭлемента("image"); 
				//Бондаренко++ 20220303
				//XML.ЗаписатьТекст(HTTPRequest.БазовыйURL+"/photo/"+Стр1.Автомобиль.VIN+"/"+СтрТЧ.НомерСтроки+".jpg");
				XML.ЗаписатьТекст(HTTPRequest.БазовыйURL+"/photo/"+Стр1.Автомобиль.УникальныйИдентификатор()+"/"+СтрТЧ.GUID+".jpg");
				//Бондаренко-- 20220303
				XML.ЗаписатьКонецЭлемента(); //url	
			КонецЦикла; 
			XML.ЗаписатьКонецЭлемента(); //images	
		КонецЕсли; 
		
		XML.ЗаписатьНачалоЭлемента("unique_id");           XML.ЗаписатьТекст(СокрЛП(Стр1.Автомобиль.Код));                                               XML.ЗаписатьКонецЭлемента();
		
		//Бондаренко++ 20220929                    
		ВидеоДляСайта = "";
		ВидеоДляСайта = СМ_ВыгрузкаОбъявленийОПродажеАвто.СМГ_СправочникВернутьЗначениеРеквизита("СсылкаНаВидео",Стр1.Автомобиль.ПолучитьОбъект());
		ВидеоДляСайта = СтрЗаменить(ВидеоДляСайта,"https://youtu.be/","https://www.youtube.com/watch?v=");		
		//Бондаренко-- 20220929		

		Если НЕ обЗначениеНеЗаполнено(ВидеоДляСайта) Тогда
			XML.ЗаписатьНачалоЭлемента("video");     XML.ЗаписатьТекст(ВидеоДляСайта); 	                                             XML.ЗаписатьКонецЭлемента(); 		
		КонецЕсли; 
		
		ТекстКлассифайда = СокрЛП(Стр1.Автомобиль.Модель.ТекстКлассифайда);
		Если обЗначениеНеЗаполнено(ТекстКлассифайда) Тогда
			ТекстКлассифайда = СокрЛП(Стр1.Подразделение.ТекстКлассифайда);
			Если обЗначениеНеЗаполнено(ТекстКлассифайда) Тогда
				ТекстКлассифайда = СокрЛП(Стр1.Подразделение.Родитель.ТекстКлассифайда);
			КонецЕсли; 
		КонецЕсли; 
		
		//Бондаренко++ 20230318
		АдресОтделаПродаж = "";
		АдресОтделаПродаж = ПолучитьАдресОтделаПродажПодразделения(ТаблицаВыгрузки,Стр1.Марка,Стр1.Подразделение);
 		XML.ЗаписатьНачалоЭлемента("poi_id");      XML.ЗаписатьТекст(СокрЛП(АдресОтделаПродаж));                                             XML.ЗаписатьКонецЭлемента(); 
		//Бондаренко-- 20230318
		
		ТелефонОтделаПродаж = "";
		ТелефонОтделаПродаж = ПолучитьТелефонОтделаПродажПодразделения(ТаблицаВыгрузки,Стр1.Марка,Стр1.Подразделение);
		
		XML.ЗаписатьНачалоЭлемента("contact_info");
		XML.ЗаписатьНачалоЭлемента("contact");
		XML.ЗаписатьНачалоЭлемента("name");       XML.ЗаписатьТекст("Отдел продаж");                                                          XML.ЗаписатьКонецЭлемента(); 
		XML.ЗаписатьНачалоЭлемента("phone");      XML.ЗаписатьТекст(СокрЛП(ТелефонОтделаПродаж));                                             XML.ЗаписатьКонецЭлемента(); 
		XML.ЗаписатьНачалоЭлемента("time");       XML.ЗаписатьТекст("00:08-20:00");                                                           XML.ЗаписатьКонецЭлемента(); 
		XML.ЗаписатьКонецЭлемента();	 //contact
		XML.ЗаписатьКонецЭлемента();     //contact_info
		
		XML.ЗаписатьНачалоЭлемента("description");   XML.ЗаписатьТекст(ТекстКлассифайда);                                                              XML.ЗаписатьКонецЭлемента();	 //comment
		
		XML.ЗаписатьКонецЭлемента(); //Car
		
	КонецЦикла; 
	
	Возврат XML;
	
КонецФункции //ПолучитьXMLОбъявленийAutoruLk(ТаблицаВыгрузки, HTTPRequest)

//Бондаренко++ 20230314
Функция ПолучитьXMLAutoruLk1ПоМарке(ТаблицаВыгрузки, HTTPRequest, XML) Экспорт
	
	//Бондаренко++ 20201030
	СписокАвтоТестДрайва = ПолучитьАвтомобилиДляТестДрайва();
	//Бондаренко-- 20201030 
	
	//Бондаренко++ 20220613
	СписокВыгруженныхАвто = Новый СписокЗначений; 
	//Бондаренко-- 20220613
	
	ТЗ = Новый ТаблицаЗначений;                                                         
	
	СписокМарокЗапроса = Новый СписокЗначений;
	СписокМарокЗапроса.ЗагрузитьЗначения(ТаблицаВыгрузки.ВыгрузитьКолонку("Марка"));
	
	тзПодразделение = ТаблицаВыгрузки.Скопировать(,"Подразделение");
	тзПодразделение.Свернуть("Подразделение");
	СписокПодразделений = Новый СписокЗначений;
	СписокПодразделений.ЗагрузитьЗначения(тзПодразделение.ВыгрузитьКолонку("Подразделение"));
	
	СписокПодразделений = ПолучитьПолныйСписокПодразделений(СписокПодразделений);
	
	Запрос = Новый Запрос;
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ОстаткиАвтомобилейОстатки.Автомобиль,
	|	ОстаткиАвтомобилейОстатки.Автомобиль.VIN КАК VIN,
	|	СУММА(ОстаткиАвтомобилейОстатки.КоличествоОстаток) КАК Остаток,
	|	ЦенаАвто.Цена + ЦенаАвто.Автомобиль.СтоимостьДопОборудования КАК Цена,
	|	ХарАвто.Значение КАК ВидАвто,
	|	ОстаткиАвтомобилейОстатки.СкладКомпании.Подразделение КАК Подразделение,
	|	ОстаткиАвтомобилейОстатки.СкладКомпании.Подразделение.ДилерскийЦентр КАК ДилерскийЦентр,
	|	ОстаткиАвтомобилейОстатки.Автомобиль.Модель.МодельАвтоРу.МаркаАвтоРу КАК МаркаАвтоРу,
	|	ОстаткиАвтомобилейОстатки.Автомобиль.Модель.МодельАвтоРу КАК МодельАвтоРу,
	|	ОстаткиАвтомобилейОстатки.Автомобиль.ВариантКомплектации.МодификацияАвтоРу КАК МодификацияАвтоРу,
	|	ОстаткиАвтомобилейОстатки.Автомобиль.ВариантКомплектации.КомплектацияАвтоРу КАК КомплектацияАвтоРу,
	|	ОстаткиАвтомобилейОстатки.Автомобиль.СпециальнаяЦена КАК СпециальнаяЦена,
	|	ОстаткиАвтомобилейОстатки.Автомобиль.СкидкаПриПокупкеВКредит КАК СкидкаПриПокупкеВКредит,
	|	ОстаткиАвтомобилейОстатки.Автомобиль.СкидкаПриСтраховании КАК СкидкаПриСтраховании,
	|	ОстаткиАвтомобилейОстатки.Автомобиль.СкидаПриПокупкеВТрейдИн КАК СкидаПриПокупкеВТрейдИн,
	|	ОстаткиАвтомобилейОстатки.Автомобиль.СкидкаМаксимальная КАК СкидкаМаксимальная,
	|	ОстаткиАвтомобилейОстатки.Автомобиль.Цвет.ЦветАвтоРу КАК ЦветАвтоРу,
	|	ОстаткиАвтомобилейОстатки.Автомобиль.Цвет.ОкраскаМеталлик КАК ОкраскаМеталлик,
	|	ОстаткиАвтомобилейОстатки.Автомобиль.ВариантКомплектации.Руль КАК Руль,
	|	ОстаткиАвтомобилейОстатки.Автомобиль.ВариантКомплектации.КоличествоДверей КАК КоличествоДверей,
	|	ОстаткиАвтомобилейОстатки.Автомобиль.Модель.КатегорияТС,
	|	ПробегиАвто.Значение КАК Пробег,
	|	ОстаткиАвтомобилейОстатки.Автомобиль.Состояние КАК Состояние,
	|	ОстаткиАвтомобилейОстатки.Автомобиль.КоличествоВладельцевПоПТС КАК КоличествоВладельцев,
	|	ОстаткиАвтомобилейОстатки.Автомобиль.ВариантКомплектации.ТипКузова.ТипКузоваАвтоРу КАК ТипКузоваВариантаКомплектации,
	|	ОстаткиАвтомобилейОстатки.Автомобиль.Модель.ТипКузова.ТипКузоваАвтоРу КАК ТипКузоваМодели,
	|	""                    "" КАК ВнешнийНомерЗаказа,
	|	ОстаткиАвтомобилейОстатки.Автомобиль.Модель.Марка КАК Марка,
	|	""В наличии"" КАК МестоАвто
	|ИЗ
	|	РегистрНакопления.ОстаткиАвтомобилей.Остатки КАК ОстаткиАвтомобилейОстатки
	|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|			ЦеныАвтомобилейСрезПоследних.Цена КАК Цена,
	|			ЦеныАвтомобилейСрезПоследних.Автомобиль КАК Автомобиль,
	|			ЦеныАвтомобилейСрезПоследних.ВариантКомплектации КАК ВариантКомплектации,
	|			ЦеныАвтомобилейСрезПоследних.ТипЦен КАК ТипЦен
	|		ИЗ
	|			РегистрСведений.ЦеныАвтомобилей.СрезПоследних КАК ЦеныАвтомобилейСрезПоследних
	|		ГДЕ
	|			ЦеныАвтомобилейСрезПоследних.ТипЦен = ЗНАЧЕНИЕ(Справочник.ТипыЦен.ОсновнойТипЦенПродажи)) КАК ЦенаАвто
	|		ПО ОстаткиАвтомобилейОстатки.Автомобиль = ЦенаАвто.Автомобиль
	|			И ОстаткиАвтомобилейОстатки.Автомобиль.ВариантКомплектации = ЦенаАвто.Автомобиль.ВариантКомплектации
	|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|			АвтомобилиСрезПоследних.Автомобиль КАК Автомобиль,
	|			АвтомобилиСрезПоследних.ВидЗначения КАК ВидЗначения,
	|			АвтомобилиСрезПоследних.Значение КАК Значение
	|		ИЗ
	|			РегистрСведений.Автомобили.СрезПоследних КАК АвтомобилиСрезПоследних
	|		ГДЕ
	|			АвтомобилиСрезПоследних.ВидЗначения = ЗНАЧЕНИЕ(Перечисление.ДополнительнаяИнформацияАвтомобилей.ВидАвтомобиля)) КАК ХарАвто
	|		ПО ОстаткиАвтомобилейОстатки.Автомобиль = ХарАвто.Автомобиль
	|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|			АвтомобилиСрезПоследних.Автомобиль КАК Автомобиль,
	|			АвтомобилиСрезПоследних.ВидЗначения КАК ВидЗначения,
	|			АвтомобилиСрезПоследних.Значение КАК Значение
	|		ИЗ
	|			РегистрСведений.Автомобили.СрезПоследних КАК АвтомобилиСрезПоследних
	|		ГДЕ
	|			АвтомобилиСрезПоследних.ВидЗначения = ЗНАЧЕНИЕ(Перечисление.ДополнительнаяИнформацияАвтомобилей.Пробег)) КАК ПробегиАвто
	|		ПО ОстаткиАвтомобилейОстатки.Автомобиль = ПробегиАвто.Автомобиль
	|ГДЕ
	|	ОстаткиАвтомобилейОстатки.КоличествоОстаток > 0
	|	И (ХарАвто.Значение = ЗНАЧЕНИЕ(Перечисление.ВидАвтомобиля.Новый)
	|			ИЛИ ХарАвто.Значение = ЗНАЧЕНИЕ(Перечисление.ВидАвтомобиля.АвтомобильСПробегом)
	|			ИЛИ ХарАвто.Значение = ЗНАЧЕНИЕ(Перечисление.ВидАвтомобиля.ПараллельныйИмпорт))
	|	И ОстаткиАвтомобилейОстатки.СкладКомпании.Подразделение В(&СписокПодразделений)
	|	И ОстаткиАвтомобилейОстатки.Автомобиль.Модель.КатегорияТС = ЗНАЧЕНИЕ(Справочник.КатегорииТранспортныхСредств.АвтомобилиЛегковые)
	|	И ОстаткиАвтомобилейОстатки.Автомобиль.Модель.Марка В(&СписокМарокЗапроса)
	|
	|СГРУППИРОВАТЬ ПО
	|	ОстаткиАвтомобилейОстатки.Автомобиль,
	|	ОстаткиАвтомобилейОстатки.Автомобиль.VIN,
	|	ХарАвто.Значение,
	|	ОстаткиАвтомобилейОстатки.СкладКомпании.Подразделение.ДилерскийЦентр,
	|	ОстаткиАвтомобилейОстатки.Автомобиль.Модель.МодельАвтоРу.МаркаАвтоРу,
	|	ОстаткиАвтомобилейОстатки.Автомобиль.Модель.МодельАвтоРу,
	|	ОстаткиАвтомобилейОстатки.Автомобиль.ВариантКомплектации.МодификацияАвтоРу,
	|	ОстаткиАвтомобилейОстатки.Автомобиль.СпециальнаяЦена,
	|	ОстаткиАвтомобилейОстатки.Автомобиль.СкидкаПриПокупкеВКредит,
	|	ОстаткиАвтомобилейОстатки.Автомобиль.СкидкаПриСтраховании,
	|	ОстаткиАвтомобилейОстатки.Автомобиль.СкидаПриПокупкеВТрейдИн,
	|	ОстаткиАвтомобилейОстатки.Автомобиль.СкидкаМаксимальная,
	|	ОстаткиАвтомобилейОстатки.Автомобиль.ВариантКомплектации.КомплектацияАвтоРу,
	|	ОстаткиАвтомобилейОстатки.Автомобиль.Цвет.ЦветАвтоРу,
	|	ОстаткиАвтомобилейОстатки.Автомобиль.Цвет.ОкраскаМеталлик,
	|	ОстаткиАвтомобилейОстатки.Автомобиль.ВариантКомплектации.Руль,
	|	ОстаткиАвтомобилейОстатки.Автомобиль.ВариантКомплектации.КоличествоДверей,
	|	ПробегиАвто.Значение,
	|	ОстаткиАвтомобилейОстатки.Автомобиль.Состояние,
	|	ОстаткиАвтомобилейОстатки.Автомобиль.КоличествоВладельцевПоПТС,
	|	ОстаткиАвтомобилейОстатки.Автомобиль.ВариантКомплектации.ТипКузова.ТипКузоваАвтоРу,
	|	ОстаткиАвтомобилейОстатки.СкладКомпании.Подразделение,
	|	ОстаткиАвтомобилейОстатки.Автомобиль.Модель.ТипКузова.ТипКузоваАвтоРу,
	|	ОстаткиАвтомобилейОстатки.Автомобиль.Модель.КатегорияТС,
	|	ЦенаАвто.Цена + ЦенаАвто.Автомобиль.СтоимостьДопОборудования,
	|	ОстаткиАвтомобилейОстатки.Автомобиль.Модель.Марка
	|
	|УПОРЯДОЧИТЬ ПО
	|	VIN";
	
	Запрос.УстановитьПараметр("СписокПодразделений",СписокПодразделений);
	Запрос.УстановитьПараметр("СписокМарокЗапроса",СписокМарокЗапроса);
	
	ТЗ = Запрос.Выполнить().Выгрузить(); 
	
	//Бондаренко++ 20220424
	ТЗ = ДополнитьЗаказамиПоставщикуПоМаркам(ТЗ,СписокПодразделений,СписокМарокЗапроса); 
	//Бондаренко-- 20220424	
	
	//СписокМарок = Новый СписокЗначений;
	
	Для каждого Стр1 Из ТЗ Цикл
		
		//Бондаренко++ 20220713
		Если НЕ Стр1.Автомобиль.ВыгружатьАвтомобильНаСайт Тогда
			Продолжить;	
		КонецЕсли; 
		//Бондаренко-- 20220713
		
		Если СписокАвтоТестДрайва.НайтиПоЗначению(Стр1.Автомобиль) <> Неопределено Тогда
			Продолжить;
		КонецЕсли; 
		
		//Бондаренко++ 20230712
		Если АвтомобильНовый(Стр1.Автомобиль) Тогда
			//Ничего не делаем
		ИначеЕсли ( АвтомобильПараллельногоИмпорта(Стр1.Автомобиль) И  Стр1.Автомобиль.АвитоАвтоРуДром ) Тогда 
		  	//Ничего не делаем
		Иначе
			//пропускаем все остальные 
			Продолжить;		
 		КонецЕсли;
 		//Бондаренко-- 20230712
		
		//Бондаренко++ 20220613
		Если СписокВыгруженныхАвто.НайтиПоЗначению(Стр1.Автомобиль) <> Неопределено Тогда
			Продолжить;		
		КонецЕсли; 
  		СписокВыгруженныхАвто.Добавить(Стр1.Автомобиль);		
		//Бондаренко-- 20220613
		
		XML.ЗаписатьНачалоЭлемента("car");
		XML.ЗаписатьНачалоЭлемента("mark_id");             XML.ЗаписатьТекст(Стр1.Автомобиль.Модель.Марка.МаркаАвтоРу.Наименование);                 XML.ЗаписатьКонецЭлемента();
		XML.ЗаписатьНачалоЭлемента("folder_id");           XML.ЗаписатьТекст(Стр1.Автомобиль.Модель.МодельАвтоРу.Наименование);                      XML.ЗаписатьКонецЭлемента();
		XML.ЗаписатьНачалоЭлемента("modification_id");     XML.ЗаписатьТекст(Стр1.Автомобиль.ВариантКомплектации.МодификацияАвтоРу.Наименование);    XML.ЗаписатьКонецЭлемента();
		XML.ЗаписатьНачалоЭлемента("complectation_name");  XML.ЗаписатьТекст(Стр1.Автомобиль.ВариантКомплектации.КомплектацияАвтоРу.Наименование);   XML.ЗаписатьКонецЭлемента();
		
		Если НЕ обЗначениеНеЗаполнено(Стр1.Автомобиль.ВариантКомплектации.ТипКузова.ТипКузоваАвтоРу) Тогда
			XML.ЗаписатьНачалоЭлемента("body_type");       XML.ЗаписатьТекст(СокрЛП(Стр1.Автомобиль.ВариантКомплектации.ТипКузова.ТипКузоваАвтоРу)); XML.ЗаписатьКонецЭлемента();
		ИначеЕсли НЕ обЗначениеНеЗаполнено(Стр1.Автомобиль.Модель.ТипКузова.ТипКузоваАвтоРу) Тогда
			XML.ЗаписатьНачалоЭлемента("body_type");       XML.ЗаписатьТекст(СокрЛП(Стр1.Автомобиль.Модель.ТипКузова.ТипКузоваАвтоРу));              XML.ЗаписатьКонецЭлемента();
		КонецЕсли; 
		
		XML.ЗаписатьНачалоЭлемента("wheel");               XML.ЗаписатьТекст(СокрЛП(Стр1.Руль));                                                     XML.ЗаписатьКонецЭлемента();
		XML.ЗаписатьНачалоЭлемента("color");               XML.ЗаписатьТекст(СокрЛП(Стр1.ЦветАвтоРу));                                               XML.ЗаписатьКонецЭлемента();
		XML.ЗаписатьНачалоЭлемента("metallic");            XML.ЗаписатьТекст(СокрЛП(Нрег(Стр1.Автомобиль.Цвет.ОкраскаМеталлик)));                    XML.ЗаписатьКонецЭлемента();

		//Бондаренко++ 20230512
		Если НЕ Стр1.Марка = Справочники.Марка.CHANGAN Тогда
			Если СокрЛП(Стр1.МестоАвто) = "В пути" Тогда
				XML.ЗаписатьНачалоЭлемента("availability"); XML.ЗаписатьТекст("На заказ");                                                           XML.ЗаписатьКонецЭлемента();
			Иначе
				XML.ЗаписатьНачалоЭлемента("availability"); XML.ЗаписатьТекст(СокрЛП(Стр1.МестоАвто));                                               XML.ЗаписатьКонецЭлемента();
			КонецЕсли;
		Иначе
			XML.ЗаписатьНачалоЭлемента("availability");    XML.ЗаписатьТекст("В наличии");                                                           XML.ЗаписатьКонецЭлемента();
		КонецЕсли;
		//Бондаренко++ 20230512
		
		XML.ЗаписатьНачалоЭлемента("custom");              XML.ЗаписатьТекст("Растаможен");                                                          XML.ЗаписатьКонецЭлемента();
		XML.ЗаписатьНачалоЭлемента("state");               XML.ЗаписатьТекст(СокрЛП(Стр1.Состояние));                                                XML.ЗаписатьКонецЭлемента();
		XML.ЗаписатьНачалоЭлемента("owners_number");       XML.ЗаписатьТекст("Не было владельцев");                                                  XML.ЗаписатьКонецЭлемента();
		//XML.ЗаписатьНачалоЭлемента("run");               XML.ЗаписатьТекст(СокрЛП(Стр1.Пробег));                                                   XML.ЗаписатьКонецЭлемента();
		XML.ЗаписатьНачалоЭлемента("run");                 XML.ЗаписатьТекст("0");                                                                   XML.ЗаписатьКонецЭлемента();
		
		//Бондаренко++ 20220629
		Если обЗначениеНеЗаполнено(Стр1.Автомобиль.ГодВыпуска) Тогда
			ГодВыпуска_ = НачалоГода(ТекущаяДата());	
		Иначе		
			ГодВыпуска_ = Стр1.Автомобиль.ГодВыпуска;		
		КонецЕсли;             
		//Бондаренко-- 20220629
		XML.ЗаписатьНачалоЭлемента("year");                XML.ЗаписатьТекст(Формат(ГодВыпуска_,"ДФ=yyyy"));                                         XML.ЗаписатьКонецЭлемента();
		
		//XML.ЗаписатьНачалоЭлемента("registry_year");     XML.ЗаписатьТекст(Формат(Стр1.Автомобиль.ГодВыпуска,"ДФ=yyyy"));                          XML.ЗаписатьКонецЭлемента();
		XML.ЗаписатьНачалоЭлемента("doors_count");         XML.ЗаписатьТекст(СокрЛП(Стр1.КоличествоДверей));                                         XML.ЗаписатьКонецЭлемента();
		XML.ЗаписатьНачалоЭлемента("currency");            XML.ЗаписатьТекст("RUR");                                                                 XML.ЗаписатьКонецЭлемента();
		XML.ЗаписатьНачалоЭлемента("vin");                 XML.ЗаписатьТекст(Стр1.Автомобиль.VIN);                                                   XML.ЗаписатьКонецЭлемента();
		
		XML.ЗаписатьНачалоЭлемента("price");                 XML.ЗаписатьТекст(СокрЛП(СтрЗаменить(Стр1.Цена,Символы.НПП,"")));                       XML.ЗаписатьКонецЭлемента(); 
		
		XML.ЗаписатьНачалоЭлемента("online_view_available"); XML.ЗаписатьТекст("true");                                                              XML.ЗаписатьКонецЭлемента(); 
		XML.ЗаписатьНачалоЭлемента("booking_allowed");       XML.ЗаписатьТекст("true");                                                              XML.ЗаписатьКонецЭлемента(); 
		
		XML.ЗаписатьНачалоЭлемента("special_price");       XML.ЗаписатьТекст(СокрЛП(СтрЗаменить(Стр1.СпециальнаяЦена,Символы.НПП,"")));              XML.ЗаписатьКонецЭлемента(); 
		XML.ЗаписатьНачалоЭлемента("credit_discount");     XML.ЗаписатьТекст(СокрЛП(СтрЗаменить(Стр1.СкидкаПриПокупкеВКредит,Символы.НПП,"")));      XML.ЗаписатьКонецЭлемента(); 
		XML.ЗаписатьНачалоЭлемента("insurance_discount");  XML.ЗаписатьТекст(СокрЛП(СтрЗаменить(Стр1.СкидкаПриСтраховании,Символы.НПП,"")));         XML.ЗаписатьКонецЭлемента();  
		XML.ЗаписатьНачалоЭлемента("tradein_discount");    XML.ЗаписатьТекст(СокрЛП(СтрЗаменить(Стр1.СкидаПриПокупкеВТрейдИн,Символы.НПП,"")));      XML.ЗаписатьКонецЭлемента();  
		XML.ЗаписатьНачалоЭлемента("max_discount");        XML.ЗаписатьТекст(СокрЛП(СтрЗаменить(Стр1.СкидкаМаксимальная,Символы.НПП,"")));           XML.ЗаписатьКонецЭлемента(); 
		
		Если Стр1.Автомобиль.ПутьКФото.Количество() > 0 Тогда
			XML.ЗаписатьНачалоЭлемента("images");
			Для каждого СтрТЧ Из Стр1.Автомобиль.ПутьКФото Цикл
				XML.ЗаписатьНачалоЭлемента("image"); 
				//Бондаренко++ 20220303
				//XML.ЗаписатьТекст(HTTPRequest.БазовыйURL+"/photo/"+Стр1.Автомобиль.VIN+"/"+СтрТЧ.НомерСтроки+".jpg");
				XML.ЗаписатьТекст(HTTPRequest.БазовыйURL+"/photo/"+Стр1.Автомобиль.УникальныйИдентификатор()+"/"+СтрТЧ.GUID+".jpg");
				//Бондаренко-- 20220303
				XML.ЗаписатьКонецЭлемента(); //url	
			КонецЦикла; 
			XML.ЗаписатьКонецЭлемента(); //images	
		КонецЕсли; 
		
		XML.ЗаписатьНачалоЭлемента("unique_id");           XML.ЗаписатьТекст(СокрЛП(Стр1.Автомобиль.Код));                                               XML.ЗаписатьКонецЭлемента();
		
		//Бондаренко++ 20220929                    
		ВидеоДляСайта = "";
		ВидеоДляСайта = СМ_ВыгрузкаОбъявленийОПродажеАвто.СМГ_СправочникВернутьЗначениеРеквизита("СсылкаНаВидео",Стр1.Автомобиль.ПолучитьОбъект());
		ВидеоДляСайта = СтрЗаменить(ВидеоДляСайта,"https://youtu.be/","https://www.youtube.com/watch?v=");		
		//Бондаренко-- 20220929		
		
		Если НЕ обЗначениеНеЗаполнено(ВидеоДляСайта) Тогда
			XML.ЗаписатьНачалоЭлемента("video");     XML.ЗаписатьТекст(ВидеоДляСайта); 	                                             XML.ЗаписатьКонецЭлемента(); 		
		КонецЕсли; 
		
		ТекстКлассифайда = СокрЛП(Стр1.Автомобиль.Модель.ТекстКлассифайда);
		Если обЗначениеНеЗаполнено(ТекстКлассифайда) Тогда
			ТекстКлассифайда = СокрЛП(Стр1.Подразделение.ТекстКлассифайда);
			Если обЗначениеНеЗаполнено(ТекстКлассифайда) Тогда
				ТекстКлассифайда = СокрЛП(Стр1.Подразделение.Родитель.ТекстКлассифайда);
			КонецЕсли; 
		КонецЕсли; 
		
		ТелефонОтделаПродаж = "";
		ТелефонОтделаПродаж = ПолучитьТелефонОтделаПродажПодразделения(ТаблицаВыгрузки,Стр1.Марка,Стр1.Подразделение);
		
		XML.ЗаписатьНачалоЭлемента("contact_info");
		XML.ЗаписатьНачалоЭлемента("contact");
		XML.ЗаписатьНачалоЭлемента("name");       XML.ЗаписатьТекст("Отдел продаж");                                                          XML.ЗаписатьКонецЭлемента(); 
		XML.ЗаписатьНачалоЭлемента("phone");      XML.ЗаписатьТекст(СокрЛП(ТелефонОтделаПродаж));                                             XML.ЗаписатьКонецЭлемента(); 
		XML.ЗаписатьНачалоЭлемента("time");       XML.ЗаписатьТекст("00:08-20:00");                                                           XML.ЗаписатьКонецЭлемента(); 
		XML.ЗаписатьКонецЭлемента();	 //contact
		XML.ЗаписатьКонецЭлемента();     //contact_info
		
		XML.ЗаписатьНачалоЭлемента("description");   XML.ЗаписатьТекст(ТекстКлассифайда);                                                              XML.ЗаписатьКонецЭлемента();	 //comment
		
		XML.ЗаписатьКонецЭлемента(); //Car
		
	КонецЦикла; 
	
	Возврат XML;
	
КонецФункции //ПолучитьXMLAutoruLk1ПоМарке(ТаблицаВыгрузки, HTTPRequest, XML)
//Бондаренко-- 20230314
 
//Бондаренко++ 20220831
Функция ПолучитьТелефонОтделаПродажПодразделения(ТаблицаВыгрузки,Марка,Подразделение) Экспорт
	
	Телефон_ = "";
	
	ПараметрыОтбора = Новый Структура;
	ПараметрыОтбора.Вставить("Марка",Марка);
	ПараметрыОтбора.Вставить("Подразделение",Подразделение);
	
	НайденныеСтроки = ТаблицаВыгрузки.НайтиСтроки(ПараметрыОтбора);
	
	Если НайденныеСтроки.Количество() > 0 Тогда
		Телефон_ = СтрЗаменить(НайденныеСтроки[0].ПредставлениеТелефона,", ","");	
	Иначе
		ПараметрыОтбора.Вставить("Подразделение",Подразделение.Родитель);
		НайденныеСтроки = ТаблицаВыгрузки.НайтиСтроки(ПараметрыОтбора);
		Если НайденныеСтроки.Количество() > 0 Тогда
			Телефон_ = СтрЗаменить(НайденныеСтроки[0].ПредставлениеТелефона,", ","");	
		КонецЕсли;	
	КонецЕсли;
	
	Возврат Телефон_;
	
КонецФункции // ПолучитьТелефонОтделаПродаж(ТаблицаВыгрузки,Марка,Подразделение)
//Бондаренко-- 20220831 
 
Функция ПолучитьПолныйСписокПодразделений(ИсхСписок) Экспорт
	
	ПолныйСписокПодразделений = Новый СписокЗначений;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ПодразделенияКомпании.Ссылка,
	|	ПодразделенияКомпании.Родитель.Ссылка
	|ИЗ
	|	Справочник.ПодразделенияКомпании КАК ПодразделенияКомпании
	|ГДЕ
	|	(ПодразделенияКомпании.Родитель В (&ИсхСписок)
	|			ИЛИ ПодразделенияКомпании.Ссылка В (&ИсхСписок))";
	
	Запрос.УстановитьПараметр("ИсхСписок", ИсхСписок);
	
	ПолныйСписокПодразделений.ЗагрузитьЗначения(Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка"));
	
	Возврат ПолныйСписокПодразделений;
	
КонецФункции

Функция ПолучитьТелефонОтделаПродаж(ТаблицаВыгрузки,Марка) Экспорт
	
	Телефон_ = "";
	
	ПараметрыОтбора = Новый Структура;
	ПараметрыОтбора.Вставить("Марка",Марка);
	
	НайденныеСтроки = ТаблицаВыгрузки.НайтиСтроки(ПараметрыОтбора);
	
	Если НайденныеСтроки.Количество() > 0 Тогда
		Телефон_ = СтрЗаменить(НайденныеСтроки[0].ПредставлениеТелефона,", ","");	
	КонецЕсли;
	
	Возврат Телефон_;
	
КонецФункции // ПолучитьТелефонОтделаПродаж(ТаблицаВыгрузки,Марка)
//Бондаренко-- 20220531 

//Бондаренко-- 20250207
Функция ПолучитьСпецусловияКредитаОтделаПродаж(ТаблицаВыгрузки,Марка) Экспорт
	
	СпецусловияКредита_ = "";
	
	ПараметрыОтбора = Новый Структура;
	ПараметрыОтбора.Вставить("Марка",Марка);
	
	НайденныеСтроки = ТаблицаВыгрузки.НайтиСтроки(ПараметрыОтбора);
	
	Если НайденныеСтроки.Количество() > 0 Тогда
		СпецусловияКредита_ = СтрЗаменить(НайденныеСтроки[0].СпецусловияКредита,", ","");	
	КонецЕсли;
	
	Возврат СпецусловияКредита_;
	
КонецФункции // ПолучитьТелефонОтделаПродаж(ТаблицаВыгрузки,Марка)
//Бондаренко-- 20250207

//Бондаренко++ 20220608
Функция ПолучитьАдресОтделаПродаж(ТаблицаВыгрузки,Марка) Экспорт
	
	Адрес_ = "";
	
	ПараметрыОтбора = Новый Структура;
	ПараметрыОтбора.Вставить("Марка",Марка);
	
	НайденныеСтроки = ТаблицаВыгрузки.НайтиСтроки(ПараметрыОтбора);
	
	Если НайденныеСтроки.Количество() > 0 Тогда
		Адрес_ = СокрЛП(НайденныеСтроки[0].Адрес);	
	КонецЕсли;
	
	Возврат Адрес_;
	
КонецФункции // ПолучитьАдресОтделаПродаж(ТаблицаВыгрузки,Марка)
//Бондаренко-- 20220608

Функция ПолучитьТаблицуЛичногоКабинетаАвитоИзЗапроса(КодЛичногоКабинета) Экспорт
	
	//КодЛичногоКабинета = HTTPRequest.ПараметрыURL["UnitCode"];
	
	Запрос = Новый Запрос;
	Запрос.Текст =	"ВЫБРАТЬ
	              	|	СМ_ЛичныеКабинеты_АвитоМарки.Ссылка.Код КАК КодЛичногоКабинета,
	              	|	СМ_ЛичныеКабинеты_АвитоМарки.Ссылка.Ссылка КАК ЛичныйКабинет,
	              	|	СМ_ЛичныеКабинеты_АвитоМарки.Марка КАК Марка,
	              	|	СМ_ЛичныеКабинеты_АвитоМарки.ПредставлениеТелефона КАК ПредставлениеТелефона,
	              	|	СМ_ЛичныеКабинеты_АвитоПодразделения.Подразделение КАК Подразделение,
	              	|	СМ_ЛичныеКабинеты_АвитоМарки.Ссылка.СпецусловияКредита КАК СпецусловияКредита,
	              	|	СМ_ЛичныеКабинеты_АвитоМарки.Адрес КАК Адрес,
	              	|	СМ_ЛичныеКабинеты_АвитоМарки.Ссылка.АксессуарыВПодарок КАК АксессуарыВПодарок,
	              	|	СМ_ЛичныеКабинеты_АвитоМарки.Ссылка.БыстроеОформление КАК БыстроеОформление
	              	|ИЗ
	              	|	Справочник.СМ_ЛичныеКабинеты_Авито.Марки КАК СМ_ЛичныеКабинеты_АвитоМарки
	              	|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	              	|			СМ_ЛичныеКабинеты_АвитоПодразделения.Ссылка КАК Ссылка,
	              	|			СМ_ЛичныеКабинеты_АвитоПодразделения.ИдентификаторМарки КАК ИдентификаторМарки,
	              	|			СМ_ЛичныеКабинеты_АвитоПодразделения.Подразделение КАК Подразделение
	              	|		ИЗ
	              	|			Справочник.СМ_ЛичныеКабинеты_Авито.Подразделения КАК СМ_ЛичныеКабинеты_АвитоПодразделения) КАК СМ_ЛичныеКабинеты_АвитоПодразделения
	              	|		ПО СМ_ЛичныеКабинеты_АвитоМарки.Ссылка = СМ_ЛичныеКабинеты_АвитоПодразделения.Ссылка
	              	|			И СМ_ЛичныеКабинеты_АвитоМарки.ИдентификаторМарки = СМ_ЛичныеКабинеты_АвитоПодразделения.ИдентификаторМарки
	              	|ГДЕ
	              	|	СМ_ЛичныеКабинеты_АвитоМарки.Ссылка.Код = &КодЛичногоКабинета";
	
	Запрос.УстановитьПараметр("КодЛичногоКабинета", КодЛичногоКабинета);
	
	ТЗ = Запрос.Выполнить().Выгрузить();
	
	Возврат ТЗ;
	
КонецФункции  //ПолучитьТаблицуЛичногоКабинетаАвитоИзЗапроса(HTTPRequest)

//Бондаренко++ 20220628
Функция ПолучитьСписокАвтоОстатковИзаказов(ТаблицаВыгрузкиПолная) Экспорт
	
	СписокАвто = Новый СписокЗначений;
	ТаблицаАвто = ПолучитьТаблицуАвто();
	
	СписокМарок = Новый СписокЗначений();
	ТаблицаМарок = ТаблицаВыгрузкиПолная.Скопировать();
	ТаблицаМарок.Свернуть("Марка","");
	СписокМарок.ЗагрузитьЗначения(ТаблицаМарок.ВыгрузитьКолонку("Марка"));	
	
	Если СписокМарок.Количество() > 0 Тогда
		Для каждого ЭлСпискаМарок Из СписокМарок Цикл
			ТекМарка = ЭлСпискаМарок.Значение;
			ПараметрыОтбора = Новый Структура("Марка",ТекМарка);
			ТаблицаВыгрузки = ТаблицаВыгрузкиПолная.Скопировать(ПараметрыОтбора);	
			СписокПодразделений = ПолучитьИтоговыйСписокПодразделений(ТаблицаВыгрузки);
			Для каждого Стр Из ТаблицаАвто Цикл
				Если Стр.Автомобиль.Модель.Марка <> ТекМарка Тогда
					Продолжить;				
				КонецЕсли;
				Если СписокПодразделений.НайтиПоЗначению(Стр.Подразделение) = Неопределено  Тогда
					Продолжить;				
				КонецЕсли;
				Если СписокАвто.НайтиПоЗначению(Стр.Автомобиль) <> Неопределено Тогда
					Продолжить;				                                                                    	
				КонецЕсли;
				СписокАвто.Добавить(Стр.Автомобиль);
			КонецЦикла;
		КонецЦикла;	 
	КонецЕсли; 
	
	Возврат СписокАвто;
	
КонецФункции // СписокАвтоОстатковИзаказов(ТаблицаВыгрузкиПолная)

Процедура ЗаполнитьОбъявлениеАвитоЛегковой(ТекАвто,HTTPRequestБазовыйURL,АдресОтделаПродаж,ТелефонОтделаПродаж,СпецусловияКредита,АксессуарыВПодарок,БыстроеОформление,XML_Полный) Экспорт
	
	ТаблицаАвто = ПолучитьТаблицуАвто();
	
	XML_Полный.ЗаписатьНачалоЭлемента("Ad");
	XML_Полный.ЗаписатьНачалоЭлемента("Id");                  XML_Полный.ЗаписатьТекст(СокрЛП(ТекАвто.Код));                     XML_Полный.ЗаписатьКонецЭлемента();
	
	//АдресОтделаПродаж = "";
	//АдресОтделаПродаж = ПолучитьАдресОтделаПродаж(ТаблицаДляВыгрузки,ТекАвто.Модель.Марка);		
	XML_Полный.ЗаписатьНачалоЭлемента("Address");             XML_Полный.ЗаписатьТекст(АдресОтделаПродаж);                       XML_Полный.ЗаписатьКонецЭлемента();
	
	//Бондаренко++ 20220714
	//ТекстКлассифайда = СокрЛП(ТекАвто.ТекстКлассифайда);
	ТекстКлассифайда = СМ_ВыгрузкаОбъявленийОПродажеАвто.СМГ_СправочникВернутьЗначениеРеквизита("ТекстКлассифайда",ТекАвто.ПолучитьОбъект());
	//Бондаренко-- 20220714
	
	Если обЗначениеНеЗаполнено(ТекстКлассифайда) Тогда
		ТекПодразделение = ПолучитьПодразделениеАвто(ТекАвто);
		Если Не обЗначениеНеЗаполнено(ТекПодразделение) Тогда
			ТекстКлассифайда = СокрЛП(ТекПодразделение.ТекстКлассифайда);
			Если обЗначениеНеЗаполнено(ТекстКлассифайда) Тогда
				Попытка ТекстКлассифайда = СокрЛП(ТекПодразделение.Родитель.ТекстКлассифайда); Исключение	КонецПопытки;  
				Если обЗначениеНеЗаполнено(ТекстКлассифайда) Тогда
					Попытка ТекстКлассифайда = СокрЛП(ТекПодразделение.Родитель.Родитель.ТекстКлассифайда); Исключение	КонецПопытки;  
				КонецЕсли; 		
			КонецЕсли; 
		КонецЕсли;
	КонецЕсли; 
	XML_Полный.ЗаписатьНачалоЭлемента("Description");         XML_Полный.ЗаписатьТекст(ТекстКлассифайда);                        XML_Полный.ЗаписатьКонецЭлемента();	 //Description
	
	XML_Полный.ЗаписатьНачалоЭлемента("Category");            XML_Полный.ЗаписатьТекст("Автомобили");                            XML_Полный.ЗаписатьКонецЭлемента();	 //Category
	XML_Полный.ЗаписатьНачалоЭлемента("CarType");             XML_Полный.ЗаписатьТекст("Новые");                                 XML_Полный.ЗаписатьКонецЭлемента();	 //CarType
	
	ПолнаяЦенаПродажи = 0.00;
	ПарОтбора = Новый Структура();
	ПарОтбора.Вставить("Автомобиль",ТекАвто);
	ПарОтбора.Вставить("ТипЦен",Справочники.ТипыЦен.ОсновнойТипЦенПродажи);
	ЦенаАвто = РегистрыСведений.ЦеныАвтомобилей.ПолучитьПоследнее(ТекущаяДата(),ПарОтбора).Цена;
	ПолнаяЦенаПродажи = ЦенаАвто+ТекАвто.СтоимостьДопОборудования;
	
	//Бондаренко++ 20231219 
	Если  ТекАвто.СтоимостьДопОборудованияМаркетинг <> 0 Тогда
		ПолнаяЦенаПродажи = ЦенаАвто+ТекАвто.СтоимостьДопОборудованияМаркетинг;
 	КонецЕсли;
	//Бондаренко-- 20231219 
	
	XML_Полный.ЗаписатьНачалоЭлемента("Price");          XML_Полный.ЗаписатьТекст(СтрЗаменить(ПолнаяЦенаПродажи,Символы.НПП,""));  XML_Полный.ЗаписатьКонецЭлемента();		 			
	
	//Бондаренко++ 20250221
 	СуммаОбычныхСкидок  = 0;
 	СуммаМаркетинговыхСкидок = 0;
	
	Попытка
		СуммаОбычныхСкидок  = ТекАвто.СкидкаПриСтраховании + ТекАвто.СкидаПриПокупкеВТрейдИн + ТекАвто.СкидкаПриПокупкеВКредит;	
	Исключение
 	КонецПопытки;
	
	Попытка
		СуммаМаркетинговыхСкидок  = ТекАвто.СкидаПриПокупкеВТрейдИнМаркетинг + ТекАвто.СкидкаПриПокупкеВКредитМаркетинг;
	Исключение
	КонецПопытки;
	
	Если СуммаОбычныхСкидок > СуммаМаркетинговыхСкидок Тогда
		Если НЕ обЗначениеНезаполнено(ТекАвто.СкидкаПриСтраховании) Тогда
			XML_Полный.ЗаписатьНачалоЭлемента("InsuranceDiscount");  XML_Полный.ЗаписатьТекст(СокрЛП(СтрЗаменить(ТекАвто.СкидкаПриСтраховании,Символы.НПП,"")));         XML_Полный.ЗаписатьКонецЭлемента();  
		КонецЕсли; 
		
		Если НЕ обЗначениеНезаполнено(ТекАвто.СкидаПриПокупкеВТрейдИн) Тогда
			XML_Полный.ЗаписатьНачалоЭлемента("TradeinDiscount");    XML_Полный.ЗаписатьТекст(СокрЛП(СтрЗаменить(ТекАвто.СкидаПриПокупкеВТрейдИн,Символы.НПП,"")));      XML_Полный.ЗаписатьКонецЭлемента();  
		КонецЕсли; 
		
		Если НЕ обЗначениеНезаполнено(ТекАвто.СкидкаПриПокупкеВКредит) Тогда
			XML_Полный.ЗаписатьНачалоЭлемента("CreditDiscount");     XML_Полный.ЗаписатьТекст(СокрЛП(СтрЗаменить(ТекАвто.СкидкаПриПокупкеВКредит,Символы.НПП,"")));      XML_Полный.ЗаписатьКонецЭлемента(); 
		КонецЕсли;
		
		Если НЕ обЗначениеНезаполнено(ТекАвто.СкидкаМаксимальная) Тогда
			XML_Полный.ЗаписатьНачалоЭлемента("MaxDiscount");        XML_Полный.ЗаписатьТекст(СокрЛП(СтрЗаменить(ТекАвто.СкидкаМаксимальная,Символы.НПП,"")));            XML_Полный.ЗаписатьКонецЭлемента(); 
		КонецЕсли; 
	Иначе
		Если НЕ обЗначениеНезаполнено(ТекАвто.СкидаПриПокупкеВТрейдИнМаркетинг) Тогда
			XML_Полный.ЗаписатьНачалоЭлемента("TradeinDiscount");    XML_Полный.ЗаписатьТекст(СокрЛП(СтрЗаменить(ТекАвто.СкидаПриПокупкеВТрейдИнМаркетинг,Символы.НПП,"")));      XML_Полный.ЗаписатьКонецЭлемента();  
		КонецЕсли; 
		
		Если  ТекАвто.СкидкаПриПокупкеВКредитМаркетинг <> 0 Тогда
			XML_Полный.ЗаписатьНачалоЭлемента("CreditDiscount");     XML_Полный.ЗаписатьТекст(СокрЛП(СтрЗаменить(ТекАвто.СкидкаПриПокупкеВКредитМаркетинг,Символы.НПП,"")));      XML_Полный.ЗаписатьКонецЭлемента(); 
		КонецЕсли;
		
		Если НЕ обЗначениеНезаполнено(ТекАвто.СкидкаМаксимальнаяМаркетинг) Тогда
			XML_Полный.ЗаписатьНачалоЭлемента("MaxDiscount");        XML_Полный.ЗаписатьТекст(СокрЛП(СтрЗаменить(ТекАвто.СкидкаМаксимальнаяМаркетинг,Символы.НПП,"")));            XML_Полный.ЗаписатьКонецЭлемента(); 
		КонецЕсли; 
	КонецЕсли;  
 	//Бондаренко-- 20250221 
	
	XML_Полный.ЗаписатьНачалоЭлемента("Make");                    XML_Полный.ЗаписатьТекст(ТекАвто.Модель.Марка.МаркаАвито.Наименование);                     XML_Полный.ЗаписатьКонецЭлемента();
	XML_Полный.ЗаписатьНачалоЭлемента("Model");                   XML_Полный.ЗаписатьТекст(ТекАвто.Модель.МодельАвито.Наименование);                          XML_Полный.ЗаписатьКонецЭлемента();
	
	//Бондаренко++ 20220629
	Если обЗначениеНеЗаполнено(ТекАвто.ГодВыпуска) Тогда
		ГодВыпуска_ = НачалоГода(ТекущаяДата());	
	Иначе		
		ГодВыпуска_ = ТекАвто.ГодВыпуска;		
	КонецЕсли; 
	//Бондаренко-- 20220629
	XML_Полный.ЗаписатьНачалоЭлемента("Year");                    XML_Полный.ЗаписатьТекст(Формат(ГодВыпуска_,"ДФ=yyyy"));                             XML_Полный.ЗаписатьКонецЭлемента();
	
	Если СокрЛП(ТекАвто.VIN) <> "" Тогда
		XML_Полный.ЗаписатьНачалоЭлемента("VIN");                 XML_Полный.ЗаписатьТекст(ТекАвто.VIN);                                                XML_Полный.ЗаписатьКонецЭлемента();
	Иначе
		ВнешнийНомерЗаказа = ПолучитьВнешнийНомерЗаказа(ТекАвто);
		Если СокрЛП(ВнешнийНомерЗаказа) <> "" Тогда                     
			//Бондаренко++ 20240124
			ВнешнийНомерЗаказа = СтрЗаменить(ВнешнийНомерЗаказа,"-","");
			//Бондаренко-- 20240124
			XML_Полный.ЗаписатьНачалоЭлемента("VIN");             XML_Полный.ЗаписатьТекст(ВнешнийНомерЗаказа);                                          XML_Полный.ЗаписатьКонецЭлемента();
		КонецЕсли;	
	КонецЕсли;
	
	//Бондаренко++ 20230823
	Если НЕ ТекАвто.Модель.Марка = Справочники.Марка.CHERY Тогда
	//Бондаренко-- 20230823
		Если ПолучитьМестоположенияАвто(ТекАвто) Тогда
			XML_Полный.ЗаписатьНачалоЭлемента("Availability");          XML_Полный.ЗаписатьТекст("В наличии");                                    XML_Полный.ЗаписатьКонецЭлемента();
		Иначе
			XML_Полный.ЗаписатьНачалоЭлемента("Availability");          XML_Полный.ЗаписатьТекст("В пути");                                       XML_Полный.ЗаписатьКонецЭлемента();
		КонецЕсли;    
	//Бондаренко++ 20230823
	Иначе
		XML_Полный.ЗаписатьНачалоЭлемента("Availability");          XML_Полный.ЗаписатьТекст("В наличии");                                       XML_Полный.ЗаписатьКонецЭлемента();
	КонецЕсли;    
	//Бондаренко-- 20230823
	
	XML_Полный.ЗаписатьНачалоЭлемента("BodyType");                XML_Полный.ЗаписатьТекст(СокрЛП(ТекАвто.ВариантКомплектации.ТипКузова.ТипКузоваАвито));  XML_Полный.ЗаписатьКонецЭлемента();
	XML_Полный.ЗаписатьНачалоЭлемента("Doors");                   XML_Полный.ЗаписатьТекст(СокрЛП(ТекАвто.ВариантКомплектации.КоличествоДверей));          XML_Полный.ЗаписатьКонецЭлемента();
	XML_Полный.ЗаписатьНачалоЭлемента("ModificationId");          XML_Полный.ЗаписатьТекст(ТекАвто.ВариантКомплектации.МодификацияАвито.Артикул);          XML_Полный.ЗаписатьКонецЭлемента();
	XML_Полный.ЗаписатьНачалоЭлемента("GenerationId");            XML_Полный.ЗаписатьТекст(ТекАвто.Модель.ГенерацияАвито.Артикул);                         XML_Полный.ЗаписатьКонецЭлемента();
	XML_Полный.ЗаписатьНачалоЭлемента("ComplectationId");         XML_Полный.ЗаписатьТекст(ТекАвто.ВариантКомплектации.КомплектацияАвито.Артикул);         XML_Полный.ЗаписатьКонецЭлемента();	
	XML_Полный.ЗаписатьНачалоЭлемента("Color");                   XML_Полный.ЗаписатьТекст(СокрЛП(ТекАвто.Цвет.ЦветАвтоРу));                               XML_Полный.ЗаписатьКонецЭлемента();

	//Бондаренко++ 20260313
		XML_Полный.ЗаписатьНачалоЭлемента("BrandComplectationCode"); XML_Полный.ЗаписатьТекст(ТекАвто.ВариантКомплектации.Артикул);                        XML_Полный.ЗаписатьКонецЭлемента();
		XML_Полный.ЗаписатьНачалоЭлемента("BrandColorCode");         XML_Полный.ЗаписатьТекст(ТекАвто.Цвет.Артикул);                                       XML_Полный.ЗаписатьКонецЭлемента();
	//Бондаренко-- 20260313
	
	//Бондаренко++ 20231207
	Если ТекАвто.ВариантКомплектации.ТипДвигателя.Дром_Гибрид Тогда
		XML_Полный.ЗаписатьНачалоЭлемента("FuelType");            XML_Полный.ЗаписатьТекст("Гибрид");                                                      XML_Полный.ЗаписатьКонецЭлемента();		
	Иначе
		ТипТоплива = ТекАвто.ВариантКомплектации.ТипДвигателя.ТипТоплива;
		Если ТипТоплива = Перечисления.ТипыТоплива.LiquefiedGas ИЛИ ТипТоплива = ТипТоплива = Перечисления.ТипыТоплива.PressureGas Тогда
			XML_Полный.ЗаписатьНачалоЭлемента("FuelType");        XML_Полный.ЗаписатьТекст("Газ");                                                         XML_Полный.ЗаписатьКонецЭлемента();
		ИначеЕсли ТипТоплива = Перечисления.ТипыТоплива.Diesel Тогда	
			XML_Полный.ЗаписатьНачалоЭлемента("FuelType");        XML_Полный.ЗаписатьТекст("Дизель");                                                      XML_Полный.ЗаписатьКонецЭлемента();
		ИначеЕсли ТипТоплива = Перечисления.ТипыТоплива.None Тогда		
			XML_Полный.ЗаписатьНачалоЭлемента("FuelType");        XML_Полный.ЗаписатьТекст("Электро");                                                     XML_Полный.ЗаписатьКонецЭлемента();		
		Иначе
			XML_Полный.ЗаписатьНачалоЭлемента("FuelType");        XML_Полный.ЗаписатьТекст(СокрЛП(ТипТоплива));                                            XML_Полный.ЗаписатьКонецЭлемента();	
		КонецЕсли;
	КонецЕсли;	
	//Бондаренко-- 20231207

 	ТипДвигателя_ = СМ_ВыгрузкаОбъявленийОПродажеАвто.СМГ_СправочникВернутьЗначениеРеквизита("ТипДвигателя",ТекАвто.ПолучитьОбъект());
	Попытка	EngineSize_str =  СтрЗаменить(СокрЛП(ТипДвигателя_.ОбъемДвигателя),Символы.НПП,""); Исключение КонецПопытки; 
	Если НЕ обЗначениеНеЗаполнено(EngineSize_str) Тогда
		//XML_Полный.ЗаписатьНачалоЭлемента("EngineSize");          XML_Полный.ЗаписатьТекст(EngineSize_str);                                                XML_Полный.ЗаписатьКонецЭлемента();
	КонецЕсли;
	
	Попытка	Power_str =  СтрЗаменить(СокрЛП(ТипДвигателя_.МощностьДвигателя),Символы.НПП,""); Исключение КонецПопытки; 
	Если НЕ обЗначениеНеЗаполнено(Power_str) Тогда
		XML_Полный.ЗаписатьНачалоЭлемента("Power");               XML_Полный.ЗаписатьТекст(Power_str);                                                     XML_Полный.ЗаписатьКонецЭлемента();
	КонецЕсли;
	
	ТипКПП_ =  СМ_ВыгрузкаОбъявленийОПродажеАвто.СМГ_СправочникВернутьЗначениеРеквизита("ТипКПП",ТекАвто.ПолучитьОбъект());
	Попытка	Transmission_str = СокрЛП(ТипКПП_.Наименование);  Исключение КонецПопытки;  
	Если НЕ обЗначениеНеЗаполнено(Transmission_str) Тогда
		XML_Полный.ЗаписатьНачалоЭлемента("Transmission");        XML_Полный.ЗаписатьТекст(Transmission_str);                                              XML_Полный.ЗаписатьКонецЭлемента();
	КонецЕсли;
	
	//Бондаренко++ 20221208
	//DriveType_ = ТекАвто.Привод;                                                                                           
	DriveType_ =  СМ_ВыгрузкаОбъявленийОПродажеАвто.СМГ_СправочникВернутьЗначениеРеквизита("Привод",ТекАвто.ПолучитьОбъект());
	//Бондаренко-- 20221208
	Если DriveType_= Перечисления.Привод.Передний ИЛИ 
		DriveType_= Перечисления.Привод.Задний 	ИЛИ 
		DriveType_= Перечисления.Привод.Полный Тогда
		DriveType_str = СокрЛП(DriveType_);    
	Иначе 
		DriveType_str = "Полный";
	КонецЕсли;	
	
	Если НЕ обЗначениеНеЗаполнено(DriveType_str) Тогда
		//XML_Полный.ЗаписатьНачалоЭлемента("DriveType");            XML_Полный.ЗаписатьТекст(DriveType_str);                                                XML_Полный.ЗаписатьКонецЭлемента();
	КонецЕсли;
	
	Руль_ = СМ_ВыгрузкаОбъявленийОПродажеАвто.СМГ_СправочникВернутьЗначениеРеквизита("Руль",ТекАвто.ПолучитьОбъект());
	WheelType_str = СокрЛП(Руль_);
	WheelType_str = Врег(Сред(WheelType_str,1,1))+Сред(WheelType_str,2);
	Если WheelType_str<>"" Тогда
		XML_Полный.ЗаписатьНачалоЭлемента("WheelType");            XML_Полный.ЗаписатьТекст(WheelType_str);                                                XML_Полный.ЗаписатьКонецЭлемента();
	КонецЕсли;
	
	//Бондаренко++ 20230531
	Если НЕ обЗначениеНеЗаполнено(ТекАвто.ВариантКомплектации) Тогда
		ЭтоАвито = Истина;
		ДописатьОпции(ТекАвто.ВариантКомплектации,XML_Полный,ЭтоАвито);
	КонецЕсли;             
	//Бондаренко-- 20230531
	
	XML_Полный.ЗаписатьНачалоЭлемента("Images");
	Для каждого СтрТЧ Из ТекАвто.ПутьКФото Цикл
		XML_Полный.ЗаписатьНачалоЭлемента("Image");
		//Бондаренко++ 20220303
		//XML.ЗаписатьАтрибут("url",HTTPRequestas.БазовыйURL+"/photo/"+Стр1.Автомобиль.VIN+"/"+СтрТЧ.НомерСтроки+".jpg");
		XML_Полный.ЗаписатьАтрибут("url",HTTPRequestБазовыйURL+"/photo/"+ТекАвто.УникальныйИдентификатор()+"/"+СтрТЧ.GUID+".jpg");
		//Бондаренко-- 20220303
		XML_Полный.ЗаписатьКонецЭлемента();
	КонецЦикла; 
	XML_Полный.ЗаписатьКонецЭлемента(); //Images	
	
	//Бондаренко++ 20220929                    
	ВидеоДляСайта = "";
	ВидеоДляСайта = СМ_ВыгрузкаОбъявленийОПродажеАвто.СМГ_СправочникВернутьЗначениеРеквизита("СсылкаНаВидео",ТекАвто.ПолучитьОбъект());
	ВидеоДляСайта = СтрЗаменить(ВидеоДляСайта,"https://youtu.be/","https://www.youtube.com/watch?v=");		
	//Бондаренко-- 20220929
	
	Если НЕ обЗначениеНеЗаполнено(ВидеоДляСайта) Тогда
 		XML_Полный.ЗаписатьНачалоЭлемента("VideoURL");     XML_Полный.ЗаписатьТекст(ВидеоДляСайта);                	                                       XML_Полный.ЗаписатьКонецЭлемента(); 		
	КонецЕсли; 
	
	//Бондаренко++ 20221207
	XML_Полный.ЗаписатьНачалоЭлемента("OnlyOnAvito");          XML_Полный.ЗаписатьТекст("Нет");                                                             XML_Полный.ЗаписатьКонецЭлемента();
	//Бондаренко-- 20221207
	
	//ТелефонОтделаПродаж = "";
	//ТелефонОтделаПродаж = ПолучитьТелефонОтделаПродаж(ТаблицаДляВыгрузки,ТекАвто.Модель.Марка);
	
	XML_Полный.ЗаписатьНачалоЭлемента("ManagerName");       XML_Полный.ЗаписатьТекст("Отдел продаж");                                                      XML_Полный.ЗаписатьКонецЭлемента(); 
	XML_Полный.ЗаписатьНачалоЭлемента("ContactMethod");     XML_Полный.ЗаписатьТекст("По телефону и в сообщениях");                                        XML_Полный.ЗаписатьКонецЭлемента(); 
	XML_Полный.ЗаписатьНачалоЭлемента("ContactPhone");      XML_Полный.ЗаписатьТекст(СокрЛП(ТелефонОтделаПродаж));                                         XML_Полный.ЗаписатьКонецЭлемента(); 
	
	//Бондаренко++ 20250318
	Попытка
		XML_Полный.ЗаписатьНачалоЭлемента("OfferSpecialLoanConditions"); XML_Полный.ЗаписатьТекст(СокрЛП(СпецусловияКредита));                             XML_Полный.ЗаписатьКонецЭлемента(); 
		XML_Полный.ЗаписатьНачалоЭлемента("OfferGiftAccessories");       XML_Полный.ЗаписатьТекст(СокрЛП(АксессуарыВПодарок));                             XML_Полный.ЗаписатьКонецЭлемента(); 
		XML_Полный.ЗаписатьНачалоЭлемента("OfferFastRegistration");      XML_Полный.ЗаписатьТекст(СокрЛП(БыстроеОформление));                              XML_Полный.ЗаписатьКонецЭлемента(); 
	Исключение
	КонецПопытки;
	//Бондаренко-- 20250318
 	
	XML_Полный.ЗаписатьКонецЭлемента();	//ad
	
КонецПроцедуры // ПолучитьОбъявлениеАвитоЛегковой()

Функция ПолучитьМестоположенияАвто(ТекАвто) Экспорт
	
	ТаблицаАвто = ПолучитьТаблицуАвто();
	
	Доступность_ = Истина;
	
	ПараметрыОтбора = Новый Структура;
	ПараметрыОтбора.Вставить("Автомобиль",ТекАвто);
	НайденныеСтроки = ТаблицаАвто.НайтиСтроки(ПараметрыОтбора);
	
	Если НайденныеСтроки.Количество() > 0 Тогда
		Доступность_ = НайденныеСтроки[0].Доступность;	
	КонецЕсли;
	
	Возврат Доступность_;
	
КонецФункции // ПолучитьМестоположенияАвто(ТекАвто)

Функция ПолучитьВнешнийНомерЗаказа(Автомобиль) Экспорт
	
	ВнешнийНомерЗаказа_ = "";
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ЗаказыПоставщикамНаАвтомобилиОстатки.Автомобиль,
	|	ЗаказыПоставщикамНаАвтомобилиОстатки.ЗаказПоставщику,
	|	ЗаказыПоставщикамНаАвтомобилиОстатки.КоличествоОстаток,
	|	ЗаказыПоставщикамНаАвтомобилиОстатки.ЗаказПоставщику.ВнешнийНомерЗаказа КАК ВнешнийНомерЗаказа
	|ИЗ
	|	РегистрНакопления.ЗаказыПоставщикамНаАвтомобили.Остатки КАК ЗаказыПоставщикамНаАвтомобилиОстатки
	|ГДЕ
	|	ЗаказыПоставщикамНаАвтомобилиОстатки.КоличествоОстаток > 0
	|	И ЗаказыПоставщикамНаАвтомобилиОстатки.Автомобиль = &Автомобиль";
	
	Запрос.УстановитьПараметр("Автомобиль", Автомобиль);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		ВнешнийНомерЗаказа_ = ВыборкаДетальныеЗаписи.ВнешнийНомерЗаказа;
	КонецЦикла;
	
	Возврат ВнешнийНомерЗаказа_;
	
КонецФункции // ПолучитьВнешнийНомерЗаказа()

Функция ПолучитьПодразделениеАвто(ТекАвто) Экспорт
	
	ТаблицаАвто = ПолучитьТаблицуАвто();
	
	Подразделение_ = Справочники.ПодразделенияКомпании.ПустаяСсылка();
	
	ПараметрыОтбора = Новый Структура;
	ПараметрыОтбора.Вставить("Автомобиль",ТекАвто);
	НайденныеСтроки = ТаблицаАвто.НайтиСтроки(ПараметрыОтбора);
	
	Если НайденныеСтроки.Количество() > 0 Тогда
		Подразделение_ = НайденныеСтроки[0].Подразделение;	
	КонецЕсли;
	
	Возврат Подразделение_;
	
КонецФункции // ПолучитьПодразделениеАвто(ТекАвто)
//Бондаренко-- 20220628

//Бондаренко++ 20220629
Процедура ЗаполнитьОбъявлениеАвитоКоммерческий(ТекАвто,HTTPRequestБазовыйURL,АдресОтделаПродаж,ТелефонОтделаПродаж,СпецусловияКредита,АксессуарыВПодарок,БыстроеОформление,XML_Полный) Экспорт
	
	ТаблицаАвто = ПолучитьТаблицуАвто();
	
	XML_Полный.ЗаписатьНачалоЭлемента("Ad");
	XML_Полный.ЗаписатьНачалоЭлемента("Id");                XML_Полный.ЗаписатьТекст(СокрЛП(ТекАвто.Код));                       XML_Полный.ЗаписатьКонецЭлемента();
	
	XML_Полный.ЗаписатьНачалоЭлемента("ContactMethod");     XML_Полный.ЗаписатьТекст("По телефону и в сообщениях");              XML_Полный.ЗаписатьКонецЭлемента(); 
	XML_Полный.ЗаписатьНачалоЭлемента("ManagerName");       XML_Полный.ЗаписатьТекст("Отдел продаж");                            XML_Полный.ЗаписатьКонецЭлемента(); 
	
	//ТелефонОтделаПродаж = "";
	//ТелефонОтделаПродаж = ПолучитьТелефонОтделаПродаж(ТаблицаДляВыгрузки,ТекАвто.Модель.Марка);
	XML_Полный.ЗаписатьНачалоЭлемента("ContactPhone");      XML_Полный.ЗаписатьТекст(СокрЛП(ТелефонОтделаПродаж));               XML_Полный.ЗаписатьКонецЭлемента(); 
	
	
	//XML_Полный.ЗаписатьНачалоЭлемента("ListingFree");       XML_Полный.ЗаписатьТекст("PackageSingle");                         XML_Полный.ЗаписатьКонецЭлемента();
	//XML_Полный.ЗаписатьНачалоЭлемента("AdStatus");          XML_Полный.ЗаписатьТекст("Free");                                  XML_Полный.ЗаписатьКонецЭлемента();
	
	//АдресОтделаПродаж = "";
	//АдресОтделаПродаж = ПолучитьАдресОтделаПродаж(ТаблицаДляВыгрузки,ТекАвто.Модель.Марка);		
	XML_Полный.ЗаписатьНачалоЭлемента("Address");             XML_Полный.ЗаписатьТекст(АдресОтделаПродаж);                       XML_Полный.ЗаписатьКонецЭлемента();
	
	XML_Полный.ЗаписатьНачалоЭлемента("Category");            XML_Полный.ЗаписатьТекст("Грузовики и спецтехника");               XML_Полный.ЗаписатьКонецЭлемента();
	XML_Полный.ЗаписатьНачалоЭлемента("GoodsType");           XML_Полный.ЗаписатьТекст("Лёгкий транспорт");                      XML_Полный.ЗаписатьКонецЭлемента();
	
	//Бондаренко++ 20220714
	//ТекстКлассифайда = СокрЛП(ТекАвто.ТекстКлассифайда);
	ТекстКлассифайда = СМ_ВыгрузкаОбъявленийОПродажеАвто.СМГ_СправочникВернутьЗначениеРеквизита("ТекстКлассифайда",ТекАвто.ПолучитьОбъект());
	//Бондаренко-- 20220714

	Если обЗначениеНеЗаполнено(ТекстКлассифайда) Тогда
		ТекПодразделение = ПолучитьПодразделениеАвто(ТекАвто);
		Если Не обЗначениеНеЗаполнено(ТекПодразделение) Тогда
			ТекстКлассифайда = СокрЛП(ТекПодразделение.ТекстКлассифайда);
			Если обЗначениеНеЗаполнено(ТекстКлассифайда) Тогда
				Попытка ТекстКлассифайда = СокрЛП(ТекПодразделение.Родитель.ТекстКлассифайда); Исключение	КонецПопытки;  
				Если обЗначениеНеЗаполнено(ТекстКлассифайда) Тогда
					Попытка ТекстКлассифайда = СокрЛП(ТекПодразделение.Родитель.Родитель.ТекстКлассифайда); Исключение	КонецПопытки;  
				КонецЕсли; 		
			КонецЕсли; 
		КонецЕсли;
	КонецЕсли; 
	XML_Полный.ЗаписатьНачалоЭлемента("Description");         XML_Полный.ЗаписатьТекст(ТекстКлассифайда);                        XML_Полный.ЗаписатьКонецЭлемента();	 //Description
	
	ПолнаяЦенаПродажи = 0.00;
	ПарОтбора = Новый Структура();
	ПарОтбора.Вставить("Автомобиль",ТекАвто);
	ПарОтбора.Вставить("ТипЦен",Справочники.ТипыЦен.ОсновнойТипЦенПродажи);
	ЦенаАвто = РегистрыСведений.ЦеныАвтомобилей.ПолучитьПоследнее(ТекущаяДата(),ПарОтбора).Цена;
	ПолнаяЦенаПродажи = ЦенаАвто+ТекАвто.СтоимостьДопОборудования;
	XML_Полный.ЗаписатьНачалоЭлемента("Price");     XML_Полный.ЗаписатьТекст(СтрЗаменить(ПолнаяЦенаПродажи,Символы.НПП,""));     XML_Полный.ЗаписатьКонецЭлемента();		 			
	
	XML_Полный.ЗаписатьНачалоЭлемента("PriceWithVAT");      XML_Полный.ЗаписатьТекст("Да");                                      XML_Полный.ЗаписатьКонецЭлемента();
	XML_Полный.ЗаписатьНачалоЭлемента("Condition");         XML_Полный.ЗаписатьТекст("Новое");                                   XML_Полный.ЗаписатьКонецЭлемента();	
	
	Пробег =  "0";
	ПарОтбора = Новый Структура();
	ПарОтбора.Вставить("Автомобиль",ТекАвто);
	ПарОтбора.Вставить("ВидЗначения",Перечисления.ДополнительнаяИнформацияАвтомобилей.Пробег); 
	Пробег_число = РегистрыСведений.Автомобили.ПолучитьПоследнее(ТекущаяДата(),ПарОтбора).Значение;
	Если Не обЗначениеНеЗаполнено(Пробег_число) Тогда
		Если Пробег_число < 100 Тогда
			Пробег_число = 0;		 
		КонецЕсли;
		Пробег = СтрЗаменить(СокрЛП(Пробег_число),Символы.НПП,"");
	КонецЕсли;
	XML_Полный.ЗаписатьНачалоЭлемента("Kilometrage");       XML_Полный.ЗаписатьТекст(Пробег);                                                               XML_Полный.ЗаписатьКонецЭлемента();	
	
	//XML_Полный.ЗаписатьНачалоЭлемента("TechnicalPassport"); XML_Полный.ЗаписатьТекст("В наличии");                                                        XML_Полный.ЗаписатьКонецЭлемента();	
	
	Если СокрЛП(ТекАвто.VIN) <> "" Тогда
		XML_Полный.ЗаписатьНачалоЭлемента("VIN");                 XML_Полный.ЗаписатьТекст(ТекАвто.VIN);                                                    XML_Полный.ЗаписатьКонецЭлемента();
	Иначе
		ВнешнийНомерЗаказа = ПолучитьВнешнийНомерЗаказа(ТекАвто);
		Если СокрЛП(ВнешнийНомерЗаказа) <> "" Тогда		
			XML_Полный.ЗаписатьНачалоЭлемента("VIN");             XML_Полный.ЗаписатьТекст(ВнешнийНомерЗаказа);                                             XML_Полный.ЗаписатьКонецЭлемента();
		КонецЕсли;	
	КонецЕсли;
	
	//Бондаренко++ 20260317
		XML_Полный.ЗаписатьНачалоЭлемента("BrandComplectationCode"); XML_Полный.ЗаписатьТекст(ТекАвто.ВариантКомплектации.Артикул);                        XML_Полный.ЗаписатьКонецЭлемента();
		XML_Полный.ЗаписатьНачалоЭлемента("BrandColorCode");         XML_Полный.ЗаписатьТекст(ТекАвто.Цвет.Артикул);                                       XML_Полный.ЗаписатьКонецЭлемента();
	//Бондаренко-- 20260317
	
	Если обЗначениеНеЗаполнено(ТекАвто.ГодВыпуска) Тогда
		ГодВыпуска_ = НачалоГода(ТекущаяДата());	
	Иначе		
		ГодВыпуска_ = ТекАвто.ГодВыпуска;		
	КонецЕсли; 
	XML_Полный.ЗаписатьНачалоЭлемента("Year");                    XML_Полный.ЗаписатьТекст(Формат(ГодВыпуска_,"ДФ=yyyy"));                                  XML_Полный.ЗаписатьКонецЭлемента();
	
	XML_Полный.ЗаписатьНачалоЭлемента("Brand");                   XML_Полный.ЗаписатьТекст(ТекАвто.Модель.Марка.МаркаАвито.Наименование);                   XML_Полный.ЗаписатьКонецЭлемента();
	XML_Полный.ЗаписатьНачалоЭлемента("Model");                   XML_Полный.ЗаписатьТекст(ТекАвто.Модель.МодельАвито.Наименование);                        XML_Полный.ЗаписатьКонецЭлемента();
	
  	XML_Полный.ЗаписатьНачалоЭлемента("Body");                    XML_Полный.ЗаписатьТекст(СокрЛП(ТекАвто.ВариантКомплектации.ТипКузова.ТипКузоваАвито));   XML_Полный.ЗаписатьКонецЭлемента();
	
	КоличествоДверей_ = СокрЛП(СМ_ВыгрузкаОбъявленийОПродажеАвто.СМГ_СправочникВернутьЗначениеРеквизита("КоличествоДверей",ТекАвто.ПолучитьОбъект())); 
	Если НЕ обЗначениеНеЗаполнено(КоличествоДверей_) Тогда
		XML_Полный.ЗаписатьНачалоЭлемента("DoorsCount");          XML_Полный.ЗаписатьТекст(КоличествоДверей_);                                              XML_Полный.ЗаписатьКонецЭлемента();	
	КонецЕсли;
	
	XML_Полный.ЗаписатьНачалоЭлемента("Generation");              XML_Полный.ЗаписатьТекст(ТекАвто.Модель.ГенерацияАвито.Наименование);                     XML_Полный.ЗаписатьКонецЭлемента();
	
	ТипДвигателя_ = СМ_ВыгрузкаОбъявленийОПродажеАвто.СМГ_СправочникВернутьЗначениеРеквизита("ТипДвигателя",ТекАвто.ПолучитьОбъект());
	Если обЗначениеНеЗаполнено(ТипДвигателя_) Тогда
		ТипТоплива_ = ТипДвигателя_.ТипТоплива;
		Если ТипТоплива_ = Перечисления.ТипыТоплива.LiquefiedGas ИЛИ ТипТоплива_ = Перечисления.ТипыТоплива.PressureGas Тогда
			XML_Полный.ЗаписатьНачалоЭлемента("EngineType");      XML_Полный.ЗаписатьТекст("Газ");                                                          XML_Полный.ЗаписатьКонецЭлемента();
		Иначе
			XML_Полный.ЗаписатьНачалоЭлемента("EngineType");      XML_Полный.ЗаписатьТекст(СокрЛП(ТипТоплива_));                                            XML_Полный.ЗаписатьКонецЭлемента();	
		КонецЕсли; 
	КонецЕсли;
	
	//Бондаренко++ 20221207
	//DriveType_ = ТекАвто.Привод;
	DriveType_ =  СМ_ВыгрузкаОбъявленийОПродажеАвто.СМГ_СправочникВернутьЗначениеРеквизита("Привод",ТекАвто.ПолучитьОбъект());
	//Бондаренко-- 20221207
	Если DriveType_= Перечисления.Привод.Передний ИЛИ 
		DriveType_= Перечисления.Привод.Задний 	ИЛИ 
		DriveType_= Перечисления.Привод.Полный Тогда
		DriveType_str = СокрЛП(DriveType_);    
	Иначе 
		DriveType_str =  "Полный";
	КонецЕсли;
	
	Если НЕ обЗначениеНеЗаполнено(DriveType_str) Тогда
		//XML_Полный.ЗаписатьНачалоЭлемента("DriveType");           XML_Полный.ЗаписатьТекст(DriveType_str);                                                  XML_Полный.ЗаписатьКонецЭлемента();
	КонецЕсли;
	
	ТипКПП_ =  СМ_ВыгрузкаОбъявленийОПродажеАвто.СМГ_СправочникВернутьЗначениеРеквизита("ТипКПП",ТекАвто.ПолучитьОбъект());
	Попытка	Transmission_str = СокрЛП(ТипКПП_.Наименование);  Исключение КонецПопытки;  
	Если НЕ обЗначениеНеЗаполнено(Transmission_str) Тогда
		XML_Полный.ЗаписатьНачалоЭлемента("Transmission");        XML_Полный.ЗаписатьТекст(Transmission_str);                                               XML_Полный.ЗаписатьКонецЭлемента();
	КонецЕсли;
	
	XML_Полный.ЗаписатьНачалоЭлемента("Modification");            XML_Полный.ЗаписатьТекст(ТекАвто.ВариантКомплектации.МодификацияАвито.Наименование);      XML_Полный.ЗаписатьКонецЭлемента();
	//XML_Полный.ЗаписатьНачалоЭлемента("Trim");                    XML_Полный.ЗаписатьТекст(ТекАвто.ВариантКомплектации.КомплектацияАвито.Наименование);   XML_Полный.ЗаписатьКонецЭлемента();	
	
	Руль_ = СМ_ВыгрузкаОбъявленийОПродажеАвто.СМГ_СправочникВернутьЗначениеРеквизита("Руль",ТекАвто.ПолучитьОбъект());
	WheelType_str = СокрЛП(Руль_);
	WheelType_str = Врег(Сред(WheelType_str,1,1))+Сред(WheelType_str,2);
	Если WheelType_str<>"" Тогда
		XML_Полный.ЗаписатьНачалоЭлемента("WheelType");           XML_Полный.ЗаписатьТекст(WheelType_str);                                                  XML_Полный.ЗаписатьКонецЭлемента();
	КонецЕсли;                                                                                                                      
	
	XML_Полный.ЗаписатьНачалоЭлемента("OwnersByDocuments");       XML_Полный.ЗаписатьТекст(СокрЛП(ТекАвто.КоличествоВладельцевПоПТС));                      XML_Полный.ЗаписатьКонецЭлемента();
	
	XML_Полный.ЗаписатьНачалоЭлемента("Color");                   XML_Полный.ЗаписатьТекст(СокрЛП(ТекАвто.Цвет.ЦветАвтоРу));                                XML_Полный.ЗаписатьКонецЭлемента();
	XML_Полный.ЗаписатьНачалоЭлемента("Accident");                XML_Полный.ЗаписатьТекст("Не битый");                                                     XML_Полный.ЗаписатьКонецЭлемента();
	Если ПолучитьМестоположенияАвто(ТекАвто) Тогда
		XML_Полный.ЗаписатьНачалоЭлемента("Availability");          XML_Полный.ЗаписатьТекст("В наличии");                                                  XML_Полный.ЗаписатьКонецЭлемента();
	Иначе
		XML_Полный.ЗаписатьНачалоЭлемента("Availability");          XML_Полный.ЗаписатьТекст("Под заказ");                                                  XML_Полный.ЗаписатьКонецЭлемента();
	КонецЕсли; 
	
	XML_Полный.ЗаписатьНачалоЭлемента("Images");
	Для каждого СтрТЧ Из ТекАвто.ПутьКФото Цикл
		XML_Полный.ЗаписатьНачалоЭлемента("Image");
		//Бондаренко++ 20220303
		//XML.ЗаписатьАтрибут("url",HTTPRequestas.БазовыйURL+"/photo/"+Стр1.Автомобиль.VIN+"/"+СтрТЧ.НомерСтроки+".jpg");
		XML_Полный.ЗаписатьАтрибут("url",HTTPRequestБазовыйURL+"/photo/"+ТекАвто.УникальныйИдентификатор()+"/"+СтрТЧ.GUID+".jpg");
		//Бондаренко-- 20220303
		XML_Полный.ЗаписатьКонецЭлемента();
	КонецЦикла; 
	XML_Полный.ЗаписатьКонецЭлемента(); //Images	
	
	//Бондаренко++ 20220929                    
	ВидеоДляСайта = "";
	ВидеоДляСайта = СМ_ВыгрузкаОбъявленийОПродажеАвто.СМГ_СправочникВернутьЗначениеРеквизита("СсылкаНаВидео",ТекАвто.ПолучитьОбъект());
	ВидеоДляСайта = СтрЗаменить(ВидеоДляСайта,"https://youtu.be/","https://www.youtube.com/watch?v=");		
	//Бондаренко-- 20220929
	
	Если НЕ обЗначениеНеЗаполнено(ВидеоДляСайта) Тогда
 		XML_Полный.ЗаписатьНачалоЭлемента("VideoURL");     XML_Полный.ЗаписатьТекст(ВидеоДляСайта);                	                                        XML_Полный.ЗаписатьКонецЭлемента(); 		
	КонецЕсли;
	
	//Бондаренко++ 20221207
	XML_Полный.ЗаписатьНачалоЭлемента("OnlyOnAvito");          XML_Полный.ЗаписатьТекст("Нет");                                                             XML_Полный.ЗаписатьКонецЭлемента();
	//Бондаренко-- 20221207
	
	//Бондаренко++ 20250318
	XML_Полный.ЗаписатьНачалоЭлемента("ManagerName");       XML_Полный.ЗаписатьТекст("Отдел продаж");                                                      XML_Полный.ЗаписатьКонецЭлемента(); 
	XML_Полный.ЗаписатьНачалоЭлемента("ContactMethod");     XML_Полный.ЗаписатьТекст("По телефону и в сообщениях");                                        XML_Полный.ЗаписатьКонецЭлемента(); 
	XML_Полный.ЗаписатьНачалоЭлемента("ContactPhone");      XML_Полный.ЗаписатьТекст(СокрЛП(ТелефонОтделаПродаж));                                         XML_Полный.ЗаписатьКонецЭлемента(); 
 	
	Попытка
		XML_Полный.ЗаписатьНачалоЭлемента("OfferSpecialLoanConditions"); XML_Полный.ЗаписатьТекст(СокрЛП(СпецусловияКредита));                             XML_Полный.ЗаписатьКонецЭлемента(); 
		XML_Полный.ЗаписатьНачалоЭлемента("OfferGiftAccessories");       XML_Полный.ЗаписатьТекст(СокрЛП(АксессуарыВПодарок));                             XML_Полный.ЗаписатьКонецЭлемента(); 
		XML_Полный.ЗаписатьНачалоЭлемента("OfferFastRegistration");      XML_Полный.ЗаписатьТекст(СокрЛП(БыстроеОформление));                              XML_Полный.ЗаписатьКонецЭлемента(); 
	Исключение
	КонецПопытки;
	//Бондаренко-- 20250318
	
	XML_Полный.ЗаписатьКонецЭлемента();	//ad
	
КонецПроцедуры // ЗаполнитьОбъявлениеАвитоКоммерческий(ТекАвто,HTTPRequest)
//Бондаренко-- 20220629

//Бондаренко++ 20220610
Функция ПолучитьXMLОбъявленийAvitoLk(HTTPRequest) Экспорт
	
	ТаблицаАвто = ПолучитьТаблицуАвто();
	
 	ТаблицаДляВыгрузки = ПолучитьТаблицуЛичногоКабинетаАвитоИзЗапроса(HTTPRequest.ПараметрыURL["UnitCode"]);
	
	//Бондаренко++ 20220628
	СписокАвто = ПолучитьСписокАвтоОстатковИзаказов(ТаблицаДляВыгрузки);
	//Бондаренко-- 20220628 
	
	XML_Полный=Новый ЗаписьXML();
	XML_Полный.УстановитьСтроку(Новый ПараметрыЗаписиXML("UTF-8","1.0",false));
	XML_Полный.ЗаписатьОбъявлениеXML();
	
	XML_Полный.ЗаписатьНачалоЭлемента("Ads");
	XML_Полный.ЗаписатьАтрибут("formatVersion","3");
	XML_Полный.ЗаписатьАтрибут("target","Avito.ru"); 
	
	//Бондаренко++ 20220628
	Если СписокАвто.Количество() > 0 Тогда
		Для каждого Эл Из СписокАвто Цикл
			
			ТекАвто = Эл.Значение; 
			
 			//Бондаренко++ 20230304
			Если АвтомобильНовый(ТекАвто) Тогда
			//Если АвтомобильНовый(ТекАвто) Тогда
 				// оставляем
			Иначе	
				//Пропускаются все авто с пробегом
				Продолжить;
			КонецЕсли;             
  			//Бондаренко-- 20230304
			
			//Бондаренко++ 20220913
			ПодразделениеАвто = "";
 			ПодразделениеАвто = НайтиПодрАвто(ТекАвто,ТаблицаАвто);
			//Бондаренко-- 20220913
			
			//Бондаренко++ 20250207
			СпецусловияКредита = "";
 			Попытка
				СпецусловияКредита = ТаблицаДляВыгрузки[0].СпецусловияКредита;
	 		Исключение
	 		КонецПопытки;
   			//Бондаренко-- 20250207
			
			//Бондаренко++ 20250318
			АксессуарыВПодарок = "";
 			Попытка
				АксессуарыВПодарок = ТаблицаДляВыгрузки[0].АксессуарыВПодарок;
	 		Исключение
	 		КонецПопытки;
 			БыстроеОформление = "";
 			Попытка
				БыстроеОформление = ТаблицаДляВыгрузки[0].БыстроеОформление;
	 		Исключение
	 		КонецПопытки;
   			//Бондаренко-- 20250318
			
			Если обЗначениеНеЗаполнено(ПодразделениеАвто) Тогда
				АдресОП   = ПолучитьАдресОтделаПродаж(ТаблицаДляВыгрузки,ТекАвто.Модель.Марка);
				ТелефонОП = ПолучитьТелефонОтделаПродаж(ТаблицаДляВыгрузки,ТекАвто.Модель.Марка);
  			Иначе
				АдресОП   = ПолучитьАдресОтделаПродажПодразделения(ТаблицаДляВыгрузки,ТекАвто.Модель.Марка,ПодразделениеАвто);
				ТелефонОП = ПолучитьТелефонОтделаПродажПодразделения(ТаблицаДляВыгрузки,ТекАвто.Модель.Марка,ПодразделениеАвто);
 			КонецЕсли;
 			Если обЗначениеНеЗаполнено(АдресОП) ИЛИ обЗначениеНеЗаполнено(ТелефонОП) Тогда
				Продолжить;
			КонецЕсли;
			
			//Бондаренко++ 20220713
			Если НЕ ТекАвто.ВыгружатьАвтомобильНаСайт Тогда
				Продолжить;	
			КонецЕсли; 
			//Бондаренко-- 20220713
 			
			Если ТекАвто.Модель.КатегорияТС = Справочники.КатегорииТранспортныхСредств.АвтомобилиЛегковые Тогда
 				ЗаполнитьОбъявлениеАвитоЛегковой(ТекАвто,HTTPRequest.БазовыйURL,АдресОП,ТелефонОП,СпецусловияКредита,АксессуарыВПодарок,БыстроеОформление,XML_Полный); 
			Иначе
				ЗаполнитьОбъявлениеАвитоКоммерческий(ТекАвто,HTTPRequest.БазовыйURL,АдресОП,ТелефонОП,СпецусловияКредита,АксессуарыВПодарок,БыстроеОформление,XML_Полный); 				 
			КонецЕсли;
			
		КонецЦикла;             
	КонецЕсли;
	//Бондаренко-- 20220628 
	
	//СписокМарок = Новый СписокЗначений();
	//
	//ТаблицаМарок = ТаблицаВыгрузкиПолная.Скопировать();
	//ТаблицаМарок.Свернуть("Марка","");
	//СписокМарок.ЗагрузитьЗначения(ТаблицаМарок.ВыгрузитьКолонку("Марка"));	
	// 
	//Если СписокМарок.Количество() > 0 Тогда
	//    Для каждого ЭлСпискаМарок Из СписокМарок Цикл
	
	//   	 ПараметрыОтбора = Новый Структура("Марка",ЭлСпискаМарок.Значение);
	//   	 ТаблицаВыгрузки = ТаблицаВыгрузкиПолная.Скопировать(ПараметрыОтбора);			
	//   	 
	//   	 XML_Полный = ПолучитьXMLAvitoLkПоМарке(ТаблицаВыгрузки, HTTPRequest,XML_Полный);
	//   	 
	//    КонецЦикла;
	//КонецЕсли;
	
	XML_Полный.ЗаписатьКонецЭлемента();     //Ads
	XMLТекст = XML_Полный.Закрыть();
	Возврат XMLТекст;
	
КонецФункции // ПолучитьXMLОбъявленийAvitoLk(ТаблицаВыгрузки, HTTPRequest)
//Бондаренко-- 20220610   

//Бондаренко++ 20220610
Функция ПолучитьXMLОбъявленийAvitoLk1(HTTPRequest) Экспорт
	
	ТаблицаАвто = ПолучитьТаблицуАвто();
	
 	ТаблицаДляВыгрузки = ПолучитьТаблицуЛичногоКабинетаАвитоИзЗапроса(HTTPRequest.ПараметрыURL["UnitCode"]);
	
	//Бондаренко++ 20220628
	СписокАвто = ПолучитьСписокАвтоОстатковИзаказов(ТаблицаДляВыгрузки);
	//Бондаренко-- 20220628 
	
	XML_Полный=Новый ЗаписьXML();
	XML_Полный.УстановитьСтроку(Новый ПараметрыЗаписиXML("UTF-8","1.0",false));
	XML_Полный.ЗаписатьОбъявлениеXML();
	
	XML_Полный.ЗаписатьНачалоЭлемента("Ads");
	XML_Полный.ЗаписатьАтрибут("formatVersion","3");
	XML_Полный.ЗаписатьАтрибут("target","Avito.ru"); 
	
	//Бондаренко++ 20220628
	Если СписокАвто.Количество() > 0 Тогда
		Для каждого Эл Из СписокАвто Цикл
			
			ТекАвто = Эл.Значение; 
			
 			//Бондаренко++ 20230613
			Если ( АвтомобильПараллельногоИмпорта(ТекАвто) И ТекАвто.АвитоАвтоРуДром ) ИЛИ
			       АвтомобильНовый(ТекАвто) Тогда
 				// оставляем
			Иначе	
				//Пропускаются все авто с пробегом
				Продолжить;
			КонецЕсли;             
  			//Бондаренко-- 20230613
			
			//Бондаренко++ 20220913
			ПодразделениеАвто = "";
			ПодразделениеАвто = НайтиПодрАвто(ТекАвто,ТаблицаАвто);
			//Бондаренко-- 20220913
			
			Если обЗначениеНеЗаполнено(ПодразделениеАвто) Тогда
				АдресОП   = ПолучитьАдресОтделаПродаж(ТаблицаДляВыгрузки,ТекАвто.Модель.Марка);
				ТелефонОП = ПолучитьТелефонОтделаПродаж(ТаблицаДляВыгрузки,ТекАвто.Модель.Марка);
			Иначе
				АдресОП   = ПолучитьАдресОтделаПродажПодразделения(ТаблицаДляВыгрузки,ТекАвто.Модель.Марка,ПодразделениеАвто);
				ТелефонОП = ПолучитьТелефонОтделаПродажПодразделения(ТаблицаДляВыгрузки,ТекАвто.Модель.Марка,ПодразделениеАвто);
			КонецЕсли; 
			
			//Бондаренко++ 20250207
			СпецусловияКредита = "";
 			Попытка
				СпецусловияКредита = ТаблицаДляВыгрузки[0].СпецусловияКредита;
	 		Исключение
	 		КонецПопытки;
   			//Бондаренко-- 20250207

			//Бондаренко++ 20250318
			АксессуарыВПодарок = "";
 			Попытка
				АксессуарыВПодарок = ТаблицаДляВыгрузки[0].АксессуарыВПодарок;
	 		Исключение
	 		КонецПопытки;
 			БыстроеОформление = "";
 			Попытка
				БыстроеОформление = ТаблицаДляВыгрузки[0].БыстроеОформление;
	 		Исключение
	 		КонецПопытки;
   			//Бондаренко-- 20250318

			Если обЗначениеНеЗаполнено(АдресОП) ИЛИ обЗначениеНеЗаполнено(ТелефонОП) Тогда
				Продолжить;
			КонецЕсли;
			
			//Бондаренко++ 20220713
			Если НЕ ТекАвто.ВыгружатьАвтомобильНаСайт Тогда
				Продолжить;	
			КонецЕсли; 
			//Бондаренко-- 20220713
 			
			Если ТекАвто.Модель.КатегорияТС = Справочники.КатегорииТранспортныхСредств.АвтомобилиЛегковые Тогда
 				ЗаполнитьОбъявлениеАвитоЛегковой(ТекАвто,HTTPRequest.БазовыйURL,АдресОП,ТелефонОП,СпецусловияКредита,АксессуарыВПодарок,БыстроеОформление,XML_Полный); 
			Иначе
				ЗаполнитьОбъявлениеАвитоКоммерческий(ТекАвто,HTTPRequest.БазовыйURL,АдресОП,ТелефонОП,СпецусловияКредита,АксессуарыВПодарок,БыстроеОформление,XML_Полный); 				 
			КонецЕсли;
			
		КонецЦикла;             
	КонецЕсли;
	//Бондаренко-- 20220628 
	
	//СписокМарок = Новый СписокЗначений();
	//
	//ТаблицаМарок = ТаблицаВыгрузкиПолная.Скопировать();
	//ТаблицаМарок.Свернуть("Марка","");
	//СписокМарок.ЗагрузитьЗначения(ТаблицаМарок.ВыгрузитьКолонку("Марка"));	
	// 
	//Если СписокМарок.Количество() > 0 Тогда
	//    Для каждого ЭлСпискаМарок Из СписокМарок Цикл
	
	//   	 ПараметрыОтбора = Новый Структура("Марка",ЭлСпискаМарок.Значение);
	//   	 ТаблицаВыгрузки = ТаблицаВыгрузкиПолная.Скопировать(ПараметрыОтбора);			
	//   	 
	//   	 XML_Полный = ПолучитьXMLAvitoLkПоМарке(ТаблицаВыгрузки, HTTPRequest,XML_Полный);
	//   	 
	//    КонецЦикла;
	//КонецЕсли;
	
	XML_Полный.ЗаписатьКонецЭлемента();     //Ads
	XMLТекст = XML_Полный.Закрыть();
	Возврат XMLТекст;
	
КонецФункции // ПолучитьXMLОбъявленийAvitoLk(ТаблицаВыгрузки, HTTPRequest)
//Бондаренко-- 20220610 

//Бондаренко++ 20221215

Функция ПолучитьТаблицуЛичногоКабинетаЗапчастиАвитоИзЗапроса(КодЛичногоКабинета) Экспорт
	
  	Запрос = Новый Запрос;
	Запрос.Текст =	"ВЫБРАТЬ
	              	|	СМ_ЛичныеКабинеты_Авито_ЗапчастиПодразделения.Ссылка.Ссылка,
	              	|	СМ_ЛичныеКабинеты_Авито_ЗапчастиПодразделения.Ссылка.Код,
	              	|	СМ_ЛичныеКабинеты_Авито_ЗапчастиПодразделения.ГруппаПодразделенийКомпании,
	              	|	СМ_ЛичныеКабинеты_Авито_ЗапчастиПодразделения.ПредставлениеТелефона,
	              	|	СМ_ЛичныеКабинеты_Авито_ЗапчастиПодразделения.Адрес,
	              	|	СМ_ЛичныеКабинеты_Авито_ЗапчастиПодразделения.ГруппаПодразделенийКомпании.ДилерскийЦентр КАК ДилерскийЦентр,
	              	|	СМ_ЛичныеКабинеты_Авито_ЗапчастиПодразделения.Ссылка.МинимальнаяЦена,
	              	|	СМ_ЛичныеКабинеты_Авито_ЗапчастиПодразделения.Ссылка.ТипЦен,
	              	|	СМ_ЛичныеКабинеты_Авито_ЗапчастиПодразделения.Ссылка.ПроцентНаценкиСкидки
	              	|ИЗ
	              	|	Справочник.СМ_ЛичныеКабинеты_Авито_Запчасти.Подразделения КАК СМ_ЛичныеКабинеты_Авито_ЗапчастиПодразделения
	              	|ГДЕ
	              	|	СМ_ЛичныеКабинеты_Авито_ЗапчастиПодразделения.Ссылка.Код = &КодЛичногоКабинета";
	
	Запрос.УстановитьПараметр("КодЛичногоКабинета", КодЛичногоКабинета);
	
	ТЗ = Запрос.Выполнить().Выгрузить();
	
	Возврат ТЗ;
	
КонецФункции  //ПолучитьТаблицуЛичногоКабинетаЗапчастиАвитоИзЗапроса(КодЛичногоКабинета)

Функция ПолучитьСписокНеликвида()
 	
	Запрос = Новый Запрос;
	
	Запрос.Текст =	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	              	|	УценкаТоваров.Номенклатура КАК НоменклатураУценки,
	              	|	УценкаТоваров.НеВыгружатьНаАвито КАК НеВыгружатьНаАвито
	              	|ИЗ
	              	|	РегистрСведений.УценкаТоваров КАК УценкаТоваров
	              	|ГДЕ
	              	|	НЕ УценкаТоваров.НеВыгружатьНаАвито"; 
	
	СЗ = Новый СписокЗначений;
	
	СЗ.ЗагрузитьЗначения(Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("НоменклатураУценки"));
	
	Возврат СЗ;
	
КонецФункции //ПолучитьСписокНеликвида()	

//Бондаренко++ 20231028
Функция ПолучитьСписокВыгружатьНаСайтОбъявлений()

	Запрос = Новый Запрос;
	
	Запрос.Текст =	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	              	|	ОстаткиТоваровКомпанииОстатки.Номенклатура КАК Номенклатура,
	              	|	СУММА(ОстаткиТоваровКомпанииОстатки.КоличествоОстаток) КАК КоличествоОстаток,
	              	|	ЗначенияСвойствОбъектов.Значение КАК ВыгружатьНаСайтОбъявлений
	              	|ИЗ
	              	|	РегистрНакопления.ОстаткиТоваровКомпании.Остатки КАК ОстаткиТоваровКомпанииОстатки
	              	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЗначенияСвойствОбъектов КАК ЗначенияСвойствОбъектов
	              	|		ПО ОстаткиТоваровКомпанииОстатки.Номенклатура = ЗначенияСвойствОбъектов.Объект
	              	|ГДЕ
	              	|	ЗначенияСвойствОбъектов.Свойство = ЗНАЧЕНИЕ(ПланВидовХарактеристик.СвойстваОбъектов.ВыгружатьНаСайтОбъявлений)
	              	|	И ЗначенияСвойствОбъектов.Значение = ИСТИНА
	              	|
	              	|СГРУППИРОВАТЬ ПО
	              	|	ОстаткиТоваровКомпанииОстатки.Номенклатура,
	              	|	ЗначенияСвойствОбъектов.Значение"; 
	
	СЗ = Новый СписокЗначений;
	
	СЗ.ЗагрузитьЗначения(Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Номенклатура"));
	
	Возврат СЗ;
	
КонецФункции 
//Бондаренко-- 20231028

Функция ПолучитьXMLОбъявленийAvitoZapLk(HTTPRequest) Экспорт
	
	СписокНеликвида = ПолучитьСписокНеликвида();
	//Бондаренко++ 20231028
	СписокВыгружатьНаСайтОбъявлений = ПолучитьСписокВыгружатьНаСайтОбъявлений();
	//Бондаренко-- 20231028
	
	СписокДЦ = Новый СписокЗначений;
 	ТаблицаДляВыгрузки = ПолучитьТаблицуЛичногоКабинетаЗапчастиАвитоИзЗапроса(HTTPRequest.ПараметрыURL["UnitCode"]);
   	СписокДЦ.ЗагрузитьЗначения(ТаблицаДляВыгрузки.ВыгрузитьКолонку("ДилерскийЦентр"));
	
	ТаблицаОстатков = ПолучитьТаблицуОстатков(СписокНеликвида,СписокВыгружатьНаСайтОбъявлений,СписокДЦ);
	
	XML_Полный=Новый ЗаписьXML();
	XML_Полный.УстановитьСтроку(Новый ПараметрыЗаписиXML("UTF-8","1.0",false));
	XML_Полный.ЗаписатьОбъявлениеXML();
	
	XML_Полный.ЗаписатьНачалоЭлемента("Ads");
	XML_Полный.ЗаписатьАтрибут("formatVersion","3");
	XML_Полный.ЗаписатьАтрибут("target","Avito.ru"); 
	
	//Бондаренко++ 20220628
	Если ТаблицаОстатков.Количество() > 0 Тогда
		
		Для каждого Эл Из ТаблицаОстатков Цикл
			
			ТекНом = Эл.Номенклатура;
			ТекДЦ = Эл.ДилерскийЦентр;
  			
		    АдресОП   = ПолучитьАдресОтделаПродажЗапчастей(ТаблицаДляВыгрузки,ТекДЦ);
			ТелефонОП = ПолучитьТелефонОтделаПродажЗапчастей(ТаблицаДляВыгрузки,ТекДЦ); 
			
			МинимальнаяЦенаЗапчастей = 0;
			МинимальнаяЦенаЗапчастей = ПолучитьМинимальнуюЦенуЗапчастей(ТаблицаДляВыгрузки,ТекДЦ);
			
			//Бондаренко++ 20231028
			ТипЦенЗапчастей = ПолучитьТипЦенЗапчастей(ТаблицаДляВыгрузки,ТекДЦ);
			ПроцентСкидкиНаценкиЗапчастей = ПолучитьПроцентНаценкиСкидкиЗапчастей(ТаблицаДляВыгрузки,ТекДЦ);
			//Бондаренко-- 20231028
			
			Если обЗначениеНеЗаполнено(АдресОП) ИЛИ обЗначениеНеЗаполнено(ТелефонОП) Тогда
				Продолжить;
			КонецЕсли;
			
			//Бондаренко++ 20231028
			Если МинимальнаяЦенаЗапчастей > 0 Тогда
				
				ЦенаПродажи = 0; 
				
				Если СписокНеликвида.НайтиПоЗначению(ТекНом) <> Неопределено Тогда
 					ОтборЦен = Новый Структура(); 
					ОтборЦен.Вставить("ТипЦен",Справочники.ТипыЦен.ОсновнойТипЦенПродажи);
					ОтборЦен.Вставить("Номенклатура",ТекНом);	
					ТецЦена = РегистрыСведений.Цены.ПолучитьПоследнее(ТекущаяДата(),ОтборЦен);
					ЦенаПродажи = ТецЦена.Цена;
				Иначе
 					ОтборЦен = Новый Структура(); 
					ОтборЦен.Вставить("ТипЦен",ТипЦенЗапчастей);
					ОтборЦен.Вставить("Номенклатура",ТекНом);	
					ТецЦена = РегистрыСведений.Цены.ПолучитьПоследнее(ТекущаяДата(),ОтборЦен) ;
					ЦенаПродажи = ТецЦена.Цена*(100+ПроцентСкидкиНаценкиЗапчастей)/100;
				КонецЕсли;
				
 				Если ЦенаПродажи < МинимальнаяЦенаЗапчастей Тогда
					Продолжить;
				КонецЕсли;
				
			КонецЕсли;
			//Бондаренко-- 20231028
			
			ЗаполнитьОбъявлениеНаЗапчасть(ЦенаПродажи,ТекНом,HTTPRequest,АдресОП,ТелефонОП, XML_Полный); 
			
		КонецЦикла;             
	КонецЕсли;
	//Бондаренко-- 20220628 
  	
	XML_Полный.ЗаписатьКонецЭлемента();     //Ads
	XMLТекст = XML_Полный.Закрыть();
	Возврат XMLТекст;
	
КонецФункции // ПолучитьXMLОбъявленийAvitoZapLk(HTTPRequest)  

Функция ПолучитьТаблицуОстатков(СписокНеликвида,СписокВыгружатьНаСайтОбъявлений,СписокДЦ)

	СписокТиповСклада = Новый СписокЗначений;
	СписокТиповСклада.Добавить(Перечисления.ТипыСкладов.Витрина);
	СписокТиповСклада.Добавить(Перечисления.ТипыСкладов.ЗапЧасти);
	СписокТиповСклада.Добавить(Перечисления.ТипыСкладов.Хозяйстенный);
	
  	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ОстаткиТоваровКомпанииОстатки.Номенклатура,
		|	СУММА(ОстаткиТоваровКомпанииОстатки.КоличествоОстаток) КАК КоличествоОстаток,
		|	ОстаткиТоваровКомпанииОстатки.СкладКомпании.Подразделение.ДилерскийЦентр КАК ДилерскийЦентр,
		|	ОстаткиТоваровКомпанииОстатки.Номенклатура.Наименование КАК НоменклатураНаименование
		|ИЗ
		|	РегистрНакопления.ОстаткиТоваровКомпании.Остатки КАК ОстаткиТоваровКомпанииОстатки
		|ГДЕ
		|	ОстаткиТоваровКомпанииОстатки.СкладКомпании.Подразделение.ДилерскийЦентр В (&СписокДилерскихЦентров)
		|			И ОстаткиТоваровКомпанииОстатки.СкладКомпании.ТипСклада В (&СписокТиповСклада)
		|			И (ОстаткиТоваровКомпанииОстатки.Номенклатура В (&СписокНеликвида)
		|				ИЛИ ОстаткиТоваровКомпанииОстатки.Номенклатура В (&СписокВыгружатьНаСайтОбъявлений))
		|
		|СГРУППИРОВАТЬ ПО
		|	ОстаткиТоваровКомпанииОстатки.Номенклатура,
		|	ОстаткиТоваровКомпанииОстатки.СкладКомпании.Подразделение.ДилерскийЦентр,
		|	ОстаткиТоваровКомпанииОстатки.Номенклатура.Наименование
		|
		|УПОРЯДОЧИТЬ ПО
		|	НоменклатураНаименование";
	
	Запрос.УстановитьПараметр("СписокДилерскихЦентров", СписокДЦ);
  	Запрос.УстановитьПараметр("СписокТиповСклада", СписокТиповСклада);          
	Запрос.УстановитьПараметр("СписокНеликвида", СписокНеликвида);
	Запрос.УстановитьПараметр("СписокВыгружатьНаСайтОбъявлений", СписокВыгружатьНаСайтОбъявлений);
  	
	Возврат Запрос.Выполнить().Выгрузить();
 
КонецФункции // ПолучитьТаблицуОстатков(СписокНеликвида,СписокВыгружатьНаСайтОбъявлений,СписокДЦ)


Процедура ЗаполнитьОбъявлениеНаЗапчасть(ЦенаПродажи,ТекНом,HTTPRequest,АдресОП,ТелефонОП, XML_Полный)
	
	
	XML_Полный.ЗаписатьНачалоЭлемента("Ad");
	
	XML_Полный.ЗаписатьНачалоЭлемента("Id");                XML_Полный.ЗаписатьТекст(СокрЛП(ТекНом.Код));                                XML_Полный.ЗаписатьКонецЭлемента();
	
	//АвитоИД = СтрЗаменить(Renault_внОбщийМодуль.ВычислитьХэш(ТекНом.УникальныйИдентификатор()),Символы.НПП,"");
 	//XML_Полный.ЗаписатьНачалоЭлемента("AvitoId");           XML_Полный.ЗаписатьТекст(СокрЛП(АвитоИД));                                 XML_Полный.ЗаписатьКонецЭлемента();

	XML_Полный.ЗаписатьНачалоЭлемента("Address");           XML_Полный.ЗаписатьТекст(АдресОП);                                           XML_Полный.ЗаписатьКонецЭлемента();
	XML_Полный.ЗаписатьНачалоЭлемента("ContactPhone");      XML_Полный.ЗаписатьТекст(ТелефонОП);                                         XML_Полный.ЗаписатьКонецЭлемента();
	XML_Полный.ЗаписатьНачалоЭлемента("ManagerName");       XML_Полный.ЗаписатьТекст("Менеджер");                                        XML_Полный.ЗаписатьКонецЭлемента();
	XML_Полный.ЗаписатьНачалоЭлемента("Category");          XML_Полный.ЗаписатьТекст("Запчасти и аксессуары");                           XML_Полный.ЗаписатьКонецЭлемента();
	
	//Бондаренко++ 20240704
	//XML_Полный.ЗаписатьНачалоЭлемента("Title");             XML_Полный.ЗаписатьТекст(СокрЛП(ТекНом.Наименование));                       XML_Полный.ЗаписатьКонецЭлемента();
	//XML_Полный.ЗаписатьНачалоЭлемента("Description");       XML_Полный.ЗаписатьТекст(СокрЛП(ТекНом.НаименованиеПолное));                 XML_Полный.ЗаписатьКонецЭлемента();
	ТекНомНаименование = СокрЛП(ТекНом.Наименование);
	ТекНомНаименование = Врег(Сред(ТекНомНаименование,1,1))+Нрег(Сред(ТекНомНаименование,2));
 	ТекНомНаименованиеПолное = СокрЛП(ТекНом.НаименованиеПолное);
	ТекНомНаименованиеПолное = Врег(Сред(ТекНомНаименованиеПолное,1,1))+Нрег(Сред(ТекНомНаименованиеПолное,2));
 	XML_Полный.ЗаписатьНачалоЭлемента("Title");             XML_Полный.ЗаписатьТекст(ТекНомНаименование);                                XML_Полный.ЗаписатьКонецЭлемента();
	XML_Полный.ЗаписатьНачалоЭлемента("Description");       XML_Полный.ЗаписатьТекст(ТекНомНаименованиеПолное);                          XML_Полный.ЗаписатьКонецЭлемента();
   	
	Если НЕ обЗначениеНеЗаполнено(ТекНом.КатегорияТоваровАвито) Тогда
		XML_Полный.ЗаписатьНачалоЭлемента("GoodsType");            XML_Полный.ЗаписатьТекст(СокрЛП(ТекНом.КатегорияТоваровАвито.GoodsType));            XML_Полный.ЗаписатьКонецЭлемента();
		XML_Полный.ЗаписатьНачалоЭлемента("ProductType");          XML_Полный.ЗаписатьТекст(СокрЛП(ТекНом.КатегорияТоваровАвито.ProductType));          XML_Полный.ЗаписатьКонецЭлемента();
		XML_Полный.ЗаписатьНачалоЭлемента("SparePartType");        XML_Полный.ЗаписатьТекст(СокрЛП(ТекНом.КатегорияТоваровАвито.SparePartType));        XML_Полный.ЗаписатьКонецЭлемента();
		XML_Полный.ЗаписатьНачалоЭлемента("EngineSparePartType");  XML_Полный.ЗаписатьТекст(СокрЛП(ТекНом.КатегорияТоваровАвито.EngineSparePartType));  XML_Полный.ЗаписатьКонецЭлемента();
		XML_Полный.ЗаписатьНачалоЭлемента("BodySparePartType");    XML_Полный.ЗаписатьТекст(СокрЛП(ТекНом.КатегорияТоваровАвито.BodySparePartType));    XML_Полный.ЗаписатьКонецЭлемента();
		XML_Полный.ЗаписатьНачалоЭлемента("DeviceType");           XML_Полный.ЗаписатьТекст(СокрЛП(ТекНом.КатегорияТоваровАвито.DeviceType));           XML_Полный.ЗаписатьКонецЭлемента();
		//Бондаренко++ 20240710
		XML_Полный.ЗаписатьНачалоЭлемента("TechnicSparePartType"); XML_Полный.ЗаписатьТекст(СокрЛП(ТекНом.КатегорияТоваровАвито.TechnicSparePartType)); XML_Полный.ЗаписатьКонецЭлемента();
		//Бондаренко-- 20240710
 	КонецЕсли;
	//Бондаренко-- 20240704
	
 	XML_Полный.ЗаписатьНачалоЭлемента("AdType");            XML_Полный.ЗаписатьТекст("Товар приобретен на продажу");                     XML_Полный.ЗаписатьКонецЭлемента();
	XML_Полный.ЗаписатьНачалоЭлемента("ProductType");       XML_Полный.ЗаписатьТекст("Для автомобилей");                                 XML_Полный.ЗаписатьКонецЭлемента();
	
	Если НЕ ТекНом.БУ Тогда
		XML_Полный.ЗаписатьНачалоЭлемента("Condition");         XML_Полный.ЗаписатьТекст("Новое");                                       XML_Полный.ЗаписатьКонецЭлемента();
 	Иначе
		XML_Полный.ЗаписатьНачалоЭлемента("Condition");         XML_Полный.ЗаписатьТекст("Б/у");                                         XML_Полный.ЗаписатьКонецЭлемента();
	КонецЕсли;
  	
	Если НЕ обЗначениеНеЗаполнено(ТекНом.Производитель) Тогда
		XML_Полный.ЗаписатьНачалоЭлемента("Brand");         XML_Полный.ЗаписатьТекст(СокрЛП(ТекНом.Производитель.ПроизводительАвито));   XML_Полный.ЗаписатьКонецЭлемента();
	Иначе
		XML_Полный.ЗаписатьНачалоЭлемента("Brand");         XML_Полный.ЗаписатьТекст("-");                                               XML_Полный.ЗаписатьКонецЭлемента();
	КонецЕсли;

	// ТецЦена = 0; 
	//ОтборЦен = Новый Структура(); 
	//ОтборЦен.Вставить("ТипЦен",Справочники.ТипыЦен.ОсновнойТипЦенПродажи);
	//ОтборЦен.Вставить("Номенклатура",ТекНом);	
	//ТецЦена = РегистрыСведений.Цены.ПолучитьПоследнее(ТекущаяДата(),ОтборЦен);
	// ЦенаПродажи = ТецЦена.Цена;
	
 	//Если ЦенаПродажи > 0  Тогда
		XML_Полный.ЗаписатьНачалоЭлемента("Price");         XML_Полный.ЗаписатьТекст(СтрЗаменить(СокрЛП(ЦенаПродажи),Символы.НПП,""));   XML_Полный.ЗаписатьКонецЭлемента();
	//КонецЕсли;
	 
	XML_Полный.ЗаписатьНачалоЭлемента("OEM");               XML_Полный.ЗаписатьТекст(СокрЛП(ТекНом.Артикул));                            XML_Полный.ЗаписатьКонецЭлемента();
	
	//Бондаренко++ 20231025
	Если ТекНом.ПутьКФото.Количество() > 0 Тогда
		XML_Полный.ЗаписатьНачалоЭлемента("Images");
		Для каждого СтрТЧ Из ТекНом.ПутьКФото Цикл
			XML_Полный.ЗаписатьНачалоЭлемента("Image");
			//XML_Полный.ЗаписатьАтрибут("url",HTTPRequestБазовыйURL+"/photo/"+ТекНом.УникальныйИдентификатор()+"/"+СтрТЧ.GUID+".jpg");
			XML_Полный.ЗаписатьАтрибут("url",HTTPRequest.БазовыйURL+"/photo/"+ТекНом.УникальныйИдентификатор()+"/"+СтрТЧ.GUID+".jpg");
			XML_Полный.ЗаписатьКонецЭлемента();
		КонецЦикла; 
		XML_Полный.ЗаписатьКонецЭлемента(); //Images	
	КонецЕсли;
	
	ВидеоДляСайта = "";
	ВидеоДляСайта = СМ_ВыгрузкаОбъявленийОПродажеАвто.СМГ_СправочникВернутьЗначениеРеквизита("СсылкаНаВидео",ТекНом.ПолучитьОбъект());
	ВидеоДляСайта = СтрЗаменить(ВидеоДляСайта,"https://youtu.be/","https://www.youtube.com/watch?v=");		
	
	Если НЕ обЗначениеНеЗаполнено(ВидеоДляСайта) Тогда
		XML_Полный.ЗаписатьНачалоЭлемента("VideoURL");     XML_Полный.ЗаписатьТекст(ВидеоДляСайта);                	                                        XML_Полный.ЗаписатьКонецЭлемента(); 		
	КонецЕсли;
	//Бондаренко-- 20231025
	
  	XML_Полный.ЗаписатьКонецЭлемента(); // Ad
	
КонецПроцедуры // ЗаполнитьОбъявлениеНаЗапчасть(ТекАвто,HTTPRequest.БазовыйURL,АдресОП,ТелефонОП, XML_Полный)

Функция ПолучитьАдресОтделаПродажЗапчастей(ТаблицаДляВыгрузки,ТекДЦ)
	
	АдресОП = "";
	
	Отбор = Новый Структура();
 	Отбор.Вставить("ДилерскийЦентр",ТекДЦ);
	Строки = ТаблицаДляВыгрузки.НайтиСтроки(Отбор);
	
	Если Строки.Количество() > 0 Тогда
	    АдресОП = Строки[0].Адрес;
	КонецЕсли;	 
	
	Возврат АдресОП;
	
	
КонецФункции // ПолучитьАдресОтделаПродажЗапчастей(ТаблицаДляВыгрузки,ТекДЦ)

Функция ПолучитьТелефонОтделаПродажЗапчастей(ТаблицаДляВыгрузки,ТекДЦ)

	ТелефонОП = "";
	
	Отбор = Новый Структура();
 	Отбор.Вставить("ДилерскийЦентр",ТекДЦ);
	Строки = ТаблицаДляВыгрузки.НайтиСтроки(Отбор);
	
	Если Строки.Количество() > 0 Тогда
	    ТелефонОП = Строки[0].ПредставлениеТелефона;
	КонецЕсли;
	
	ТелефонОП = СтрЗаменить(ТелефонОП,"+7, ","8");
	
	Возврат ТелефонОП;
 	
КонецФункции // ПолучитьТелефонОтделаПродажЗапчастей(ТаблицаДляВыгрузки,ТекДЦ)
//Бондаренко-- 20221215

Функция ПолучитьXMLAvitoLkПоМарке(ТаблицаВыгрузки, HTTPRequest,XML) Экспорт
	
	//Бондаренко++ 20201030
	СписокАвтоТестДрайва = ПолучитьАвтомобилиДляТестДрайва();
	//Бондаренко-- 20201030  
	
	//Бондаренко++ 20220613
	СписокВыгруженныхАвто = Новый СписокЗначений; 
	//Бондаренко-- 20220613
	
	ТЗ = Новый ТаблицаЗначений;                                                         
	
	СписокМарокЗапроса = Новый СписокЗначений;
	СписокМарокЗапроса.ЗагрузитьЗначения(ТаблицаВыгрузки.ВыгрузитьКолонку("Марка"));
	
	тзПодразделение = ТаблицаВыгрузки.Скопировать(,"Подразделение");
	тзПодразделение.Свернуть("Подразделение");
	СписокПодразделений = Новый СписокЗначений;
	СписокПодразделений.ЗагрузитьЗначения(тзПодразделение.ВыгрузитьКолонку("Подразделение"));
	
	СписокПодразделений = ПолучитьПолныйСписокПодразделений(СписокПодразделений);
	
	Если СписокПодразделений.Количество() = 0 Тогда
		Возврат XML;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ОстаткиАвтомобилейОстатки.Автомобиль,
	|	ОстаткиАвтомобилейОстатки.Автомобиль.VIN КАК VIN,
	|	СУММА(ОстаткиАвтомобилейОстатки.КоличествоОстаток) КАК Остаток,
	|	ЦенаАвто.Цена + ЦенаАвто.Автомобиль.СтоимостьДопОборудования КАК Цена,
	|	ХарАвто.Значение КАК ВидАвто,
	|	ОстаткиАвтомобилейОстатки.СкладКомпании.Подразделение КАК Подразделение,
	|	ОстаткиАвтомобилейОстатки.СкладКомпании.Подразделение.ДилерскийЦентр КАК ДилерскийЦентр,
	|	ОстаткиАвтомобилейОстатки.Автомобиль.Модель.МодельАвтоРу.МаркаАвтоРу КАК МаркаАвтоРу,
	|	ОстаткиАвтомобилейОстатки.Автомобиль.Модель.МодельАвтоРу КАК МодельАвтоРу,
	|	ОстаткиАвтомобилейОстатки.Автомобиль.ВариантКомплектации.МодификацияАвтоРу КАК МодификацияАвтоРу,
	|	ОстаткиАвтомобилейОстатки.Автомобиль.ВариантКомплектации.КомплектацияАвтоРу КАК КомплектацияАвтоРу,
	|	ОстаткиАвтомобилейОстатки.Автомобиль.СпециальнаяЦена КАК СпециальнаяЦена,
	|	ОстаткиАвтомобилейОстатки.Автомобиль.СкидкаПриПокупкеВКредит КАК СкидкаПриПокупкеВКредит,
	|	ОстаткиАвтомобилейОстатки.Автомобиль.СкидкаПриСтраховании КАК СкидкаПриСтраховании,
	|	ОстаткиАвтомобилейОстатки.Автомобиль.СкидаПриПокупкеВТрейдИн КАК СкидаПриПокупкеВТрейдИн,
	|	ОстаткиАвтомобилейОстатки.Автомобиль.СкидкаМаксимальная КАК СкидкаМаксимальная,
	|	ОстаткиАвтомобилейОстатки.Автомобиль.Цвет.ЦветАвтоРу КАК ЦветАвтоРу,
	|	ОстаткиАвтомобилейОстатки.Автомобиль.Цвет.ОкраскаМеталлик КАК ОкраскаМеталлик,
	|	ОстаткиАвтомобилейОстатки.Автомобиль.ВариантКомплектации.Руль КАК Руль,
	|	ОстаткиАвтомобилейОстатки.Автомобиль.ВариантКомплектации.КоличествоДверей КАК КоличествоДверей,
	|	ОстаткиАвтомобилейОстатки.Автомобиль.Модель.КатегорияТС,
	|	ПробегиАвто.Значение КАК Пробег,
	|	ОстаткиАвтомобилейОстатки.Автомобиль.Состояние КАК Состояние,
	|	ОстаткиАвтомобилейОстатки.Автомобиль.КоличествоВладельцевПоПТС КАК КоличествоВладельцев,
	|	ОстаткиАвтомобилейОстатки.Автомобиль.ВариантКомплектации.ТипКузова.ТипКузоваАвтоРу КАК ТипКузоваВариантаКомплектации,
	|	ОстаткиАвтомобилейОстатки.Автомобиль.Модель.ТипКузова.ТипКузоваАвтоРу КАК ТипКузоваМодели,
	|	""                    "" КАК ВнешнийНомерЗаказа,
	|	ОстаткиАвтомобилейОстатки.Автомобиль.Модель.Марка КАК Марка,
	|	""В наличии"" КАК МестоАвто
	|ИЗ
	|	РегистрНакопления.ОстаткиАвтомобилей.Остатки КАК ОстаткиАвтомобилейОстатки
	|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|			ЦеныАвтомобилейСрезПоследних.Цена КАК Цена,
	|			ЦеныАвтомобилейСрезПоследних.Автомобиль КАК Автомобиль,
	|			ЦеныАвтомобилейСрезПоследних.ВариантКомплектации КАК ВариантКомплектации,
	|			ЦеныАвтомобилейСрезПоследних.ТипЦен КАК ТипЦен
	|		ИЗ
	|			РегистрСведений.ЦеныАвтомобилей.СрезПоследних КАК ЦеныАвтомобилейСрезПоследних
	|		ГДЕ
	|			ЦеныАвтомобилейСрезПоследних.ТипЦен = ЗНАЧЕНИЕ(Справочник.ТипыЦен.ОсновнойТипЦенПродажи)) КАК ЦенаАвто
	|		ПО ОстаткиАвтомобилейОстатки.Автомобиль = ЦенаАвто.Автомобиль
	|			И ОстаткиАвтомобилейОстатки.Автомобиль.ВариантКомплектации = ЦенаАвто.Автомобиль.ВариантКомплектации
	|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|			АвтомобилиСрезПоследних.Автомобиль КАК Автомобиль,
	|			АвтомобилиСрезПоследних.ВидЗначения КАК ВидЗначения,
	|			АвтомобилиСрезПоследних.Значение КАК Значение
	|		ИЗ
	|			РегистрСведений.Автомобили.СрезПоследних КАК АвтомобилиСрезПоследних
	|		ГДЕ
	|			АвтомобилиСрезПоследних.ВидЗначения = ЗНАЧЕНИЕ(Перечисление.ДополнительнаяИнформацияАвтомобилей.ВидАвтомобиля)) КАК ХарАвто
	|		ПО ОстаткиАвтомобилейОстатки.Автомобиль = ХарАвто.Автомобиль
	|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|			АвтомобилиСрезПоследних.Автомобиль КАК Автомобиль,
	|			АвтомобилиСрезПоследних.ВидЗначения КАК ВидЗначения,
	|			АвтомобилиСрезПоследних.Значение КАК Значение
	|		ИЗ
	|			РегистрСведений.Автомобили.СрезПоследних КАК АвтомобилиСрезПоследних
	|		ГДЕ
	|			АвтомобилиСрезПоследних.ВидЗначения = ЗНАЧЕНИЕ(Перечисление.ДополнительнаяИнформацияАвтомобилей.Пробег)) КАК ПробегиАвто
	|		ПО ОстаткиАвтомобилейОстатки.Автомобиль = ПробегиАвто.Автомобиль
	|ГДЕ
	|	ОстаткиАвтомобилейОстатки.КоличествоОстаток > 0
	|	И ХарАвто.Значение = ЗНАЧЕНИЕ(Перечисление.ВидАвтомобиля.Новый)
	|	И ОстаткиАвтомобилейОстатки.СкладКомпании.Подразделение В(&СписокПодразделений)
	|	И ОстаткиАвтомобилейОстатки.Автомобиль.Модель.КатегорияТС = ЗНАЧЕНИЕ(Справочник.КатегорииТранспортныхСредств.АвтомобилиЛегковые)
	|	И ОстаткиАвтомобилейОстатки.Автомобиль.Модель.Марка В(&СписокМарокЗапроса)
	|
	|СГРУППИРОВАТЬ ПО
	|	ОстаткиАвтомобилейОстатки.Автомобиль,
	|	ОстаткиАвтомобилейОстатки.Автомобиль.VIN,
	|	ХарАвто.Значение,
	|	ОстаткиАвтомобилейОстатки.СкладКомпании.Подразделение.ДилерскийЦентр,
	|	ОстаткиАвтомобилейОстатки.Автомобиль.Модель.МодельАвтоРу.МаркаАвтоРу,
	|	ОстаткиАвтомобилейОстатки.Автомобиль.Модель.МодельАвтоРу,
	|	ОстаткиАвтомобилейОстатки.Автомобиль.ВариантКомплектации.МодификацияАвтоРу,
	|	ОстаткиАвтомобилейОстатки.Автомобиль.СпециальнаяЦена,
	|	ОстаткиАвтомобилейОстатки.Автомобиль.СкидкаПриПокупкеВКредит,
	|	ОстаткиАвтомобилейОстатки.Автомобиль.СкидкаПриСтраховании,
	|	ОстаткиАвтомобилейОстатки.Автомобиль.СкидаПриПокупкеВТрейдИн,
	|	ОстаткиАвтомобилейОстатки.Автомобиль.СкидкаМаксимальная,
	|	ОстаткиАвтомобилейОстатки.Автомобиль.ВариантКомплектации.КомплектацияАвтоРу,
	|	ОстаткиАвтомобилейОстатки.Автомобиль.Цвет.ЦветАвтоРу,
	|	ОстаткиАвтомобилейОстатки.Автомобиль.Цвет.ОкраскаМеталлик,
	|	ОстаткиАвтомобилейОстатки.Автомобиль.ВариантКомплектации.Руль,
	|	ОстаткиАвтомобилейОстатки.Автомобиль.ВариантКомплектации.КоличествоДверей,
	|	ПробегиАвто.Значение,
	|	ОстаткиАвтомобилейОстатки.Автомобиль.Состояние,
	|	ОстаткиАвтомобилейОстатки.Автомобиль.КоличествоВладельцевПоПТС,
	|	ОстаткиАвтомобилейОстатки.Автомобиль.ВариантКомплектации.ТипКузова.ТипКузоваАвтоРу,
	|	ОстаткиАвтомобилейОстатки.СкладКомпании.Подразделение,
	|	ОстаткиАвтомобилейОстатки.Автомобиль.Модель.ТипКузова.ТипКузоваАвтоРу,
	|	ОстаткиАвтомобилейОстатки.Автомобиль.Модель.КатегорияТС,
	|	ЦенаАвто.Цена + ЦенаАвто.Автомобиль.СтоимостьДопОборудования,
	|	ОстаткиАвтомобилейОстатки.Автомобиль.Модель.Марка
	|
	|УПОРЯДОЧИТЬ ПО
	|	VIN";
	
	Запрос.УстановитьПараметр("СписокПодразделений",СписокПодразделений);
	Запрос.УстановитьПараметр("СписокМарокЗапроса",СписокМарокЗапроса);
	
	ТЗ = Запрос.Выполнить().Выгрузить(); 
	
	//Бондаренко++ 20220424
	ТЗ = ДополнитьЗаказамиПоставщикуПоМаркам(ТЗ,СписокПодразделений,СписокМарокЗапроса); 
	//Бондаренко-- 20220424	
	
	
	Для каждого Стр1 Из ТЗ Цикл
		
		//Если НЕ обЗначениеНеЗаполнено(Стр1.Подразделение) Тогда
		//	СписокМарок = ПолучитьСписокМарокАвто(Стр1.Подразделение);
		//	Если СписокМарок.НайтиПоЗначению(Стр1.Автомобиль.Модель.Марка) = Неопределено Тогда
		//		Продолжить;	
		//	КонецЕсли; 
		//КонецЕсли; 
		
		//Бондаренко++ 20200707
		//Если Стр1.Автомобиль.ПутьКФото.Количество() = 0 Тогда
		//	Продолжить;	
		//КонецЕсли; 
		//Бондаренко++ 20200707	
		
		//Бондаренко++ 20201030
		Если СписокАвтоТестДрайва.НайтиПоЗначению(Стр1.Автомобиль) <> Неопределено Тогда
			Продолжить;
		КонецЕсли; 
		//Бондаренко-- 20201030  
		
		//Бондаренко++ 20220613
		Если СписокВыгруженныхАвто.НайтиПоЗначению(Стр1.Автомобиль) <> Неопределено Тогда
			Продолжить;		
		КонецЕсли;
		СписокВыгруженныхАвто.Добавить(Стр1.Автомобиль);		
		//Бондаренко-- 20220613
		
		XML.ЗаписатьНачалоЭлемента("Ad");
		
		//Бондаренко++ 20220608                                                                                                
		//XML.ЗаписатьНачалоЭлемента("Id");                XML.ЗаписатьТекст(Стр1.Автомобиль.VIN); XML.ЗаписатьКонецЭлемента();
		XML.ЗаписатьНачалоЭлемента("Id");                  XML.ЗаписатьТекст(СокрЛП(Стр1.Автомобиль.Код)); XML.ЗаписатьКонецЭлемента();
		//Бондаренко-- 20220608
		
		//Бондаренко++ 20220608
		//ТекущееПодразделение = Стр1.Подразделение;
		//ПодразделениеАдрес = киПолучитьПредставлениеКИ(ТекущееПодразделение, Справочники.ВидыКонтактнойИнформации.АдресФактический);
		//Если обЗначениеНеЗаполнено(ПодразделениеАдрес) Тогда
		//	ПодразделениеАдрес = киПолучитьПредставлениеКИ(ТекущееПодразделение, Справочники.ВидыКонтактнойИнформации.АдресПочтовый);
		//КонецЕсли;        
		АдресОтделаПродаж = "";
		АдресОтделаПродаж = ПолучитьАдресОтделаПродаж(ТаблицаВыгрузки,Стр1.Марка);		
		//Бондаренко-- 20220608
		
		XML.ЗаписатьНачалоЭлемента("Address");             XML.ЗаписатьТекст(АдресОтделаПродаж);                                                         XML.ЗаписатьКонецЭлемента();
		
		ТекстКлассифайда = СокрЛП(Стр1.Автомобиль.Модель.ТекстКлассифайда);
		Если обЗначениеНеЗаполнено(ТекстКлассифайда) Тогда
			ТекстКлассифайда = СокрЛП(Стр1.Подразделение.ТекстКлассифайда);
			Если обЗначениеНеЗаполнено(ТекстКлассифайда) Тогда
				Попытка ТекстКлассифайда = СокрЛП(Стр1.Подразделение.Родитель.ТекстКлассифайда); Исключение	КонецПопытки;  
				Если обЗначениеНеЗаполнено(ТекстКлассифайда) Тогда
					Попытка ТекстКлассифайда = СокрЛП(Стр1.Подразделение.Родитель.Родитель.ТекстКлассифайда); Исключение	КонецПопытки;  
				КонецЕсли; 		
			КонецЕсли; 
		КонецЕсли; 
		
		XML.ЗаписатьНачалоЭлемента("Description");         XML.ЗаписатьТекст(ТекстКлассифайда);                                                          XML.ЗаписатьКонецЭлемента();	 //Description
		
		XML.ЗаписатьНачалоЭлемента("Category");            XML.ЗаписатьТекст("Автомобили");                                                              XML.ЗаписатьКонецЭлемента();	 //Category
		XML.ЗаписатьНачалоЭлемента("CarType");             XML.ЗаписатьТекст("Новые");                                                                   XML.ЗаписатьКонецЭлемента();	 //CarType
		
		XML.ЗаписатьНачалоЭлемента("Price");               XML.ЗаписатьТекст(СокрЛП(СтрЗаменить(Стр1.Цена,Символы.НПП,"")));                             XML.ЗаписатьКонецЭлемента(); 
		
		Если НЕ обЗначениеНезаполнено(Стр1.СкидкаПриПокупкеВКредит) Тогда
			XML.ЗаписатьНачалоЭлемента("CreditDiscount");     XML.ЗаписатьТекст(СокрЛП(СтрЗаменить(Стр1.СкидкаПриПокупкеВКредит,Символы.НПП,"")));       XML.ЗаписатьКонецЭлемента(); 
		КонецЕсли; 
		
		Если НЕ обЗначениеНезаполнено(Стр1.СкидкаПриСтраховании) Тогда
			XML.ЗаписатьНачалоЭлемента("InsuranceDiscount");  XML.ЗаписатьТекст(СокрЛП(СтрЗаменить(Стр1.СкидкаПриСтраховании,Символы.НПП,"")));          XML.ЗаписатьКонецЭлемента();  
		КонецЕсли; 
		
		Если НЕ обЗначениеНезаполнено(Стр1.СкидаПриПокупкеВТрейдИн) Тогда
			XML.ЗаписатьНачалоЭлемента("TradeinDiscount");    XML.ЗаписатьТекст(СокрЛП(СтрЗаменить(Стр1.СкидаПриПокупкеВТрейдИн,Символы.НПП,"")));       XML.ЗаписатьКонецЭлемента();  
		КонецЕсли; 
		
		Если НЕ обЗначениеНезаполнено(Стр1.СкидкаМаксимальная) Тогда
			XML.ЗаписатьНачалоЭлемента("MaxDiscount");        XML.ЗаписатьТекст(СокрЛП(СтрЗаменить(Стр1.СкидкаМаксимальная,Символы.НПП,"")));            XML.ЗаписатьКонецЭлемента(); 
		КонецЕсли; 
		
		XML.ЗаписатьНачалоЭлемента("Make");                    XML.ЗаписатьТекст(Стр1.Автомобиль.Модель.Марка.МаркаАвито.Наименование);                  XML.ЗаписатьКонецЭлемента();
		XML.ЗаписатьНачалоЭлемента("Model");                   XML.ЗаписатьТекст(Стр1.Автомобиль.Модель.МодельАвито.Наименование);                       XML.ЗаписатьКонецЭлемента();
		
		//Бондаренко++ 20220629
		Если обЗначениеНеЗаполнено(Стр1.Автомобиль.ГодВыпуска) Тогда
			ГодВыпуска_ = НачалоГода(ТекущаяДата());	
		Иначе		
			ГодВыпуска_ = Стр1.Автомобиль.ГодВыпуска;		
		КонецЕсли;
		//Бондаренко-- 20220629
		XML.ЗаписатьНачалоЭлемента("Year");                    XML.ЗаписатьТекст(Формат(ГодВыпуска_,"ДФ=yyyy"));                                         XML.ЗаписатьКонецЭлемента();
		//Бондаренко++ 20220708
		//XML.ЗаписатьНачалоЭлемента("VIN");                   XML.ЗаписатьТекст(Стр1.Автомобиль.VIN);                                                   XML.ЗаписатьКонецЭлемента();
		Если СокрЛП(Стр1.Автомобиль.VIN) <> "" Тогда
			XML.ЗаписатьНачалоЭлемента("VIN");                 XML.ЗаписатьТекст(Стр1.Автомобиль.VIN);                                                   XML.ЗаписатьКонецЭлемента();
		Иначе
			XML.ЗаписатьНачалоЭлемента("VIN");                 XML.ЗаписатьТекст(Стр1.ВнешнийНомерЗаказа);                                               XML.ЗаписатьКонецЭлемента();
		КонецЕсли;
		XML.ЗаписатьНачалоЭлемента("Availability");             XML.ЗаписатьТекст(СокрЛП(Стр1.МестоАвто));                                               XML.ЗаписатьКонецЭлемента();
		//Бондаренко-- 20220708 
		
		XML.ЗаписатьНачалоЭлемента("BodyType");                XML.ЗаписатьТекст(СокрЛП(Стр1.Автомобиль.ВариантКомплектации.ТипКузова.ТипКузоваАвито));  XML.ЗаписатьКонецЭлемента();
		XML.ЗаписатьНачалоЭлемента("Doors");                   XML.ЗаписатьТекст(СокрЛП(Стр1.Автомобиль.ВариантКомплектации.КоличествоДверей));          XML.ЗаписатьКонецЭлемента();
		XML.ЗаписатьНачалоЭлемента("ModificationId");          XML.ЗаписатьТекст(Стр1.Автомобиль.ВариантКомплектации.МодификацияАвито.Артикул);          XML.ЗаписатьКонецЭлемента();
		XML.ЗаписатьНачалоЭлемента("GenerationId");            XML.ЗаписатьТекст(Стр1.Автомобиль.Модель.ГенерацияАвито.Артикул);                         XML.ЗаписатьКонецЭлемента();
		XML.ЗаписатьНачалоЭлемента("ComplectationId");         XML.ЗаписатьТекст(Стр1.Автомобиль.ВариантКомплектации.КомплектацияАвито.Артикул);         XML.ЗаписатьКонецЭлемента();	
		XML.ЗаписатьНачалоЭлемента("Color");                   XML.ЗаписатьТекст(СокрЛП(Стр1.ЦветАвтоРу));                                               XML.ЗаписатьКонецЭлемента();
		
		ТипТоплива = Стр1.Автомобиль.ВариантКомплектации.ТипДвигателя.ТипТоплива;
		Если ТипТоплива = Перечисления.ТипыТоплива.LiquefiedGas ИЛИ ТипТоплива = ТипТоплива = Перечисления.ТипыТоплива.PressureGas Тогда
			XML.ЗаписатьНачалоЭлемента("FuelType");            XML.ЗаписатьТекст("Газ");                                                                 XML.ЗаписатьКонецЭлемента();
		Иначе
			XML.ЗаписатьНачалоЭлемента("FuelType");            XML.ЗаписатьТекст(СокрЛП(ТипТоплива));                                                         XML.ЗаписатьКонецЭлемента();	
		КонецЕсли; 
		
		EngineSize_str =  СтрЗаменить(СокрЛП(Стр1.Автомобиль.ОбъемДвигателя*1000),Символы.НПП,"");
		Если НЕ обЗначениеНеЗаполнено(EngineSize_str) Тогда
			XML.ЗаписатьНачалоЭлемента("EngineSize");          XML.ЗаписатьТекст(EngineSize_str);                                                        XML.ЗаписатьКонецЭлемента();
		КонецЕсли;
		
		Power_str =  СтрЗаменить(СокрЛП(Стр1.Автомобиль.МощностьДвигателя),Символы.НПП,"");
		Если НЕ обЗначениеНеЗаполнено(Power_str) Тогда
			XML.ЗаписатьНачалоЭлемента("Power");               XML.ЗаписатьТекст(Power_str);                                                             XML.ЗаписатьКонецЭлемента();
		КонецЕсли;
		
		Transmission_str = СокрЛП(Стр1.Автомобиль.ВариантКомплектации.ТипКПП.Наименование); 
		Если НЕ обЗначениеНеЗаполнено(Transmission_str) Тогда
			XML.ЗаписатьНачалоЭлемента("Transmission");        XML.ЗаписатьТекст(Transmission_str);                                                      XML.ЗаписатьКонецЭлемента();
		КонецЕсли;
		
		DriveType_ = Стр1.Автомобиль.Привод;
		Если DriveType_= Перечисления.Привод.Передний ИЛИ 
			DriveType_= Перечисления.Привод.Задний 	ИЛИ 
			DriveType_= Перечисления.Привод.Полный Тогда
			DriveType_str = СокрЛП(DriveType_);    
		Иначе 
			DriveType_str =  "Полный";
		КонецЕсли;	
		Если НЕ обЗначениеНеЗаполнено(DriveType_str) Тогда
			XML.ЗаписатьНачалоЭлемента("DriveType");            XML.ЗаписатьТекст(DriveType_str);                                                        XML.ЗаписатьКонецЭлемента();
		КонецЕсли;
		
		WheelType_str = СокрЛП(Стр1.Руль);
		WheelType_str = Врег(Сред(WheelType_str,1,1))+Сред(WheelType_str,2);
		Если WheelType_str<>"" Тогда
			XML.ЗаписатьНачалоЭлемента("WheelType");            XML.ЗаписатьТекст(WheelType_str);                                                        XML.ЗаписатьКонецЭлемента();
		КонецЕсли;
		
		XML.ЗаписатьНачалоЭлемента("Images");
		Для каждого СтрТЧ Из Стр1.Автомобиль.ПутьКФото Цикл
			XML.ЗаписатьНачалоЭлемента("Image");
			//Бондаренко++ 20220303
			//XML.ЗаписатьАтрибут("url",HTTPRequestas.БазовыйURL+"/photo/"+Стр1.Автомобиль.VIN+"/"+СтрТЧ.НомерСтроки+".jpg");
			XML.ЗаписатьАтрибут("url",HTTPRequest.БазовыйURL+"/photo/"+Стр1.Автомобиль.УникальныйИдентификатор()+"/"+СтрТЧ.GUID+".jpg");
			//Бондаренко-- 20220303
			XML.ЗаписатьКонецЭлемента();
		КонецЦикла; 
		XML.ЗаписатьКонецЭлемента(); //Images	

	    //Бондаренко++ 20220929                    
		ВидеоДляСайта = "";
		ВидеоДляСайта = СМ_ВыгрузкаОбъявленийОПродажеАвто.СМГ_СправочникВернутьЗначениеРеквизита("СсылкаНаВидео",Стр1.Автомобил.ПолучитьОбъект());
		ВидеоДляСайта = СтрЗаменить(ВидеоДляСайта,"https://youtu.be/","https://www.youtube.com/watch?v=");		
		//Бондаренко-- 20220929
	
		Если НЕ обЗначениеНеЗаполнено(ВидеоДляСайта) Тогда
 			XML.ЗаписатьНачалоЭлемента("VideoURL");     XML.ЗаписатьТекст(ВидеоДляСайта);                	                                             XML.ЗаписатьКонецЭлемента(); 		
		КонецЕсли; 
		
		ТелефонОтделаПродаж = "";
		ТелефонОтделаПродаж = ПолучитьТелефонОтделаПродаж(ТаблицаВыгрузки,Стр1.Марка);
		
		XML.ЗаписатьНачалоЭлемента("ManagerName");       XML.ЗаписатьТекст("Отдел продаж");                                                             XML.ЗаписатьКонецЭлемента(); 
		XML.ЗаписатьНачалоЭлемента("ContactMethod");     XML.ЗаписатьТекст("По телефону и в сообщениях");                                               XML.ЗаписатьКонецЭлемента(); 
		XML.ЗаписатьНачалоЭлемента("ContactPhone");      XML.ЗаписатьТекст(СокрЛП(ТелефонОтделаПродаж));                                                XML.ЗаписатьКонецЭлемента(); 
		
		XML.ЗаписатьКонецЭлемента(); //Ad
		
	КонецЦикла;
	
	Возврат XML;
	
КонецФункции //ПолучитьXMLAvitoLkПоМарке(ТаблицаВыгрузки, HTTPRequest,XML)
//Бондаренко-- 20220603

Функция ПолучитьТаблицуЛичногоКабинетаДромИзЗапроса(HTTPRequest) Экспорт
	
	КодЛичногоКабинета = HTTPRequest.ПараметрыURL["UnitCode"];
	
	Запрос = Новый Запрос;
	Запрос.Текст =	"ВЫБРАТЬ
	|	СМ_ЛичныеКабинеты_ДромМарки.Ссылка.Код КАК КодЛичногоКабинета,
	|	СМ_ЛичныеКабинеты_ДромМарки.Ссылка.Ссылка КАК ЛичныйКабинет,
	|	СМ_ЛичныеКабинеты_ДромМарки.Марка,
	|	СМ_ЛичныеКабинеты_ДромМарки.ПредставлениеТелефона,
	|	СМ_ЛичныеКабинеты_ДромПодразделения.Подразделение,
	|	СМ_ЛичныеКабинеты_ДромМарки.Адрес
	|ИЗ
	|	Справочник.СМ_ЛичныеКабинеты_Дром.Марки КАК СМ_ЛичныеКабинеты_ДромМарки
	|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|			СМ_ЛичныеКабинеты_ДромПодразделения.Ссылка КАК Ссылка,
	|			СМ_ЛичныеКабинеты_ДромПодразделения.ИдентификаторМарки КАК ИдентификаторМарки,
	|			СМ_ЛичныеКабинеты_ДромПодразделения.Подразделение КАК Подразделение
	|		ИЗ
	|			Справочник.СМ_ЛичныеКабинеты_Дром.Подразделения КАК СМ_ЛичныеКабинеты_ДромПодразделения) КАК СМ_ЛичныеКабинеты_ДромПодразделения
	|		ПО СМ_ЛичныеКабинеты_ДромМарки.Ссылка = СМ_ЛичныеКабинеты_ДромПодразделения.Ссылка
	|			И СМ_ЛичныеКабинеты_ДромМарки.ИдентификаторМарки = СМ_ЛичныеКабинеты_ДромПодразделения.ИдентификаторМарки
	|ГДЕ
	|	СМ_ЛичныеКабинеты_ДромМарки.Ссылка.Код = &КодЛичногоКабинета";
	
	Запрос.УстановитьПараметр("КодЛичногоКабинета", КодЛичногоКабинета);
	
	ТЗ = Запрос.Выполнить().Выгрузить();
	
	Возврат ТЗ;
	
КонецФункции  // ПолучитьТаблицуЛичногоКабинетаДромИзЗапроса(HTTPRequest) 

Функция ПолучитьXMLОбъявленийDromLk(ТаблицаВыгрузкиПолная, HTTPRequest) Экспорт
	
	СписокАвто = Новый СписокЗначений;
	ТаблицаАвто = ПолучитьТаблицуАвто();
	
	СписокМарок = Новый СписокЗначений();
	ТаблицаМарок = ТаблицаВыгрузкиПолная.Скопировать();
	ТаблицаМарок.Свернуть("Марка","");
	СписокМарок.ЗагрузитьЗначения(ТаблицаМарок.ВыгрузитьКолонку("Марка"));	
	
	Если СписокМарок.Количество() > 0 Тогда
		Для каждого ЭлСпискаМарок Из СписокМарок Цикл
			ТекМарка = ЭлСпискаМарок.Значение;
			ПараметрыОтбора = Новый Структура("Марка",ТекМарка);
			ТаблицаВыгрузки = ТаблицаВыгрузкиПолная.Скопировать(ПараметрыОтбора);	
			СписокПодразделений = ПолучитьИтоговыйСписокПодразделений(ТаблицаВыгрузки);
			Для каждого Стр Из ТаблицаАвто Цикл
				Если Стр.Автомобиль.Модель.Марка <> ТекМарка Тогда
					Продолжить;				
				КонецЕсли;
				Если СписокПодразделений.НайтиПоЗначению(Стр.Подразделение) = Неопределено  Тогда
					Продолжить;				
				КонецЕсли;
				Если СписокАвто.НайтиПоЗначению(Стр.Автомобиль) <> Неопределено Тогда
					Продолжить;				                                                                    	
				КонецЕсли;
				
				//Бондаренко++ 20251212
				//Если Стр.Автомобиль.Модель.КатегорияТС <> Справочники.КатегорииТранспортныхСредств.АвтомобилиЛегковые Тогда					
				//	Продолжить;				                                                                    	
				//КонецЕсли;
				//Если НЕ Стр.Автомобиль.ВыгружатьАвтомобильНаСайт Тогда
				//	Продолжить;	
				//КонецЕсли; 
				//Бондаренко-- 20221212

				СписокАвто.Добавить(Стр.Автомобиль);
			КонецЦикла;
		КонецЦикла;	 
	КонецЕсли;
	
	XML_Полный=Новый ЗаписьXML();
	XML_Полный.УстановитьСтроку(Новый ПараметрыЗаписиXML("UTF-8","1.0",false));
	XML_Полный.ЗаписатьОбъявлениеXML();
	
	XML_Полный.ЗаписатьНачалоЭлемента("avtoxml");
	//XML_Полный.ЗаписатьНачалоЭлемента("Dealers");
	//XML_Полный.ЗаписатьНачалоЭлемента("Dealer");	 
	//
	//XML_Полный.ЗаписатьНачалоЭлемента("idCity");    XML_Полный.ЗаписатьТекст("132");                           XML_Полный.ЗаписатьКонецЭлемента();
	//XML_Полный.ЗаписатьНачалоЭлемента("Name");      XML_Полный.ЗаписатьТекст("Группа компаний ""Сокол-Моторс""");                   XML_Полный.ЗаписатьКонецЭлемента();
	//XML_Полный.ЗаписатьНачалоЭлемента("Contact");   XML_Полный.ЗаписатьТекст("Ростов-на-Дону, Шолохова, 235 Телефоны: +7(863)222-84-97"); XML_Полный.ЗаписатьКонецЭлемента();
	//XML_Полный.ЗаписатьНачалоЭлемента("url");       XML_Полный.ЗаписатьТекст("https://sokolmotors.chery.ru");     XML_Полный.ЗаписатьКонецЭлемента();
	//
	//XML_Полный.ЗаписатьКонецЭлемента();      //Dealer
	//XML_Полный.ЗаписатьКонецЭлемента();      //Dealers 
	
	XML_Полный.ЗаписатьНачалоЭлемента("Offers");
	
	Для каждого ТекЭл Из СписокАвто Цикл        
		
		ТекАвто = ТекЭл.Значение;
		
		//Бондаренко++ 20230304
		Если АвтомобильНовый(ТекАвто) Тогда
		//Если АвтомобильНовый(ТекАвто) Тогда
 			//Ничего не делаем
		Иначе
			//пропускаем все б/у непараллельного импорта
			Продолжить;		
 		КонецЕсли;
 		//Бондаренко-- 20230304
		
		XML_Полный.ЗаписатьНачалоЭлемента("Offer"); 
		
		XML_Полный.ЗаписатьНачалоЭлемента("idOffer");        XML_Полный.ЗаписатьТекст(СокрЛП(ТекАвто.УникальныйИдентификатор()));      XML_Полный.ЗаписатьКонецЭлемента();		 	
		
		Если НЕ обЗначениеНеЗаполнено(ТекАвто.Модель.Марка.МаркаДром) Тогда
			XML_Полный.ЗаписатьНачалоЭлемента("idMark");      XML_Полный.ЗаписатьТекст(СокрЛП(ТекАвто.Модель.Марка.МаркаДром.Артикул)); XML_Полный.ЗаписатьКонецЭлемента();		 			 
		Иначе
			XML_Полный.ЗаписатьНачалоЭлемента("sMark");       XML_Полный.ЗаписатьТекст(СокрЛП(ТекАвто.Модель.Марка.Наименование));      XML_Полный.ЗаписатьКонецЭлемента();		 			 
		КонецЕсли;
		
		Если НЕ обЗначениеНеЗаполнено(ТекАвто.Модель.МодельДром) Тогда
			XML_Полный.ЗаписатьНачалоЭлемента("idModel");    XML_Полный.ЗаписатьТекст(СокрЛП(ТекАвто.Модель.МодельДром.Артикул));      XML_Полный.ЗаписатьКонецЭлемента();		 			 
		Иначе
			XML_Полный.ЗаписатьНачалоЭлемента("sModel");     XML_Полный.ЗаписатьТекст(СокрЛП(ТекАвто.Модель.Наименование));            XML_Полный.ЗаписатьКонецЭлемента();		 			 
		КонецЕсли; 

		//Бондаренко++ 20220701
		Если НЕ обЗначениеНеЗаполнено(ТекАвто.ВариантКомплектации) Тогда
			Если НЕ обЗначениеНеЗаполнено(ТекАвто.ВариантКомплектации.НаименованиеДром) Тогда		
				XML_Полный.ЗаписатьНачалоЭлемента("sComplectation"); XML_Полный.ЗаписатьТекст(СокрЛП(ТекАвто.ВариантКомплектации.НаименованиеДром)); XML_Полный.ЗаписатьКонецЭлемента();		 			 			
			Иначе 
				XML_Полный.ЗаписатьНачалоЭлемента("sComplectation"); XML_Полный.ЗаписатьТекст(СокрЛП(ТекАвто.ВариантКомплектации.Наименование));     XML_Полный.ЗаписатьКонецЭлемента();		 			 
			КонецЕсли;	
		КонецЕсли;
  		//Бондаренко-- 20220701
		
		//Бондаренко++ 20220706
		Если Не обЗначениеНеЗаполнено(ТекАвто.ВариантКомплектации) Тогда
			Если ТекАвто.ВариантКомплектации.ИдентификаторДром > 0 Тогда		
				XML_Полный.ЗаписатьНачалоЭлемента("idComplectation"); XML_Полный.ЗаписатьТекст(СтрЗаменить(СокрЛП(ТекАвто.ВариантКомплектации.ИдентификаторДром),Символы.НПП,"")); XML_Полный.ЗаписатьКонецЭлемента();		 			 			
 			КонецЕсли;	
		КонецЕсли;
  		//Бондаренко-- 20220706
  
		ТелефонОтделаПродаж = "";
		ТелефонОтделаПродаж = ПолучитьТелефонОтделаПродаж(ТаблицаВыгрузкиПолная,ТекАвто.Модель.Марка);
		XML_Полный.ЗаписатьНачалоЭлемента("Phone");	      XML_Полный.ЗаписатьТекст(ТелефонОтделаПродаж);                               XML_Полный.ЗаписатьКонецЭлемента();		 			
		
		ГородОтделаПродаж = "";
		ГородОтделаПродаж = ПолучитьГородОтделаПродаж(ТаблицаВыгрузкиПолная,ТекАвто.Модель.Марка);
		XML_Полный.ЗаписатьНачалоЭлемента("idCity");	      XML_Полный.ЗаписатьТекст(ГородОтделаПродаж);                              XML_Полный.ЗаписатьКонецЭлемента();		 			
		
		//Бондаренко++ 20220629
		Если обЗначениеНеЗаполнено(ТекАвто.ГодВыпуска) Тогда
			ГодВыпуска_ = НачалоГода(ТекущаяДата());	
		Иначе		
			ГодВыпуска_ = ТекАвто.ГодВыпуска;		
		КонецЕсли;             
		//Бондаренко-- 20220629
		XML_Полный.ЗаписатьНачалоЭлемента("YearOfMade");     XML_Полный.ЗаписатьТекст(Формат(ГодВыпуска_,"ДФ=yyyy"));                  XML_Полный.ЗаписатьКонецЭлемента();		 			
		
		XML_Полный.ЗаписатьНачалоЭлемента("VIN");            XML_Полный.ЗаписатьТекст(СокрЛП(ТекАвто.VIN));                            XML_Полный.ЗаписатьКонецЭлемента();		 	
		
		//=======
		
		ПолнаяЦенаПродажи = 0.00;
		ПарОтбора = Новый Структура();
		ПарОтбора.Вставить("Автомобиль",ТекАвто);
		ПарОтбора.Вставить("ТипЦен",Справочники.ТипыЦен.ОсновнойТипЦенПродажи);
		ЦенаАвто = РегистрыСведений.ЦеныАвтомобилей.ПолучитьПоследнее(ТекущаяДата(),ПарОтбора).Цена;
		ПолнаяЦенаПродажи = ЦенаАвто+ТекАвто.СтоимостьДопОборудования;
		XML_Полный.ЗаписатьНачалоЭлемента("Price");          XML_Полный.ЗаписатьТекст(СтрЗаменить(ПолнаяЦенаПродажи,Символы.НПП,""));  XML_Полный.ЗаписатьКонецЭлемента();		 			
		
  		//Бондаренко++ 20230304
		Если АвтомобильНовый(ТекАвто) Тогда
		//Если АвтомобильНовый(ТекАвто) Тогда
 			ЭтоНовый = "1";
		Иначе	
			СТС = "";
			СТС = НайтиСТС(ТекАвто);	
			Если НЕ обЗначениеНеЗаполнено(СТС) Тогда
				XML_Полный.ЗаписатьНачалоЭлемента("SOR");        XML_Полный.ЗаписатьТекст(СТС);                                        XML_Полный.ЗаписатьКонецЭлемента();		 					 
			КонецЕсли;
			ЭтоНовый = "0";
		КонецЕсли;             
		//Бондаренко-- 20230304
		
		XML_Полный.ЗаписатьНачалоЭлемента("NewType");        XML_Полный.ЗаписатьТекст(ЭтоНовый);                                       XML_Полный.ЗаписатьКонецЭлемента();		 			
		
		Если НЕ обЗначениеНеЗаполнено(ТекАвто.ВариантКомплектации) Тогда
			ОбъемДвигателя =  СтрЗаменить(СокрЛП(ТекАвто.ВариантКомплектации.ТипДвигателя.ОбъемДвигателя*1000),Символы.НПП,"");
		Иначе
			ОбъемДвигателя =  СтрЗаменить(СокрЛП(ТекАвто.ТипДвигателя.ОбъемДвигателя*1000),Символы.НПП,"");
		КонецЕсли;
		XML_Полный.ЗаписатьНачалоЭлемента("Volume");         XML_Полный.ЗаписатьТекст(ОбъемДвигателя);                                 XML_Полный.ЗаписатьКонецЭлемента();		 			
		
		ТипКузоваДром = Справочники.СМ_ДромТипыКузовов.ПустаяСсылка();
		Если НЕ обЗначениеНеЗаполнено(ТекАвто.ВариантКомплектации) Тогда
			ТипКузоваДром =  СокрЛП(ТекАвто.ВариантКомплектации.ТипКузова.ТипКузоваДром.Артикул);
			ТипКузоваДромСтрокой =  СокрЛП(ТекАвто.ВариантКомплектации.ТипКузова);			
		Иначе
			ТипКузоваДром =  СокрЛП(ТекАвто.ТипКузова.ТипКузоваДром.Артикул);                       
			ТипКузоваДромСтрокой =  СокрЛП(ТекАвто.ТипКузова);			
		КонецЕсли;	   
		Если НЕ обЗначениеНеЗаполнено(ТипКузоваДром) Тогда
			XML_Полный.ЗаписатьНачалоЭлемента("idFrameType"); XML_Полный.ЗаписатьТекст(ТипКузоваДром);                                  XML_Полный.ЗаписатьКонецЭлемента();	
		Иначе
			XML_Полный.ЗаписатьНачалоЭлемента("sFrameType");  XML_Полный.ЗаписатьТекст(ТипКузоваДромСтрокой);                           XML_Полный.ЗаписатьКонецЭлемента();	
		КонецЕсли;
		
		ЦветДром = Справочники.СМ_ДромЦвета.ПустаяСсылка();
		Если НЕ обЗначениеНеЗаполнено(ТекАвто.Цвет.ЦветДром) Тогда
			ЦветДром = СокрЛП(ТекАвто.Цвет.ЦветДром.Артикул);   
		Иначе	
			ЦветДромСтрокой = СокрЛП(ТекАвто.Цвет);  
		КонецЕсли;
		
		Если НЕ обЗначениеНеЗаполнено(ЦветДром) Тогда
			XML_Полный.ЗаписатьНачалоЭлемента("idColor");        XML_Полный.ЗаписатьТекст(ЦветДром);                                    XML_Полный.ЗаписатьКонецЭлемента();	  
		Иначе
			XML_Полный.ЗаписатьНачалоЭлемента("sColor");         XML_Полный.ЗаписатьТекст(ЦветДромСтрокой);                             XML_Полный.ЗаписатьКонецЭлемента();	  
		КонецЕсли;
		
		ТрансмиссияДром = Справочники.СМ_ДромТипыКПП.ПустаяСсылка();
		Если НЕ обЗначениеНеЗаполнено(ТекАвто.ВариантКомплектации.ТипКПП) Тогда
			ТрансмиссияДром =  СокрЛП(ТекАвто.ВариантКомплектации.ТипКПП.ТипКПП_Дром.Артикул);
			ТрансмиссияДромСтрокой =  СокрЛП(ТекАвто.ВариантКомплектации.ТипКПП);			
		Иначе
			ТрансмиссияДром =  СокрЛП(ТекАвто.ТипКПП.ТипКПП_Дром.Артикул);                  
			ТрансмиссияДромСтрокой =  СокрЛП(ТекАвто.ТипКПП);			
		КонецЕсли;	   
		Если НЕ обЗначениеНеЗаполнено(ТрансмиссияДром) Тогда
			XML_Полный.ЗаписатьНачалоЭлемента("idTransmission"); XML_Полный.ЗаписатьТекст(ТрансмиссияДром);                            XML_Полный.ЗаписатьКонецЭлемента();	  
		Иначе
			XML_Полный.ЗаписатьНачалоЭлемента("sTransmission");  XML_Полный.ЗаписатьТекст(ТрансмиссияДромСтрокой);                     XML_Полный.ЗаписатьКонецЭлемента();	  	 
		КонецЕсли;	 
		
		ТипДвигателяДром = Справочники.СМ_ДромВидДвигателя.ПустаяСсылка();
		ГибридДром = "";
		ГБОДром = "";
		МощностьДвигателяДром = "";
		Если НЕ обЗначениеНеЗаполнено(ТекАвто.ВариантКомплектации.ТипДвигателя) Тогда
			ТипДвигателяДром =  СокрЛП(ТекАвто.ВариантКомплектации.ТипДвигателя.Дром_ВидДвигателя.Артикул);
			ТипДвигателяДромСтрокой =  СокрЛП(ТекАвто.ВариантКомплектации.ТипДвигателя.ТипТоплива);			
			Если ТекАвто.ВариантКомплектации.ТипДвигателя.Дром_Гибрид Тогда
				ГибридДром = "1";			
			КонецЕсли;
			Если ТекАвто.ВариантКомплектации.ТипДвигателя.Дром_ГБО Тогда
				ГБОДром = "1";			
			КонецЕсли;
			МощностьДвигателяДром = СокрЛП(ТекАвто.ВариантКомплектации.ТипДвигателя.МощностьЛС);
		Иначе
			ТипДвигателяДром =  СокрЛП(ТекАвто.ТипДвигателя.Дром_ВидДвигателя.Артикул);
			ТипДвигателяДромСтрокой =  СокрЛП(ТекАвто.ТипДвигателя.ТипТоплива);			
			Если ТекАвто.ТипДвигателя.Дром_Гибрид Тогда
				ГибридДром = "1";			
			КонецЕсли;
			Если ТекАвто.ТипДвигателя.Дром_ГБО Тогда
				ГБОДром = "1";			
			КонецЕсли;
			МощностьДвигателяДром = СокрЛП(ТекАвто.ТипДвигателя.МощностьЛС);
		КонецЕсли;	   
		
		Если НЕ обЗначениеНеЗаполнено(ТипДвигателяДром) Тогда
			XML_Полный.ЗаписатьНачалоЭлемента("idEngineType");  XML_Полный.ЗаписатьТекст(ТипДвигателяДром);                            XML_Полный.ЗаписатьКонецЭлемента();	  
		Иначе
			XML_Полный.ЗаписатьНачалоЭлемента("sEngineType");   XML_Полный.ЗаписатьТекст(ТипДвигателяДромСтрокой);                     XML_Полный.ЗаписатьКонецЭлемента();	  	 
		КонецЕсли;
		
		Если НЕ обЗначениеНеЗаполнено(МощностьДвигателяДром) Тогда
			XML_Полный.ЗаписатьНачалоЭлемента("Power");         XML_Полный.ЗаписатьТекст(МощностьДвигателяДром);                       XML_Полный.ЗаписатьКонецЭлемента();	  
		КонецЕсли;
		
		Если Не обЗначениеНеЗаполнено(ГибридДром) Тогда
			XML_Полный.ЗаписатьНачалоЭлемента("idHybridType");   XML_Полный.ЗаписатьТекст(ГибридДром);                                  XML_Полный.ЗаписатьКонецЭлемента();	  		 
		КонецЕсли;
		
		Если Не обЗначениеНеЗаполнено(ГБОДром) Тогда
			XML_Полный.ЗаписатьНачалоЭлемента("idGbo");          XML_Полный.ЗаписатьТекст(ГБОДром);                                     XML_Полный.ЗаписатьКонецЭлемента();	  		 
		КонецЕсли;
		
		Руль_Дром = Справочники.СМ_ДромРуль.ПустаяСсылка(); 
		
		РульДром = справочники.СМ_ДромРуль.ПустаяСсылка();
		Если НЕ обЗначениеНеЗаполнено(ТекАвто.ВариантКомплектации.Руль) Тогда
			РульДром = СокрЛП(Справочники.СМ_ДромРуль.НайтиПоНаименованию(ТекАвто.ВариантКомплектации.Руль).Артикул);
			РульДромСтрокой = СокрЛП(ТекАвто.ВариантКомплектации.Руль);
		Иначе
			РульДром =  СокрЛП(Справочники.СМ_ДромРуль.НайтиПоНаименованию(ТекАвто.Руль).Артикул);
			РульДромСтрокой = СокрЛП(ТекАвто.Руль);
		КонецЕсли;	   
		Если НЕ обЗначениеНеЗаполнено(РульДром) Тогда
			XML_Полный.ЗаписатьНачалоЭлемента("idWheelType"); XML_Полный.ЗаписатьТекст(РульДром);                                      XML_Полный.ЗаписатьКонецЭлемента();	  
		Иначе
			XML_Полный.ЗаписатьНачалоЭлемента("sWheelType");  XML_Полный.ЗаписатьТекст(РульДромСтрокой);                               XML_Полный.ЗаписатьКонецЭлемента();	  	 
		КонецЕсли;	
		
		Пробег =  "0";
		
		ПарОтбора = Новый Структура();
		ПарОтбора.Вставить("Автомобиль",ТекАвто);
		ПарОтбора.Вставить("ВидЗначения",Перечисления.ДополнительнаяИнформацияАвтомобилей.Пробег); 
		
		Пробег_число = РегистрыСведений.Автомобили.ПолучитьПоследнее(ТекущаяДата(),ПарОтбора).Значение;
		
		Если Не обЗначениеНеЗаполнено(Пробег_число) Тогда
			Если Пробег_число < 100 Тогда
				Пробег_число = 0;		 
			КонецЕсли;
			Пробег = СтрЗаменить(СокрЛП(Пробег_число),Символы.НПП,"");
		КонецЕсли;
		
		XML_Полный.ЗаписатьНачалоЭлемента("Haul");          XML_Полный.ЗаписатьТекст(Пробег);                                          XML_Полный.ЗаписатьКонецЭлемента();	  

		//Бондаренко++ 20220929                    
		ВидеоДляСайта = "";
		ВидеоДляСайта = СМ_ВыгрузкаОбъявленийОПродажеАвто.СМГ_СправочникВернутьЗначениеРеквизита("СсылкаНаВидео",ТекАвто.ПолучитьОбъект());
		ВидеоДляСайта = СтрЗаменить(ВидеоДляСайта,"https://youtu.be/","https://www.youtube.com/watch?v=");		
		//Бондаренко-- 20220929
	
 		Если НЕ обЗначениеНеЗаполнено(ВидеоДляСайта) Тогда
			XML_Полный.ЗаписатьНачалоЭлемента("Additional");    XML_Полный.ЗаписатьТекст(ВидеоДляСайта);                       XML_Полный.ЗаписатьКонецЭлемента();	  
		КонецЕсли;
		
		Если ТекАвто.ПутьКФото.Количество() > 0 Тогда
			XML_Полный.ЗаписатьНачалоЭлемента("Photos");
			Для каждого СтрТЧ Из ТекАвто.ПутьКФото Цикл
				Если СтрТЧ.НомерСтроки = 1 Тогда
					XML_Полный.ЗаписатьАтрибут("PhotoDir","");
					XML_Полный.ЗаписатьАтрибут("PhotoMain",HTTPRequest.БазовыйURL+"/photo/"+ТекАвто.УникальныйИдентификатор()+"/"+СтрТЧ.GUID+".jpg");
					Продолжить;
					//Главное фото размещаем только в заголовке секции Photos
				КонецЕсли;
				XML_Полный.ЗаписатьНачалоЭлемента("Photo"); 
				XML_Полный.ЗаписатьТекст(HTTPRequest.БазовыйURL+"/photo/"+ТекАвто.УникальныйИдентификатор()+"/"+СтрТЧ.GUID+".jpg");
				XML_Полный.ЗаписатьКонецЭлемента(); //Photo	
			КонецЦикла; 
			XML_Полный.ЗаписатьКонецЭлемента(); //Photos	
		КонецЕсли;  		 
		
		ПараметрыОтбора = Новый Структура();
		ПараметрыОтбора.Вставить("Автомобиль",ТекАвто);
		НайденныеСтроки = ТаблицаАвто.НайтиСтроки(ПараметрыОтбора);
		Если НайденныеСтроки.Количество() > 0 Тогда    
			Доступность = ""; 
			Для каждого Строка1  Из НайденныеСтроки Цикл
				Если Строка1.Доступность Тогда
					Доступность = СокрЛП(Справочники.СМ_ДромМестонахождения.НайтиПоНаименованию("в наличии").Артикул);
				Иначе	
					Доступность = СокрЛП(Справочники.СМ_ДромМестонахождения.НайтиПоНаименованию("в пути").Артикул);				
					//Доступность = СокрЛП(Справочники.СМ_ДромМестонахождения.НайтиПоНаименованию("под заказ").Артикул);									
				КонецЕсли;
				Если Не обЗначениеНеЗаполнено(Доступность) Тогда
					XML_Полный.ЗаписатьНачалоЭлемента("Whereabouts");    XML_Полный.ЗаписатьТекст(Доступность);                       XML_Полный.ЗаписатьКонецЭлемента();	  				
				КонецЕсли;
				Прервать;
			КонецЦикла;
		КонецЕсли; 
		
		XML_Полный.ЗаписатьНачалоЭлемента("DamagedType");          XML_Полный.ЗаписатьТекст("0");                                     XML_Полный.ЗаписатьКонецЭлемента();	  		 
		
		XML_Полный.ЗаписатьКонецЭлемента();     //Offer  
		
	КонецЦикла;
	
	XML_Полный.ЗаписатьКонецЭлемента();     //Offers 
	//Сюда вывести скидки 
	ТаблицаСкидок = ПолучитьТаблицуСкидок(СписокАвто);
	
	Если ТаблицаСкидок.Количество() > 0 Тогда
		
		XML_Полный.ЗаписатьНачалоЭлемента("Discounts");
		
		Для каждого СтрокаСкидок Из ТаблицаСкидок Цикл                                                    
			
			//Бондаренко++ 20220629                                                   
			//УнИдентАвто = СтрокаСкидок.Ссылка.УникальныйИдентификатор();
			УнИдентАвто = ВычислитьХешСуммуСтроки(Строка(СтрокаСкидок.Ссылка.УникальныйИдентификатор()));
			//Бондаренко-- 20220629
			
			Если СтрокаСкидок.СкидкаМаксимальная > 0  Тогда
				XML_Полный.ЗаписатьНачалоЭлемента("MaxDiscount");
				УнИдентСкидки = СокрЛП(УнИдентАвто)+"_Max";
				РазмерСкидки = СтрЗаменить(СокрЛП(СтрокаСкидок.СкидкаМаксимальная),Символы.НПП,"");
				XML_Полный.ЗаписатьНачалоЭлемента("idMaxDiscount");  XML_Полный.ЗаписатьТекст(УнИдентСкидки);    XML_Полный.ЗаписатьКонецЭлемента();	  				
				XML_Полный.ЗаписатьНачалоЭлемента("VIN");            XML_Полный.ЗаписатьТекст(СтрокаСкидок.VIN); XML_Полный.ЗаписатьКонецЭлемента();	  				
				XML_Полный.ЗаписатьНачалоЭлемента("maxDiscount");    XML_Полный.ЗаписатьТекст(РазмерСкидки);     XML_Полный.ЗаписатьКонецЭлемента();	  				 
				XML_Полный.ЗаписатьНачалоЭлемента("idDiscountType"); XML_Полный.ЗаписатьТекст("2");              XML_Полный.ЗаписатьКонецЭлемента();	  				 
				XML_Полный.ЗаписатьКонецЭлемента();     //MaxDiscount 				
			КонецЕсли;
			
			Если СтрокаСкидок.СкидаПриПокупкеВТрейдИн > 0  Тогда
				XML_Полный.ЗаписатьНачалоЭлемента("Discount");
				УнИдентСкидки = СокрЛП(УнИдентАвто)+"_TradeIn";
				РазмерСкидки = СтрЗаменить(СокрЛП(СтрокаСкидок.СкидаПриПокупкеВТрейдИн),Символы.НПП,"");
				XML_Полный.ЗаписатьНачалоЭлемента("idDiscount");     XML_Полный.ЗаписатьТекст(УнИдентСкидки);    XML_Полный.ЗаписатьКонецЭлемента();	  				
				XML_Полный.ЗаписатьНачалоЭлемента("VIN");            XML_Полный.ЗаписатьТекст(СтрокаСкидок.VIN); XML_Полный.ЗаписатьКонецЭлемента();	  				
				XML_Полный.ЗаписатьНачалоЭлемента("discount");       XML_Полный.ЗаписатьТекст(РазмерСкидки);     XML_Полный.ЗаписатьКонецЭлемента();	  				 
				XML_Полный.ЗаписатьНачалоЭлемента("idDiscountType"); XML_Полный.ЗаписатьТекст("2");              XML_Полный.ЗаписатьКонецЭлемента();	  				 
				XML_Полный.ЗаписатьНачалоЭлемента("name");           XML_Полный.ЗаписатьТекст("Скидка при покупке по программе Trade-In");                     XML_Полный.ЗаписатьКонецЭлемента();	  				 
				XML_Полный.ЗаписатьНачалоЭлемента("description");    XML_Полный.ЗаписатьТекст("Скидка в рублях при покупке автомобиля по программе Trade-In"); XML_Полный.ЗаписатьКонецЭлемента();	  				 				
				XML_Полный.ЗаписатьКонецЭлемента();     //Discount 	
			КонецЕсли;
			
			Если СтрокаСкидок.СкидкаПриПокупкеВКредит > 0  Тогда
				XML_Полный.ЗаписатьНачалоЭлемента("Discount");
				УнИдентСкидки = СокрЛП(УнИдентАвто)+"_Credit";
				РазмерСкидки = СтрЗаменить(СокрЛП(СтрокаСкидок.СкидкаПриПокупкеВКредит),Символы.НПП,"");
				XML_Полный.ЗаписатьНачалоЭлемента("idDiscount");     XML_Полный.ЗаписатьТекст(УнИдентСкидки);    XML_Полный.ЗаписатьКонецЭлемента();	  				
				XML_Полный.ЗаписатьНачалоЭлемента("VIN");            XML_Полный.ЗаписатьТекст(СтрокаСкидок.VIN); XML_Полный.ЗаписатьКонецЭлемента();	  				
				XML_Полный.ЗаписатьНачалоЭлемента("discount");       XML_Полный.ЗаписатьТекст(РазмерСкидки);     XML_Полный.ЗаписатьКонецЭлемента();	  				 
				XML_Полный.ЗаписатьНачалоЭлемента("idDiscountType"); XML_Полный.ЗаписатьТекст("2");              XML_Полный.ЗаписатьКонецЭлемента();	  				 
				XML_Полный.ЗаписатьНачалоЭлемента("name");           XML_Полный.ЗаписатьТекст("Скидка при покупке в кредит");                                  XML_Полный.ЗаписатьКонецЭлемента();	  				 
				XML_Полный.ЗаписатьНачалоЭлемента("description");    XML_Полный.ЗаписатьТекст("Скидка в рублях при покупке автомобиля по программе в кредит"); XML_Полный.ЗаписатьКонецЭлемента();	  				 				
				XML_Полный.ЗаписатьКонецЭлемента();     //Discount 	
			КонецЕсли;                               
			
			Если СтрокаСкидок.СкидкаПриСтраховании > 0  Тогда
				XML_Полный.ЗаписатьНачалоЭлемента("Discount");
				УнИдентСкидки = СокрЛП(УнИдентАвто)+"_Insurance";
				РазмерСкидки = СтрЗаменить(СокрЛП(СтрокаСкидок.СкидкаПриСтраховании),Символы.НПП,"");
				XML_Полный.ЗаписатьНачалоЭлемента("idDiscount");     XML_Полный.ЗаписатьТекст(УнИдентСкидки);    XML_Полный.ЗаписатьКонецЭлемента();	  				
				XML_Полный.ЗаписатьНачалоЭлемента("VIN");            XML_Полный.ЗаписатьТекст(СтрокаСкидок.VIN); XML_Полный.ЗаписатьКонецЭлемента();	  				
				XML_Полный.ЗаписатьНачалоЭлемента("discount");       XML_Полный.ЗаписатьТекст(РазмерСкидки);     XML_Полный.ЗаписатьКонецЭлемента();	  				 
				XML_Полный.ЗаписатьНачалоЭлемента("idDiscountType"); XML_Полный.ЗаписатьТекст("2");              XML_Полный.ЗаписатьКонецЭлемента();	  				 
				XML_Полный.ЗаписатьНачалоЭлемента("name");           XML_Полный.ЗаписатьТекст("Скидка при страховании");                                       XML_Полный.ЗаписатьКонецЭлемента();	  				 
				XML_Полный.ЗаписатьНачалоЭлемента("description");    XML_Полный.ЗаписатьТекст("Скидка в рублях при покупке автомобиля со страхованием");       XML_Полный.ЗаписатьКонецЭлемента();	  				 				
				XML_Полный.ЗаписатьКонецЭлемента();     //Discount 	
			КонецЕсли;
		КонецЦикла;
		
		XML_Полный.ЗаписатьКонецЭлемента();     //Discounts 
		
	КонецЕсли;
	
	XML_Полный.ЗаписатьКонецЭлемента();     //avtoxml 
	XMLТекст = XML_Полный.Закрыть();
	Возврат XMLТекст;
	
КонецФункции // ПолучитьXMLОбъявленийDromLk(ТаблицаВыгрузкиПолная, HTTPRequest)

//Бондаренко++ 20230314
Функция ПолучитьXMLОбъявленийDromLk1(ТаблицаВыгрузкиПолная, HTTPRequest) Экспорт
	
	СписокАвто = Новый СписокЗначений;
	ТаблицаАвто = ПолучитьТаблицуАвто();
	
	СписокМарок = Новый СписокЗначений();
	ТаблицаМарок = ТаблицаВыгрузкиПолная.Скопировать();
	ТаблицаМарок.Свернуть("Марка","");
	СписокМарок.ЗагрузитьЗначения(ТаблицаМарок.ВыгрузитьКолонку("Марка"));	
	
	Если СписокМарок.Количество() > 0 Тогда
		Для каждого ЭлСпискаМарок Из СписокМарок Цикл
			ТекМарка = ЭлСпискаМарок.Значение;
			ПараметрыОтбора = Новый Структура("Марка",ТекМарка);
			ТаблицаВыгрузки = ТаблицаВыгрузкиПолная.Скопировать(ПараметрыОтбора);	
			СписокПодразделений = ПолучитьИтоговыйСписокПодразделений(ТаблицаВыгрузки);
			Для каждого Стр Из ТаблицаАвто Цикл
				Если Стр.Автомобиль.Модель.Марка <> ТекМарка Тогда
					Продолжить;				
				КонецЕсли;
				Если СписокПодразделений.НайтиПоЗначению(Стр.Подразделение) = Неопределено  Тогда
					Продолжить;				
				КонецЕсли;
				Если СписокАвто.НайтиПоЗначению(Стр.Автомобиль) <> Неопределено Тогда
					Продолжить;				                                                                    	
				КонецЕсли;
				
				//Бондаренко++ 20220713
				Если Стр.Автомобиль.Модель.КатегорияТС <> Справочники.КатегорииТранспортныхСредств.АвтомобилиЛегковые Тогда					
					Продолжить;				                                                                    	
				КонецЕсли;
 				Если НЕ Стр.Автомобиль.ВыгружатьАвтомобильНаСайт Тогда
					Продолжить;	
				КонецЕсли; 
				//Бондаренко-- 20220713

				СписокАвто.Добавить(Стр.Автомобиль);
			КонецЦикла;
		КонецЦикла;	 
	КонецЕсли;
	
	XML_Полный=Новый ЗаписьXML();
	XML_Полный.УстановитьСтроку(Новый ПараметрыЗаписиXML("UTF-8","1.0",false));
	XML_Полный.ЗаписатьОбъявлениеXML();
	
	XML_Полный.ЗаписатьНачалоЭлемента("avtoxml");
	//XML_Полный.ЗаписатьНачалоЭлемента("Dealers");
	//XML_Полный.ЗаписатьНачалоЭлемента("Dealer");	 
	//
	//XML_Полный.ЗаписатьНачалоЭлемента("idCity");    XML_Полный.ЗаписатьТекст("132");                           XML_Полный.ЗаписатьКонецЭлемента();
	//XML_Полный.ЗаписатьНачалоЭлемента("Name");      XML_Полный.ЗаписатьТекст("Группа компаний ""Сокол-Моторс""");                   XML_Полный.ЗаписатьКонецЭлемента();
	//XML_Полный.ЗаписатьНачалоЭлемента("Contact");   XML_Полный.ЗаписатьТекст("Ростов-на-Дону, Шолохова, 235 Телефоны: +7(863)222-84-97"); XML_Полный.ЗаписатьКонецЭлемента();
	//XML_Полный.ЗаписатьНачалоЭлемента("url");       XML_Полный.ЗаписатьТекст("https://sokolmotors.chery.ru");     XML_Полный.ЗаписатьКонецЭлемента();
	//
	//XML_Полный.ЗаписатьКонецЭлемента();      //Dealer
	//XML_Полный.ЗаписатьКонецЭлемента();      //Dealers 
	
	XML_Полный.ЗаписатьНачалоЭлемента("Offers");
	
	Для каждого ТекЭл Из СписокАвто Цикл        
		
		ТекАвто = ТекЭл.Значение;
		
		//Бондаренко++ 20230929
		Если ( АвтомобильПараллельногоИмпорта(ТекАвто) И ТекАвто.АвитоАвтоРуДром ) ИЛИ АвтомобильНовый(ТекАвто) Тогда
 			//Ничего не делаем
		Иначе
			//пропускаем все б/у непараллельного импорта и неновые
			Продолжить;		
 		КонецЕсли;
 		//Бондаренко-- 20230929
		
		XML_Полный.ЗаписатьНачалоЭлемента("Offer"); 
		
		XML_Полный.ЗаписатьНачалоЭлемента("idOffer");        XML_Полный.ЗаписатьТекст(СокрЛП(ТекАвто.УникальныйИдентификатор()));      XML_Полный.ЗаписатьКонецЭлемента();		 	
		
		Если НЕ обЗначениеНеЗаполнено(ТекАвто.Модель.Марка.МаркаДром) Тогда
			XML_Полный.ЗаписатьНачалоЭлемента("idMark");      XML_Полный.ЗаписатьТекст(СокрЛП(ТекАвто.Модель.Марка.МаркаДром.Артикул)); XML_Полный.ЗаписатьКонецЭлемента();		 			 
		Иначе
			XML_Полный.ЗаписатьНачалоЭлемента("sMark");       XML_Полный.ЗаписатьТекст(СокрЛП(ТекАвто.Модель.Марка.Наименование));      XML_Полный.ЗаписатьКонецЭлемента();		 			 
		КонецЕсли;
		
		Если НЕ обЗначениеНеЗаполнено(ТекАвто.Модель.МодельДром) Тогда
			XML_Полный.ЗаписатьНачалоЭлемента("idModel");    XML_Полный.ЗаписатьТекст(СокрЛП(ТекАвто.Модель.МодельДром.Артикул));      XML_Полный.ЗаписатьКонецЭлемента();		 			 
		Иначе
			XML_Полный.ЗаписатьНачалоЭлемента("sModel");     XML_Полный.ЗаписатьТекст(СокрЛП(ТекАвто.Модель.Наименование));            XML_Полный.ЗаписатьКонецЭлемента();		 			 
		КонецЕсли; 

		//Бондаренко++ 20220701
		Если НЕ обЗначениеНеЗаполнено(ТекАвто.ВариантКомплектации) Тогда
			Если НЕ обЗначениеНеЗаполнено(ТекАвто.ВариантКомплектации.НаименованиеДром) Тогда		
				XML_Полный.ЗаписатьНачалоЭлемента("sComplectation"); XML_Полный.ЗаписатьТекст(СокрЛП(ТекАвто.ВариантКомплектации.НаименованиеДром)); XML_Полный.ЗаписатьКонецЭлемента();		 			 			
			Иначе 
				XML_Полный.ЗаписатьНачалоЭлемента("sComplectation"); XML_Полный.ЗаписатьТекст(СокрЛП(ТекАвто.ВариантКомплектации.Наименование));     XML_Полный.ЗаписатьКонецЭлемента();		 			 
			КонецЕсли;	
		КонецЕсли;
  		//Бондаренко-- 20220701
		
		//Бондаренко++ 20220706
		Если Не обЗначениеНеЗаполнено(ТекАвто.ВариантКомплектации) Тогда
			Если ТекАвто.ВариантКомплектации.ИдентификаторДром > 0 Тогда		
				XML_Полный.ЗаписатьНачалоЭлемента("idComplectation"); XML_Полный.ЗаписатьТекст(СтрЗаменить(СокрЛП(ТекАвто.ВариантКомплектации.ИдентификаторДром),Символы.НПП,"")); XML_Полный.ЗаписатьКонецЭлемента();		 			 			
 			КонецЕсли;	
		КонецЕсли;
  		//Бондаренко-- 20220706
  
		ТелефонОтделаПродаж = "";
		ТелефонОтделаПродаж = ПолучитьТелефонОтделаПродаж(ТаблицаВыгрузкиПолная,ТекАвто.Модель.Марка);
		XML_Полный.ЗаписатьНачалоЭлемента("Phone");	      XML_Полный.ЗаписатьТекст(ТелефонОтделаПродаж);                               XML_Полный.ЗаписатьКонецЭлемента();		 			
		
		ГородОтделаПродаж = "";
		ГородОтделаПродаж = ПолучитьГородОтделаПродаж(ТаблицаВыгрузкиПолная,ТекАвто.Модель.Марка);
		XML_Полный.ЗаписатьНачалоЭлемента("idCity");	      XML_Полный.ЗаписатьТекст(ГородОтделаПродаж);                              XML_Полный.ЗаписатьКонецЭлемента();		 			
		
		//Бондаренко++ 20220629
		Если обЗначениеНеЗаполнено(ТекАвто.ГодВыпуска) Тогда
			ГодВыпуска_ = НачалоГода(ТекущаяДата());	
		Иначе		
			ГодВыпуска_ = ТекАвто.ГодВыпуска;		
		КонецЕсли;             
		//Бондаренко-- 20220629
		XML_Полный.ЗаписатьНачалоЭлемента("YearOfMade");     XML_Полный.ЗаписатьТекст(Формат(ГодВыпуска_,"ДФ=yyyy"));                  XML_Полный.ЗаписатьКонецЭлемента();		 			
		
		XML_Полный.ЗаписатьНачалоЭлемента("VIN");            XML_Полный.ЗаписатьТекст(СокрЛП(ТекАвто.VIN));                            XML_Полный.ЗаписатьКонецЭлемента();		 	
		
		//=======
		
		ПолнаяЦенаПродажи = 0.00;
		ПарОтбора = Новый Структура();
		ПарОтбора.Вставить("Автомобиль",ТекАвто);
		ПарОтбора.Вставить("ТипЦен",Справочники.ТипыЦен.ОсновнойТипЦенПродажи);
		ЦенаАвто = РегистрыСведений.ЦеныАвтомобилей.ПолучитьПоследнее(ТекущаяДата(),ПарОтбора).Цена;
		ПолнаяЦенаПродажи = ЦенаАвто+ТекАвто.СтоимостьДопОборудования;
		XML_Полный.ЗаписатьНачалоЭлемента("Price");          XML_Полный.ЗаписатьТекст(СтрЗаменить(ПолнаяЦенаПродажи,Символы.НПП,""));  XML_Полный.ЗаписатьКонецЭлемента();		 			
		
  		//Бондаренко++ 20230923
		Если ( АвтомобильПараллельногоИмпорта(ТекАвто) И ТекАвто.АвитоАвтоРуДром ) Или АвтомобильНовый(ТекАвто) Тогда
 			ЭтоНовый = "1";
		Иначе	
			СТС = "";
			СТС = НайтиСТС(ТекАвто);	
			Если НЕ обЗначениеНеЗаполнено(СТС) Тогда
				XML_Полный.ЗаписатьНачалоЭлемента("SOR");        XML_Полный.ЗаписатьТекст(СТС);                                        XML_Полный.ЗаписатьКонецЭлемента();		 					 
			КонецЕсли;
			ЭтоНовый = "0";
		КонецЕсли;             
		//Бондаренко-- 20230923
		
		XML_Полный.ЗаписатьНачалоЭлемента("NewType");        XML_Полный.ЗаписатьТекст(ЭтоНовый);                                       XML_Полный.ЗаписатьКонецЭлемента();		 			
		
		Если НЕ обЗначениеНеЗаполнено(ТекАвто.ВариантКомплектации) Тогда
			ОбъемДвигателя =  СтрЗаменить(СокрЛП(ТекАвто.ВариантКомплектации.ТипДвигателя.ОбъемДвигателя*1000),Символы.НПП,"");
		Иначе
			ОбъемДвигателя =  СтрЗаменить(СокрЛП(ТекАвто.ТипДвигателя.ОбъемДвигателя*1000),Символы.НПП,"");
		КонецЕсли;
		XML_Полный.ЗаписатьНачалоЭлемента("Volume");         XML_Полный.ЗаписатьТекст(ОбъемДвигателя);                                 XML_Полный.ЗаписатьКонецЭлемента();		 			
		
		ТипКузоваДром = Справочники.СМ_ДромТипыКузовов.ПустаяСсылка();
		Если НЕ обЗначениеНеЗаполнено(ТекАвто.ВариантКомплектации) Тогда
			ТипКузоваДром =  СокрЛП(ТекАвто.ВариантКомплектации.ТипКузова.ТипКузоваДром.Артикул);
			ТипКузоваДромСтрокой =  СокрЛП(ТекАвто.ВариантКомплектации.ТипКузова);			
		Иначе
			ТипКузоваДром =  СокрЛП(ТекАвто.ТипКузова.ТипКузоваДром.Артикул);                       
			ТипКузоваДромСтрокой =  СокрЛП(ТекАвто.ТипКузова);			
		КонецЕсли;	   
		Если НЕ обЗначениеНеЗаполнено(ТипКузоваДром) Тогда
			XML_Полный.ЗаписатьНачалоЭлемента("idFrameType"); XML_Полный.ЗаписатьТекст(ТипКузоваДром);                                  XML_Полный.ЗаписатьКонецЭлемента();	
		Иначе
			XML_Полный.ЗаписатьНачалоЭлемента("sFrameType");  XML_Полный.ЗаписатьТекст(ТипКузоваДромСтрокой);                           XML_Полный.ЗаписатьКонецЭлемента();	
		КонецЕсли;
		
		ЦветДром = Справочники.СМ_ДромЦвета.ПустаяСсылка();
		Если НЕ обЗначениеНеЗаполнено(ТекАвто.Цвет.ЦветДром) Тогда
			ЦветДром = СокрЛП(ТекАвто.Цвет.ЦветДром.Артикул);   
		Иначе	
			ЦветДромСтрокой = СокрЛП(ТекАвто.Цвет);  
		КонецЕсли;
		
		Если НЕ обЗначениеНеЗаполнено(ЦветДром) Тогда
			XML_Полный.ЗаписатьНачалоЭлемента("idColor");        XML_Полный.ЗаписатьТекст(ЦветДром);                                    XML_Полный.ЗаписатьКонецЭлемента();	  
		Иначе
			XML_Полный.ЗаписатьНачалоЭлемента("sColor");         XML_Полный.ЗаписатьТекст(ЦветДромСтрокой);                             XML_Полный.ЗаписатьКонецЭлемента();	  
		КонецЕсли;
		
		ТрансмиссияДром = Справочники.СМ_ДромТипыКПП.ПустаяСсылка();
		Если НЕ обЗначениеНеЗаполнено(ТекАвто.ВариантКомплектации.ТипКПП) Тогда
			ТрансмиссияДром =  СокрЛП(ТекАвто.ВариантКомплектации.ТипКПП.ТипКПП_Дром.Артикул);
			ТрансмиссияДромСтрокой =  СокрЛП(ТекАвто.ВариантКомплектации.ТипКПП);			
		Иначе
			ТрансмиссияДром =  СокрЛП(ТекАвто.ТипКПП.ТипКПП_Дром.Артикул);                  
			ТрансмиссияДромСтрокой =  СокрЛП(ТекАвто.ТипКПП);			
		КонецЕсли;	   
		Если НЕ обЗначениеНеЗаполнено(ТрансмиссияДром) Тогда
			XML_Полный.ЗаписатьНачалоЭлемента("idTransmission"); XML_Полный.ЗаписатьТекст(ТрансмиссияДром);                            XML_Полный.ЗаписатьКонецЭлемента();	  
		Иначе
			XML_Полный.ЗаписатьНачалоЭлемента("sTransmission");  XML_Полный.ЗаписатьТекст(ТрансмиссияДромСтрокой);                     XML_Полный.ЗаписатьКонецЭлемента();	  	 
		КонецЕсли;	 
		
		ТипДвигателяДром = Справочники.СМ_ДромВидДвигателя.ПустаяСсылка();
		ГибридДром = "";
		ГБОДром = "";
		МощностьДвигателяДром = "";
		Если НЕ обЗначениеНеЗаполнено(ТекАвто.ВариантКомплектации.ТипДвигателя) Тогда
			ТипДвигателяДром =  СокрЛП(ТекАвто.ВариантКомплектации.ТипДвигателя.Дром_ВидДвигателя.Артикул);
			ТипДвигателяДромСтрокой =  СокрЛП(ТекАвто.ВариантКомплектации.ТипДвигателя.ТипТоплива);			
			Если ТекАвто.ВариантКомплектации.ТипДвигателя.Дром_Гибрид Тогда
				ГибридДром = "1";			
			КонецЕсли;
			Если ТекАвто.ВариантКомплектации.ТипДвигателя.Дром_ГБО Тогда
				ГБОДром = "1";			
			КонецЕсли;
			МощностьДвигателяДром = СокрЛП(ТекАвто.ВариантКомплектации.ТипДвигателя.МощностьЛС);
		Иначе
			ТипДвигателяДром =  СокрЛП(ТекАвто.ТипДвигателя.Дром_ВидДвигателя.Артикул);
			ТипДвигателяДромСтрокой =  СокрЛП(ТекАвто.ТипДвигателя.ТипТоплива);			
			Если ТекАвто.ТипДвигателя.Дром_Гибрид Тогда
				ГибридДром = "1";			
			КонецЕсли;
			Если ТекАвто.ТипДвигателя.Дром_ГБО Тогда
				ГБОДром = "1";			
			КонецЕсли;
			МощностьДвигателяДром = СокрЛП(ТекАвто.ТипДвигателя.МощностьЛС);
		КонецЕсли;	   
		
		Если НЕ обЗначениеНеЗаполнено(ТипДвигателяДром) Тогда
			XML_Полный.ЗаписатьНачалоЭлемента("idEngineType");  XML_Полный.ЗаписатьТекст(ТипДвигателяДром);                            XML_Полный.ЗаписатьКонецЭлемента();	  
		Иначе
			XML_Полный.ЗаписатьНачалоЭлемента("sEngineType");   XML_Полный.ЗаписатьТекст(ТипДвигателяДромСтрокой);                     XML_Полный.ЗаписатьКонецЭлемента();	  	 
		КонецЕсли;
		
		Если НЕ обЗначениеНеЗаполнено(МощностьДвигателяДром) Тогда
			XML_Полный.ЗаписатьНачалоЭлемента("Power");         XML_Полный.ЗаписатьТекст(МощностьДвигателяДром);                       XML_Полный.ЗаписатьКонецЭлемента();	  
		КонецЕсли;
		
		Если Не обЗначениеНеЗаполнено(ГибридДром) Тогда
			XML_Полный.ЗаписатьНачалоЭлемента("idHybridType");   XML_Полный.ЗаписатьТекст(ГибридДром);                                  XML_Полный.ЗаписатьКонецЭлемента();	  		 
		КонецЕсли;
		
		Если Не обЗначениеНеЗаполнено(ГБОДром) Тогда
			XML_Полный.ЗаписатьНачалоЭлемента("idGbo");          XML_Полный.ЗаписатьТекст(ГБОДром);                                     XML_Полный.ЗаписатьКонецЭлемента();	  		 
		КонецЕсли;
		
		Руль_Дром = Справочники.СМ_ДромРуль.ПустаяСсылка(); 
		
		РульДром = справочники.СМ_ДромРуль.ПустаяСсылка();
		Если НЕ обЗначениеНеЗаполнено(ТекАвто.ВариантКомплектации.Руль) Тогда
			РульДром = СокрЛП(Справочники.СМ_ДромРуль.НайтиПоНаименованию(ТекАвто.ВариантКомплектации.Руль).Артикул);
			РульДромСтрокой = СокрЛП(ТекАвто.ВариантКомплектации.Руль);
		Иначе
			РульДром =  СокрЛП(Справочники.СМ_ДромРуль.НайтиПоНаименованию(ТекАвто.Руль).Артикул);
			РульДромСтрокой = СокрЛП(ТекАвто.Руль);
		КонецЕсли;	   
		Если НЕ обЗначениеНеЗаполнено(РульДром) Тогда
			XML_Полный.ЗаписатьНачалоЭлемента("idWheelType"); XML_Полный.ЗаписатьТекст(РульДром);                                      XML_Полный.ЗаписатьКонецЭлемента();	  
		Иначе
			XML_Полный.ЗаписатьНачалоЭлемента("sWheelType");  XML_Полный.ЗаписатьТекст(РульДромСтрокой);                               XML_Полный.ЗаписатьКонецЭлемента();	  	 
		КонецЕсли;	
		
		Пробег =  "0";
		
		ПарОтбора = Новый Структура();
		ПарОтбора.Вставить("Автомобиль",ТекАвто);
		ПарОтбора.Вставить("ВидЗначения",Перечисления.ДополнительнаяИнформацияАвтомобилей.Пробег); 
		
		Пробег_число = РегистрыСведений.Автомобили.ПолучитьПоследнее(ТекущаяДата(),ПарОтбора).Значение;
		
		Если Не обЗначениеНеЗаполнено(Пробег_число) Тогда
			Если Пробег_число < 100 Тогда
				Пробег_число = 0;		 
			КонецЕсли;
			Пробег = СтрЗаменить(СокрЛП(Пробег_число),Символы.НПП,"");
		КонецЕсли;
		
		XML_Полный.ЗаписатьНачалоЭлемента("Haul");          XML_Полный.ЗаписатьТекст(Пробег);                                          XML_Полный.ЗаписатьКонецЭлемента();	  

		//Бондаренко++ 20220929                    
		ВидеоДляСайта = "";
		ВидеоДляСайта = СМ_ВыгрузкаОбъявленийОПродажеАвто.СМГ_СправочникВернутьЗначениеРеквизита("СсылкаНаВидео",ТекАвто.ПолучитьОбъект());
		ВидеоДляСайта = СтрЗаменить(ВидеоДляСайта,"https://youtu.be/","https://www.youtube.com/watch?v=");		
		//Бондаренко-- 20220929
	
 		Если НЕ обЗначениеНеЗаполнено(ВидеоДляСайта) Тогда
			XML_Полный.ЗаписатьНачалоЭлемента("Additional");    XML_Полный.ЗаписатьТекст(ВидеоДляСайта);                       XML_Полный.ЗаписатьКонецЭлемента();	  
		КонецЕсли;
		
		Если ТекАвто.ПутьКФото.Количество() > 0 Тогда
			XML_Полный.ЗаписатьНачалоЭлемента("Photos");
			Для каждого СтрТЧ Из ТекАвто.ПутьКФото Цикл
				Если СтрТЧ.НомерСтроки = 1 Тогда
					XML_Полный.ЗаписатьАтрибут("PhotoDir","");
					XML_Полный.ЗаписатьАтрибут("PhotoMain",HTTPRequest.БазовыйURL+"/photo/"+ТекАвто.УникальныйИдентификатор()+"/"+СтрТЧ.GUID+".jpg");
					Продолжить;
					//Главное фото размещаем только в заголовке секции Photos
				КонецЕсли;
				XML_Полный.ЗаписатьНачалоЭлемента("Photo"); 
				XML_Полный.ЗаписатьТекст(HTTPRequest.БазовыйURL+"/photo/"+ТекАвто.УникальныйИдентификатор()+"/"+СтрТЧ.GUID+".jpg");
				XML_Полный.ЗаписатьКонецЭлемента(); //Photo	
			КонецЦикла; 
			XML_Полный.ЗаписатьКонецЭлемента(); //Photos	
		КонецЕсли;  		 
		
		ПараметрыОтбора = Новый Структура();
		ПараметрыОтбора.Вставить("Автомобиль",ТекАвто);
		НайденныеСтроки = ТаблицаАвто.НайтиСтроки(ПараметрыОтбора);
		Если НайденныеСтроки.Количество() > 0 Тогда    
			Доступность = ""; 
			Для каждого Строка1  Из НайденныеСтроки Цикл
				Если Строка1.Доступность Тогда
					Доступность = СокрЛП(Справочники.СМ_ДромМестонахождения.НайтиПоНаименованию("в наличии").Артикул);
				Иначе	
					Доступность = СокрЛП(Справочники.СМ_ДромМестонахождения.НайтиПоНаименованию("в пути").Артикул);				
					//Доступность = СокрЛП(Справочники.СМ_ДромМестонахождения.НайтиПоНаименованию("под заказ").Артикул);									
				КонецЕсли;
				Если Не обЗначениеНеЗаполнено(Доступность) Тогда
					XML_Полный.ЗаписатьНачалоЭлемента("Whereabouts");    XML_Полный.ЗаписатьТекст(Доступность);                       XML_Полный.ЗаписатьКонецЭлемента();	  				
				КонецЕсли;
				Прервать;
			КонецЦикла;
		КонецЕсли; 
		
		XML_Полный.ЗаписатьНачалоЭлемента("DamagedType");          XML_Полный.ЗаписатьТекст("0");                                     XML_Полный.ЗаписатьКонецЭлемента();	  		 
		
		XML_Полный.ЗаписатьКонецЭлемента();     //Offer  
		
	КонецЦикла;
	
	XML_Полный.ЗаписатьКонецЭлемента();     //Offers 
	//Сюда вывести скидки 
	ТаблицаСкидок = ПолучитьТаблицуСкидок(СписокАвто);
	
	Если ТаблицаСкидок.Количество() > 0 Тогда
		
		XML_Полный.ЗаписатьНачалоЭлемента("Discounts");
		
		Для каждого СтрокаСкидок Из ТаблицаСкидок Цикл                                                    
			
			//Бондаренко++ 20220629                                                   
			//УнИдентАвто = СтрокаСкидок.Ссылка.УникальныйИдентификатор();
			УнИдентАвто = ВычислитьХешСуммуСтроки(Строка(СтрокаСкидок.Ссылка.УникальныйИдентификатор()));
			//Бондаренко-- 20220629
			
			Если СтрокаСкидок.СкидкаМаксимальная > 0  Тогда
				XML_Полный.ЗаписатьНачалоЭлемента("MaxDiscount");
				УнИдентСкидки = СокрЛП(УнИдентАвто)+"_Max";
				РазмерСкидки = СтрЗаменить(СокрЛП(СтрокаСкидок.СкидкаМаксимальная),Символы.НПП,"");
				XML_Полный.ЗаписатьНачалоЭлемента("idMaxDiscount");  XML_Полный.ЗаписатьТекст(УнИдентСкидки);    XML_Полный.ЗаписатьКонецЭлемента();	  				
				XML_Полный.ЗаписатьНачалоЭлемента("VIN");            XML_Полный.ЗаписатьТекст(СтрокаСкидок.VIN); XML_Полный.ЗаписатьКонецЭлемента();	  				
				XML_Полный.ЗаписатьНачалоЭлемента("maxDiscount");    XML_Полный.ЗаписатьТекст(РазмерСкидки);     XML_Полный.ЗаписатьКонецЭлемента();	  				 
				XML_Полный.ЗаписатьНачалоЭлемента("idDiscountType"); XML_Полный.ЗаписатьТекст("2");              XML_Полный.ЗаписатьКонецЭлемента();	  				 
				XML_Полный.ЗаписатьКонецЭлемента();     //MaxDiscount 				
			КонецЕсли;
			
			Если СтрокаСкидок.СкидаПриПокупкеВТрейдИн > 0  Тогда
				XML_Полный.ЗаписатьНачалоЭлемента("Discount");
				УнИдентСкидки = СокрЛП(УнИдентАвто)+"_TradeIn";
				РазмерСкидки = СтрЗаменить(СокрЛП(СтрокаСкидок.СкидаПриПокупкеВТрейдИн),Символы.НПП,"");
				XML_Полный.ЗаписатьНачалоЭлемента("idDiscount");     XML_Полный.ЗаписатьТекст(УнИдентСкидки);    XML_Полный.ЗаписатьКонецЭлемента();	  				
				XML_Полный.ЗаписатьНачалоЭлемента("VIN");            XML_Полный.ЗаписатьТекст(СтрокаСкидок.VIN); XML_Полный.ЗаписатьКонецЭлемента();	  				
				XML_Полный.ЗаписатьНачалоЭлемента("discount");       XML_Полный.ЗаписатьТекст(РазмерСкидки);     XML_Полный.ЗаписатьКонецЭлемента();	  				 
				XML_Полный.ЗаписатьНачалоЭлемента("idDiscountType"); XML_Полный.ЗаписатьТекст("2");              XML_Полный.ЗаписатьКонецЭлемента();	  				 
				XML_Полный.ЗаписатьНачалоЭлемента("name");           XML_Полный.ЗаписатьТекст("Скидка при покупке по программе Trade-In");                     XML_Полный.ЗаписатьКонецЭлемента();	  				 
				XML_Полный.ЗаписатьНачалоЭлемента("description");    XML_Полный.ЗаписатьТекст("Скидка в рублях при покупке автомобиля по программе Trade-In"); XML_Полный.ЗаписатьКонецЭлемента();	  				 				
				XML_Полный.ЗаписатьКонецЭлемента();     //Discount 	
			КонецЕсли;
			
			Если СтрокаСкидок.СкидкаПриПокупкеВКредит > 0  Тогда
				XML_Полный.ЗаписатьНачалоЭлемента("Discount");
				УнИдентСкидки = СокрЛП(УнИдентАвто)+"_Credit";
				РазмерСкидки = СтрЗаменить(СокрЛП(СтрокаСкидок.СкидкаПриПокупкеВКредит),Символы.НПП,"");
				XML_Полный.ЗаписатьНачалоЭлемента("idDiscount");     XML_Полный.ЗаписатьТекст(УнИдентСкидки);    XML_Полный.ЗаписатьКонецЭлемента();	  				
				XML_Полный.ЗаписатьНачалоЭлемента("VIN");            XML_Полный.ЗаписатьТекст(СтрокаСкидок.VIN); XML_Полный.ЗаписатьКонецЭлемента();	  				
				XML_Полный.ЗаписатьНачалоЭлемента("discount");       XML_Полный.ЗаписатьТекст(РазмерСкидки);     XML_Полный.ЗаписатьКонецЭлемента();	  				 
				XML_Полный.ЗаписатьНачалоЭлемента("idDiscountType"); XML_Полный.ЗаписатьТекст("2");              XML_Полный.ЗаписатьКонецЭлемента();	  				 
				XML_Полный.ЗаписатьНачалоЭлемента("name");           XML_Полный.ЗаписатьТекст("Скидка при покупке в кредит");                                  XML_Полный.ЗаписатьКонецЭлемента();	  				 
				XML_Полный.ЗаписатьНачалоЭлемента("description");    XML_Полный.ЗаписатьТекст("Скидка в рублях при покупке автомобиля по программе в кредит"); XML_Полный.ЗаписатьКонецЭлемента();	  				 				
				XML_Полный.ЗаписатьКонецЭлемента();     //Discount 	
			КонецЕсли;                               
			
			Если СтрокаСкидок.СкидкаПриСтраховании > 0  Тогда
				XML_Полный.ЗаписатьНачалоЭлемента("Discount");
				УнИдентСкидки = СокрЛП(УнИдентАвто)+"_Insurance";
				РазмерСкидки = СтрЗаменить(СокрЛП(СтрокаСкидок.СкидкаПриСтраховании),Символы.НПП,"");
				XML_Полный.ЗаписатьНачалоЭлемента("idDiscount");     XML_Полный.ЗаписатьТекст(УнИдентСкидки);    XML_Полный.ЗаписатьКонецЭлемента();	  				
				XML_Полный.ЗаписатьНачалоЭлемента("VIN");            XML_Полный.ЗаписатьТекст(СтрокаСкидок.VIN); XML_Полный.ЗаписатьКонецЭлемента();	  				
				XML_Полный.ЗаписатьНачалоЭлемента("discount");       XML_Полный.ЗаписатьТекст(РазмерСкидки);     XML_Полный.ЗаписатьКонецЭлемента();	  				 
				XML_Полный.ЗаписатьНачалоЭлемента("idDiscountType"); XML_Полный.ЗаписатьТекст("2");              XML_Полный.ЗаписатьКонецЭлемента();	  				 
				XML_Полный.ЗаписатьНачалоЭлемента("name");           XML_Полный.ЗаписатьТекст("Скидка при страховании");                                       XML_Полный.ЗаписатьКонецЭлемента();	  				 
				XML_Полный.ЗаписатьНачалоЭлемента("description");    XML_Полный.ЗаписатьТекст("Скидка в рублях при покупке автомобиля со страхованием");       XML_Полный.ЗаписатьКонецЭлемента();	  				 				
				XML_Полный.ЗаписатьКонецЭлемента();     //Discount 	
			КонецЕсли;
		КонецЦикла;
		
		XML_Полный.ЗаписатьКонецЭлемента();     //Discounts 
		
	КонецЕсли;
	
	XML_Полный.ЗаписатьКонецЭлемента();     //avtoxml 
	XMLТекст = XML_Полный.Закрыть();
	Возврат XMLТекст;
	
КонецФункции // ПолучитьXMLОбъявленийDromLk1(ТаблицаВыгрузкиПолная, HTTPRequest)
//Бондаренко-- 20230314

Функция ПолучитьИтоговыйСписокПодразделений(ТаблицаВыгрузки) Экспорт
	
	тзПодразделение = ТаблицаВыгрузки.Скопировать(,"Подразделение");
	тзПодразделение.Свернуть("Подразделение");
	СписокПодразделений = Новый СписокЗначений;
	СписокПодразделений.ЗагрузитьЗначения(тзПодразделение.ВыгрузитьКолонку("Подразделение"));
	
	СписокПодразделений = ПолучитьПолныйСписокПодразделений(СписокПодразделений); 
	
	Возврат СписокПодразделений;
	
КонецФункции // ПолучитьИтоговыйСписокАвто(ТаблицаВыгрузки,СписокАвто,ЭлСпискаМарок.Значение,ИтоговыйСписокАвто)

Функция ПолучитьТаблицуАвто() Экспорт
	
	Запрос = Новый Запрос;
	
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ОстаткиАвтомобилейОстатки.Автомобиль,
	|	ИСТИНА КАК Доступность,
	|	ОстаткиАвтомобилейОстатки.СкладКомпании.Подразделение КАК Подразделение
	|ИЗ
	|	РегистрНакопления.ОстаткиАвтомобилей.Остатки КАК ОстаткиАвтомобилейОстатки
	|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|			ЗначенияСвойствОбъектов.Объект КАК Объект
	|		ИЗ
	|			РегистрСведений.ЗначенияСвойствОбъектов КАК ЗначенияСвойствОбъектов
	|		ГДЕ
	|			ЗначенияСвойствОбъектов.Объект ССЫЛКА Справочник.Автомобили
	|			И ЗначенияСвойствОбъектов.Свойство = ЗНАЧЕНИЕ(ПланВидовХарактеристик.СвойстваОбъектов.ИспользоватьДляТестДрайва)
	|			И ЗначенияСвойствОбъектов.Значение = ИСТИНА) КАК АвтоТестДрайва
	|		ПО ОстаткиАвтомобилейОстатки.Автомобиль = АвтоТестДрайва.Объект
	|ГДЕ
	|	ОстаткиАвтомобилейОстатки.КоличествоОстаток > 0
	|	И АвтоТестДрайва.Объект ЕСТЬ NULL
	|
	|СГРУППИРОВАТЬ ПО
	|	ОстаткиАвтомобилейОстатки.Автомобиль,
	|	ОстаткиАвтомобилейОстатки.СкладКомпании.Подразделение
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ЗаказыАвтомобилейОстатки.Автомобиль,
	|	ЛОЖЬ,
	|	ЗаказыАвтомобилейОстатки.ЗаказПоставщику.ПодразделениеКомпании
	|ИЗ
	|	РегистрНакопления.ЗаказыПоставщикамНаАвтомобили.Остатки КАК ЗаказыАвтомобилейОстатки
	|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|			ЗначенияСвойствОбъектов.Объект КАК Объект
	|		ИЗ
	|			РегистрСведений.ЗначенияСвойствОбъектов КАК ЗначенияСвойствОбъектов
	|		ГДЕ
	|			ЗначенияСвойствОбъектов.Объект ССЫЛКА Справочник.Автомобили
	|			И ЗначенияСвойствОбъектов.Свойство = ЗНАЧЕНИЕ(ПланВидовХарактеристик.СвойстваОбъектов.ИспользоватьДляТестДрайва)
	|			И ЗначенияСвойствОбъектов.Значение = ИСТИНА) КАК АвтоТестДрайва
	|		ПО ЗаказыАвтомобилейОстатки.Автомобиль = АвтоТестДрайва.Объект
	|ГДЕ
	|	ЗаказыАвтомобилейОстатки.КоличествоОстаток > 0
	|	И АвтоТестДрайва.Объект ЕСТЬ NULL
	|
	|СГРУППИРОВАТЬ ПО
	|	ЗаказыАвтомобилейОстатки.Автомобиль,
	|	ЗаказыАвтомобилейОстатки.ЗаказПоставщику.ПодразделениеКомпании"; 
	
	ТЗ = Запрос.Выполнить().Выгрузить();
	
	Возврат ТЗ;
	
КонецФункции // ПолучитьТаблицуАвто(СписокАвто)

Функция ПолучитьГородОтделаПродаж(ТаблицаВыгрузки,Марка) Экспорт
	
	Город_ = "";
	
	ПараметрыОтбора = Новый Структура;
	ПараметрыОтбора.Вставить("Марка",Марка);
	
	НайденныеСтроки = ТаблицаВыгрузки.НайтиСтроки(ПараметрыОтбора);
	
	Если НайденныеСтроки.Количество() > 0 Тогда
		Город_ = СокрЛП(НайденныеСтроки[0].Адрес.Артикул);	
	КонецЕсли;
	
	Возврат Город_;
	
КонецФункции // ПолучитьГородОтделаПродаж(ТаблицаВыгрузки,Марка)
//Бондаренко-- 20220617

Функция ОпределитьВидАвто(ТекАвто) Экспорт 
	
	ВидАвто = Неопределено;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	АвтомобилиСрезПоследних.Автомобиль,
	|	АвтомобилиСрезПоследних.ВидЗначения,
	|	АвтомобилиСрезПоследних.Значение
	|ИЗ
	|	РегистрСведений.Автомобили.СрезПоследних(&ДатаЗапроса, ) КАК АвтомобилиСрезПоследних
	|ГДЕ
	|	АвтомобилиСрезПоследних.Автомобиль = &Автомобиль
	|	И АвтомобилиСрезПоследних.ВидЗначения = &ВидЗначения";
	
	Запрос.УстановитьПараметр("Автомобиль", ТекАвто);
	Запрос.УстановитьПараметр("ВидЗначения", Перечисления.ДополнительнаяИнформацияАвтомобилей.ВидАвтомобиля);
	Запрос.УстановитьПараметр("ДатаЗапроса",ТекущаяДата());
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		ВидАвто = ВыборкаДетальныеЗаписи.Значение;		
	КонецЦикла;
	
	Возврат ВидАвто;
	
КонецФункции // ОпределитьВидАвто(ТекАвто)

Функция НайтиСТС(Авто) Экспорт
	
	НомерСТС = "";
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ПодтверждающиеДокументы.Ссылка,
	|	ПодтверждающиеДокументы.ПометкаУдаления,
	|	ПодтверждающиеДокументы.ВидПодтверждающегоДокумента,
	|	ПодтверждающиеДокументы.Номер,
	|	ПодтверждающиеДокументы.Серия,
	|	ПодтверждающиеДокументы.Устаревший,
	|	ПодтверждающиеДокументы.Владелец
	|ИЗ
	|	Справочник.ПодтверждающиеДокументы КАК ПодтверждающиеДокументы
	|ГДЕ
	|	ПодтверждающиеДокументы.Владелец = &Владелец
	|	И НЕ ПодтверждающиеДокументы.Устаревший
	|	И НЕ ПодтверждающиеДокументы.ПометкаУдаления
	|	И ПодтверждающиеДокументы.ВидПодтверждающегоДокумента = &ВидПодтверждающегоДокумента";
	
	Запрос.УстановитьПараметр("ВидПодтверждающегоДокумента",Перечисления.ВидыДокументов.Свидетельство);
	Запрос.УстановитьПараметр("Владелец", Авто);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		НомерСТС = СокрЛП(СтрЗаменить(ВыборкаДетальныеЗаписи.Серия," ",""))+СокрЛП(ВыборкаДетальныеЗаписи.Номер);
	КонецЦикла;
	
	Возврат НомерСТС;
	
КонецФункции // НайтиСТС(Авто)

Функция ПолучитьТаблицуСкидок(СписокАвто) Экспорт        
	
	Запрос = Новый Запрос;
	
	Запрос.Текст = "ВЫБРАТЬ
	|	Автомобили.Ссылка,
	|	Автомобили.СкидаПриПокупкеВТрейдИн,
	|	Автомобили.СкидкаМаксимальная,
	|	Автомобили.СкидкаПриПокупкеВКредит,
	|	Автомобили.СкидкаПриСтраховании,
	|	Автомобили.СпециальнаяЦена,
	|	Автомобили.VIN
	|ИЗ
	|	Справочник.Автомобили КАК Автомобили
	|ГДЕ
	|	(Автомобили.СкидкаПриСтраховании <> 0
	|			ИЛИ Автомобили.СкидкаПриПокупкеВКредит <> 0
	|			ИЛИ Автомобили.СкидкаМаксимальная <> 0
	|			ИЛИ Автомобили.СкидаПриПокупкеВТрейдИн <> 0
	|			ИЛИ Автомобили.СпециальнаяЦена <> 0)
	|	И Автомобили.Ссылка В(&СписокАвто)";
	
	Запрос.УстановитьПараметр("СписокАвто",СписокАвто);
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции // ПолучитьТаблицуСкидок()

//Бондаренко++ 20220629
Функция ВычислитьХешСуммуСтроки(ВхСтрока) Экспорт
	
	ХешированиеДанных = Новый ХешированиеДанных(ХешФункция.CRC32);
	
	ХешированиеДанных.Добавить(ВхСтрока);
	
	Возврат СтрЗаменить(ХешированиеДанных.ХешСумма,Символы.НПП,"");
	
КонецФункции           
//Бондаренко-- 20220629

Функция ПолучитьXMLОбъявленийAutoruLCVLk(HTTPRequest) Экспорт
	
 	ТаблицаДляВыгрузки = ПолучитьТаблицуЛичногоКабинетаАвтоРуКоммерцияИзЗапроса(HTTPRequest.ПараметрыURL["UnitCode"]);
	
 	СписокАвто = ПолучитьСписокАвтоОстатковИзаказов(ТаблицаДляВыгрузки);
 	
	XML_Полный=Новый ЗаписьXML();
	XML_Полный.УстановитьСтроку(Новый ПараметрыЗаписиXML("UTF-8","1.0",false));
	XML_Полный.ЗаписатьОбъявлениеXML();
	
	XML_Полный.ЗаписатьНачалоЭлемента("Data");
	XML_Полный.ЗаписатьНачалоЭлемента("Cars");
 	
 	Если СписокАвто.Количество() > 0 Тогда
		Для каждого Эл Из СписокАвто Цикл
			
			ТекАвто = Эл.Значение; 
			
 			//Бондаренко++ 20230304
			Если АвтомобильНовый(ТекАвто) Тогда
			//Если АвтомобильНовый(ТекАвто) Тогда
				// оставляем
			Иначе	
				Продолжить;
			КонецЕсли;             
			//Бондаренко-- 20230304
			//Пропускаются все авто с пробегом

 			ТелефонОП = ПолучитьТелефонОтделаПродаж(ТаблицаДляВыгрузки,ТекАвто.Модель.Марка);
			Если обЗначениеНеЗаполнено(ТелефонОП) Тогда
				Продолжить;
			КонецЕсли;
			
			//Бондаренко++ 20220713
			Если НЕ ТекАвто.ВыгружатьАвтомобильНаСайт Тогда
				Продолжить;	
			КонецЕсли; 
			//Бондаренко-- 20220713
 			
			Если ТекАвто.Модель.КатегорияТС = Справочники.КатегорииТранспортныхСредств.АвтомобилиЛегковые Тогда
 				Продолжить;
			КонецЕсли;

			ЗаполнитьОбъявлениеАвтоРуКоммерческий(ТекАвто,HTTPRequest.БазовыйURL,ТелефонОП, XML_Полный); 				 
 			
		КонецЦикла;             
	КонецЕсли;
	
	XML_Полный.ЗаписатьКонецЭлемента();     //Cars
	XML_Полный.ЗаписатьКонецЭлемента();     //Data
	XMLТекст = XML_Полный.Закрыть();
	Возврат XMLТекст;
	
КонецФункции // ПолучитьXMLОбъявленийAutoruLCVLk(HTTPRequest) 

//Бондаренко++ 20230314
Функция ПолучитьXMLОбъявленийAutoruLCVLk1(HTTPRequest) Экспорт
	
 	ТаблицаДляВыгрузки = ПолучитьТаблицуЛичногоКабинетаАвтоРуКоммерцияИзЗапроса(HTTPRequest.ПараметрыURL["UnitCode"]);
	
 	СписокАвто = ПолучитьСписокАвтоОстатковИзаказов(ТаблицаДляВыгрузки);
 	
	XML_Полный=Новый ЗаписьXML();
	XML_Полный.УстановитьСтроку(Новый ПараметрыЗаписиXML("UTF-8","1.0",false));
	XML_Полный.ЗаписатьОбъявлениеXML();
	
	XML_Полный.ЗаписатьНачалоЭлемента("Data");
	XML_Полный.ЗаписатьНачалоЭлемента("Cars");
 	
 	Если СписокАвто.Количество() > 0 Тогда
		Для каждого Эл Из СписокАвто Цикл
			
			ТекАвто = Эл.Значение; 
			
 			//Бондаренко++ 20230304
			Если ( АвтомобильПараллельногоИмпорта(ТекАвто) И ТекАвто.АвитоАвтоРуДром ) Тогда
			//Если АвтомобильНовый(ТекАвто) Тогда
				// оставляем
			Иначе	
				Продолжить;
			КонецЕсли;             
			//Бондаренко-- 20230304
			//Пропускаются все авто с пробегом

 			ТелефонОП = ПолучитьТелефонОтделаПродаж(ТаблицаДляВыгрузки,ТекАвто.Модель.Марка);
			Если обЗначениеНеЗаполнено(ТелефонОП) Тогда
				Продолжить;
			КонецЕсли;
			
			//Бондаренко++ 20220713
			Если НЕ ТекАвто.ВыгружатьАвтомобильНаСайт Тогда
				Продолжить;	
			КонецЕсли; 
			//Бондаренко-- 20220713
 			
			Если ТекАвто.Модель.КатегорияТС = Справочники.КатегорииТранспортныхСредств.АвтомобилиЛегковые Тогда
 				Продолжить;
			КонецЕсли;

			ЗаполнитьОбъявлениеАвтоРуКоммерческий(ТекАвто,HTTPRequest.БазовыйURL,ТелефонОП, XML_Полный); 				 
 			
		КонецЦикла;             
	КонецЕсли;
	
	XML_Полный.ЗаписатьКонецЭлемента();     //Cars
	XML_Полный.ЗаписатьКонецЭлемента();     //Data
	XMLТекст = XML_Полный.Закрыть();
	Возврат XMLТекст;
	
КонецФункции // ПолучитьXMLОбъявленийAutoruLCVLk1(HTTPRequest) 
//Бондаренко-- 20230314

Функция ПолучитьТаблицуЛичногоКабинетаАвтоРуКоммерцияИзЗапроса(КодЛичногоКабинета) Экспорт
	
	//КодЛичногоКабинета = HTTPRequest.ПараметрыURL["UnitCode"];
	
	Запрос = Новый Запрос;
	Запрос.Текст =	"ВЫБРАТЬ
	              	|	СМ_ЛичныеКабинеты_АвтоРуКоммерческиеМарки.Ссылка.Код КАК КодЛичногоКабинета,
	              	|	СМ_ЛичныеКабинеты_АвтоРуКоммерческиеМарки.Ссылка.Ссылка КАК ЛичныйКабинет,
	              	|	СМ_ЛичныеКабинеты_АвтоРуКоммерческиеМарки.Марка,
	              	|	СМ_ЛичныеКабинеты_АвтоРуКоммерческиеМарки.ПредставлениеТелефона,
	              	|	СМ_ЛичныеКабинеты_АвтоРуКоммерческиеПодразделения.Подразделение
	              	|ИЗ
	              	|	Справочник.СМ_ЛичныеКабинеты_АвтоРу_Коммерческие.Марки КАК СМ_ЛичныеКабинеты_АвтоРуКоммерческиеМарки
	              	|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	              	|			СМ_ЛичныеКабинеты_АвитоПодразделения.Ссылка КАК Ссылка,
	              	|			СМ_ЛичныеКабинеты_АвитоПодразделения.ИдентификаторМарки КАК ИдентификаторМарки,
	              	|			СМ_ЛичныеКабинеты_АвитоПодразделения.Подразделение КАК Подразделение
	              	|		ИЗ
	              	|			Справочник.СМ_ЛичныеКабинеты_АвтоРу_Коммерческие.Подразделения КАК СМ_ЛичныеКабинеты_АвитоПодразделения) КАК СМ_ЛичныеКабинеты_АвтоРуКоммерческиеПодразделения
	              	|		ПО СМ_ЛичныеКабинеты_АвтоРуКоммерческиеМарки.Ссылка = СМ_ЛичныеКабинеты_АвтоРуКоммерческиеПодразделения.Ссылка
	              	|			И СМ_ЛичныеКабинеты_АвтоРуКоммерческиеМарки.ИдентификаторМарки = СМ_ЛичныеКабинеты_АвтоРуКоммерческиеПодразделения.ИдентификаторМарки
	              	|ГДЕ
	              	|	СМ_ЛичныеКабинеты_АвтоРуКоммерческиеМарки.Ссылка.Код = &КодЛичногоКабинета";
	
	Запрос.УстановитьПараметр("КодЛичногоКабинета", КодЛичногоКабинета);
	
	ТЗ = Запрос.Выполнить().Выгрузить();
	
	Возврат ТЗ;
	
КонецФункции  //ПолучитьТаблицуЛичногоКабинетаАвитоИзЗапроса(HTTPRequest) 

Процедура ЗаполнитьОбъявлениеАвтоРуКоммерческий(ТекАвто,HTTPRequestБазовыйURL,ТелефонОтделаПродаж, XML_Полный) Экспорт
	
	XML_Полный.ЗаписатьНачалоЭлемента("car");
	
	XML_Полный.ЗаписатьНачалоЭлемента("mark_id");             XML_Полный.ЗаписатьТекст(ТекАвто.Модель.Марка.МаркаАвтоРу.Наименование);                     XML_Полный.ЗаписатьКонецЭлемента();
	XML_Полный.ЗаписатьНачалоЭлемента("group_id");            XML_Полный.ЗаписатьТекст(ТекАвто.Модель.МодельАвтоРу.Наименование);                          XML_Полный.ЗаписатьКонецЭлемента();
	
	Если ТекАвто.Цвет.ОкраскаМеталлик Тогда
		XML_Полный.ЗаписатьНачалоЭлемента("color");            XML_Полный.ЗаписатьТекст(СокрЛП(ТекАвто.Цвет.ЦветАвтоРу)+" металлик");                                            XML_Полный.ЗаписатьКонецЭлемента();
	Иначе
		XML_Полный.ЗаписатьНачалоЭлемента("color");            XML_Полный.ЗаписатьТекст(СокрЛП(ТекАвто.Цвет.ЦветАвтоРу));                                                        XML_Полный.ЗаписатьКонецЭлемента();
	КонецЕсли; 
	
	XML_Полный.ЗаписатьНачалоЭлемента("availability");        XML_Полный.ЗаписатьТекст("В наличии");                                                                        XML_Полный.ЗаписатьКонецЭлемента();
	XML_Полный.ЗаписатьНачалоЭлемента("custom");              XML_Полный.ЗаписатьТекст("Растаможен");                                                                       XML_Полный.ЗаписатьКонецЭлемента();
	XML_Полный.ЗаписатьНачалоЭлемента("state");               XML_Полный.ЗаписатьТекст("Отличное");                                                                         XML_Полный.ЗаписатьКонецЭлемента();
	
	XML_Полный.ЗаписатьНачалоЭлемента("haggle");              XML_Полный.ЗаписатьТекст("не возможен");                                                                      XML_Полный.ЗаписатьКонецЭлемента();
	XML_Полный.ЗаписатьНачалоЭлемента("exchange");            XML_Полный.ЗаписатьТекст("нет");                                                                              XML_Полный.ЗаписатьКонецЭлемента();
	
	XML_Полный.ЗаписатьНачалоЭлемента("run");                 XML_Полный.ЗаписатьТекст("0");                                                                                XML_Полный.ЗаписатьКонецЭлемента();
	
	//Бондаренко++ 20220629
	Если обЗначениеНеЗаполнено(ТекАвто.ГодВыпуска) Тогда
		ГодВыпуска_ = НачалоГода(ТекущаяДата());	
	Иначе		
		ГодВыпуска_ = ТекАвто.ГодВыпуска;		
	КонецЕсли; 
	//Бондаренко-- 20220629
	XML_Полный.ЗаписатьНачалоЭлемента("year");                XML_Полный.ЗаписатьТекст(Формат(ГодВыпуска_,"ДФ=yyyy"));                                       XML_Полный.ЗаписатьКонецЭлемента();
	
	ПолнаяЦенаПродажи = 0.00;
	ПарОтбора = Новый Структура();
	ПарОтбора.Вставить("Автомобиль",ТекАвто);
	ПарОтбора.Вставить("ТипЦен",Справочники.ТипыЦен.ОсновнойТипЦенПродажи);
	ЦенаАвто = РегистрыСведений.ЦеныАвтомобилей.ПолучитьПоследнее(ТекущаяДата(),ПарОтбора).Цена;
	ПолнаяЦенаПродажи = ЦенаАвто+ТекАвто.СтоимостьДопОборудования;

	XML_Полный.ЗаписатьНачалоЭлемента("price");               XML_Полный.ЗаписатьТекст(СокрЛП(СтрЗаменить(ПолнаяЦенаПродажи,Символы.НПП,"")));                                XML_Полный.ЗаписатьКонецЭлемента(); 
	
	XML_Полный.ЗаписатьНачалоЭлемента("currency");            XML_Полный.ЗаписатьТекст("RUR");                                                                              XML_Полный.ЗаписатьКонецЭлемента();
	XML_Полный.ЗаписатьНачалоЭлемента("vin");                 XML_Полный.ЗаписатьТекст(ТекАвто.VIN);                                                                XML_Полный.ЗаписатьКонецЭлемента();
	
	ТекстКлассифайда = СокрЛП(ТекАвто.Модель.ТекстКлассифайда);
	//Если обЗначениеНеЗаполнено(ТекстКлассифайда) Тогда
	//	ТекстКлассифайда = СокрЛП(Стр1.Подразделение.ТекстКлассифайда);
	//	Если обЗначениеНеЗаполнено(ТекстКлассифайда) Тогда
	//		ТекстКлассифайда = СокрЛП(Стр1.Подразделение.Родитель.ТекстКлассифайда);
	//	КонецЕсли; 
	//КонецЕсли; 
	
	XML_Полный.ЗаписатьНачалоЭлемента("description");   XML_Полный.ЗаписатьТекст(ТекстКлассифайда);                                                                         XML_Полный.ЗаписатьКонецЭлемента();	 
	
	Если ТекАвто.ПутьКФото.Количество() > 0 Тогда
		XML_Полный.ЗаписатьНачалоЭлемента("images");
		Для каждого СтрТЧ Из ТекАвто.ПутьКФото Цикл
			XML_Полный.ЗаписатьНачалоЭлемента("image"); 
			//Бондаренко++ 20220303
			//XML_Полный.ЗаписатьТекст(HTTPRequest.БазовыйURL+"/photo/"+ТекАвто.VIN+"/"+СтрТЧ.НомерСтроки+".jpg");
			XML_Полный.ЗаписатьТекст(HTTPRequestБазовыйURL+"/photo/"+ТекАвто.УникальныйИдентификатор()+"/"+СтрТЧ.GUID+".jpg");
			//Бондаренко++ 20220303
			XML_Полный.ЗаписатьКонецЭлемента(); //url	
		КонецЦикла; 
		XML_Полный.ЗаписатьКонецЭлемента(); //images	
	КонецЕсли;
	
	//Уникальный идентификатор объявления. Элемент используется, если не указан VIN номер.Произвольный набор цифр, букв, знаков «-» и «_» до 50 символов.
	//unique_id_str = ""+ТекАвто.VIN+"_"+СтрЗаменить(Стр1.ГодДокаПоступленияАвто,Символы.НПП,"")+"_"+ Стр1.НомерДокаПоступленияАвто;
	
	XML_Полный.ЗаписатьНачалоЭлемента("unique_id");             XML_Полный.ЗаписатьТекст(СокрЛП(ТекАвто.Код));                                 XML_Полный.ЗаписатьКонецЭлемента();	
	
	wheel_str = СокрЛП(ТекАвто.Руль);
	
	//Бондаренко++ 20220621
	Если обЗначениеНеЗаполнено(wheel_str) Тогда				
		wheel_str = СокрЛП(ТекАвто.ВариантКомплектации.Руль);						
	КонецЕсли;			
	//Бондаренко 20220621
	
	Если НЕ обЗначениеНеЗаполнено(wheel_str) Тогда
		XML_Полный.ЗаписатьНачалоЭлемента("wheel");             XML_Полный.ЗаписатьТекст(wheel_str);                                                     XML_Полный.ЗаписатьКонецЭлемента();
	КонецЕсли;
	
	bus_type_str =  СокрЛП(ТекАвто.ТипАвтобусаАвтоРу);
	Если НЕ обЗначениеНеЗаполнено(bus_type_str) Тогда
		XML_Полный.ЗаписатьНачалоЭлемента("bus_type");          XML_Полный.ЗаписатьТекст(bus_type_str);                                                  XML_Полный.ЗаписатьКонецЭлемента();
	КонецЕсли;
	
	wheel_drive_str =  СокрЛП(ТекАвто.КолеснаяФормулаАвтоРу);
	Если НЕ обЗначениеНеЗаполнено(wheel_drive_str) Тогда
		XML_Полный.ЗаписатьНачалоЭлемента("wheel_drive");       XML_Полный.ЗаписатьТекст(wheel_drive_str);                                               XML_Полный.ЗаписатьКонецЭлемента();
	КонецЕсли;
	
	seats_str =  СокрЛП(ТекАвто.КоличествоМест);
	Если НЕ обЗначениеНеЗаполнено(seats_str) Тогда
		XML_Полный.ЗаписатьНачалоЭлемента("seats");             XML_Полный.ЗаписатьТекст(seats_str);                                                     XML_Полный.ЗаписатьКонецЭлемента();
	КонецЕсли;
	
	//Бондаренко++ 20220627
	ТипДвигателя = Справочники.ТипыДвигателей.ПустаяСсылка();
	ТипДвигателя = СМ_ВыгрузкаОбъявленийОПродажеАвто.СМГ_СправочникВернутьЗначениеРеквизита("ТипДвигателя",ТекАвто.ПолучитьОбъект());
	//Бондаренко-- 20220627
	
	Если Не обЗначениеНеЗаполнено(ТипДвигателя) Тогда
		engine_power_str =  СтрЗаменить(СокрЛП(ТипДвигателя.МощностьЛС),Символы.НПП,"");
		Если НЕ обЗначениеНеЗаполнено(engine_power_str) Тогда
			XML_Полный.ЗаписатьНачалоЭлемента("engine_power");      XML_Полный.ЗаписатьТекст(engine_power_str);                                              XML_Полный.ЗаписатьКонецЭлемента();
		КонецЕсли;
		
		engine_volume_str =  СтрЗаменить(СокрЛП(ТипДвигателя.ОбъемДвигателя*1000),Символы.НПП,"");
		Если НЕ обЗначениеНеЗаполнено(engine_volume_str) Тогда
			XML_Полный.ЗаписатьНачалоЭлемента("engine_volume");     XML_Полный.ЗаписатьТекст(engine_volume_str);                                             XML_Полный.ЗаписатьКонецЭлемента();
		КонецЕсли;
		
		ТипТоплива = ТипДвигателя.ТипТоплива;
		Если ТипТоплива = Перечисления.ТипыТоплива.Petrol Тогда
			engine_type_str =  "бензин";
		ИначеЕсли ТипТоплива = Перечисления.ТипыТоплива.Diesel Тогда
			engine_type_str =  "дизель";	
		ИначеЕсли ТипТоплива = Перечисления.ТипыТоплива.None Тогда
			engine_type_str =  "электрический";	
		ИначеЕсли ТипТоплива = Перечисления.ТипыТоплива.LiquefiedGas ИЛИ ТипТоплива = Перечисления.ТипыТоплива.PressureGas Тогда
			engine_type_str =  "газ";	
		КонецЕсли;
		
		Если ТипДвигателя.Дром_Гибрид Тогда
			engine_type_str =  "гибридный";				
		КонецЕсли;	
		
		Если НЕ обЗначениеНеЗаполнено(engine_type_str) Тогда
			XML_Полный.ЗаписатьНачалоЭлемента("engine_type");       XML_Полный.ЗаписатьТекст(engine_type_str);                                               XML_Полный.ЗаписатьКонецЭлемента();
		КонецЕсли;
	КонецЕсли;
	
	gearbox_str =  СокрЛП(ТекАвто.ТипКПП.ТипКПП_АутоРу);
	Если НЕ обЗначениеНеЗаполнено(gearbox_str) Тогда
		XML_Полный.ЗаписатьНачалоЭлемента("gearbox");            XML_Полный.ЗаписатьТекст(gearbox_str);                                                  XML_Полный.ЗаписатьКонецЭлемента();
	КонецЕсли;
	
	extras_flag = ТекАвто.ИспользоватьОпцииМодели;
	Если extras_flag  Тогда
		Табл = ТекАвто.Модель.ОпцииКоммерцияАвтоРу;
	Иначе
		Табл = ТекАвто.ОпцииКоммерцияАвтоРу;
	КонецЕсли;
	Всего_ОпцийАвтоРу = Табл.Количество();
	Если Всего_ОпцийАвтоРу > 0 Тогда
		extras_str = "";
		Для каждого Стр Из Табл Цикл
			Если НЕ обЗначениеНеЗаполнено(extras_str) Тогда
				extras_str = СокрЛП(extras_str)+";"+СокрЛП(Стр.Опция);
			Иначе
				extras_str = СокрЛП(Стр.Опция);
			КонецЕсли; 
		КонецЦикла; 
		XML_Полный.ЗаписатьНачалоЭлемента("extras");          XML_Полный.ЗаписатьТекст(extras_str);                                                      XML_Полный.ЗаписатьКонецЭлемента();
	КонецЕсли;
	
	//Бондаренко++ 20220714
	//body_type_str =  СокрЛП(ТекАвто.ТипКузоваКоммерцияАвтоРу);
	body_type_str = "";
	ТипКузова = СМ_ВыгрузкаОбъявленийОПродажеАвто.СМГ_СправочникВернутьЗначениеРеквизита("ТипКузова",ТекАвто.ПолучитьОбъект());
	Если НЕ обЗначениеНеЗаполнено(ТипКузова) Тогда
		body_type_str =  СокрЛП(ТипКузова.ТипКузоваАвтоРу);		  
	КонецЕсли;
	//Бондаренко++ 20220714
	Если НЕ обЗначениеНеЗаполнено(body_type_str) Тогда
		XML_Полный.ЗаписатьНачалоЭлемента("body_type");          XML_Полный.ЗаписатьТекст(body_type_str);                                                XML_Полный.ЗаписатьКонецЭлемента();
	КонецЕсли;
	
	cabin_type_str =  СокрЛП(ТекАвто.ТипКабиныКоммерцияАвтоРу);
	Если НЕ обЗначениеНеЗаполнено(cabin_type_str) Тогда
		XML_Полный.ЗаписатьНачалоЭлемента("cabin_type");         XML_Полный.ЗаписатьТекст(cabin_type_str);                                               XML_Полный.ЗаписатьКонецЭлемента();
	КонецЕсли;
	
	loading_number =  ТекАвто.Грузоподъемность;
	Если loading_number > 0 Тогда
		loading_str =  СтрЗаменить(СокрЛП(loading_number),Символы.НПП,"");
		Если НЕ обЗначениеНеЗаполнено(loading_str) Тогда
			XML_Полный.ЗаписатьНачалоЭлемента("loading");        XML_Полный.ЗаписатьТекст(loading_str);                                                  XML_Полный.ЗаписатьКонецЭлемента();
		КонецЕсли;
	КонецЕсли;
	
	suspension_chassis_str =  СокрЛП(ТекАвто.ПодвескаШассиКоммерцияАвтоРу);
	Если НЕ обЗначениеНеЗаполнено(suspension_chassis_str) Тогда
		XML_Полный.ЗаписатьНачалоЭлемента("suspension_chassis"); XML_Полный.ЗаписатьТекст(suspension_chassis_str);                                       XML_Полный.ЗаписатьКонецЭлемента();
	КонецЕсли;
	
	drive_str =  СокрЛП(ТекАвто.Привод);
	Если НЕ обЗначениеНеЗаполнено(drive_str) Тогда
		XML_Полный.ЗаписатьНачалоЭлемента("drive");              XML_Полный.ЗаписатьТекст(drive_str);                                                    XML_Полный.ЗаписатьКонецЭлемента();
	КонецЕсли;
	
	XML_Полный.ЗаписатьКонецЭлемента(); //car
	
КонецПроцедуры // ЗаполнитьОбъявлениеАвтоРуКоммерческий(ТекАвто,HTTPRequestБазовыйURL,ТелефонОтделаПродаж)
//Бондаренко-- 20220719

//Бондаренко++ 20220913
Функция НайтиПодрАвто(Авто,Табл) Экспорт
	
	Подр_ = "";
	
	ПараметрыОтбора = Новый Структура;
	ПараметрыОтбора.Вставить("Автомобиль",Авто);
	
	НайденныеСтроки = Табл.НайтиСтроки(ПараметрыОтбора);
	
	Если НайденныеСтроки.Количество() > 0 Тогда
		Подр_ = НайденныеСтроки[0].Подразделение;	
	КонецЕсли;
	
	Возврат Подр_; 
	
КонецФункции // НайтиПодрАвто(Авто,Табл)

Функция ПолучитьАдресОтделаПродажПодразделения(ТаблицаВыгрузки,Марка,Подразделение) Экспорт
	
	Адрес_ = "";
	
	ПараметрыОтбора = Новый Структура;
	ПараметрыОтбора.Вставить("Марка",Марка); 
	ПараметрыОтбора.Вставить("Подразделение",Подразделение);
 	
	НайденныеСтроки = ТаблицаВыгрузки.НайтиСтроки(ПараметрыОтбора);
	
	Если НайденныеСтроки.Количество() > 0 Тогда
		
		Адрес_ = СокрЛП(НайденныеСтроки[0].Адрес);
		
	Иначе
		
		ПараметрыОтбора = Новый Структура;
		ПараметрыОтбора.Вставить("Марка",Марка); 
		ПараметрыОтбора.Вставить("Подразделение",Подразделение.Родитель);
 	
		НайденныеСтроки = ТаблицаВыгрузки.НайтиСтроки(ПараметрыОтбора);
		
		Если НайденныеСтроки.Количество() > 0 Тогда
			Адрес_ = СокрЛП(НайденныеСтроки[0].Адрес);
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат Адрес_;
	
КонецФункции // ПолучитьАдресОтделаПродажПодразделения(ТаблицаВыгрузки,Марка,Подразделение)
 //Бондаренко-- 20220913

 // Функция "расщепляет" строку на подстроки, используя заданный 
//		разделитель. Разделитель может иметь любую длину. 
//		Если в качестве разделителя задан пробел, рядом стоящие пробелы 
//		считаются одним разделителем, а ведущие и хвостовые пробелы параметра Стр
//		игнорируются.
//		Например, 
//		РазложитьСтрокуВМассивПодстрок(",ку,,,му", ",") возвратит массив значений из пяти элементов, 
//		три из которых - пустые строки, а 
//		РазложитьСтрокуВМассивПодстрок(" ку   му", " ") возвратит массив значений из двух элементов
//
//	Параметры: 
//		Стр - 			строка, которую необходимо разложить на подстроки. 
//						Параметр передается по значению.
//		Разделитель - 	строка-разделитель, по умолчанию - запятая.
//
//
//	Возвращаемое значение:
//		массив значений, элементы которого - подстроки
//
Функция обМояРазложитьСтрокуВМассивПодстрок(Знач Стр, Разделитель = ",") Экспорт
	
	МассивСтрок = Новый Массив();
	Если Разделитель = " " Тогда
		Стр = СокрЛП(Стр);
		Пока Истина Цикл
			Поз = Найти(Стр,Разделитель);
			Если Поз=0 Тогда
				МассивСтрок.Добавить(Стр);
				Возврат МассивСтрок;
			КонецЕсли;
			МассивСтрок.Добавить(Лев(Стр,Поз-1));
			Стр = СокрЛ(Сред(Стр,Поз));
		КонецЦикла;
	Иначе
		ДлинаРазделителя = СтрДлина(Разделитель);
		Пока Истина Цикл
			Поз = Найти(Стр,Разделитель);
			Если Поз=0 Тогда
				МассивСтрок.Добавить(Стр);
				Возврат МассивСтрок;
			КонецЕсли;
			МассивСтрок.Добавить(Лев(Стр,Поз-1));
			Стр = Сред(Стр,Поз+ДлинаРазделителя);
		КонецЦикла;
	КонецЕсли;
	
КонецФункции // обМояРазложитьСтрокуВМассивПодстрок

Функция ПолучитьXMLОбъявленийAvito(СписокПодразделений,ДополнительныйСписокМарок,HTTPRequestas) Экспорт
	
	//Бондаренко++ 20201030
	СписокАвтоТестДрайва = ПолучитьАвтомобилиДляТестДрайва();
	//Бондаренко-- 20201030
	
	Запрос = Новый Запрос("ВЫБРАТЬ
	|	ОстаткиАвтомобилейОстатки.Автомобиль,
	|	ОстаткиАвтомобилейОстатки.Автомобиль.VIN КАК VIN,
	|	СУММА(ОстаткиАвтомобилейОстатки.КоличествоОстаток) КАК Остаток,
	|	ЦенаАвто.Цена КАК Цена,
	|	ХарАвто.Значение КАК ВидАвто,
	|	ОстаткиАвтомобилейОстатки.СкладКомпании.Подразделение КАК Подразделение,
	|	ОстаткиАвтомобилейОстатки.СкладКомпании.Подразделение.ДилерскийЦентр КАК ДилерскийЦентр,
	|	ОстаткиАвтомобилейОстатки.Автомобиль.Модель.МодельАвтоРу.МаркаАвтоРу КАК МаркаАвтоРу,
	|	ОстаткиАвтомобилейОстатки.Автомобиль.Модель.МодельАвтоРу КАК МодельАвтоРу,
	|	ОстаткиАвтомобилейОстатки.Автомобиль.ВариантКомплектации.МодификацияАвтоРу КАК МодификацияАвтоРу,
	|	ОстаткиАвтомобилейОстатки.Автомобиль.ВариантКомплектации.КомплектацияАвтоРу КАК КомплектацияАвтоРу,
	|	ОстаткиАвтомобилейОстатки.Автомобиль.СпециальнаяЦена КАК СпециальнаяЦена,
	|	ОстаткиАвтомобилейОстатки.Автомобиль.СкидкаПриПокупкеВКредит КАК СкидкаПриПокупкеВКредит,
	|	ОстаткиАвтомобилейОстатки.Автомобиль.СкидкаПриСтраховании КАК СкидкаПриСтраховании,
	|	ОстаткиАвтомобилейОстатки.Автомобиль.СкидаПриПокупкеВТрейдИн КАК СкидаПриПокупкеВТрейдИн,
	|	ОстаткиАвтомобилейОстатки.Автомобиль.СкидкаМаксимальная КАК СкидкаМаксимальная,
	|	ОстаткиАвтомобилейОстатки.Автомобиль.Цвет.ЦветАвтоРу КАК ЦветАвтоРу,
	|	ОстаткиАвтомобилейОстатки.Автомобиль.Цвет.ОкраскаМеталлик КАК ОкраскаМеталлик,
	|	ОстаткиАвтомобилейОстатки.Автомобиль.ВариантКомплектации.Руль КАК Руль,
	|	ОстаткиАвтомобилейОстатки.Автомобиль.ВариантКомплектации.КоличествоДверей КАК КоличествоДверей,
	|	ПробегиАвто.Значение КАК Пробег,
	|	ОстаткиАвтомобилейОстатки.Автомобиль.Состояние КАК Состояние,
	|	ОстаткиАвтомобилейОстатки.Автомобиль.КоличествоВладельцевПоПТС КАК КоличествоВладельцев,
	|	ОстаткиАвтомобилейОстатки.Автомобиль.ВариантКомплектации.ТипКузова.ТипКузоваАвтоРу КАК ТипКузоваВариантаКомплектации,
	|	ОстаткиАвтомобилейОстатки.Автомобиль.Модель.ТипКузова.ТипКузоваАвтоРу КАК ТипКузоваМодели
	|ИЗ
	|	РегистрНакопления.ОстаткиАвтомобилей.Остатки КАК ОстаткиАвтомобилейОстатки
	|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|			ЦеныАвтомобилейСрезПоследних.Цена КАК Цена,
	|			ЦеныАвтомобилейСрезПоследних.Автомобиль КАК Автомобиль,
	|			ЦеныАвтомобилейСрезПоследних.ВариантКомплектации КАК ВариантКомплектации,
	|			ЦеныАвтомобилейСрезПоследних.ТипЦен КАК ТипЦен
	|		ИЗ
	|			РегистрСведений.ЦеныАвтомобилей.СрезПоследних КАК ЦеныАвтомобилейСрезПоследних
	|		ГДЕ
	|			ЦеныАвтомобилейСрезПоследних.ТипЦен = ЗНАЧЕНИЕ(Справочник.ТипыЦен.ОсновнойТипЦенПродажи)) КАК ЦенаАвто
	|		ПО ОстаткиАвтомобилейОстатки.Автомобиль = ЦенаАвто.Автомобиль
	|			И ОстаткиАвтомобилейОстатки.Автомобиль.ВариантКомплектации = ЦенаАвто.Автомобиль.ВариантКомплектации
	|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|			АвтомобилиСрезПоследних.Автомобиль КАК Автомобиль,
	|			АвтомобилиСрезПоследних.ВидЗначения КАК ВидЗначения,
	|			АвтомобилиСрезПоследних.Значение КАК Значение
	|		ИЗ
	|			РегистрСведений.Автомобили.СрезПоследних КАК АвтомобилиСрезПоследних
	|		ГДЕ
	|			АвтомобилиСрезПоследних.ВидЗначения = ЗНАЧЕНИЕ(Перечисление.ДополнительнаяИнформацияАвтомобилей.ВидАвтомобиля)) КАК ХарАвто
	|		ПО ОстаткиАвтомобилейОстатки.Автомобиль = ХарАвто.Автомобиль
	|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|			АвтомобилиСрезПоследних.Автомобиль КАК Автомобиль,
	|			АвтомобилиСрезПоследних.ВидЗначения КАК ВидЗначения,
	|			АвтомобилиСрезПоследних.Значение КАК Значение
	|		ИЗ
	|			РегистрСведений.Автомобили.СрезПоследних КАК АвтомобилиСрезПоследних
	|		ГДЕ
	|			АвтомобилиСрезПоследних.ВидЗначения = ЗНАЧЕНИЕ(Перечисление.ДополнительнаяИнформацияАвтомобилей.Пробег)) КАК ПробегиАвто
	|		ПО ОстаткиАвтомобилейОстатки.Автомобиль = ПробегиАвто.Автомобиль
	|ГДЕ
	|	ОстаткиАвтомобилейОстатки.КоличествоОстаток > 0
	|	И ХарАвто.Значение = ЗНАЧЕНИЕ(Перечисление.ВидАвтомобиля.Новый)
	|	И ОстаткиАвтомобилейОстатки.СкладКомпании.Подразделение В(&СписокПодразделений)
	|
	|СГРУППИРОВАТЬ ПО
	|	ОстаткиАвтомобилейОстатки.Автомобиль,
	|	ОстаткиАвтомобилейОстатки.Автомобиль.VIN,
	|	ЦенаАвто.Цена,
	|	ХарАвто.Значение,
	|	ОстаткиАвтомобилейОстатки.СкладКомпании.Подразделение.ДилерскийЦентр,
	|	ОстаткиАвтомобилейОстатки.Автомобиль.Модель.МодельАвтоРу.МаркаАвтоРу,
	|	ОстаткиАвтомобилейОстатки.Автомобиль.Модель.МодельАвтоРу,
	|	ОстаткиАвтомобилейОстатки.Автомобиль.ВариантКомплектации.МодификацияАвтоРу,
	|	ОстаткиАвтомобилейОстатки.Автомобиль.СпециальнаяЦена,
	|	ОстаткиАвтомобилейОстатки.Автомобиль.СкидкаПриПокупкеВКредит,
	|	ОстаткиАвтомобилейОстатки.Автомобиль.СкидкаПриСтраховании,
	|	ОстаткиАвтомобилейОстатки.Автомобиль.СкидаПриПокупкеВТрейдИн,
	|	ОстаткиАвтомобилейОстатки.Автомобиль.СкидкаМаксимальная,
	|	ОстаткиАвтомобилейОстатки.Автомобиль.ВариантКомплектации.КомплектацияАвтоРу,
	|	ОстаткиАвтомобилейОстатки.Автомобиль.Цвет.ЦветАвтоРу,
	|	ОстаткиАвтомобилейОстатки.Автомобиль.Цвет.ОкраскаМеталлик,
	|	ОстаткиАвтомобилейОстатки.Автомобиль.ВариантКомплектации.Руль,
	|	ОстаткиАвтомобилейОстатки.Автомобиль.ВариантКомплектации.КоличествоДверей,
	|	ПробегиАвто.Значение,
	|	ОстаткиАвтомобилейОстатки.Автомобиль.Состояние,
	|	ОстаткиАвтомобилейОстатки.Автомобиль.КоличествоВладельцевПоПТС,
	|	ОстаткиАвтомобилейОстатки.Автомобиль.ВариантКомплектации.ТипКузова.ТипКузоваАвтоРу,
	|	ОстаткиАвтомобилейОстатки.СкладКомпании.Подразделение,
	|	ОстаткиАвтомобилейОстатки.Автомобиль.Модель.ТипКузова.ТипКузоваАвтоРу
	|
	|УПОРЯДОЧИТЬ ПО
	|	VIN");
	
	Запрос.УстановитьПараметр("СписокПодразделений",СписокПодразделений);
	
	ТЗ = Запрос.Выполнить().Выгрузить();
	
	//Бондаренко++ 20220424
	ТЗ = ДополнитьТаблицуЗаказамиПоставщику(ТЗ,СписокПодразделений); 
	//Бондаренко-- 20220424	
	
	СписокМарок = Новый СписокЗначений;
	
	XML=Новый ЗаписьXML();
	
	XML.УстановитьСтроку(Новый ПараметрыЗаписиXML("UTF-8","1.0",false));
	XML.ЗаписатьОбъявлениеXML();
	
	XML.ЗаписатьНачалоЭлемента("Ads");
	XML.ЗаписатьАтрибут("formatVersion","3");
	XML.ЗаписатьАтрибут("target","Avito.ru");
	
	Для каждого Стр1 Из ТЗ Цикл
		
		//Бондаренко++ 20220713
		Если НЕ Стр1.Автомобиль.ВыгружатьАвтомобильНаСайт Тогда
			Продолжить;	
		КонецЕсли; 
		//Бондаренко-- 20220713
		
		Если НЕ обЗначениеНеЗаполнено(Стр1.Подразделение) Тогда
			СписокМарок = ПолучитьСписокМарокАвто(Стр1.Подразделение);
			Если СписокМарок.НайтиПоЗначению(Стр1.Автомобиль.Модель.Марка) = Неопределено Тогда
				Продолжить;	
			КонецЕсли; 
		КонецЕсли; 
		
		//Бондаренко++ 20200707
		Если Стр1.Автомобиль.ПутьКФото.Количество() = 0 Тогда
			Продолжить;	
		КонецЕсли; 
		//Бондаренко++ 20200707	
		
		//Бондаренко++ 20201030
		Если СписокАвтоТестДрайва.НайтиПоЗначению(Стр1.Автомобиль) <> Неопределено Тогда
			Продолжить;
		КонецЕсли; 
		//Бондаренко-- 20201030 
		
		//Бондаренко++ 20220524
		Если ДополнительныйСписокМарок <> Неопределено Тогда
			Если ДополнительныйСписокМарок.НайтиПоЗначению(Стр1.Автомобиль.Модель.Марка) = Неопределено Тогда
				Продолжить;
			КонецЕсли; 
		КонецЕсли;
		//Бондаренко-- 20220524
		
		XML.ЗаписатьНачалоЭлемента("Ad");
		
		XML.ЗаписатьНачалоЭлемента("Id");                  XML.ЗаписатьТекст(Стр1.Автомобиль.VIN); XML.ЗаписатьКонецЭлемента();
		
		ТекущееПодразделение = Стр1.Подразделение;
		ПодразделениеАдрес = киПолучитьПредставлениеКИ(ТекущееПодразделение, Справочники.ВидыКонтактнойИнформации.АдресФактический);
		Если обЗначениеНеЗаполнено(ПодразделениеАдрес) Тогда
			ПодразделениеАдрес = киПолучитьПредставлениеКИ(ТекущееПодразделение, Справочники.ВидыКонтактнойИнформации.АдресПочтовый);
		КонецЕсли;
		
		XML.ЗаписатьНачалоЭлемента("Address");             XML.ЗаписатьТекст(ПодразделениеАдрес);                                                                XML.ЗаписатьКонецЭлемента();
		
		ТекстКлассифайда = СокрЛП(Стр1.Автомобиль.Модель.ТекстКлассифайда);
		Если обЗначениеНеЗаполнено(ТекстКлассифайда) Тогда
			ТекстКлассифайда = СокрЛП(Стр1.Подразделение.ТекстКлассифайда);
			Если обЗначениеНеЗаполнено(ТекстКлассифайда) Тогда
				Попытка ТекстКлассифайда = СокрЛП(Стр1.Подразделение.Родитель.ТекстКлассифайда); Исключение	КонецПопытки;  
				Если обЗначениеНеЗаполнено(ТекстКлассифайда) Тогда
					Попытка ТекстКлассифайда = СокрЛП(Стр1.Подразделение.Родитель.Родитель.ТекстКлассифайда); Исключение	КонецПопытки;  
				КонецЕсли; 		
			КонецЕсли; 
		КонецЕсли; 
		
		XML.ЗаписатьНачалоЭлемента("Description");         XML.ЗаписатьТекст(ТекстКлассифайда);                                                                  XML.ЗаписатьКонецЭлемента();	 //Description
		
		XML.ЗаписатьНачалоЭлемента("Category");            XML.ЗаписатьТекст("Автомобили");                                                                      XML.ЗаписатьКонецЭлемента();	 //Category
		XML.ЗаписатьНачалоЭлемента("CarType");             XML.ЗаписатьТекст("Новые");                                                                           XML.ЗаписатьКонецЭлемента();	 //CarType
		
		XML.ЗаписатьНачалоЭлемента("Price");               XML.ЗаписатьТекст(СокрЛП(СтрЗаменить(Стр1.Цена,Символы.НПП,"")));                                XML.ЗаписатьКонецЭлемента(); 
		
		Если НЕ обЗначениеНезаполнено(Стр1.СкидкаПриПокупкеВКредит) Тогда
			XML.ЗаписатьНачалоЭлемента("CreditDiscount");     XML.ЗаписатьТекст(СокрЛП(СтрЗаменить(Стр1.СкидкаПриПокупкеВКредит,Символы.НПП,"")));                   XML.ЗаписатьКонецЭлемента(); 
		КонецЕсли; 
		
		Если НЕ обЗначениеНезаполнено(Стр1.СкидкаПриСтраховании) Тогда
			XML.ЗаписатьНачалоЭлемента("InsuranceDiscount");  XML.ЗаписатьТекст(СокрЛП(СтрЗаменить(Стр1.СкидкаПриСтраховании,Символы.НПП,"")));                      XML.ЗаписатьКонецЭлемента();  
		КонецЕсли; 
		
		Если НЕ обЗначениеНезаполнено(Стр1.СкидаПриПокупкеВТрейдИн) Тогда
			XML.ЗаписатьНачалоЭлемента("TradeinDiscount");    XML.ЗаписатьТекст(СокрЛП(СтрЗаменить(Стр1.СкидаПриПокупкеВТрейдИн,Символы.НПП,"")));                   XML.ЗаписатьКонецЭлемента();  
		КонецЕсли; 
		
		Если НЕ обЗначениеНезаполнено(Стр1.СкидкаМаксимальная) Тогда
			XML.ЗаписатьНачалоЭлемента("MaxDiscount");        XML.ЗаписатьТекст(СокрЛП(СтрЗаменить(Стр1.СкидкаМаксимальная,Символы.НПП,"")));                        XML.ЗаписатьКонецЭлемента(); 
		КонецЕсли; 
		
		XML.ЗаписатьНачалоЭлемента("Make");                    XML.ЗаписатьТекст(Стр1.Автомобиль.Модель.Марка.МаркаАвито.Наименование);                              XML.ЗаписатьКонецЭлемента();
		XML.ЗаписатьНачалоЭлемента("Model");                   XML.ЗаписатьТекст(Стр1.Автомобиль.Модель.МодельАвито.Наименование);                                   XML.ЗаписатьКонецЭлемента();
		XML.ЗаписатьНачалоЭлемента("Year");                    XML.ЗаписатьТекст(Формат(Стр1.Автомобиль.ГодВыпуска,"ДФ=yyyy"));                                      XML.ЗаписатьКонецЭлемента();
		XML.ЗаписатьНачалоЭлемента("VIN");                     XML.ЗаписатьТекст(Стр1.Автомобиль.VIN);                                                               XML.ЗаписатьКонецЭлемента();
		XML.ЗаписатьНачалоЭлемента("BodyType");                XML.ЗаписатьТекст(СокрЛП(Стр1.Автомобиль.ВариантКомплектации.ТипКузова.ТипКузоваАвито));              XML.ЗаписатьКонецЭлемента();
		XML.ЗаписатьНачалоЭлемента("Doors");                   XML.ЗаписатьТекст(СокрЛП(Стр1.Автомобиль.ВариантКомплектации.КоличествоДверей));                      XML.ЗаписатьКонецЭлемента();
		XML.ЗаписатьНачалоЭлемента("ModificationId");          XML.ЗаписатьТекст(Стр1.Автомобиль.ВариантКомплектации.МодификацияАвито.Артикул);                      XML.ЗаписатьКонецЭлемента();
		XML.ЗаписатьНачалоЭлемента("GenerationId");            XML.ЗаписатьТекст(Стр1.Автомобиль.Модель.ГенерацияАвито.Артикул);                                     XML.ЗаписатьКонецЭлемента();
		XML.ЗаписатьНачалоЭлемента("ComplectationId");         XML.ЗаписатьТекст(Стр1.Автомобиль.ВариантКомплектации.КомплектацияАвито.Артикул);                     XML.ЗаписатьКонецЭлемента();	
		XML.ЗаписатьНачалоЭлемента("Color");                   XML.ЗаписатьТекст(СокрЛП(Стр1.ЦветАвтоРу));                                                           XML.ЗаписатьКонецЭлемента();
		
		ТипТоплива = Стр1.Автомобиль.ВариантКомплектации.ТипДвигателя.ТипТоплива;
		Если ТипТоплива = Перечисления.ТипыТоплива.LiquefiedGas ИЛИ ТипТоплива = Перечисления.ТипыТоплива.PressureGas Тогда
			XML.ЗаписатьНачалоЭлемента("FuelType");            XML.ЗаписатьТекст("Газ");                                                                             XML.ЗаписатьКонецЭлемента();
		Иначе
			XML.ЗаписатьНачалоЭлемента("FuelType");            XML.ЗаписатьТекст(СокрЛП(ТипТоплива));                                                                     XML.ЗаписатьКонецЭлемента();	
		КонецЕсли; 
		
		EngineSize_str =  СтрЗаменить(СокрЛП(Стр1.Автомобиль.ОбъемДвигателя*1000),Символы.НПП,"");
		Если НЕ обЗначениеНеЗаполнено(EngineSize_str) Тогда
			XML.ЗаписатьНачалоЭлемента("EngineSize");          XML.ЗаписатьТекст(EngineSize_str);                                                                    XML.ЗаписатьКонецЭлемента();
		КонецЕсли;
		
		Power_str =  СтрЗаменить(СокрЛП(Стр1.Автомобиль.МощностьДвигателя),Символы.НПП,"");
		Если НЕ обЗначениеНеЗаполнено(Power_str) Тогда
			XML.ЗаписатьНачалоЭлемента("Power");               XML.ЗаписатьТекст(Power_str);                                                                         XML.ЗаписатьКонецЭлемента();
		КонецЕсли;
		
		Transmission_str = СокрЛП(Стр1.Автомобиль.ВариантКомплектации.ТипКПП.Наименование); 
		Если НЕ обЗначениеНеЗаполнено(Transmission_str) Тогда
			XML.ЗаписатьНачалоЭлемента("Transmission");        XML.ЗаписатьТекст(Transmission_str);                                                                  XML.ЗаписатьКонецЭлемента();
		КонецЕсли;
		
		DriveType_ = Стр1.Автомобиль.Привод;
		Если DriveType_= Перечисления.Привод.Передний Или DriveType_= Перечисления.Привод.Задний ИЛИ DriveType_= Перечисления.Привод.Полный Тогда
			DriveType_str = СокрЛП(DriveType_);    
		Иначе 
			DriveType_str =  "Полный";
		КонецЕсли;	
		Если НЕ обЗначениеНеЗаполнено(DriveType_str) Тогда
			XML.ЗаписатьНачалоЭлемента("DriveType");            XML.ЗаписатьТекст(DriveType_str);                                                                    XML.ЗаписатьКонецЭлемента();
		КонецЕсли;
		
		WheelType_str = СокрЛП(Стр1.Автомобиль.Руль);
		WheelType_str = Врег(Сред(WheelType_str,1,1))+Сред(WheelType_str,2);
		Если НЕ обЗначениеНеЗаполнено(WheelType_str) Тогда
			XML.ЗаписатьНачалоЭлемента("WheelType");            XML.ЗаписатьТекст(WheelType_str);                                                                    XML.ЗаписатьКонецЭлемента();
		КонецЕсли;
		
		XML.ЗаписатьНачалоЭлемента("Images");
		Для каждого СтрТЧ Из Стр1.Автомобиль.ПутьКФото Цикл
			XML.ЗаписатьНачалоЭлемента("Image");
			//Бондаренко++ 20220303
			//XML.ЗаписатьАтрибут("url",HTTPRequestas.БазовыйURL+"/photo/"+Стр1.Автомобиль.VIN+"/"+СтрТЧ.НомерСтроки+".jpg");
			XML.ЗаписатьАтрибут("url",HTTPRequestas.БазовыйURL+"/photo/"+Стр1.Автомобиль.УникальныйИдентификатор()+"/"+СтрТЧ.GUID+".jpg");
			//Бондаренко-- 20220303
			XML.ЗаписатьКонецЭлемента();
		КонецЦикла; 
		XML.ЗаписатьКонецЭлемента(); //Images	
		
		//Бондаренко++ 20220929                    
		ВидеоДляСайта = "";
		ВидеоДляСайта = СМ_ВыгрузкаОбъявленийОПродажеАвто.СМГ_СправочникВернутьЗначениеРеквизита("СсылкаНаВидео",Стр1.Автомобиль.ПолучитьОбъект());
		ВидеоДляСайта = СтрЗаменить(ВидеоДляСайта,"https://youtu.be/","https://www.youtube.com/watch?v=");		
		//Бондаренко-- 20220929		

		Если НЕ обЗначениеНеЗаполнено(ВидеоДляСайта) Тогда
 			XML.ЗаписатьНачалоЭлемента("VideoURL");     XML.ЗаписатьТекст(ВидеоДляСайта);                	                                                         XML.ЗаписатьКонецЭлемента(); 		
		КонецЕсли; 
		
		XML.ЗаписатьКонецЭлемента(); //Ad
		
	КонецЦикла; 
	
	XML.ЗаписатьКонецЭлемента();     //Ads
	
	XMLТекст = XML.Закрыть();
	
	Возврат XMLТекст;
	
КонецФункции

Функция ПолучитьXMLОбъявленийAutoruNew(СписокПодразделений, ДополнительныйСписокМарок, HTTPRequest) Экспорт
	
	//Бондаренко++ 20201030
	СписокАвтоТестДрайва = ПолучитьАвтомобилиДляТестДрайва();
	//Бондаренко-- 20201030
	
	ТЗ = Новый ТаблицаЗначений;
	
	Запрос = Новый Запрос;
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ОстаткиАвтомобилейОстатки.Автомобиль,
	|	ОстаткиАвтомобилейОстатки.Автомобиль.VIN КАК VIN,
	|	СУММА(ОстаткиАвтомобилейОстатки.КоличествоОстаток) КАК Остаток,
	|	ЦенаАвто.Цена + ЦенаАвто.Автомобиль.СтоимостьДопОборудования КАК Цена,
	|	ХарАвто.Значение КАК ВидАвто,
	|	ОстаткиАвтомобилейОстатки.СкладКомпании.Подразделение КАК Подразделение,
	|	ОстаткиАвтомобилейОстатки.СкладКомпании.Подразделение.ДилерскийЦентр КАК ДилерскийЦентр,
	|	ОстаткиАвтомобилейОстатки.Автомобиль.Модель.МодельАвтоРу.МаркаАвтоРу КАК МаркаАвтоРу,
	|	ОстаткиАвтомобилейОстатки.Автомобиль.Модель.МодельАвтоРу КАК МодельАвтоРу,
	|	ОстаткиАвтомобилейОстатки.Автомобиль.ВариантКомплектации.МодификацияАвтоРу КАК МодификацияАвтоРу,
	|	ОстаткиАвтомобилейОстатки.Автомобиль.ВариантКомплектации.КомплектацияАвтоРу КАК КомплектацияАвтоРу,
	|	ОстаткиАвтомобилейОстатки.Автомобиль.СпециальнаяЦена КАК СпециальнаяЦена,
	|	ОстаткиАвтомобилейОстатки.Автомобиль.СкидкаПриПокупкеВКредит КАК СкидкаПриПокупкеВКредит,
	|	ОстаткиАвтомобилейОстатки.Автомобиль.СкидкаПриСтраховании КАК СкидкаПриСтраховании,
	|	ОстаткиАвтомобилейОстатки.Автомобиль.СкидаПриПокупкеВТрейдИн КАК СкидаПриПокупкеВТрейдИн,
	|	ОстаткиАвтомобилейОстатки.Автомобиль.СкидкаМаксимальная КАК СкидкаМаксимальная,
	|	ОстаткиАвтомобилейОстатки.Автомобиль.Цвет.ЦветАвтоРу КАК ЦветАвтоРу,
	|	ОстаткиАвтомобилейОстатки.Автомобиль.Цвет.ОкраскаМеталлик КАК ОкраскаМеталлик,
	|	ОстаткиАвтомобилейОстатки.Автомобиль.ВариантКомплектации.Руль КАК Руль,
	|	ОстаткиАвтомобилейОстатки.Автомобиль.ВариантКомплектации.КоличествоДверей КАК КоличествоДверей,
	|	ОстаткиАвтомобилейОстатки.Автомобиль.Модель.КатегорияТС,
	|	ПробегиАвто.Значение КАК Пробег,
	|	ОстаткиАвтомобилейОстатки.Автомобиль.Состояние КАК Состояние,
	|	ОстаткиАвтомобилейОстатки.Автомобиль.КоличествоВладельцевПоПТС КАК КоличествоВладельцев,
	|	ОстаткиАвтомобилейОстатки.Автомобиль.ВариантКомплектации.ТипКузова.ТипКузоваАвтоРу КАК ТипКузоваВариантаКомплектации,
	|	ОстаткиАвтомобилейОстатки.Автомобиль.Модель.ТипКузова.ТипКузоваАвтоРу КАК ТипКузоваМодели,
	|	""                    "" КАК ВнешнийНомерЗаказа
	|ИЗ
	|	РегистрНакопления.ОстаткиАвтомобилей.Остатки КАК ОстаткиАвтомобилейОстатки
	|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|			ЦеныАвтомобилейСрезПоследних.Цена КАК Цена,
	|			ЦеныАвтомобилейСрезПоследних.Автомобиль КАК Автомобиль,
	|			ЦеныАвтомобилейСрезПоследних.ВариантКомплектации КАК ВариантКомплектации,
	|			ЦеныАвтомобилейСрезПоследних.ТипЦен КАК ТипЦен
	|		ИЗ
	|			РегистрСведений.ЦеныАвтомобилей.СрезПоследних КАК ЦеныАвтомобилейСрезПоследних
	|		ГДЕ
	|			ЦеныАвтомобилейСрезПоследних.ТипЦен = ЗНАЧЕНИЕ(Справочник.ТипыЦен.ОсновнойТипЦенПродажи)) КАК ЦенаАвто
	|		ПО ОстаткиАвтомобилейОстатки.Автомобиль = ЦенаАвто.Автомобиль
	|			И ОстаткиАвтомобилейОстатки.Автомобиль.ВариантКомплектации = ЦенаАвто.Автомобиль.ВариантКомплектации
	|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|			АвтомобилиСрезПоследних.Автомобиль КАК Автомобиль,
	|			АвтомобилиСрезПоследних.ВидЗначения КАК ВидЗначения,
	|			АвтомобилиСрезПоследних.Значение КАК Значение
	|		ИЗ
	|			РегистрСведений.Автомобили.СрезПоследних КАК АвтомобилиСрезПоследних
	|		ГДЕ
	|			АвтомобилиСрезПоследних.ВидЗначения = ЗНАЧЕНИЕ(Перечисление.ДополнительнаяИнформацияАвтомобилей.ВидАвтомобиля)) КАК ХарАвто
	|		ПО ОстаткиАвтомобилейОстатки.Автомобиль = ХарАвто.Автомобиль
	|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|			АвтомобилиСрезПоследних.Автомобиль КАК Автомобиль,
	|			АвтомобилиСрезПоследних.ВидЗначения КАК ВидЗначения,
	|			АвтомобилиСрезПоследних.Значение КАК Значение
	|		ИЗ
	|			РегистрСведений.Автомобили.СрезПоследних КАК АвтомобилиСрезПоследних
	|		ГДЕ
	|			АвтомобилиСрезПоследних.ВидЗначения = ЗНАЧЕНИЕ(Перечисление.ДополнительнаяИнформацияАвтомобилей.Пробег)) КАК ПробегиАвто
	|		ПО ОстаткиАвтомобилейОстатки.Автомобиль = ПробегиАвто.Автомобиль
	|ГДЕ
	|	ОстаткиАвтомобилейОстатки.КоличествоОстаток > 0
	|	И ХарАвто.Значение = ЗНАЧЕНИЕ(Перечисление.ВидАвтомобиля.Новый)
	|	И ОстаткиАвтомобилейОстатки.СкладКомпании.Подразделение В(&СписокПодразделений)
	|	И ОстаткиАвтомобилейОстатки.Автомобиль.Модель.КатегорияТС = ЗНАЧЕНИЕ(Справочник.КатегорииТранспортныхСредств.АвтомобилиЛегковые)
	|
	|СГРУППИРОВАТЬ ПО
	|	ОстаткиАвтомобилейОстатки.Автомобиль,
	|	ОстаткиАвтомобилейОстатки.Автомобиль.VIN,
	|	ХарАвто.Значение,
	|	ОстаткиАвтомобилейОстатки.СкладКомпании.Подразделение.ДилерскийЦентр,
	|	ОстаткиАвтомобилейОстатки.Автомобиль.Модель.МодельАвтоРу.МаркаАвтоРу,
	|	ОстаткиАвтомобилейОстатки.Автомобиль.Модель.МодельАвтоРу,
	|	ОстаткиАвтомобилейОстатки.Автомобиль.ВариантКомплектации.МодификацияАвтоРу,
	|	ОстаткиАвтомобилейОстатки.Автомобиль.СпециальнаяЦена,
	|	ОстаткиАвтомобилейОстатки.Автомобиль.СкидкаПриПокупкеВКредит,
	|	ОстаткиАвтомобилейОстатки.Автомобиль.СкидкаПриСтраховании,
	|	ОстаткиАвтомобилейОстатки.Автомобиль.СкидаПриПокупкеВТрейдИн,
	|	ОстаткиАвтомобилейОстатки.Автомобиль.СкидкаМаксимальная,
	|	ОстаткиАвтомобилейОстатки.Автомобиль.ВариантКомплектации.КомплектацияАвтоРу,
	|	ОстаткиАвтомобилейОстатки.Автомобиль.Цвет.ЦветАвтоРу,
	|	ОстаткиАвтомобилейОстатки.Автомобиль.Цвет.ОкраскаМеталлик,
	|	ОстаткиАвтомобилейОстатки.Автомобиль.ВариантКомплектации.Руль,
	|	ОстаткиАвтомобилейОстатки.Автомобиль.ВариантКомплектации.КоличествоДверей,
	|	ПробегиАвто.Значение,
	|	ОстаткиАвтомобилейОстатки.Автомобиль.Состояние,
	|	ОстаткиАвтомобилейОстатки.Автомобиль.КоличествоВладельцевПоПТС,
	|	ОстаткиАвтомобилейОстатки.Автомобиль.ВариантКомплектации.ТипКузова.ТипКузоваАвтоРу,
	|	ОстаткиАвтомобилейОстатки.СкладКомпании.Подразделение,
	|	ОстаткиАвтомобилейОстатки.Автомобиль.Модель.ТипКузова.ТипКузоваАвтоРу,
	|	ОстаткиАвтомобилейОстатки.Автомобиль.Модель.КатегорияТС,
	|	ЦенаАвто.Цена + ЦенаАвто.Автомобиль.СтоимостьДопОборудования
	|
	|УПОРЯДОЧИТЬ ПО
	|	VIN";
	
	Запрос.УстановитьПараметр("СписокПодразделений",СписокПодразделений);
	
	ТЗ = Запрос.Выполнить().Выгрузить(); 
	
	//Бондаренко++ 20220424
	ТЗ = ДополнитьТаблицуЗаказамиПоставщику(ТЗ,СписокПодразделений); 
	//Бондаренко-- 20220424	
	
	СписокМарок = Новый СписокЗначений;
	
	XML=Новый ЗаписьXML();
	
	XML.УстановитьСтроку(Новый ПараметрыЗаписиXML("UTF-8","1.0",false));
	XML.ЗаписатьОбъявлениеXML();
	
	XML.ЗаписатьНачалоЭлемента("Data");
	
	XML.ЗаписатьНачалоЭлемента("Cars");
	
	Для каждого Стр1 Из ТЗ Цикл
		
  		//Бондаренко++ 20220713
		Если НЕ Стр1.Автомобиль.ВыгружатьАвтомобильНаСайт Тогда
			Продолжить;	
		КонецЕсли; 
		//Бондаренко-- 20220713
		
		Если НЕ обЗначениеНеЗаполнено(Стр1.Подразделение) Тогда
			СписокМарок = ПолучитьСписокМарокАвто(Стр1.Подразделение);
			Если СписокМарок.НайтиПоЗначению(Стр1.Автомобиль.Модель.Марка) = Неопределено Тогда
				Продолжить;	
			КонецЕсли; 
		КонецЕсли; 
		
		//Бондаренко++ 20201030
		Если СписокАвтоТестДрайва.НайтиПоЗначению(Стр1.Автомобиль) <> Неопределено Тогда
			Продолжить;
		КонецЕсли; 
		//Бондаренко-- 20201030
		
		//Бондаренко++ 20220524        
		Если ДополнительныйСписокМарок <> Неопределено Тогда
			Если ДополнительныйСписокМарок.НайтиПоЗначению(Стр1.Автомобиль.Модель.Марка) = Неопределено Тогда
				Продолжить;
			КонецЕсли; 
		КонецЕсли;
		//Бондаренко-- 20220524
		
		XML.ЗаписатьНачалоЭлемента("car");
		XML.ЗаписатьНачалоЭлемента("mark_id");             XML.ЗаписатьТекст(Стр1.Автомобиль.Модель.Марка.МаркаАвтоРу.Наименование);                              XML.ЗаписатьКонецЭлемента();
		XML.ЗаписатьНачалоЭлемента("folder_id");           XML.ЗаписатьТекст(Стр1.Автомобиль.Модель.МодельАвтоРу.Наименование);                                   XML.ЗаписатьКонецЭлемента();
		XML.ЗаписатьНачалоЭлемента("modification_id");     XML.ЗаписатьТекст(Стр1.Автомобиль.ВариантКомплектации.МодификацияАвтоРу.Наименование);                 XML.ЗаписатьКонецЭлемента();
		XML.ЗаписатьНачалоЭлемента("complectation_name");  XML.ЗаписатьТекст(Стр1.Автомобиль.ВариантКомплектации.КомплектацияАвтоРу.Наименование);                XML.ЗаписатьКонецЭлемента();
		
		Если НЕ обЗначениеНеЗаполнено(Стр1.Автомобиль.ВариантКомплектации.ТипКузова.ТипКузоваАвтоРу) Тогда
			XML.ЗаписатьНачалоЭлемента("body_type");       XML.ЗаписатьТекст(СокрЛП(Стр1.Автомобиль.ВариантКомплектации.ТипКузова.ТипКузоваАвтоРу)); XML.ЗаписатьКонецЭлемента();
		ИначеЕсли НЕ обЗначениеНеЗаполнено(Стр1.Автомобиль.Модель.ТипКузова.ТипКузоваАвтоРу) Тогда
			XML.ЗаписатьНачалоЭлемента("body_type");       XML.ЗаписатьТекст(СокрЛП(Стр1.Автомобиль.Модель.ТипКузова.ТипКузоваАвтоРу));              XML.ЗаписатьКонецЭлемента();
		КонецЕсли; 
		
		XML.ЗаписатьНачалоЭлемента("wheel");               XML.ЗаписатьТекст(СокрЛП(Стр1.Руль));                                                                  XML.ЗаписатьКонецЭлемента();
		XML.ЗаписатьНачалоЭлемента("color");               XML.ЗаписатьТекст(СокрЛП(Стр1.ЦветАвтоРу));                                                            XML.ЗаписатьКонецЭлемента();
		XML.ЗаписатьНачалоЭлемента("metallic");            XML.ЗаписатьТекст(СокрЛП(Нрег(Стр1.Автомобиль.Цвет.ОкраскаМеталлик)));                                 XML.ЗаписатьКонецЭлемента();
		XML.ЗаписатьНачалоЭлемента("availability");        XML.ЗаписатьТекст("В наличии");                                                                        XML.ЗаписатьКонецЭлемента();
		XML.ЗаписатьНачалоЭлемента("custom");              XML.ЗаписатьТекст("Растаможен");                                                                       XML.ЗаписатьКонецЭлемента();
		XML.ЗаписатьНачалоЭлемента("state");               XML.ЗаписатьТекст(СокрЛП(Стр1.Состояние));                                                             XML.ЗаписатьКонецЭлемента();
		XML.ЗаписатьНачалоЭлемента("owners_number");       XML.ЗаписатьТекст("Не было владельцев");                                                               XML.ЗаписатьКонецЭлемента();
		//XML.ЗаписатьНачалоЭлемента("run");               XML.ЗаписатьТекст(СокрЛП(Стр1.Пробег));                                                                XML.ЗаписатьКонецЭлемента();
		XML.ЗаписатьНачалоЭлемента("run");                 XML.ЗаписатьТекст("0");                                                                                XML.ЗаписатьКонецЭлемента();
		XML.ЗаписатьНачалоЭлемента("year");                XML.ЗаписатьТекст(Формат(Стр1.Автомобиль.ГодВыпуска,"ДФ=yyyy"));                                       XML.ЗаписатьКонецЭлемента();
		//XML.ЗаписатьНачалоЭлемента("registry_year");     XML.ЗаписатьТекст(Формат(Стр1.Автомобиль.ГодВыпуска,"ДФ=yyyy"));                                       XML.ЗаписатьКонецЭлемента();
		XML.ЗаписатьНачалоЭлемента("doors_count");         XML.ЗаписатьТекст(СокрЛП(Стр1.КоличествоДверей));                                                      XML.ЗаписатьКонецЭлемента();
		XML.ЗаписатьНачалоЭлемента("currency");            XML.ЗаписатьТекст("RUR");                                                                              XML.ЗаписатьКонецЭлемента();
		XML.ЗаписатьНачалоЭлемента("vin");                 XML.ЗаписатьТекст(Стр1.Автомобиль.VIN);                                                                XML.ЗаписатьКонецЭлемента();
		
		XML.ЗаписатьНачалоЭлемента("price");                 XML.ЗаписатьТекст(СокрЛП(СтрЗаменить(Стр1.Цена,Символы.НПП,"")));                                    XML.ЗаписатьКонецЭлемента(); 
		
		XML.ЗаписатьНачалоЭлемента("online_view_available"); XML.ЗаписатьТекст("true");                                                                          XML.ЗаписатьКонецЭлемента(); 
		XML.ЗаписатьНачалоЭлемента("booking_allowed");       XML.ЗаписатьТекст("true");                                                                          XML.ЗаписатьКонецЭлемента(); 
		
		XML.ЗаписатьНачалоЭлемента("special_price");       XML.ЗаписатьТекст(СокрЛП(СтрЗаменить(Стр1.СпециальнаяЦена,Символы.НПП,"")));                         XML.ЗаписатьКонецЭлемента(); 
		XML.ЗаписатьНачалоЭлемента("credit_discount");     XML.ЗаписатьТекст(СокрЛП(СтрЗаменить(Стр1.СкидкаПриПокупкеВКредит,Символы.НПП,"")));                 XML.ЗаписатьКонецЭлемента(); 
		XML.ЗаписатьНачалоЭлемента("insurance_discount");  XML.ЗаписатьТекст(СокрЛП(СтрЗаменить(Стр1.СкидкаПриСтраховании,Символы.НПП,"")));                    XML.ЗаписатьКонецЭлемента();  
		XML.ЗаписатьНачалоЭлемента("tradein_discount");    XML.ЗаписатьТекст(СокрЛП(СтрЗаменить(Стр1.СкидаПриПокупкеВТрейдИн,Символы.НПП,"")));                 XML.ЗаписатьКонецЭлемента();  
		XML.ЗаписатьНачалоЭлемента("max_discount");        XML.ЗаписатьТекст(СокрЛП(СтрЗаменить(Стр1.СкидкаМаксимальная,Символы.НПП,"")));                      XML.ЗаписатьКонецЭлемента(); 
		
		Если Стр1.Автомобиль.ПутьКФото.Количество() > 0 Тогда
			XML.ЗаписатьНачалоЭлемента("images");
			Для каждого СтрТЧ Из Стр1.Автомобиль.ПутьКФото Цикл
				XML.ЗаписатьНачалоЭлемента("image"); 
				//Бондаренко++ 20220303
				//XML.ЗаписатьТекст(HTTPRequest.БазовыйURL+"/photo/"+Стр1.Автомобиль.VIN+"/"+СтрТЧ.НомерСтроки+".jpg");
				XML.ЗаписатьТекст(HTTPRequest.БазовыйURL+"/photo/"+Стр1.Автомобиль.УникальныйИдентификатор()+"/"+СтрТЧ.GUID+".jpg");
				//Бондаренко-- 20220303
				XML.ЗаписатьКонецЭлемента(); //url	
			КонецЦикла; 
			XML.ЗаписатьКонецЭлемента(); //images	
		КонецЕсли; 
		
		XML.ЗаписатьНачалоЭлемента("unique_id");           XML.ЗаписатьТекст(Стр1.ВнешнийНомерЗаказа);                                                   XML.ЗаписатьКонецЭлемента();

		//Бондаренко++ 20220929                    
		ВидеоДляСайта = "";
		ВидеоДляСайта = СМ_ВыгрузкаОбъявленийОПродажеАвто.СМГ_СправочникВернутьЗначениеРеквизита("СсылкаНаВидео",Стр1.Автомобиль.ПолучитьОбъект());
		ВидеоДляСайта = СтрЗаменить(ВидеоДляСайта,"https://youtu.be/","https://www.youtube.com/watch?v=");		
		//Бондаренко-- 20220929		
		
		Если НЕ обЗначениеНеЗаполнено(ВидеоДляСайта) Тогда
			XML.ЗаписатьНачалоЭлемента("video");     XML.ЗаписатьТекст(ВидеоДляСайта); 	                                                          XML.ЗаписатьКонецЭлемента(); 		
		КонецЕсли; 
		
		ТекстКлассифайда = СокрЛП(Стр1.Автомобиль.Модель.ТекстКлассифайда);
		Если обЗначениеНеЗаполнено(ТекстКлассифайда) Тогда
			ТекстКлассифайда = СокрЛП(Стр1.Подразделение.ТекстКлассифайда);
			Если обЗначениеНеЗаполнено(ТекстКлассифайда) Тогда
				ТекстКлассифайда = СокрЛП(Стр1.Подразделение.Родитель.ТекстКлассифайда);
			КонецЕсли; 
		КонецЕсли; 
		
		XML.ЗаписатьНачалоЭлемента("description");   XML.ЗаписатьТекст(ТекстКлассифайда);                                                                         XML.ЗаписатьКонецЭлемента();	 //comment
		
		XML.ЗаписатьКонецЭлемента(); //Car
		
	КонецЦикла; 
	
	XML.ЗаписатьКонецЭлемента();	 //Cars
	
	XML.ЗаписатьКонецЭлемента();         //Data
	
	XMLТекст = XML.Закрыть();
	
	Возврат XMLТекст;
	
КонецФункции

Функция ПолучитьXMLОбъявленийAutoruLCV(СписокПодразделений, ДополнительныйСписокМарок, HTTPRequest) Экспорт
	
	//Бондаренко++ 20201030
	СписокАвтоТестДрайва = ПолучитьАвтомобилиДляТестДрайва();
	//Бондаренко-- 20201030
	
	ТЗ = Новый ТаблицаЗначений;
	
	Запрос = Новый Запрос;
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ОстаткиАвтомобилейОстатки.Автомобиль,
	|	ОстаткиАвтомобилейОстатки.Автомобиль.VIN КАК VIN,
	|	СУММА(ОстаткиАвтомобилейОстатки.КоличествоОстаток) КАК Остаток,
	|	ЦенаАвто.Цена + ЦенаАвто.Автомобиль.СтоимостьДопОборудования КАК Цена,
	|	ХарАвто.Значение КАК ВидАвто,
	|	ОстаткиАвтомобилейОстатки.СкладКомпании.Подразделение КАК Подразделение,
	|	ОстаткиАвтомобилейОстатки.СкладКомпании.Подразделение.ДилерскийЦентр КАК ДилерскийЦентр,
	|	ОстаткиАвтомобилейОстатки.Автомобиль.Модель.МодельАвтоРу.МаркаАвтоРу КАК МаркаАвтоРу,
	|	ОстаткиАвтомобилейОстатки.Автомобиль.Модель.МодельАвтоРу КАК МодельАвтоРу,
	|	ОстаткиАвтомобилейОстатки.Автомобиль.ВариантКомплектации.МодификацияАвтоРу КАК МодификацияАвтоРу,
	|	ОстаткиАвтомобилейОстатки.Автомобиль.ВариантКомплектации.КомплектацияАвтоРу КАК КомплектацияАвтоРу,
	|	ОстаткиАвтомобилейОстатки.Автомобиль.СпециальнаяЦена КАК СпециальнаяЦена,
	|	ОстаткиАвтомобилейОстатки.Автомобиль.СкидкаПриПокупкеВКредит КАК СкидкаПриПокупкеВКредит,
	|	ОстаткиАвтомобилейОстатки.Автомобиль.СкидкаПриСтраховании КАК СкидкаПриСтраховании,
	|	ОстаткиАвтомобилейОстатки.Автомобиль.СкидаПриПокупкеВТрейдИн КАК СкидаПриПокупкеВТрейдИн,
	|	ОстаткиАвтомобилейОстатки.Автомобиль.СкидкаМаксимальная КАК СкидкаМаксимальная,
	|	ОстаткиАвтомобилейОстатки.Автомобиль.Цвет.ЦветАвтоРу КАК ЦветАвтоРу,
	|	ОстаткиАвтомобилейОстатки.Автомобиль.Цвет.ОкраскаМеталлик КАК ОкраскаМеталлик,
	|	ПробегиАвто.Значение КАК Пробег,
	|	ОстаткиАвтомобилейОстатки.Автомобиль.Состояние КАК Состояние,
	|	ОстаткиАвтомобилейОстатки.Автомобиль.КоличествоВладельцевПоПТС КАК КоличествоВладельцев,
	|	ОстаткиАвтомобилейОстатки.Автомобиль.ВариантКомплектации.ТипКузова.ТипКузоваАвтоРу КАК ТипКузоваВариантаКомплектации,
	|	ОстаткиАвтомобилейОстатки.Автомобиль.Модель.ТипКузова.ТипКузоваАвтоРу КАК ТипКузоваМодели,
	|	ОстаткиАвтомобилейОстатки.Автомобиль.Модель.КатегорияТС,
	|	ГОД(ОстаткиАвтомобилейОстатки.Партия.Дата) КАК ГодДокаПоступленияАвто,
	|	ОстаткиАвтомобилейОстатки.Партия.Номер КАК НомерДокаПоступленияАвто
	|ИЗ
	|	РегистрНакопления.ОстаткиАвтомобилей.Остатки КАК ОстаткиАвтомобилейОстатки
	|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|			ЦеныАвтомобилейСрезПоследних.Цена КАК Цена,
	|			ЦеныАвтомобилейСрезПоследних.Автомобиль КАК Автомобиль,
	|			ЦеныАвтомобилейСрезПоследних.ВариантКомплектации КАК ВариантКомплектации,
	|			ЦеныАвтомобилейСрезПоследних.ТипЦен КАК ТипЦен
	|		ИЗ
	|			РегистрСведений.ЦеныАвтомобилей.СрезПоследних КАК ЦеныАвтомобилейСрезПоследних
	|		ГДЕ
	|			ЦеныАвтомобилейСрезПоследних.ТипЦен = ЗНАЧЕНИЕ(Справочник.ТипыЦен.ОсновнойТипЦенПродажи)) КАК ЦенаАвто
	|		ПО ОстаткиАвтомобилейОстатки.Автомобиль = ЦенаАвто.Автомобиль
	|			И ОстаткиАвтомобилейОстатки.Автомобиль.ВариантКомплектации = ЦенаАвто.Автомобиль.ВариантКомплектации
	|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|			АвтомобилиСрезПоследних.Автомобиль КАК Автомобиль,
	|			АвтомобилиСрезПоследних.ВидЗначения КАК ВидЗначения,
	|			АвтомобилиСрезПоследних.Значение КАК Значение
	|		ИЗ
	|			РегистрСведений.Автомобили.СрезПоследних КАК АвтомобилиСрезПоследних
	|		ГДЕ
	|			АвтомобилиСрезПоследних.ВидЗначения = ЗНАЧЕНИЕ(Перечисление.ДополнительнаяИнформацияАвтомобилей.ВидАвтомобиля)) КАК ХарАвто
	|		ПО ОстаткиАвтомобилейОстатки.Автомобиль = ХарАвто.Автомобиль
	|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|			АвтомобилиСрезПоследних.Автомобиль КАК Автомобиль,
	|			АвтомобилиСрезПоследних.ВидЗначения КАК ВидЗначения,
	|			АвтомобилиСрезПоследних.Значение КАК Значение
	|		ИЗ
	|			РегистрСведений.Автомобили.СрезПоследних КАК АвтомобилиСрезПоследних
	|		ГДЕ
	|			АвтомобилиСрезПоследних.ВидЗначения = ЗНАЧЕНИЕ(Перечисление.ДополнительнаяИнформацияАвтомобилей.Пробег)) КАК ПробегиАвто
	|		ПО ОстаткиАвтомобилейОстатки.Автомобиль = ПробегиАвто.Автомобиль
	|ГДЕ
	|	ОстаткиАвтомобилейОстатки.КоличествоОстаток > 0
	|	И ХарАвто.Значение = ЗНАЧЕНИЕ(Перечисление.ВидАвтомобиля.Новый)
	|	И ОстаткиАвтомобилейОстатки.СкладКомпании.Подразделение В(&СписокПодразделений)
	|	И ОстаткиАвтомобилейОстатки.Автомобиль.Модель.КатегорияТС <> ЗНАЧЕНИЕ(Справочник.КатегорииТранспортныхСредств.АвтомобилиЛегковые)
	|
	|СГРУППИРОВАТЬ ПО
	|	ОстаткиАвтомобилейОстатки.Автомобиль,
	|	ОстаткиАвтомобилейОстатки.Автомобиль.VIN,
	|	ХарАвто.Значение,
	|	ОстаткиАвтомобилейОстатки.СкладКомпании.Подразделение.ДилерскийЦентр,
	|	ОстаткиАвтомобилейОстатки.Автомобиль.ВариантКомплектации.МодификацияАвтоРу,
	|	ОстаткиАвтомобилейОстатки.Автомобиль.СпециальнаяЦена,
	|	ОстаткиАвтомобилейОстатки.Автомобиль.СкидкаПриПокупкеВКредит,
	|	ОстаткиАвтомобилейОстатки.Автомобиль.СкидкаПриСтраховании,
	|	ОстаткиАвтомобилейОстатки.Автомобиль.СкидаПриПокупкеВТрейдИн,
	|	ОстаткиАвтомобилейОстатки.Автомобиль.СкидкаМаксимальная,
	|	ОстаткиАвтомобилейОстатки.Автомобиль.ВариантКомплектации.КомплектацияАвтоРу,
	|	ОстаткиАвтомобилейОстатки.Автомобиль.Цвет.ЦветАвтоРу,
	|	ОстаткиАвтомобилейОстатки.Автомобиль.Цвет.ОкраскаМеталлик,
	|	ПробегиАвто.Значение,
	|	ОстаткиАвтомобилейОстатки.Автомобиль.Состояние,
	|	ОстаткиАвтомобилейОстатки.Автомобиль.КоличествоВладельцевПоПТС,
	|	ОстаткиАвтомобилейОстатки.Автомобиль.ВариантКомплектации.ТипКузова.ТипКузоваАвтоРу,
	|	ОстаткиАвтомобилейОстатки.СкладКомпании.Подразделение,
	|	ОстаткиАвтомобилейОстатки.Автомобиль.Модель.ТипКузова.ТипКузоваАвтоРу,
	|	ОстаткиАвтомобилейОстатки.Автомобиль.Модель.МодельАвтоРу,
	|	ОстаткиАвтомобилейОстатки.Автомобиль.Модель.МодельАвтоРу.МаркаАвтоРу,
	|	ОстаткиАвтомобилейОстатки.Автомобиль.Модель.КатегорияТС,
	|	ГОД(ОстаткиАвтомобилейОстатки.Партия.Дата),
	|	ОстаткиАвтомобилейОстатки.Партия.Номер,
	|	ЦенаАвто.Цена + ЦенаАвто.Автомобиль.СтоимостьДопОборудования
	|
	|УПОРЯДОЧИТЬ ПО
	|	VIN";
	
	Запрос.УстановитьПараметр("СписокПодразделений",СписокПодразделений);
	
	ТЗ = Запрос.Выполнить().Выгрузить();
	
	//Бондаренко++ 20220424
	ТЗ = ДополнитьТаблицуЗаказамиПоставщикуКоммерция(ТЗ,СписокПодразделений); 
	//Бондаренко-- 20220424	
	
	СписокМарок = Новый СписокЗначений;
	
	XML=Новый ЗаписьXML();
	
	XML.УстановитьСтроку(Новый ПараметрыЗаписиXML("UTF-8","1.0",false));
	XML.ЗаписатьОбъявлениеXML();
	
	XML.ЗаписатьНачалоЭлемента("Data");
	
	XML.ЗаписатьНачалоЭлемента("Cars");
	
	Для каждого Стр1 Из ТЗ Цикл
		
		//Бондаренко++ 20220713
		Если НЕ Стр1.Автомобиль.ВыгружатьАвтомобильНаСайт Тогда
			Продолжить;	
		КонецЕсли; 
		//Бондаренко-- 20220713
		
		//Бондаренко++ 20201030
		Если СписокАвтоТестДрайва.НайтиПоЗначению(Стр1.Автомобиль) <> Неопределено Тогда
			Продолжить;
		КонецЕсли; 
		//Бондаренко-- 20201030 
		
		//Бондаренко++ 20220524        
		Если ДополнительныйСписокМарок <> Неопределено Тогда
			Если ДополнительныйСписокМарок.НайтиПоЗначению(Стр1.Автомобиль.Модель.Марка) = Неопределено Тогда
				Продолжить;
			КонецЕсли; 
		КонецЕсли;
		//Бондаренко-- 20220524
		
		
		XML.ЗаписатьНачалоЭлемента("car");
		XML.ЗаписатьНачалоЭлемента("mark_id");             XML.ЗаписатьТекст(Стр1.Автомобиль.Модель.Марка.МаркаАвтоРу.Наименование);                     XML.ЗаписатьКонецЭлемента();
		XML.ЗаписатьНачалоЭлемента("group_id");            XML.ЗаписатьТекст(Стр1.Автомобиль.Модель.МодельАвтоРу.Наименование);                          XML.ЗаписатьКонецЭлемента();
		
		Если Стр1.ОкраскаМеталлик Тогда
			XML.ЗаписатьНачалоЭлемента("color");               XML.ЗаписатьТекст(СокрЛП(Стр1.ЦветАвтоРу)+" металлик");                                            XML.ЗаписатьКонецЭлемента();
		Иначе
			XML.ЗаписатьНачалоЭлемента("color");               XML.ЗаписатьТекст(СокрЛП(Стр1.ЦветАвтоРу));                                                        XML.ЗаписатьКонецЭлемента();
		КонецЕсли; 
		
		XML.ЗаписатьНачалоЭлемента("availability");        XML.ЗаписатьТекст("В наличии");                                                                        XML.ЗаписатьКонецЭлемента();
		XML.ЗаписатьНачалоЭлемента("custom");              XML.ЗаписатьТекст("Растаможен");                                                                       XML.ЗаписатьКонецЭлемента();
		XML.ЗаписатьНачалоЭлемента("state");               XML.ЗаписатьТекст("Отличное");                                                                         XML.ЗаписатьКонецЭлемента();
		
		XML.ЗаписатьНачалоЭлемента("haggle");              XML.ЗаписатьТекст("не возможен");                                                                      XML.ЗаписатьКонецЭлемента();
		XML.ЗаписатьНачалоЭлемента("exchange");            XML.ЗаписатьТекст("нет");                                                                              XML.ЗаписатьКонецЭлемента();
		
		XML.ЗаписатьНачалоЭлемента("run");                 XML.ЗаписатьТекст("0");                                                                                XML.ЗаписатьКонецЭлемента();
		
		//Бондаренко++ 20220629
		Если обЗначениеНеЗаполнено(Стр1.Автомобиль.ГодВыпуска) Тогда
			ГодВыпуска_ = НачалоГода(ТекущаяДата());	
		Иначе		
			ГодВыпуска_ = Стр1.Автомобиль.ГодВыпуска;		
		КонецЕсли; 
		//Бондаренко-- 20220629
		XML.ЗаписатьНачалоЭлемента("year");                XML.ЗаписатьТекст(Формат(ГодВыпуска_,"ДФ=yyyy"));                                       XML.ЗаписатьКонецЭлемента();
		
		XML.ЗаписатьНачалоЭлемента("price");               XML.ЗаписатьТекст(СокрЛП(СтрЗаменить(Стр1.Цена,Символы.НПП,"")));                                XML.ЗаписатьКонецЭлемента(); 
		
		XML.ЗаписатьНачалоЭлемента("currency");            XML.ЗаписатьТекст("RUR");                                                                              XML.ЗаписатьКонецЭлемента();
		XML.ЗаписатьНачалоЭлемента("vin");                 XML.ЗаписатьТекст(Стр1.Автомобиль.VIN);                                                                XML.ЗаписатьКонецЭлемента();
		
		ТекстКлассифайда = СокрЛП(Стр1.Автомобиль.Модель.ТекстКлассифайда);
		Если обЗначениеНеЗаполнено(ТекстКлассифайда) Тогда
			ТекстКлассифайда = СокрЛП(Стр1.Подразделение.ТекстКлассифайда);
			Если обЗначениеНеЗаполнено(ТекстКлассифайда) Тогда
				ТекстКлассифайда = СокрЛП(Стр1.Подразделение.Родитель.ТекстКлассифайда);
			КонецЕсли; 
		КонецЕсли; 
		
		XML.ЗаписатьНачалоЭлемента("description");   XML.ЗаписатьТекст(ТекстКлассифайда);                                                                         XML.ЗаписатьКонецЭлемента();	 
		
		Если Стр1.Автомобиль.ПутьКФото.Количество() > 0 Тогда
			XML.ЗаписатьНачалоЭлемента("images");
			Для каждого СтрТЧ Из Стр1.Автомобиль.ПутьКФото Цикл
				XML.ЗаписатьНачалоЭлемента("image"); 
				//Бондаренко++ 20220303
				//XML.ЗаписатьТекст(HTTPRequest.БазовыйURL+"/photo/"+Стр1.Автомобиль.VIN+"/"+СтрТЧ.НомерСтроки+".jpg");
				XML.ЗаписатьТекст(HTTPRequest.БазовыйURL+"/photo/"+Стр1.Автомобиль.УникальныйИдентификатор()+"/"+СтрТЧ.GUID+".jpg");
				//Бондаренко++ 20220303
				XML.ЗаписатьКонецЭлемента(); //url	
			КонецЦикла; 
			XML.ЗаписатьКонецЭлемента(); //images	
		КонецЕсли;
		
		//Уникальный идентификатор объявления. Элемент используется, если не указан VIN номер.Произвольный набор цифр, букв, знаков «-» и «_» до 50 символов.
		//unique_id_str = ""+Стр1.Автомобиль.VIN+"_"+СтрЗаменить(Стр1.ГодДокаПоступленияАвто,Символы.НПП,"")+"_"+ Стр1.НомерДокаПоступленияАвто;
		
		XML.ЗаписатьНачалоЭлемента("unique_id");             XML.ЗаписатьТекст(СокрЛП(Стр1.Автомобиль.Код));                                 XML.ЗаписатьКонецЭлемента();	
		
		wheel_str = СокрЛП(Стр1.Автомобиль.Руль);
		
		//Бондаренко++ 20220621
		Если обЗначениеНеЗаполнено(wheel_str) Тогда				
			wheel_str = СокрЛП(Стр1.Автомобиль.ВариантКомплектации.Руль);						
		КонецЕсли;			
		//Бондаренко 20220621
		
		Если НЕ обЗначениеНеЗаполнено(wheel_str) Тогда
			XML.ЗаписатьНачалоЭлемента("wheel");             XML.ЗаписатьТекст(wheel_str);                                                     XML.ЗаписатьКонецЭлемента();
		КонецЕсли;
		
		bus_type_str =  СокрЛП(Стр1.Автомобиль.ТипАвтобусаАвтоРу);
		Если НЕ обЗначениеНеЗаполнено(bus_type_str) Тогда
			XML.ЗаписатьНачалоЭлемента("bus_type");          XML.ЗаписатьТекст(bus_type_str);                                                  XML.ЗаписатьКонецЭлемента();
		КонецЕсли;
		
		wheel_drive_str =  СокрЛП(Стр1.Автомобиль.КолеснаяФормулаАвтоРу);
		Если НЕ обЗначениеНеЗаполнено(wheel_drive_str) Тогда
			XML.ЗаписатьНачалоЭлемента("wheel_drive");       XML.ЗаписатьТекст(wheel_drive_str);                                               XML.ЗаписатьКонецЭлемента();
		КонецЕсли;
		
		seats_str =  СокрЛП(Стр1.Автомобиль.КоличествоМест);
		Если НЕ обЗначениеНеЗаполнено(seats_str) Тогда
			XML.ЗаписатьНачалоЭлемента("seats");             XML.ЗаписатьТекст(seats_str);                                                     XML.ЗаписатьКонецЭлемента();
		КонецЕсли;
		
		//Бондаренко++ 20220627
		ТипДвигателя = Справочники.ТипыДвигателей.ПустаяСсылка();
		ТипДвигателя = СМ_ВыгрузкаОбъявленийОПродажеАвто.СМГ_СправочникВернутьЗначениеРеквизита("ТипДвигателя",Стр1.Автомобиль.ПолучитьОбъект());
		//Бондаренко-- 20220627
		
		Если Не обЗначениеНеЗаполнено(ТипДвигателя) Тогда
			engine_power_str =  СтрЗаменить(СокрЛП(ТипДвигателя.МощностьЛС),Символы.НПП,"");
			Если НЕ обЗначениеНеЗаполнено(engine_power_str) Тогда
				XML.ЗаписатьНачалоЭлемента("engine_power");      XML.ЗаписатьТекст(engine_power_str);                                              XML.ЗаписатьКонецЭлемента();
			КонецЕсли;
			
			engine_volume_str =  СтрЗаменить(СокрЛП(ТипДвигателя.ОбъемДвигателя*1000),Символы.НПП,"");
			Если НЕ обЗначениеНеЗаполнено(engine_volume_str) Тогда
				XML.ЗаписатьНачалоЭлемента("engine_volume");     XML.ЗаписатьТекст(engine_volume_str);                                             XML.ЗаписатьКонецЭлемента();
			КонецЕсли;
			
			ТипТоплива = ТипДвигателя.ТипТоплива;
			Если ТипТоплива = Перечисления.ТипыТоплива.Petrol Тогда
				engine_type_str =  "бензин";
			ИначеЕсли ТипТоплива = Перечисления.ТипыТоплива.Diesel Тогда
				engine_type_str =  "дизель";	
			ИначеЕсли ТипТоплива = Перечисления.ТипыТоплива.None Тогда
				engine_type_str =  "электрический";	
			ИначеЕсли ТипТоплива = Перечисления.ТипыТоплива.LiquefiedGas ИЛИ ТипТоплива = Перечисления.ТипыТоплива.PressureGas Тогда
				engine_type_str =  "газ";	
			КонецЕсли;
			
			Если ТипДвигателя.Дром_Гибрид Тогда
				engine_type_str =  "гибридный";				
			КонецЕсли;	
			
			Если НЕ обЗначениеНеЗаполнено(engine_type_str) Тогда
				XML.ЗаписатьНачалоЭлемента("engine_type");       XML.ЗаписатьТекст(engine_type_str);                                               XML.ЗаписатьКонецЭлемента();
			КонецЕсли;
		КонецЕсли;
		
		gearbox_str =  СокрЛП(Стр1.Автомобиль.ТипКПП.ТипКПП_АутоРу);
		Если НЕ обЗначениеНеЗаполнено(gearbox_str) Тогда
			XML.ЗаписатьНачалоЭлемента("gearbox");            XML.ЗаписатьТекст(gearbox_str);                                                  XML.ЗаписатьКонецЭлемента();
		КонецЕсли;
		
		extras_flag = Стр1.Автомобиль.ИспользоватьОпцииМодели;
		Если extras_flag  Тогда
			Табл = Стр1.Автомобиль.Модель.ОпцииКоммерцияАвтоРу;
		Иначе
			Табл = Стр1.Автомобиль.ОпцииКоммерцияАвтоРу;
		КонецЕсли;
		Всего_ОпцийАвтоРу = Табл.Количество();
		Если Всего_ОпцийАвтоРу > 0 Тогда
			extras_str = "";
			Для каждого Стр Из Табл Цикл
				Если НЕ обЗначениеНеЗаполнено(extras_str) Тогда
					extras_str = СокрЛП(extras_str)+";"+СокрЛП(Стр.Опция);
				Иначе
					extras_str = СокрЛП(Стр.Опция);
				КонецЕсли; 
			КонецЦикла; 
			XML.ЗаписатьНачалоЭлемента("extras");          XML.ЗаписатьТекст(extras_str);                                                      XML.ЗаписатьКонецЭлемента();
		КонецЕсли;
		
		//Бондаренко++ 20220714
		//body_type_str =  СокрЛП(Стр1.Автомобиль.ТипКузоваКоммерцияАвтоРу);
		body_type_str = "";
		ТипКузова = СМ_ВыгрузкаОбъявленийОПродажеАвто.СМГ_СправочникВернутьЗначениеРеквизита("ТипКузова",Стр1.Автомобиль.ПолучитьОбъект());
		Если НЕ обЗначениеНеЗаполнено(ТипКузова) Тогда
			body_type_str =  СокрЛП(ТипКузова.ТипКузоваАвтоРу);		  
		КонецЕсли;
		//Бондаренко++ 20220714
		Если НЕ обЗначениеНеЗаполнено(body_type_str) Тогда
			XML.ЗаписатьНачалоЭлемента("body_type");          XML.ЗаписатьТекст(body_type_str);                                                XML.ЗаписатьКонецЭлемента();
		КонецЕсли;
		
		cabin_type_str =  СокрЛП(Стр1.Автомобиль.ТипКабиныКоммерцияАвтоРу);
		Если НЕ обЗначениеНеЗаполнено(cabin_type_str) Тогда
			XML.ЗаписатьНачалоЭлемента("cabin_type");         XML.ЗаписатьТекст(cabin_type_str);                                               XML.ЗаписатьКонецЭлемента();
		КонецЕсли;
		
		loading_number =  Стр1.Автомобиль.Грузоподъемность;
		Если loading_number > 0 Тогда
			loading_str =  СтрЗаменить(СокрЛП(loading_number),Символы.НПП,"");
			Если НЕ обЗначениеНеЗаполнено(loading_str) Тогда
				XML.ЗаписатьНачалоЭлемента("loading");        XML.ЗаписатьТекст(loading_str);                                                  XML.ЗаписатьКонецЭлемента();
			КонецЕсли;
		КонецЕсли;
		
		suspension_chassis_str =  СокрЛП(Стр1.Автомобиль.ПодвескаШассиКоммерцияАвтоРу);
		Если НЕ обЗначениеНеЗаполнено(suspension_chassis_str) Тогда
			XML.ЗаписатьНачалоЭлемента("suspension_chassis"); XML.ЗаписатьТекст(suspension_chassis_str);                                       XML.ЗаписатьКонецЭлемента();
		КонецЕсли;
		
		drive_str =  СокрЛП(Стр1.Автомобиль.Привод);
		Если НЕ обЗначениеНеЗаполнено(drive_str) Тогда
			XML.ЗаписатьНачалоЭлемента("drive");              XML.ЗаписатьТекст(drive_str);                                                    XML.ЗаписатьКонецЭлемента();
		КонецЕсли;
		
		XML.ЗаписатьКонецЭлемента(); //Car
		
	КонецЦикла; 
	
	XML.ЗаписатьКонецЭлемента();	 //Cars
	
	XML.ЗаписатьКонецЭлемента();         //Data
	
	XMLТекст = XML.Закрыть();
	
	Возврат XMLТекст;
	
КонецФункции

Функция ПолучитьXMLОбъявленийTDealerNew(СписокПодразделений, ДополнительныйСписокМарок ,HTTPRequest) Экспорт
	
	//Бондаренко++ 20201030
	СписокАвтоТестДрайва = ПолучитьАвтомобилиДляТестДрайва();
	//Бондаренко-- 20201030
	
	ТЗ = Новый ТаблицаЗначений;
	
	Запрос = Новый Запрос;
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ОстаткиАвтомобилейОстатки.Автомобиль,
	|	ОстаткиАвтомобилейОстатки.Автомобиль.VIN КАК VIN,
	|	СУММА(ОстаткиАвтомобилейОстатки.КоличествоОстаток) КАК Остаток,
	|	ЦенаАвто.Цена + ЦенаАвто.Автомобиль.СтоимостьДопОборудования КАК Цена,
	|	ХарАвто.Значение КАК ВидАвто,
	|	ОстаткиАвтомобилейОстатки.СкладКомпании.Подразделение КАК Подразделение,
	|	ОстаткиАвтомобилейОстатки.СкладКомпании.Подразделение.ДилерскийЦентр КАК ДилерскийЦентр,
	|	ОстаткиАвтомобилейОстатки.Автомобиль.Модель.МодельАвтоРу.МаркаАвтоРу КАК МаркаАвтоРу,
	|	ОстаткиАвтомобилейОстатки.Автомобиль.Модель.МодельАвтоРу КАК МодельАвтоРу,
	|	ОстаткиАвтомобилейОстатки.Автомобиль.ВариантКомплектации.МодификацияАвтоРу КАК МодификацияАвтоРу,
	|	ОстаткиАвтомобилейОстатки.Автомобиль.ВариантКомплектации.КомплектацияАвтоРу КАК КомплектацияАвтоРу,
	|	ОстаткиАвтомобилейОстатки.Автомобиль.СпециальнаяЦена КАК СпециальнаяЦена,
	|	ОстаткиАвтомобилейОстатки.Автомобиль.СкидкаПриПокупкеВКредит КАК СкидкаПриПокупкеВКредит,
	|	ОстаткиАвтомобилейОстатки.Автомобиль.СкидкаПриСтраховании КАК СкидкаПриСтраховании,
	|	ОстаткиАвтомобилейОстатки.Автомобиль.СкидаПриПокупкеВТрейдИн КАК СкидаПриПокупкеВТрейдИн,
	|	ОстаткиАвтомобилейОстатки.Автомобиль.СкидкаМаксимальная КАК СкидкаМаксимальная,
	|	ОстаткиАвтомобилейОстатки.Автомобиль.Цвет.ЦветАвтоРу КАК ЦветАвтоРу,
	|	ОстаткиАвтомобилейОстатки.Автомобиль.Цвет.ОкраскаМеталлик КАК ОкраскаМеталлик,
	|	ОстаткиАвтомобилейОстатки.Автомобиль.ВариантКомплектации.Руль КАК Руль,
	|	ОстаткиАвтомобилейОстатки.Автомобиль.ВариантКомплектации.КоличествоДверей КАК КоличествоДверей,
	|	ОстаткиАвтомобилейОстатки.Автомобиль.Модель.КатегорияТС,
	|	ПробегиАвто.Значение КАК Пробег,
	|	ОстаткиАвтомобилейОстатки.Автомобиль.Состояние КАК Состояние,
	|	ОстаткиАвтомобилейОстатки.Автомобиль.КоличествоВладельцевПоПТС КАК КоличествоВладельцев,
	|	ОстаткиАвтомобилейОстатки.Автомобиль.ВариантКомплектации.ТипКузова.ТипКузоваАвтоРу КАК ТипКузоваВариантаКомплектации,
	|	ОстаткиАвтомобилейОстатки.Автомобиль.Модель.ТипКузова.ТипКузоваАвтоРу КАК ТипКузоваМодели,
	|	ОстаткиАвтомобилейОстатки.Автомобиль.Цвет.Артикул,
	|	ОстаткиАвтомобилейОстатки.Автомобиль.ВариантКомплектации.Артикул,
	|	""В наличии"" КАК Доступность
	|ИЗ
	|	РегистрНакопления.ОстаткиАвтомобилей.Остатки КАК ОстаткиАвтомобилейОстатки
	|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|			ЦеныАвтомобилейСрезПоследних.Цена КАК Цена,
	|			ЦеныАвтомобилейСрезПоследних.Автомобиль КАК Автомобиль,
	|			ЦеныАвтомобилейСрезПоследних.ВариантКомплектации КАК ВариантКомплектации,
	|			ЦеныАвтомобилейСрезПоследних.ТипЦен КАК ТипЦен
	|		ИЗ
	|			РегистрСведений.ЦеныАвтомобилей.СрезПоследних КАК ЦеныАвтомобилейСрезПоследних
	|		ГДЕ
	|			ЦеныАвтомобилейСрезПоследних.ТипЦен = ЗНАЧЕНИЕ(Справочник.ТипыЦен.ОсновнойТипЦенПродажи)) КАК ЦенаАвто
	|		ПО ОстаткиАвтомобилейОстатки.Автомобиль = ЦенаАвто.Автомобиль
	|			И ОстаткиАвтомобилейОстатки.Автомобиль.ВариантКомплектации = ЦенаАвто.Автомобиль.ВариантКомплектации
	|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|			АвтомобилиСрезПоследних.Автомобиль КАК Автомобиль,
	|			АвтомобилиСрезПоследних.ВидЗначения КАК ВидЗначения,
	|			АвтомобилиСрезПоследних.Значение КАК Значение
	|		ИЗ
	|			РегистрСведений.Автомобили.СрезПоследних КАК АвтомобилиСрезПоследних
	|		ГДЕ
	|			АвтомобилиСрезПоследних.ВидЗначения = ЗНАЧЕНИЕ(Перечисление.ДополнительнаяИнформацияАвтомобилей.ВидАвтомобиля)) КАК ХарАвто
	|		ПО ОстаткиАвтомобилейОстатки.Автомобиль = ХарАвто.Автомобиль
	|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|			АвтомобилиСрезПоследних.Автомобиль КАК Автомобиль,
	|			АвтомобилиСрезПоследних.ВидЗначения КАК ВидЗначения,
	|			АвтомобилиСрезПоследних.Значение КАК Значение
	|		ИЗ
	|			РегистрСведений.Автомобили.СрезПоследних КАК АвтомобилиСрезПоследних
	|		ГДЕ
	|			АвтомобилиСрезПоследних.ВидЗначения = ЗНАЧЕНИЕ(Перечисление.ДополнительнаяИнформацияАвтомобилей.Пробег)) КАК ПробегиАвто
	|		ПО ОстаткиАвтомобилейОстатки.Автомобиль = ПробегиАвто.Автомобиль
	|ГДЕ
	|	ОстаткиАвтомобилейОстатки.КоличествоОстаток > 0
	|	И ХарАвто.Значение = ЗНАЧЕНИЕ(Перечисление.ВидАвтомобиля.Новый)
	|	И ОстаткиАвтомобилейОстатки.СкладКомпании.Подразделение В(&СписокПодразделений)
	|	И ОстаткиАвтомобилейОстатки.Автомобиль.Модель.КатегорияТС = ЗНАЧЕНИЕ(Справочник.КатегорииТранспортныхСредств.АвтомобилиЛегковые)
	|
	|СГРУППИРОВАТЬ ПО
	|	ОстаткиАвтомобилейОстатки.Автомобиль,
	|	ОстаткиАвтомобилейОстатки.Автомобиль.VIN,
	|	ХарАвто.Значение,
	|	ОстаткиАвтомобилейОстатки.СкладКомпании.Подразделение.ДилерскийЦентр,
	|	ОстаткиАвтомобилейОстатки.Автомобиль.Модель.МодельАвтоРу.МаркаАвтоРу,
	|	ОстаткиАвтомобилейОстатки.Автомобиль.Модель.МодельАвтоРу,
	|	ОстаткиАвтомобилейОстатки.Автомобиль.ВариантКомплектации.МодификацияАвтоРу,
	|	ОстаткиАвтомобилейОстатки.Автомобиль.СпециальнаяЦена,
	|	ОстаткиАвтомобилейОстатки.Автомобиль.СкидкаПриПокупкеВКредит,
	|	ОстаткиАвтомобилейОстатки.Автомобиль.СкидкаПриСтраховании,
	|	ОстаткиАвтомобилейОстатки.Автомобиль.СкидаПриПокупкеВТрейдИн,
	|	ОстаткиАвтомобилейОстатки.Автомобиль.СкидкаМаксимальная,
	|	ОстаткиАвтомобилейОстатки.Автомобиль.ВариантКомплектации.КомплектацияАвтоРу,
	|	ОстаткиАвтомобилейОстатки.Автомобиль.Цвет.ЦветАвтоРу,
	|	ОстаткиАвтомобилейОстатки.Автомобиль.Цвет.ОкраскаМеталлик,
	|	ОстаткиАвтомобилейОстатки.Автомобиль.ВариантКомплектации.Руль,
	|	ОстаткиАвтомобилейОстатки.Автомобиль.ВариантКомплектации.КоличествоДверей,
	|	ПробегиАвто.Значение,
	|	ОстаткиАвтомобилейОстатки.Автомобиль.Состояние,
	|	ОстаткиАвтомобилейОстатки.Автомобиль.КоличествоВладельцевПоПТС,
	|	ОстаткиАвтомобилейОстатки.Автомобиль.ВариантКомплектации.ТипКузова.ТипКузоваАвтоРу,
	|	ОстаткиАвтомобилейОстатки.СкладКомпании.Подразделение,
	|	ОстаткиАвтомобилейОстатки.Автомобиль.Модель.ТипКузова.ТипКузоваАвтоРу,
	|	ОстаткиАвтомобилейОстатки.Автомобиль.Цвет.Артикул,
	|	ОстаткиАвтомобилейОстатки.Автомобиль.ВариантКомплектации.Артикул,
	|	ОстаткиАвтомобилейОстатки.Автомобиль.Модель.КатегорияТС,
	|	ЦенаАвто.Цена + ЦенаАвто.Автомобиль.СтоимостьДопОборудования
	|
	|УПОРЯДОЧИТЬ ПО
	|	VIN";
	
	Запрос.УстановитьПараметр("СписокПодразделений",СписокПодразделений);
	
	ТЗ = Запрос.Выполнить().Выгрузить();  
	
	//Бондаренко++ 20211027 =========================================================================
	
	ТаблицаИсточник = Новый ТаблицаЗначений;
	
	Запрос = Новый Запрос;
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ЗаказыПоставщикамНаАвтомобилиОстатки.Автомобиль,
	|	ВЫБОР
	|		КОГДА ЗаказыПоставщикамНаАвтомобилиОстатки.Автомобиль.VIN = """"
	|			ТОГДА ЗаказыПоставщикамНаАвтомобилиОстатки.ЗаказПоставщику.ВнешнийНомерЗаказа
	|		ИНАЧЕ ЗаказыПоставщикамНаАвтомобилиОстатки.Автомобиль.VIN
	|	КОНЕЦ КАК VIN,
	|	СУММА(ЗаказыПоставщикамНаАвтомобилиОстатки.КоличествоОстаток) КАК Остаток,
	|	ЦенаАвто.Цена + ЦенаАвто.Автомобиль.СтоимостьДопОборудования КАК Цена,
	|	ХарАвто.Значение КАК ВидАвто,
	|	ЗаказыПоставщикамНаАвтомобилиОстатки.ЗаказПоставщику.ПодразделениеКомпании КАК Подразделение,
	|	ЗаказыПоставщикамНаАвтомобилиОстатки.ЗаказПоставщику.ПодразделениеКомпании.ДилерскийЦентр КАК ДилерскийЦентр,
	|	ЗаказыПоставщикамНаАвтомобилиОстатки.Автомобиль.Модель.МодельАвтоРу.МаркаАвтоРу КАК МаркаАвтоРу,
	|	ЗаказыПоставщикамНаАвтомобилиОстатки.Автомобиль.Модель.МодельАвтоРу КАК МодельАвтоРу,
	|	ЗаказыПоставщикамНаАвтомобилиОстатки.Автомобиль.ВариантКомплектации.МодификацияАвтоРу КАК МодификацияАвтоРу,
	|	ЗаказыПоставщикамНаАвтомобилиОстатки.Автомобиль.ВариантКомплектации.КомплектацияАвтоРу КАК КомплектацияАвтоРу,
	|	ЗаказыПоставщикамНаАвтомобилиОстатки.Автомобиль.СпециальнаяЦена КАК СпециальнаяЦена,
	|	ЗаказыПоставщикамНаАвтомобилиОстатки.Автомобиль.СкидкаПриПокупкеВКредит КАК СкидкаПриПокупкеВКредит,
	|	ЗаказыПоставщикамНаАвтомобилиОстатки.Автомобиль.СкидкаПриСтраховании КАК СкидкаПриСтраховании,
	|	ЗаказыПоставщикамНаАвтомобилиОстатки.Автомобиль.СкидаПриПокупкеВТрейдИн КАК СкидаПриПокупкеВТрейдИн,
	|	ЗаказыПоставщикамНаАвтомобилиОстатки.Автомобиль.СкидкаМаксимальная КАК СкидкаМаксимальная,
	|	ЗаказыПоставщикамНаАвтомобилиОстатки.Автомобиль.Цвет.ЦветАвтоРу КАК ЦветАвтоРу,
	|	ЗаказыПоставщикамНаАвтомобилиОстатки.Автомобиль.Цвет.ОкраскаМеталлик КАК ОкраскаМеталлик,
	|	ЗаказыПоставщикамНаАвтомобилиОстатки.Автомобиль.ВариантКомплектации.Руль КАК Руль,
	|	ЗаказыПоставщикамНаАвтомобилиОстатки.Автомобиль.ВариантКомплектации.КоличествоДверей КАК КоличествоДверей,
	|	ЗаказыПоставщикамНаАвтомобилиОстатки.Автомобиль.Модель.КатегорияТС,
	|	ПробегиАвто.Значение КАК Пробег,
	|	ЗаказыПоставщикамНаАвтомобилиОстатки.Автомобиль.Состояние КАК Состояние,
	|	ЗаказыПоставщикамНаАвтомобилиОстатки.Автомобиль.КоличествоВладельцевПоПТС КАК КоличествоВладельцев,
	|	ЗаказыПоставщикамНаАвтомобилиОстатки.Автомобиль.ВариантКомплектации.ТипКузова.ТипКузоваАвтоРу КАК ТипКузоваВариантаКомплектации,
	|	ЗаказыПоставщикамНаАвтомобилиОстатки.Автомобиль.Модель.ТипКузова.ТипКузоваАвтоРу КАК ТипКузоваМодели,
	|	ЗаказыПоставщикамНаАвтомобилиОстатки.Автомобиль.Цвет.Артикул,
	|	ЗаказыПоставщикамНаАвтомобилиОстатки.Автомобиль.ВариантКомплектации.Артикул,
	|	""На заказ"" КАК Доступность
	|ИЗ
	|	РегистрНакопления.ЗаказыПоставщикамНаАвтомобили.Остатки КАК ЗаказыПоставщикамНаАвтомобилиОстатки
	|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|			ЦеныАвтомобилейСрезПоследних.Цена КАК Цена,
	|			ЦеныАвтомобилейСрезПоследних.Автомобиль КАК Автомобиль,
	|			ЦеныАвтомобилейСрезПоследних.ВариантКомплектации КАК ВариантКомплектации,
	|			ЦеныАвтомобилейСрезПоследних.ТипЦен КАК ТипЦен
	|		ИЗ
	|			РегистрСведений.ЦеныАвтомобилей.СрезПоследних КАК ЦеныАвтомобилейСрезПоследних
	|		ГДЕ
	|			ЦеныАвтомобилейСрезПоследних.ТипЦен = ЗНАЧЕНИЕ(Справочник.ТипыЦен.ОсновнойТипЦенПродажи)) КАК ЦенаАвто
	|		ПО ЗаказыПоставщикамНаАвтомобилиОстатки.Автомобиль = ЦенаАвто.Автомобиль
	|			И ЗаказыПоставщикамНаАвтомобилиОстатки.Автомобиль.ВариантКомплектации = ЦенаАвто.Автомобиль.ВариантКомплектации
	|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|			АвтомобилиСрезПоследних.Автомобиль КАК Автомобиль,
	|			АвтомобилиСрезПоследних.ВидЗначения КАК ВидЗначения,
	|			АвтомобилиСрезПоследних.Значение КАК Значение
	|		ИЗ
	|			РегистрСведений.Автомобили.СрезПоследних КАК АвтомобилиСрезПоследних
	|		ГДЕ
	|			АвтомобилиСрезПоследних.ВидЗначения = ЗНАЧЕНИЕ(Перечисление.ДополнительнаяИнформацияАвтомобилей.ВидАвтомобиля)) КАК ХарАвто
	|		ПО ЗаказыПоставщикамНаАвтомобилиОстатки.Автомобиль = ХарАвто.Автомобиль
	|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|			АвтомобилиСрезПоследних.Автомобиль КАК Автомобиль,
	|			АвтомобилиСрезПоследних.ВидЗначения КАК ВидЗначения,
	|			АвтомобилиСрезПоследних.Значение КАК Значение
	|		ИЗ
	|			РегистрСведений.Автомобили.СрезПоследних КАК АвтомобилиСрезПоследних
	|		ГДЕ
	|			АвтомобилиСрезПоследних.ВидЗначения = ЗНАЧЕНИЕ(Перечисление.ДополнительнаяИнформацияАвтомобилей.Пробег)) КАК ПробегиАвто
	|		ПО ЗаказыПоставщикамНаАвтомобилиОстатки.Автомобиль = ПробегиАвто.Автомобиль
	|ГДЕ
	|	ЗаказыПоставщикамНаАвтомобилиОстатки.КоличествоОстаток > 0
	|	И (ХарАвто.Значение = ЗНАЧЕНИЕ(Перечисление.ВидАвтомобиля.Новый)
	|			ИЛИ ХарАвто.Значение ЕСТЬ NULL)
	|	И ЗаказыПоставщикамНаАвтомобилиОстатки.ЗаказПоставщику.ПодразделениеКомпании В(&СписокПодразделений)
	|	И ЗаказыПоставщикамНаАвтомобилиОстатки.Автомобиль.Модель.КатегорияТС = ЗНАЧЕНИЕ(Справочник.КатегорииТранспортныхСредств.АвтомобилиЛегковые)
	|
	|СГРУППИРОВАТЬ ПО
	|	ЗаказыПоставщикамНаАвтомобилиОстатки.Автомобиль,
	|	ХарАвто.Значение,
	|	ЗаказыПоставщикамНаАвтомобилиОстатки.ЗаказПоставщику.ПодразделениеКомпании.ДилерскийЦентр,
	|	ЗаказыПоставщикамНаАвтомобилиОстатки.Автомобиль.Модель.МодельАвтоРу.МаркаАвтоРу,
	|	ЗаказыПоставщикамНаАвтомобилиОстатки.Автомобиль.Модель.МодельАвтоРу,
	|	ЗаказыПоставщикамНаАвтомобилиОстатки.Автомобиль.ВариантКомплектации.МодификацияАвтоРу,
	|	ЗаказыПоставщикамНаАвтомобилиОстатки.Автомобиль.СпециальнаяЦена,
	|	ЗаказыПоставщикамНаАвтомобилиОстатки.Автомобиль.СкидкаПриПокупкеВКредит,
	|	ЗаказыПоставщикамНаАвтомобилиОстатки.Автомобиль.СкидкаПриСтраховании,
	|	ЗаказыПоставщикамНаАвтомобилиОстатки.Автомобиль.СкидаПриПокупкеВТрейдИн,
	|	ЗаказыПоставщикамНаАвтомобилиОстатки.Автомобиль.СкидкаМаксимальная,
	|	ЗаказыПоставщикамНаАвтомобилиОстатки.Автомобиль.ВариантКомплектации.КомплектацияАвтоРу,
	|	ЗаказыПоставщикамНаАвтомобилиОстатки.Автомобиль.Цвет.ЦветАвтоРу,
	|	ЗаказыПоставщикамНаАвтомобилиОстатки.Автомобиль.Цвет.ОкраскаМеталлик,
	|	ЗаказыПоставщикамНаАвтомобилиОстатки.Автомобиль.ВариантКомплектации.Руль,
	|	ЗаказыПоставщикамНаАвтомобилиОстатки.Автомобиль.ВариантКомплектации.КоличествоДверей,
	|	ПробегиАвто.Значение,
	|	ЗаказыПоставщикамНаАвтомобилиОстатки.Автомобиль.Состояние,
	|	ЗаказыПоставщикамНаАвтомобилиОстатки.Автомобиль.КоличествоВладельцевПоПТС,
	|	ЗаказыПоставщикамНаАвтомобилиОстатки.Автомобиль.ВариантКомплектации.ТипКузова.ТипКузоваАвтоРу,
	|	ЗаказыПоставщикамНаАвтомобилиОстатки.ЗаказПоставщику.ПодразделениеКомпании,
	|	ЗаказыПоставщикамНаАвтомобилиОстатки.Автомобиль.Модель.ТипКузова.ТипКузоваАвтоРу,
	|	ЗаказыПоставщикамНаАвтомобилиОстатки.Автомобиль.Цвет.Артикул,
	|	ЗаказыПоставщикамНаАвтомобилиОстатки.Автомобиль.ВариантКомплектации.Артикул,
	|	ЗаказыПоставщикамНаАвтомобилиОстатки.Автомобиль.Модель.КатегорияТС,
	|	ЦенаАвто.Цена + ЦенаАвто.Автомобиль.СтоимостьДопОборудования,
	|	ВЫБОР
	|		КОГДА ЗаказыПоставщикамНаАвтомобилиОстатки.Автомобиль.VIN = """"
	|			ТОГДА ЗаказыПоставщикамНаАвтомобилиОстатки.ЗаказПоставщику.ВнешнийНомерЗаказа
	|		ИНАЧЕ ЗаказыПоставщикамНаАвтомобилиОстатки.Автомобиль.VIN
	|	КОНЕЦ
	|
	|УПОРЯДОЧИТЬ ПО
	|	VIN";
	
	Запрос.УстановитьПараметр("СписокПодразделений",СписокПодразделений);
	
	ТаблицаИсточник = Запрос.Выполнить().Выгрузить(); 
	
	Если ТаблицаИсточник.Количество() > 0 Тогда
		Для Каждого СтрокаТаблицыИсточник Из ТаблицаИсточник Цикл
			НайденнаяСтрока = ТЗ.Найти(СтрокаТаблицыИсточник.VIN, "VIN");
			Если НайденнаяСтрока = Неопределено Тогда
				ЗаполнитьЗначенияСвойств(ТЗ.Добавить(), СтрокаТаблицыИсточник);
			КонецЕсли;	
		КонецЦикла;
	КонецЕсли;
	//Бондаренко-- 20211027 ==============================================================================
	
	СписокМарок = Новый СписокЗначений;
	
	XML=Новый ЗаписьXML();
	
	XML.УстановитьСтроку(Новый ПараметрыЗаписиXML("UTF-8","1.0",false));
	XML.ЗаписатьОбъявлениеXML();
	
	XML.ЗаписатьНачалоЭлемента("Data");
	
	XML.ЗаписатьНачалоЭлемента("Cars");
	
	Для каждого Стр1 Из ТЗ Цикл
		
		//Бондаренко++ 20220713
		Если НЕ Стр1.Автомобиль.ВыгружатьАвтомобильНаСайт Тогда
			Продолжить;	
		КонецЕсли; 
		//Бондаренко-- 20220713
		
		//Бондаренко++ 20201030
		Если СписокАвтоТестДрайва.НайтиПоЗначению(Стр1.Автомобиль) <> Неопределено Тогда
			Продолжить;
		КонецЕсли; 
		//Бондаренко-- 20201030
		
		//Бондаренко++ 20220315        
		Если ДополнительныйСписокМарок <> Неопределено Тогда
			Если ДополнительныйСписокМарок.НайтиПоЗначению(Стр1.Автомобиль.Модель.Марка) = Неопределено Тогда
				Продолжить;
			КонецЕсли; 
		КонецЕсли;
		//Бондаренко-- 20220315
		
		//Бондаренко++ 20220317        
		Если НЕ Стр1.Автомобиль.ВыгружатьАвтомобильНаСайт Тогда
			Продолжить;
		КонецЕсли;
		//Бондаренко-- 20220317
		
		XML.ЗаписатьНачалоЭлемента("car");
		XML.ЗаписатьНачалоЭлемента("mark_id");             XML.ЗаписатьТекст(Стр1.Автомобиль.Модель.Марка.МаркаАвтоРу.Наименование);                              XML.ЗаписатьКонецЭлемента();
		XML.ЗаписатьНачалоЭлемента("folder_id");           XML.ЗаписатьТекст(Стр1.Автомобиль.Модель.МодельАвтоРу.Наименование);                                   XML.ЗаписатьКонецЭлемента();
		XML.ЗаписатьНачалоЭлемента("modification_id");     XML.ЗаписатьТекст(Стр1.Автомобиль.ВариантКомплектации.МодификацияАвтоРу.Наименование);                 XML.ЗаписатьКонецЭлемента();
		XML.ЗаписатьНачалоЭлемента("complectation_name");  XML.ЗаписатьТекст(Стр1.Автомобиль.ВариантКомплектации.КомплектацияАвтоРу.Наименование);                XML.ЗаписатьКонецЭлемента();
		
		Если НЕ обЗначениеНеЗаполнено(Стр1.Автомобиль.ВариантКомплектации.ТипКузова.ТипКузоваАвтоРу) Тогда
			XML.ЗаписатьНачалоЭлемента("body_type");       XML.ЗаписатьТекст(СокрЛП(Стр1.Автомобиль.ВариантКомплектации.ТипКузова.ТипКузоваАвтоРу)); XML.ЗаписатьКонецЭлемента();
		ИначеЕсли НЕ обЗначениеНеЗаполнено(Стр1.Автомобиль.Модель.ТипКузова.ТипКузоваАвтоРу) Тогда
			XML.ЗаписатьНачалоЭлемента("body_type");       XML.ЗаписатьТекст(СокрЛП(Стр1.Автомобиль.Модель.ТипКузова.ТипКузоваАвтоРу));              XML.ЗаписатьКонецЭлемента();
		КонецЕсли; 
		
		XML.ЗаписатьНачалоЭлемента("wheel");               XML.ЗаписатьТекст(СокрЛП(Стр1.Руль));                                                                  XML.ЗаписатьКонецЭлемента();
		XML.ЗаписатьНачалоЭлемента("color");               XML.ЗаписатьТекст(СокрЛП(Стр1.ЦветАвтоРу));                                                            XML.ЗаписатьКонецЭлемента();
		XML.ЗаписатьНачалоЭлемента("metallic");            XML.ЗаписатьТекст(СокрЛП(Нрег(Стр1.Автомобиль.Цвет.ОкраскаМеталлик)));                                 XML.ЗаписатьКонецЭлемента();  
		
		//Бондаренко++ 20211115
		//XML.ЗаписатьНачалоЭлемента("availability");        XML.ЗаписатьТекст("В наличии");                                                                        XML.ЗаписатьКонецЭлемента();
		XML.ЗаписатьНачалоЭлемента("availability");        XML.ЗаписатьТекст(СокрЛП(Стр1.Доступность));                                                                        XML.ЗаписатьКонецЭлемента();
		//Бондаренко++ 20211115		
		
		XML.ЗаписатьНачалоЭлемента("custom");              XML.ЗаписатьТекст("Растаможен");                                                                       XML.ЗаписатьКонецЭлемента();
		XML.ЗаписатьНачалоЭлемента("state");               XML.ЗаписатьТекст(СокрЛП(Стр1.Состояние));                                                             XML.ЗаписатьКонецЭлемента();
		XML.ЗаписатьНачалоЭлемента("owners_number");       XML.ЗаписатьТекст("Не было владельцев");                                                               XML.ЗаписатьКонецЭлемента();
		//XML.ЗаписатьНачалоЭлемента("run");               XML.ЗаписатьТекст(СокрЛП(Стр1.Пробег));                                                                XML.ЗаписатьКонецЭлемента();
		XML.ЗаписатьНачалоЭлемента("run");                 XML.ЗаписатьТекст("0");                                                                                XML.ЗаписатьКонецЭлемента();
		XML.ЗаписатьНачалоЭлемента("year");                XML.ЗаписатьТекст(Формат(Стр1.Автомобиль.ГодВыпуска,"ДФ=yyyy"));                                       XML.ЗаписатьКонецЭлемента();
		//XML.ЗаписатьНачалоЭлемента("registry_year");     XML.ЗаписатьТекст(Формат(Стр1.Автомобиль.ГодВыпуска,"ДФ=yyyy"));                                       XML.ЗаписатьКонецЭлемента();
		XML.ЗаписатьНачалоЭлемента("doors_count");         XML.ЗаписатьТекст(СокрЛП(Стр1.КоличествоДверей));                                                      XML.ЗаписатьКонецЭлемента();
		XML.ЗаписатьНачалоЭлемента("currency");            XML.ЗаписатьТекст("RUR");                                                                              XML.ЗаписатьКонецЭлемента();
		XML.ЗаписатьНачалоЭлемента("vin");                 XML.ЗаписатьТекст(Стр1.VIN);                                                                           XML.ЗаписатьКонецЭлемента();
		
		//Бондаренко++ 20201026
		XML.ЗаписатьНачалоЭлемента("ColorCode");           XML.ЗаписатьТекст(Стр1.Автомобиль.Цвет.Артикул);                                                       XML.ЗаписатьКонецЭлемента();
		XML.ЗаписатьНачалоЭлемента("SpecId");              XML.ЗаписатьТекст(Стр1.Автомобиль.ВариантКомплектации.Артикул);                                        XML.ЗаписатьКонецЭлемента();
		//Бондаренко-- 20201026
		
		XML.ЗаписатьНачалоЭлемента("price");               XML.ЗаписатьТекст(СокрЛП(СтрЗаменить(Стр1.Цена,Символы.НПП,"")));                                XML.ЗаписатьКонецЭлемента(); 
		XML.ЗаписатьНачалоЭлемента("special_price");       XML.ЗаписатьТекст(СокрЛП(СтрЗаменить(Стр1.СпециальнаяЦена,Символы.НПП,"")));                         XML.ЗаписатьКонецЭлемента(); 
		XML.ЗаписатьНачалоЭлемента("credit_discount");     XML.ЗаписатьТекст(СокрЛП(СтрЗаменить(Стр1.СкидкаПриПокупкеВКредит,Символы.НПП,"")));                 XML.ЗаписатьКонецЭлемента(); 
		XML.ЗаписатьНачалоЭлемента("insurance_discount");  XML.ЗаписатьТекст(СокрЛП(СтрЗаменить(Стр1.СкидкаПриСтраховании,Символы.НПП,"")));                    XML.ЗаписатьКонецЭлемента();  
		XML.ЗаписатьНачалоЭлемента("tradein_discount");    XML.ЗаписатьТекст(СокрЛП(СтрЗаменить(Стр1.СкидаПриПокупкеВТрейдИн,Символы.НПП,"")));                 XML.ЗаписатьКонецЭлемента();  
		XML.ЗаписатьНачалоЭлемента("max_discount");        XML.ЗаписатьТекст(СокрЛП(СтрЗаменить(Стр1.СкидкаМаксимальная,Символы.НПП,"")));                      XML.ЗаписатьКонецЭлемента(); 
		
		Если Стр1.Автомобиль.ПутьКФото.Количество() > 0 Тогда
			XML.ЗаписатьНачалоЭлемента("images");
			Для каждого СтрТЧ Из Стр1.Автомобиль.ПутьКФото Цикл
				XML.ЗаписатьНачалоЭлемента("image");
				//Бондаренко++ 20220303
				//XML.ЗаписатьТекст(HTTPRequest.БазовыйURL+"/photo/"+Стр1.Автомобиль.VIN+"/"+СтрТЧ.НомерСтроки+".jpg");
				XML.ЗаписатьТекст(HTTPRequest.БазовыйURL+"/photo/"+Стр1.Автомобиль.УникальныйИдентификатор()+"/"+СтрТЧ.GUID+".jpg");
				//Бондаренко-- 20220303
				XML.ЗаписатьКонецЭлемента(); //url	
			КонецЦикла; 
			XML.ЗаписатьКонецЭлемента(); //images	
		КонецЕсли; 

		//Бондаренко++ 20220929                    
		ВидеоДляСайта = "";
		ВидеоДляСайта = СМ_ВыгрузкаОбъявленийОПродажеАвто.СМГ_СправочникВернутьЗначениеРеквизита("СсылкаНаВидео",Стр1.Автомобиль.ПолучитьОбъект());
		ВидеоДляСайта = СтрЗаменить(ВидеоДляСайта,"https://youtu.be/","https://www.youtube.com/watch?v=");		
		//Бондаренко-- 20220929		
		
		Если НЕ обЗначениеНеЗаполнено(ВидеоДляСайта) Тогда
			XML.ЗаписатьНачалоЭлемента("video");     XML.ЗаписатьТекст(ВидеоДляСайта); 	                                                          XML.ЗаписатьКонецЭлемента(); 		
		КонецЕсли; 
		
		ТекстКлассифайда = СокрЛП(Стр1.Автомобиль.Модель.ТекстКлассифайда);
		Если обЗначениеНеЗаполнено(ТекстКлассифайда) Тогда
			ТекстКлассифайда = СокрЛП(Стр1.Подразделение.ТекстКлассифайда);
			Если обЗначениеНеЗаполнено(ТекстКлассифайда) Тогда
				ТекстКлассифайда = СокрЛП(Стр1.Подразделение.Родитель.ТекстКлассифайда);
			КонецЕсли; 
		КонецЕсли; 
		
		XML.ЗаписатьНачалоЭлемента("description");   XML.ЗаписатьТекст(ТекстКлассифайда);                                                                         XML.ЗаписатьКонецЭлемента();	 //comment
		
		XML.ЗаписатьКонецЭлемента(); //Car
		
	КонецЦикла; 
	
	XML.ЗаписатьКонецЭлемента();	 //Cars
	
	XML.ЗаписатьКонецЭлемента();         //Data
	
	XMLТекст = XML.Закрыть();
	
	Возврат XMLТекст;
	
КонецФункции

Функция ПолучитьСписокПодразделенийСДочернимиИзЗапроса(HTTPRequest) Экспорт
	
	сзКодовПодразделений = Новый СписокЗначений;
	сзКодовПодразделений.ЗагрузитьЗначения(обМояРазложитьСтрокуВМассивПодстрок(HTTPRequest.ПараметрыURL["UnitCode"], ";"));
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ПодразделенияКомпании.Ссылка,
	|	ПодразделенияКомпании.Родитель.Код,
	|   ПодразделенияКомпании.Код
	|ИЗ
	|	Справочник.ПодразделенияКомпании КАК ПодразделенияКомпании
	|ГДЕ
	|	ПодразделенияКомпании.Родитель.Код В (&сзКодовПодразделений)
	|	ИЛИ ПодразделенияКомпании.Код В (&сзКодовПодразделений)";
	
	Запрос.УстановитьПараметр("сзКодовПодразделений", сзКодовПодразделений);
	
	СписокПодразделенийСДочерними = Новый СписокЗначений;
	СписокПодразделенийСДочерними.ЗагрузитьЗначения(Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка"));
	
	Возврат СписокПодразделенийСДочерними;
КонецФункции

Функция ПолучитьФотоАвтомобиля(УникальныйИдентификатор,НомерКартинки) Экспорт
	
	ПолныйПутьКХранилищу = ""; 
	
	//Бондаренко++ 20220328
	ПолныйПутьКХранилищу =  СокрЛП(Константы.ПустьКХранилищюСканов.Получить())+"\"+СокрЛП(ОбщиеСервер.ПолучитьИмяИБ())+"\carphoto\"+УникальныйИдентификатор+"\"+НомерКартинки+".jpg";
	//Бондаренко-- 20220328
	
	Если НЕ обЗначениеНеЗаполнено(ПолныйПутьКХранилищу) Тогда
		// evgeny.s
		ФайлКартинки = Новый Файл(ПолныйПутьКХранилищу);
		Если ФайлКартинки.Существует() Тогда
			ДвоичныеДанныеКартинки = Новый ДвоичныеДанные(ПолныйПутьКХранилищу);
			Возврат ДвоичныеДанныеКартинки;
		Иначе
			Возврат "";
		КонецЕсли;	
		// evgeny.s
	КонецЕсли; 
	
	Возврат "";
	
КонецФункции

Функция ПолучитьСписокМарокАвто(Подр) Экспорт
	
	СЗ = Новый СписокЗначений;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ПодразделенияКомпанииМаркиАвтомобилей.Ссылка,
	|	ПодразделенияКомпанииМаркиАвтомобилей.Марка
	|ИЗ
	|	Справочник.ПодразделенияКомпании.МаркиАвтомобилей КАК ПодразделенияКомпанииМаркиАвтомобилей
	|ГДЕ
	|	ПодразделенияКомпанииМаркиАвтомобилей.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", Подр);
	
	СЗ.ЗагрузитьЗначения(Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Марка"));
	
	Если СЗ.Количество() = 0 Тогда
		Если НЕ обЗначениеНеЗаполнено(Подр.Родитель) Тогда
			СЗ = ПолучитьСписокМарокАвто(Подр.Родитель);
			Если СЗ.Количество() > 0 Тогда
				Возврат СЗ;	 	
			КонецЕсли;
		Иначе
			Возврат СЗ;	 	
		КонецЕсли; 
	Иначе	
		Возврат СЗ;	 
	КонецЕсли; 
	
КонецФункции // ПолучитьСписокМарок()

//Бондаренко++ 20221214
Функция АвтомобильНовый(Автомобиль) Экспорт
	ВидАвтомобиля = Справочники.Автомобили.ЧтениеЗначенияРегистраСведения(Автомобиль, Перечисления.ДополнительнаяИнформацияАвтомобилей.ВидАвтомобиля, ТекущаяДата());
	Возврат ( Не обЗначениеНеЗаполнено(ВидАвтомобиля) ) И ВидАвтомобиля = Перечисления.ВидАвтомобиля.Новый;
КонецФункции

Функция АвтомобильСПробегом(Автомобиль) Экспорт
	ВидАвтомобиля = Справочники.Автомобили.ЧтениеЗначенияРегистраСведения(Автомобиль, Перечисления.ДополнительнаяИнформацияАвтомобилей.ВидАвтомобиля, ТекущаяДата());
	Возврат ( Не обЗначениеНеЗаполнено(ВидАвтомобиля) ) И ВидАвтомобиля = Перечисления.ВидАвтомобиля.АвтомобильСПробегом;
КонецФункции

Функция АвтомобильПараллельногоИмпорта(Автомобиль) Экспорт
	//Бондаренко++ 20230304 
	//ПараллельныйИмпорт = Справочники.Автомобили.ЧтениеЗначенияРегистраСведения(Автомобиль, Перечисления.ДополнительнаяИнформацияАвтомобилей.ПараллельныйИмпорт, ТекущаяДата());
	//Если ПараллельныйИмпорт = Неопределено Тогда
	// ПараллельныйИмпорт = Ложь;
	// КонецЕсли;
	//Возврат ПараллельныйИмпорт;
	ВидАвтомобиля = Справочники.Автомобили.ЧтениеЗначенияРегистраСведения(Автомобиль, Перечисления.ДополнительнаяИнформацияАвтомобилей.ВидАвтомобиля, ТекущаяДата());
	Возврат ( Не обЗначениеНеЗаполнено(ВидАвтомобиля) ) И ( ВидАвтомобиля = Перечисления.ВидАвтомобиля.ПараллельныйИмпортБУ ИЛИ ВидАвтомобиля = Перечисления.ВидАвтомобиля.ПараллельныйИмпорт );
	//Бондаренко-- 20230304
КонецФункции
//Бондаренко-- 20221214

//Бондаренко++ 20230531
Функция ДописатьОпции(ВариантКомплектации,XML_Полный,ЭтоАвито);

	Запрос=Новый Запрос;
	Запрос.Текст="ВЫБРАТЬ
	             |	ОпцииВариантовКомплектации.Опция КАК Опция,
	             |	ОпцииВариантовКомплектации.Опция.Наименование КАК ОпцияНаименование,
	             |	ОпцииВариантовКомплектации.Количество КАК Количество,
	             |	ОпцииВариантовКомплектации.Опция.ОпцияАвтоРу КАК ОпцияАвтоРу,
	             |	ОпцииВариантовКомплектации.Опция.ОпцияАвито КАК ОпцияАвито,
	             |	ОпцииВариантовКомплектации.Опция.ОпцияАвито.Родитель КАК ОпцияАвитоРодитель
	             |ИЗ
	             |	РегистрСведений.ОпцииВариантовКомплектации КАК ОпцииВариантовКомплектации
	             |ГДЕ
	             |	ОпцииВариантовКомплектации.ВариантКомплектации = &ВариантКомплектации
	             |	И (ОпцииВариантовКомплектации.ВидВключения = 2
	             |			ИЛИ ОпцииВариантовКомплектации.ВидВключения = 1)
	             |
	             |УПОРЯДОЧИТЬ ПО
	             |	ОпцияНаименование";
	Запрос.УстановитьПараметр("ВариантКомплектации",ВариантКомплектации);
	
	тзОпции=Запрос.Выполнить().Выгрузить();
	
	СписокОпцийАвтоРу = "";
	
	Для каждого Стр Из тзОпции Цикл 
		Если ЭтоАвито Тогда
			Если обЗначениеНеЗаполнено(Стр.ОпцияАвито) Тогда
				Продолжить;
			КонецЕсли; 
			Если обЗначениеНеЗаполнено(Стр.ОпцияАвитоРодитель) Тогда
				Продолжить;
			КонецЕсли; 
			opc_str = СокрЛП(Стр.ОпцияАвито);
			//Бондаренко++ 20230613
			name_opc_str = СтрЗаменить(СокрЛП(Стр.ОпцияАвитоРодитель)," ","");
			//Бондаренко-- 20230613
			XML_Полный.ЗаписатьНачалоЭлемента(""+name_opc_str);      XML_Полный.ЗаписатьТекст(opc_str);             XML_Полный.ЗаписатьКонецЭлемента();
		Иначе
			Если обЗначениеНеЗаполнено(Стр.ОпцияАвтоРу) Тогда
				Продолжить;
			КонецЕсли; 
 			opc_str = СокрЛП(Стр.ОпцияАвтоРу);
			Если СписокОпцийАвтоРу <> "" Тогда
				СписокОпцийАвтоРу = СписокОпцийАвтоРу+", "+opc_str;
 			Иначе
				СписокОпцийАвтоРу = opc_str;			
			КонецЕсли;
 		КонецЕсли;
	КонецЦикла;
	
	Если НЕ ЭтоАвито Тогда
 		XML_Полный.ЗаписатьНачалоЭлемента("extras");      XML_Полный.ЗаписатьТекст(opc_str);             XML_Полный.ЗаписатьКонецЭлемента();
	КонецЕсли;
	
КонецФункции // ДописатьОпции(ВарКомпл,XML_Полный,ЭтоАвито)
//Бондаренко-- 20230531

//Бондаренко++ 20230711
Функция ПолучитьXMLОбъявленийLegoCarLk(HTTPRequest,FlagHTTPService) Экспорт
	
	ТаблицаАвто = ПолучитьТаблицуАвто();
	
  	Если FlagHTTPService Тогда
		ТаблицаДляВыгрузки = ПолучитьТаблицуЛичногоКабинетаЛегоКарИзЗапроса(HTTPRequest.ПараметрыURL["UnitCode"]);
	Иначе	
		ТаблицаДляВыгрузки = ПолучитьТаблицуЛичногоКабинетаЛегоКарИзЗапроса(Прав(HTTPRequest,9));
	КонецЕсли;
 	

 	СписокАвто = ПолучитьСписокАвтоОстатковИзаказов(ТаблицаДляВыгрузки);

 	
	XML_Полный=Новый ЗаписьXML();
	XML_Полный.УстановитьСтроку(Новый ПараметрыЗаписиXML("UTF-8","1.0",false));
	XML_Полный.ЗаписатьОбъявлениеXML();
	
	XML_Полный.ЗаписатьНачалоЭлемента("auto-catalog");
	XML_Полный.ЗаписатьНачалоЭлемента("offers");
	//XML_Полный.ЗаписатьАтрибут("formatVersion","3");
	//XML_Полный.ЗаписатьАтрибут("target","LegoCar.ru"); 
	

 	Если СписокАвто.Количество() > 0 Тогда
		Для каждого Эл Из СписокАвто Цикл
			
			ТекАвто = Эл.Значение; 
			
 		 	Если НЕ АвтомобильНовый(ТекАвто) Тогда
  				Продолжить;
			КонецЕсли;             
			
 			Если НЕ ТекАвто.ВыгружатьАвтомобильНаСайт Тогда
				Продолжить;	
			КонецЕсли; 
  	 			
 			ПодразделениеАвто = "";
			ПодразделениеАвто = НайтиПодрАвто(ТекАвто,ТаблицаАвто);
 			
			Если обЗначениеНеЗаполнено(ПодразделениеАвто) Тогда
				АдресОП   = ПолучитьАдресОтделаПродаж(ТаблицаДляВыгрузки,ТекАвто.Модель.Марка);
				ТелефонОП = ПолучитьТелефонОтделаПродаж(ТаблицаДляВыгрузки,ТекАвто.Модель.Марка);
			Иначе
				АдресОП   = ПолучитьАдресОтделаПродажПодразделения(ТаблицаДляВыгрузки,ТекАвто.Модель.Марка,ПодразделениеАвто);
				ТелефонОП = ПолучитьТелефонОтделаПродажПодразделения(ТаблицаДляВыгрузки,ТекАвто.Модель.Марка,ПодразделениеАвто);
			КонецЕсли;
 			Если обЗначениеНеЗаполнено(АдресОП) ИЛИ обЗначениеНеЗаполнено(ТелефонОП) Тогда
				Продолжить;
			КонецЕсли;
    			
			Если FlagHTTPService Тогда
 				ЗаполнитьОбъявлениеЛегоКарЛегковой(ТекАвто,HTTPRequest.БазовыйURL,АдресОП,ТелефонОП, XML_Полный); 

			Иначе
				ЗаполнитьОбъявлениеЛегоКарЛегковой(ТекАвто,Сред(HTTPRequest,1,СтрДлина(HTTPRequest)-21),АдресОП,ТелефонОП, XML_Полный); 
 			КонецЕсли;
			
		КонецЦикла;             
	КонецЕсли;
	
	XML_Полный.ЗаписатьКонецЭлемента();     //offers
	XML_Полный.ЗаписатьКонецЭлемента();     //auto-catalog 
 	XMLТекст = XML_Полный.Закрыть();
	Возврат XMLТекст;
	
КонецФункции // ПолучитьXMLОбъявленийLegoCarLk(HTTPRequest,FlagHTTPService)

Функция ПолучитьТаблицуЛичногоКабинетаЛегоКарИзЗапроса(КодЛичногоКабинета) Экспорт
	
	//КодЛичногоКабинета = HTTPRequest.ПараметрыURL["UnitCode"];
	
	HTTPRequest = Новый Запрос;
	HTTPRequest.Текст =	"ВЫБРАТЬ
	                   	|	СМ_ЛичныеКабинеты_ЛегоКарМарки.Ссылка.Код КАК КодЛичногоКабинета,
	                   	|	СМ_ЛичныеКабинеты_ЛегоКарМарки.Ссылка.Ссылка КАК ЛичныйКабинет,
	                   	|	СМ_ЛичныеКабинеты_ЛегоКарМарки.Марка,
	                   	|	СМ_ЛичныеКабинеты_ЛегоКарМарки.ПредставлениеТелефона,
	                   	|	СМ_ЛичныеКабинеты_ЛегоКарПодразделения.Подразделение,
	                   	|	СМ_ЛичныеКабинеты_ЛегоКарМарки.Адрес
	                   	|ИЗ
	                   	|	Справочник.СМ_ЛичныеКабинеты_ЛегоКар.Марки КАК СМ_ЛичныеКабинеты_ЛегоКарМарки
	                   	|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	                   	|			СМ_ЛичныеКабинеты_АвитоПодразделения.Ссылка КАК Ссылка,
	                   	|			СМ_ЛичныеКабинеты_АвитоПодразделения.ИдентификаторМарки КАК ИдентификаторМарки,
	                   	|			СМ_ЛичныеКабинеты_АвитоПодразделения.Подразделение КАК Подразделение
	                   	|		ИЗ
	                   	|			Справочник.СМ_ЛичныеКабинеты_ЛегоКар.Подразделения КАК СМ_ЛичныеКабинеты_АвитоПодразделения) КАК СМ_ЛичныеКабинеты_ЛегоКарПодразделения
	                   	|		ПО СМ_ЛичныеКабинеты_ЛегоКарМарки.Ссылка = СМ_ЛичныеКабинеты_ЛегоКарПодразделения.Ссылка
	                   	|			И СМ_ЛичныеКабинеты_ЛегоКарМарки.ИдентификаторМарки = СМ_ЛичныеКабинеты_ЛегоКарПодразделения.ИдентификаторМарки
	                   	|ГДЕ
	                   	|	СМ_ЛичныеКабинеты_ЛегоКарМарки.Ссылка.Код = &КодЛичногоКабинета";
	
	HTTPRequest.УстановитьПараметр("КодЛичногоКабинета", КодЛичногоКабинета);
	
	ТЗ = HTTPRequest.Выполнить().Выгрузить();
	
	Возврат ТЗ;
	
КонецФункции  //ПолучитьТаблицуЛичногоКабинетаЛегоКарИзЗапроса(HTTPRequest)

Процедура ЗаполнитьОбъявлениеЛегоКарЛегковой(ТекАвто,HTTPRequestБазовыйURL,АдресОтделаПродаж,ТелефонОтделаПродаж, XML_Полный) Экспорт
	
  	XML_Полный.ЗаписатьНачалоЭлемента("offer");
	XML_Полный.ЗаписатьНачалоЭлемента("mark");                  XML_Полный.ЗаписатьТекст(ТекАвто.Модель.Марка.МаркаАвито.Наименование);                  XML_Полный.ЗаписатьКонецЭлемента();
	
	Если обЗначениеНеЗаполнено(ТекАвто.ГодВыпуска) Тогда
		ГодВыпуска_ = НачалоГода(ТекущаяДата());	
	Иначе		
		ГодВыпуска_ = ТекАвто.ГодВыпуска;		
	КонецЕсли; 
 	XML_Полный.ЗаписатьНачалоЭлемента("year");                  XML_Полный.ЗаписатьТекст(Формат(ГодВыпуска_,"ДФ=yyyy"));                                 XML_Полный.ЗаписатьКонецЭлемента();

	XML_Полный.ЗаписатьНачалоЭлемента("TrimCode");              XML_Полный.ЗаписатьТекст(ТекАвто.ВариантКомплектации.Артикул);                         	 XML_Полный.ЗаписатьКонецЭлемента();
	XML_Полный.ЗаписатьНачалоЭлемента("ColorCode");             XML_Полный.ЗаписатьТекст(СокрЛП(ТекАвто.Цвет.Артикул));                                  XML_Полный.ЗаписатьКонецЭлемента();
	XML_Полный.ЗаписатьНачалоЭлемента("ColorCode_int");         XML_Полный.ЗаписатьТекст(СокрЛП(ТекАвто.ТипСалона.КодСалона));                           XML_Полный.ЗаписатьКонецЭлемента();
	
 	Для каждого СтрТЧ Из ТекАвто.ПутьКФото Цикл
		XML_Полный.ЗаписатьНачалоЭлемента("file");
 		XML_Полный.ЗаписатьАтрибут("file_type","image");
		XML_Полный.ЗаписатьТекст(HTTPRequestБазовыйURL+"/photo/"+ТекАвто.УникальныйИдентификатор()+"/"+СтрТЧ.GUID+".jpg");
 		XML_Полный.ЗаписатьКонецЭлемента();
	КонецЦикла; 
 	
	Если СокрЛП(ТекАвто.VIN) <> "" Тогда
		XML_Полный.ЗаписатьНачалоЭлемента("VIN");                 XML_Полный.ЗаписатьТекст(ТекАвто.VIN);                                                 XML_Полный.ЗаписатьКонецЭлемента();
	Иначе
		ВнешнийНомерЗаказа = ПолучитьВнешнийНомерЗаказа(ТекАвто);
		Если СокрЛП(ВнешнийНомерЗаказа) <> "" Тогда		
			XML_Полный.ЗаписатьНачалоЭлемента("VIN");             XML_Полный.ЗаписатьТекст(ВнешнийНомерЗаказа);                                          XML_Полный.ЗаписатьКонецЭлемента();
		КонецЕсли;	
	КонецЕсли;

	ПолнаяЦенаПродажи = 0.00;
	ПарОтбора = Новый Структура();
	ПарОтбора.Вставить("Автомобиль",ТекАвто);
	ПарОтбора.Вставить("ТипЦен",Справочники.ТипыЦен.ОсновнойТипЦенПродажи);
	ЦенаАвто = РегистрыСведений.ЦеныАвтомобилей.ПолучитьПоследнее(ТекущаяДата(),ПарОтбора).Цена;
	ПолнаяЦенаПродажи = ЦенаАвто+ТекАвто.СтоимостьДопОборудования;
	
	XML_Полный.ЗаписатьНачалоЭлемента("price");                   XML_Полный.ЗаписатьТекст(СтрЗаменить(ПолнаяЦенаПродажи,Символы.НПП,""));               XML_Полный.ЗаписатьКонецЭлемента();		 			
 		
	Если НЕ обЗначениеНезаполнено(ТекАвто.СкидкаМаксимальная) Тогда
		XML_Полный.ЗаписатьНачалоЭлемента("max_discount");        XML_Полный.ЗаписатьТекст(СокрЛП(СтрЗаменить(ТекАвто.СкидкаМаксимальная,Символы.НПП,"")));            XML_Полный.ЗаписатьКонецЭлемента(); 
	КонецЕсли;
	
 	Если НЕ обЗначениеНезаполнено(ТекАвто.СкидкаПриСтраховании) Тогда
		XML_Полный.ЗаписатьНачалоЭлемента("insurance_discount");  XML_Полный.ЗаписатьТекст(СокрЛП(СтрЗаменить(ТекАвто.СкидкаПриСтраховании,Символы.НПП,"")));         XML_Полный.ЗаписатьКонецЭлемента();  
	КонецЕсли; 
	
	Если НЕ обЗначениеНезаполнено(ТекАвто.СкидаПриПокупкеВТрейдИн) Тогда
		XML_Полный.ЗаписатьНачалоЭлемента("tradein_discount");    XML_Полный.ЗаписатьТекст(СокрЛП(СтрЗаменить(ТекАвто.СкидаПриПокупкеВТрейдИн,Символы.НПП,"")));      XML_Полный.ЗаписатьКонецЭлемента();  
	КонецЕсли; 

	Если НЕ обЗначениеНезаполнено(ТекАвто.СкидкаПриПокупкеВКредит) Тогда
		XML_Полный.ЗаписатьНачалоЭлемента("credit_discount");     XML_Полный.ЗаписатьТекст(СокрЛП(СтрЗаменить(ТекАвто.СкидкаПриПокупкеВКредит,Символы.НПП,"")));      XML_Полный.ЗаписатьКонецЭлемента(); 
	КонецЕсли; 
 	
	//XML_Полный.ЗаписатьНачалоЭлемента("Id");                  XML_Полный.ЗаписатьТекст(СокрЛП(ТекАвто.Код));                     XML_Полный.ЗаписатьКонецЭлемента();
 	//XML_Полный.ЗаписатьНачалоЭлемента("Description");         XML_Полный.ЗаписатьТекст(ТекстКлассифайда);                        XML_Полный.ЗаписатьКонецЭлемента();	 //Description
 	//XML_Полный.ЗаписатьНачалоЭлемента("Category");            XML_Полный.ЗаписатьТекст("Автомобили");                            XML_Полный.ЗаписатьКонецЭлемента();	 //Category
	//XML_Полный.ЗаписатьНачалоЭлемента("CarType");             XML_Полный.ЗаписатьТекст("Новые");                                 XML_Полный.ЗаписатьКонецЭлемента();	 //CarType
  	//XML_Полный.ЗаписатьНачалоЭлемента("Model");                   XML_Полный.ЗаписатьТекст(ТекАвто.Модель.МодельАвито.Наименование);                          XML_Полный.ЗаписатьКонецЭлемента();
 	//Если ПолучитьМестоположенияАвто(ТекАвто) Тогда
	//	XML_Полный.ЗаписатьНачалоЭлемента("Availability");          XML_Полный.ЗаписатьТекст("В наличии");                                    XML_Полный.ЗаписатьКонецЭлемента();
	//Иначе
	//	XML_Полный.ЗаписатьНачалоЭлемента("Availability");          XML_Полный.ЗаписатьТекст("В пути");                                       XML_Полный.ЗаписатьКонецЭлемента();
	//КонецЕсли;  
 	//XML_Полный.ЗаписатьНачалоЭлемента("BodyType");                XML_Полный.ЗаписатьТекст(СокрЛП(ТекАвто.ВариантКомплектации.ТипКузова.ТипКузоваАвито));  XML_Полный.ЗаписатьКонецЭлемента();
	//XML_Полный.ЗаписатьНачалоЭлемента("Doors");                   XML_Полный.ЗаписатьТекст(СокрЛП(ТекАвто.ВариантКомплектации.КоличествоДверей));          XML_Полный.ЗаписатьКонецЭлемента();
	//XML_Полный.ЗаписатьНачалоЭлемента("ModificationId");          XML_Полный.ЗаписатьТекст(ТекАвто.ВариантКомплектации.МодификацияАвито.Артикул);          XML_Полный.ЗаписатьКонецЭлемента();
	//XML_Полный.ЗаписатьНачалоЭлемента("GenerationId");            XML_Полный.ЗаписатьТекст(ТекАвто.Модель.ГенерацияАвито.Артикул);                         XML_Полный.ЗаписатьКонецЭлемента();
	//XML_Полный.ЗаписатьНачалоЭлемента("ComplectationId");         XML_Полный.ЗаписатьТекст(ТекАвто.ВариантКомплектации.КомплектацияАвито.Артикул);         XML_Полный.ЗаписатьКонецЭлемента();	
 	//ТипТоплива = ТекАвто.ВариантКомплектации.ТипДвигателя.ТипТоплива;
	//Если ТипТоплива = Перечисления.ТипыТоплива.LiquefiedGas ИЛИ ТипТоплива = ТипТоплива = Перечисления.ТипыТоплива.PressureGas Тогда
	//	XML_Полный.ЗаписатьНачалоЭлемента("FuelType");            XML_Полный.ЗаписатьТекст("Газ");                                                         XML_Полный.ЗаписатьКонецЭлемента();
	//ИначеЕсли ТипТоплива = Перечисления.ТипыТоплива.Diesel Тогда	
	//	XML_Полный.ЗаписатьНачалоЭлемента("FuelType");            XML_Полный.ЗаписатьТекст("Дизель");                                                      XML_Полный.ЗаписатьКонецЭлемента();
	//ИначеЕсли ТипТоплива = Перечисления.ТипыТоплива.None Тогда		
	//	XML_Полный.ЗаписатьНачалоЭлемента("FuelType");            XML_Полный.ЗаписатьТекст("Электро");                                                     XML_Полный.ЗаписатьКонецЭлемента();		
	//Иначе
	//	XML_Полный.ЗаписатьНачалоЭлемента("FuelType");            XML_Полный.ЗаписатьТекст(СокрЛП(ТипТоплива));                                            XML_Полный.ЗаписатьКонецЭлемента();	
	//КонецЕсли; 
 	//ТипДвигателя_ = СМ_ВыгрузкаОбъявленийОПродажеАвто.СМГ_СправочникВернутьЗначениеРеквизита("ТипДвигателя",ТекАвто.ПолучитьОбъект());
	//Попытка	EngineSize_str =  СтрЗаменить(СокрЛП(ТипДвигателя_.ОбъемДвигателя),Символы.НПП,""); Исключение КонецПопытки; 
	//Если НЕ обЗначениеНеЗаполнено(EngineSize_str) Тогда
	//	//XML_Полный.ЗаписатьНачалоЭлемента("EngineSize");          XML_Полный.ЗаписатьТекст(EngineSize_str);                                                XML_Полный.ЗаписатьКонецЭлемента();
	//КонецЕсли;
 	//Попытка	Power_str =  СтрЗаменить(СокрЛП(ТипДвигателя_.МощностьДвигателя),Символы.НПП,""); Исключение КонецПопытки; 
	//Если НЕ обЗначениеНеЗаполнено(Power_str) Тогда
	//	XML_Полный.ЗаписатьНачалоЭлемента("Power");               XML_Полный.ЗаписатьТекст(Power_str);                                                     XML_Полный.ЗаписатьКонецЭлемента();
	//КонецЕсли;
 	//ТипКПП_ =  СМ_ВыгрузкаОбъявленийОПродажеАвто.СМГ_СправочникВернутьЗначениеРеквизита("ТипКПП",ТекАвто.ПолучитьОбъект());
	//Попытка	Transmission_str = СокрЛП(ТипКПП_.Наименование);  Исключение КонецПопытки;  
	//Если НЕ обЗначениеНеЗаполнено(Transmission_str) Тогда
	//	XML_Полный.ЗаписатьНачалоЭлемента("Transmission");        XML_Полный.ЗаписатьТекст(Transmission_str);                                              XML_Полный.ЗаписатьКонецЭлемента();
	//КонецЕсли;
 	////Бондаренко++ 20221208
	////DriveType_ = ТекАвто.Привод;                                                                                           
	//DriveType_ =  СМ_ВыгрузкаОбъявленийОПродажеАвто.СМГ_СправочникВернутьЗначениеРеквизита("Привод",ТекАвто.ПолучитьОбъект());
	////Бондаренко-- 20221208
	//Если DriveType_= Перечисления.Привод.Передний ИЛИ 
	//	DriveType_= Перечисления.Привод.Задний 	ИЛИ 
	//	DriveType_= Перечисления.Привод.Полный Тогда
	//	DriveType_str = СокрЛП(DriveType_);    
	//Иначе 
	//	DriveType_str = "Полный";
	//КонецЕсли;	
 	//Если НЕ обЗначениеНеЗаполнено(DriveType_str) Тогда
	//	//XML_Полный.ЗаписатьНачалоЭлемента("DriveType");            XML_Полный.ЗаписатьТекст(DriveType_str);                                                XML_Полный.ЗаписатьКонецЭлемента();
	//КонецЕсли;
 	//Руль_ = СМ_ВыгрузкаОбъявленийОПродажеАвто.СМГ_СправочникВернутьЗначениеРеквизита("Руль",ТекАвто.ПолучитьОбъект());
	//WheelType_str = СокрЛП(Руль_);
	//WheelType_str = Врег(Сред(WheelType_str,1,1))+Сред(WheelType_str,2);
	//Если WheelType_str<>"" Тогда
	//	XML_Полный.ЗаписатьНачалоЭлемента("WheelType");            XML_Полный.ЗаписатьТекст(WheelType_str);                                                XML_Полный.ЗаписатьКонецЭлемента();
	//КонецЕсли;
 	//Если НЕ обЗначениеНеЗаполнено(ТекАвто.ВариантКомплектации) Тогда
	//	ЭтоАвито = Истина;
	//	ДописатьОпции(ТекАвто.ВариантКомплектации,XML_Полный,ЭтоАвито);
	//КонецЕсли;             
 	//ВидеоДляСайта = "";
	//ВидеоДляСайта = СМ_ВыгрузкаОбъявленийОПродажеАвто.СМГ_СправочникВернутьЗначениеРеквизита("СсылкаНаВидео",ТекАвто.ПолучитьОбъект());
	//ВидеоДляСайта = СтрЗаменить(ВидеоДляСайта,"https://youtu.be/","https://www.youtube.com/watch?v=");		
 	//Если НЕ обЗначениеНеЗаполнено(ВидеоДляСайта) Тогда
	// 	XML_Полный.ЗаписатьНачалоЭлемента("VideoURL");     XML_Полный.ЗаписатьТекст(ВидеоДляСайта);                	                                       XML_Полный.ЗаписатьКонецЭлемента(); 		
	//КонецЕсли; 
 	////ТелефонОтделаПродаж = "";
	////ТелефонОтделаПродаж = ПолучитьТелефонОтделаПродаж(ТаблицаДляВыгрузки,ТекАвто.Модель.Марка);
 	//XML_Полный.ЗаписатьНачалоЭлемента("ManagerName");       XML_Полный.ЗаписатьТекст("Отдел продаж");                                                      XML_Полный.ЗаписатьКонецЭлемента(); 
	//XML_Полный.ЗаписатьНачалоЭлемента("ContactMethod");     XML_Полный.ЗаписатьТекст("По телефону и в сообщениях");                                        XML_Полный.ЗаписатьКонецЭлемента(); 
	//XML_Полный.ЗаписатьНачалоЭлемента("ContactPhone");      XML_Полный.ЗаписатьТекст(СокрЛП(ТелефонОтделаПродаж));                                         XML_Полный.ЗаписатьКонецЭлемента(); 
	
	XML_Полный.ЗаписатьКонецЭлемента();	//ad
	
КонецПроцедуры // ЗаполнитьОбъявлениеЛегоКарЛегковой(ТекАвто,HTTPRequestБазовыйURL,АдресОтделаПродаж,ТелефонОтделаПродаж, XML_Полный) 

//Бондаренко-- 20230711

//Бондаренко++ 20231025
Функция ПолучитьМинимальнуюЦенуЗапчастей(ТаблицаДляВыгрузки,ТекДЦ)

	МинЦена = "";
	
	Отбор = Новый Структура();
 	Отбор.Вставить("ДилерскийЦентр",ТекДЦ);
	Строки = ТаблицаДляВыгрузки.НайтиСтроки(Отбор);
	
	Если Строки.Количество() > 0 Тогда
	    МинЦена = Строки[0].МинимальнаяЦена;
	КонецЕсли;
	
	Возврат МинЦена;
 	
КонецФункции // ПолучитьМинимальнуюЦенуЗапчастей(ТаблицаДляВыгрузки,ТекДЦ)
//Бондаренко-- 20231025

//Бондаренко++ 20231028
Функция ПолучитьТипЦенЗапчастей(ТаблицаДляВыгрузки,ТекДЦ)

	ТипЦен = "";
	
	Отбор = Новый Структура();
 	Отбор.Вставить("ДилерскийЦентр",ТекДЦ);
	Строки = ТаблицаДляВыгрузки.НайтиСтроки(Отбор);
	
	Если Строки.Количество() > 0 Тогда
	    МинЦена = Строки[0].ТипЦен;
	КонецЕсли;
	
	Возврат ТипЦен;
 	
КонецФункции // ПолучитьТипЦенЗапчастей(ТаблицаДляВыгрузки,ТекДЦ)

Функция ПолучитьПроцентНаценкиСкидкиЗапчастей(ТаблицаДляВыгрузки,ТекДЦ)

	ПроцентНаценкиСкидки = 0;
	
	Отбор = Новый Структура();
 	Отбор.Вставить("ДилерскийЦентр",ТекДЦ);
	Строки = ТаблицаДляВыгрузки.НайтиСтроки(Отбор);
	
	Если Строки.Количество() > 0 Тогда
	    МинЦена = Строки[0].ПроцентНаценкиСкидки;
	КонецЕсли;
	
	Возврат ПроцентНаценкиСкидки;
 	
КонецФункции // ПолучитьПроцентСкидкиНаценкиЗапчастей(ТаблицаДляВыгрузки,ТекДЦ)

//Бондаренко-- 20231028