
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("ДанныеПоВозврату") Тогда
		ЗаполнитьЗначенияСвойств(Объект,Параметры.ДанныеПоВозврату);		
	КонецЕсли; 
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	Если ЗначениеЗаполнено(ТекущийОбъект.Контрагент) Тогда
		
		ПараметрКонтрагент 		= Новый ПараметрВыбора("Отбор.Контрагент", 		ТекущийОбъект.Контрагент);
		ПараметрПометкаУдаления = Новый ПараметрВыбора("Отбор.ПометкаУдаления", Ложь);
		
		МассивПараметров = Новый Массив();
		МассивПараметров.Добавить(ПараметрКонтрагент);
		МассивПараметров.Добавить(ПараметрПометкаУдаления);
		
		НовыеПараметры = Новый ФиксированныйМассив(МассивПараметров);
		
		Элементы.КартаЛояльности.ПараметрыВыбора = НовыеПараметры;
		
	КонецЕсли; 
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
		
	ЗаполнитьДатуПогашения(ТекущийОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура КартаЛояльностиПриИзменении(Элемент)
	КартаЛояльностиПриИзмененииНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура КонтрагентПриИзменении(Элемент)
	КонтрагентПриИзмененииНаСервере();
КонецПроцедуры

&НаСервере
Процедура КартаЛояльностиПриИзмененииНаСервере()
	
	Объект.Контрагент = Объект.КартаЛояльности.Контрагент;	
	
КонецПроцедуры

&НаСервере
Процедура КонтрагентПриИзмененииНаСервере()
	
	Если ЗначениеЗаполнено(Объект.Контрагент) Тогда
		Объект.КартаЛояльности = ПолучитьКартуЛояльностиПоУмолчанию(Объект.Контрагент);
	Иначе 
		Объект.КартаЛояльности = Справочники.Renault_КартыЛояльности.ПустаяСсылка();
	КонецЕсли; 
	
	Если ЗначениеЗаполнено(Объект.Контрагент) Тогда
		
		ПараметрКонтрагент 		= Новый ПараметрВыбора("Отбор.Контрагент", Объект.Контрагент);
		ПараметрПометкаУдаления = Новый ПараметрВыбора("Отбор.ПометкаУдаления", Ложь);
		МассивПараметров = Новый Массив();
		МассивПараметров.Добавить(ПараметрКонтрагент);
		МассивПараметров.Добавить(ПараметрПометкаУдаления);
		НовыеПараметры = Новый ФиксированныйМассив(МассивПараметров);
		
		Элементы.КартаЛояльности.ПараметрыВыбора = НовыеПараметры;
		
	Иначе 
		
		ПараметрПометкаУдаления = Новый ПараметрВыбора("Отбор.ПометкаУдаления", Ложь);
		МассивПараметров = Новый Массив();
		МассивПараметров.Добавить(ПараметрПометкаУдаления);
		НовыеПараметры = Новый ФиксированныйМассив(МассивПараметров);
		
		Элементы.КартаЛояльности.ПараметрыВыбора = НовыеПараметры;
		
	КонецЕсли; 
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьКартуЛояльностиПоУмолчанию(Контрагент)
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Контрагент", Контрагент);
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	КартыЛояльности.Ссылка КАК КартаЛояльности
		|ИЗ
		|	Справочник.Renault_КартыЛояльности КАК КартыЛояльности
		|ГДЕ
		|	КартыЛояльности.Контрагент = &Контрагент
		|	И НЕ КартыЛояльности.ПометкаУдаления";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	КартаЛояльности = Справочники.Renault_КартыЛояльности.ПустаяСсылка();
	
	Если ВыборкаДетальныеЗаписи.Следующий() И ВыборкаДетальныеЗаписи.Количество() = 1 Тогда
		КартаЛояльности = ВыборкаДетальныеЗаписи.КартаЛояльности;
	КонецЕсли;
	
	Возврат КартаЛояльности;

КонецФункции // ПолучитьКартуЛояльностиПоУмолчанию()

&НаСервере
Процедура ЗаполнитьДатуПогашения(мОбъект)
	
	ВидКартыЛояльности  = мОбъект.КартаЛояльности.DMS_ВидКартыЛояльности;
	ПрограммаЛояльности = мОбъект.КартаЛояльности.ПрограммаЛояльности;
	
	Если ЗначениеЗаполнено(ВидКартыЛояльности)
		И ВидКартыЛояльности.ИспользоватьСрокДействияБаллов Тогда
		
		мОбъект.ПогаситьДо = ДобавитьКДате(мОбъект.Дата,Формат(ВидКартыЛояльности.СрокДействияБаллов,"ЧЦ=10; ЧН=0; ЧГ="),СокрЛП(ВидКартыЛояльности.ПериодичностьДействияБаллов)); 
		
	ИначеЕсли ЗначениеЗаполнено(ПрограммаЛояльности) 
		И ПрограммаЛояльности.СрокДействияБаллов <> 0 Тогда  
		
		мОбъект.ПогаситьДо = ДобавитьКДате(НачалоДня(мОбъект.Дата),Формат(ПрограммаЛояльности.СрокДействияБаллов,"ЧЦ=10; ЧН=0; ЧГ=")); 
	
	КонецЕсли; 	

КонецПроцедуры

&НаСервере
Функция ДобавитьКДате(мДата,Количество,Тип = "День")
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("мДата", мДата);
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ДОБАВИТЬКДАТЕ(&мДата, "+Тип+", "+Количество+") КАК НоваяДата";
	
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	НоваяДата = мДата;
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		НоваяДата = ВыборкаДетальныеЗаписи.НоваяДата;
	КонецЦикла;
	
	Возврат НоваяДата;
	
КонецФункции // ДобавитьКДате()

