
////#Область ОбменДаннымиОбменСистемаДилерскогоМедиапланированияСАвтосалоном

Процедура DMS_ОбменДаннымиОбменСистемаДилерскогоМедиапланированияСАвтосалономЗарегистрироватьИзменениеПередЗаписью(Источник, Отказ) Экспорт
     	
	Если Не ПланОбменаСодержитОбъект("DMS_ОбменСАвтосалоном",Источник) Тогда
		Возврат;
	КонецЕсли; 
	
	Если Источник.ОбменДанными.Загрузка Тогда
		
		Если АвтоРегистрацияРазрешена("DMS_ОбменСАвтосалоном",Источник) Тогда
			СократитьПолучателей(Источник,ПолучитьВсехПолучателей("DMS_ОбменСАвтосалоном"));	
		КонецЕсли;
		
		Возврат;
		
	КонецЕсли; 
	
	Модифицирован = МодифицированностьОбъекта(Источник);
	
	Если Модифицирован Тогда
		
		Если Не АвтоРегистрацияРазрешена("DMS_ОбменСАвтосалоном",Источник) Тогда
			
			МетаданныеОбъекта = Источник.Метаданные(); 
			
			ЭтоСправочник 	 = DMS_ОбщегоНазначенияСервер.ЭтоСправочник(МетаданныеОбъекта);
			ЭтоЗадача    	 = DMS_ОбщегоНазначенияСервер.ЭтоЗадача(МетаданныеОбъекта);
			ЭтоБизнесПроцесс = DMS_ОбщегоНазначенияСервер.ЭтоБизнесПроцесс(МетаданныеОбъекта);
			
			Если ЭтоСправочник Тогда
				ВыполнитьРегистрациюДляОбъекта(Источник);
			ИначеЕсли ЭтоЗадача Тогда 
				ВыполнитьРегистрациюДляОбъекта(Источник,"Предмет");
			ИначеЕсли ЭтоБизнесПроцесс Тогда 
				ВыполнитьРегистрациюДляОбъекта(Источник,"Предмет");
			КонецЕсли; 
			
		КонецЕсли; 
		
	Иначе 
		
		Если АвтоРегистрацияРазрешена("DMS_ОбменСАвтосалоном",Источник) Тогда
			СократитьПолучателей(Источник,ПолучитьВсехПолучателей("DMS_ОбменСАвтосалоном"));	
		КонецЕсли;
		
	КонецЕсли; 	
	
КонецПроцедуры

Процедура DMS_ОбменДаннымиОбменСистемаДилерскогоМедиапланированияСАвтосалономЗарегистрироватьИзменениеДокументовПередЗаписью(Источник, Отказ, РежимЗаписи, РежимПроведения) Экспорт
	
	Если Не ПланОбменаСодержитОбъект("DMS_ОбменСАвтосалоном",Источник) Тогда
		Возврат;
	КонецЕсли; 
	
	Если Источник.ОбменДанными.Загрузка Тогда
		
		Если АвтоРегистрацияРазрешена("DMS_ОбменСАвтосалоном",Источник) Тогда
			СократитьПолучателей(Источник,ПолучитьВсехПолучателей("DMS_ОбменСАвтосалоном"));	
		КонецЕсли;
		
		Возврат;
		
	КонецЕсли; 
	
	Модифицирован = МодифицированностьОбъекта(Источник, РежимЗаписи);
	
	Если Модифицирован Тогда
		
		Если Не АвтоРегистрацияРазрешена("DMS_ОбменСАвтосалоном",Источник) Тогда
			
			Если ТипЗнч(Источник) = Тип("ДокументОбъект.DMS_РекламнаяКампания")
				И Источник.ВидОперации = Перечисления.DMS_ВидыОперацийРекламнойКампании.СозданиеШаблона Тогда
				ВыполнитьРегистрациюДляОбъекта(Источник,,Истина);
			Иначе 
				ВыполнитьРегистрациюДляОбъекта(Источник);
			КонецЕсли; 
			
		КонецЕсли; 
		
	Иначе 
		
		Если АвтоРегистрацияРазрешена("DMS_ОбменСАвтосалоном",Источник) Тогда
			СократитьПолучателей(Источник,ПолучитьВсехПолучателей("DMS_ОбменСАвтосалоном"));	
		КонецЕсли;
		
	КонецЕсли; 	
	
КонецПроцедуры

Процедура DMS_ОбменДаннымиОбменСистемаДилерскогоМедиапланированияСАвтосалономЗарегистрироватьУдалениеПередУдалением(Источник, Отказ) Экспорт
	
	Если Не ПланОбменаСодержитОбъект("DMS_ОбменСАвтосалоном",Источник) Тогда
		Возврат;
	КонецЕсли; 
	
	Если Источник.ОбменДанными.Загрузка Тогда
		
		Если АвтоРегистрацияРазрешена("DMS_ОбменСАвтосалоном",Источник) Тогда
			СократитьПолучателей(Источник,ПолучитьВсехПолучателей("DMS_ОбменСАвтосалоном"));	
		КонецЕсли;
		
		Возврат;
		
	КонецЕсли; 
	
	Если Не АвтоРегистрацияРазрешена("DMS_ОбменСАвтосалоном",Источник) Тогда
		
		МетаданныеОбъекта = Источник.Метаданные(); 
		
		ЭтоСправочник 	 = DMS_ОбщегоНазначенияСервер.ЭтоСправочник(МетаданныеОбъекта);
		ЭтоДокумент    	 = DMS_ОбщегоНазначенияСервер.ЭтоДокумент(МетаданныеОбъекта);
		ЭтоЗадача    	 = DMS_ОбщегоНазначенияСервер.ЭтоЗадача(МетаданныеОбъекта);
		ЭтоБизнесПроцесс = DMS_ОбщегоНазначенияСервер.ЭтоБизнесПроцесс(МетаданныеОбъекта);
		
		Если ЭтоСправочник Тогда
			ВыполнитьРегистрациюДляОбъекта(Источник);
		ИначеЕсли ЭтоЗадача Тогда 
			ВыполнитьРегистрациюДляОбъекта(Источник,"Предмет");
		ИначеЕсли ЭтоБизнесПроцесс Тогда 
			ВыполнитьРегистрациюДляОбъекта(Источник,"Предмет");
		ИначеЕсли ЭтоДокумент Тогда 
			
			Если ТипЗнч(Источник) = Тип("ДокументОбъект.DMS_РекламнаяКампания")
				И Источник.ВидОперации = Перечисления.DMS_ВидыОперацийРекламнойКампании.СозданиеШаблона Тогда
				ВыполнитьРегистрациюДляОбъекта(Источник,,Истина);
			Иначе 
				ВыполнитьРегистрациюДляОбъекта(Источник);
			КонецЕсли; 
			
		КонецЕсли; 
		
	КонецЕсли; 
	
КонецПроцедуры

Процедура DMS_ОбменДаннымиОбменСистемаДилерскогоМедиапланированияСАвтосалономЗарегистрироватьНаборыЗаписейПередЗаписью(Источник, Отказ, Замещение) Экспорт
	
	Если Не ПланОбменаСодержитОбъект("DMS_ОбменСАвтосалоном",Источник) Тогда
		Возврат;
	КонецЕсли; 
	
	Если Источник.ОбменДанными.Загрузка Тогда
		
		Если АвтоРегистрацияРазрешена("DMS_ОбменСАвтосалоном",Источник) Тогда
			СократитьПолучателей(Источник,ПолучитьВсехПолучателей("DMS_ОбменСАвтосалоном"));	
		КонецЕсли;
		
		Возврат;
		
	КонецЕсли;       
	
	Если Не АвтоРегистрацияРазрешена("DMS_ОбменСАвтосалоном",Источник) Тогда
		
		Если ТипЗнч(Источник) = Тип("РегистрСведенийНаборЗаписей.DMS_РекламныеКампанииПредставителей") Тогда 
			
			ДополнитьПолучателей(Источник,ПолучитьВсехПолучателей("DMS_ОбменСАвтосалоном"));
			
		ИначеЕсли Источник.Отбор.Найти("Регистратор") <> Неопределено Тогда
			
			Если ЗначениеЗаполнено(Источник.Отбор.Регистратор.Значение) Тогда
				
				Объект = Источник.Отбор.Регистратор.Значение.ПолучитьОбъект();
				
				СтруктураПараметров = ПолучитьПараметрыОтбораДляОбъекта(Объект);
				
				Получатели = ПолучателиПоОтборуУзла(СтруктураПараметров);
				
				Если Получатели.Количество() > 0 Тогда
					ДополнитьПолучателей(Источник,Получатели);
				КонецЕсли;
				
			КонецЕсли;
			
		ИначеЕсли Источник.Отбор.Найти("РекламнаяКампания") <> Неопределено Тогда
			
			Если ЗначениеЗаполнено(Источник.Отбор.РекламнаяКампания.Значение) Тогда
				
				Объект = Источник.Отбор.РекламнаяКампания.Значение.ПолучитьОбъект();
				
				СтруктураПараметров = ПолучитьПараметрыОтбораДляОбъекта(Объект);
				
				Получатели = ПолучателиПоОтборуУзла(СтруктураПараметров);
				
				Если Получатели.Количество() > 0 Тогда
					ДополнитьПолучателей(Источник,Получатели);
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;	
	
КонецПроцедуры

 ////#КонецОбласти
 
//#Область Renault_Advanced_ОбменСБухгалтерией

Процедура RenaultОбменДанными_УстановитьУзелОбменаУСтрокДерева(Дерево, УзелОбмена)
	
	Для Каждого Строка Из Дерево Цикл
		Если Строка.ЭтоГруппа Тогда
			RenaultОбменДанными_УстановитьУзелОбменаУСтрокДерева(Строка.Строки, УзелОбмена);
		Иначе
			Строка.СсылкаНаУзелОбмена = УзелОбмена;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

Процедура RenaultОбменДанными_DMS_Документооборот_ВыгрузитьДанные(Перемен = Неопределено) Экспорт
	
	ОбработкаВыгрузкаДанных = Обработки.УниверсальныйОбменДаннымиXML.Создать();  	
	ОбработкаВыгрузкаДанных.РежимОбмена="Выгрузка";
	ОбработкаВыгрузкаДанных.ЗагружатьДанныеВРежимеОбмена = Истина;
	ОбработкаВыгрузкаДанных.ЗаписыватьРегистрыНаборамиЗаписей = Истина;
	ОбработкаВыгрузкаДанных.ЗапоминатьЗагруженныеОбъекты = Истина;
	ОбработкаВыгрузкаДанных.ВыгружатьТолькоРазрешенные = Истина;
 	ОбработкаВыгрузкаДанных.ИспользоватьОтборПоДатеДляВсехОбъектов = Истина;
	
	ОбработкаВыгрузкаДанных.ДатаНачала = НачалоГода(ТекущаяДата());
    ОбработкаВыгрузкаДанных.ДатаОкончания = КонецДня(ТекущаяДата());

    ВременныйФайл = ПолучитьИмяВременногоФайла("xml");
    МакетПравилОбмена = ПолучитьОбщийМакет("Renault_ПравилаОбменаDMSДокументооборот");
    МакетПравилОбмена.Записать(ВременныйФайл);
    ОбработкаВыгрузкаДанных.ИмяФайлаПравилОбмена = ВременныйФайл; 
    
	ПараметрыОбмена = Справочники.Renault_СлужебныеНастройкиБазыДанных[ПараметрыСеанса.DMS_Бренд.Наименование];
	//Если хотим выгружать данные в файл - ставим Ложь, Если Истина - будет произведена выгрузка в базу-приёмник
	ОбработкаВыгрузкаДанных.НепосредственноеЧтениеВИБПриемнике = ПараметрыОбмена.НепосредственноеЧтениеВИБПриемникеДокументооборот;
	
	//Если база-приёмник выгружаемых данных является серверной, то Ложь. Если файловая - Истина 
	ОбработкаВыгрузкаДанных.ТипИнформационнойБазыДляПодключения = ПараметрыОбмена.ТипИнформационнойБазыДляПодключенияДокументооборот;

	КаталогОбменаDMSПетровский = ПараметрыОбмена.КаталогОбменаЧерезФайлыДокументооборот;
	Если Не ЗначениеЗаполнено(КаталогОбменаDMSПетровский) И ПараметрыОбмена.НепосредственноеЧтениеВИБПриемникеДокументооборот = Ложь Тогда
		 КаталогОбменаDMSПетровский = "";
		 Сообщить("Не задан каталог обмена");
		 Возврат
	КонецЕсли;
	Если Не ОбработкаВыгрузкаДанных.НепосредственноеЧтениеВИБПриемнике Тогда

		Если Константы.Renault_ЭтоМосковскаяБаза.Получить() = Истина Тогда
			ОбработкаВыгрузкаДанных.ИмяФайлаОбмена = КаталогОбменаDMSПетровский + "\ВыгрузкаDMS_ДО_МСК.xml";	
		Иначе
			ОбработкаВыгрузкаДанных.ИмяФайлаОбмена = КаталогОбменаDMSПетровский + "\ВыгрузкаDMS_ДО_СПБ.xml";
		КонецЕсли;

	Иначе
		ОбработкаВыгрузкаДанных.ПользовательИнформационнойБазыДляПодключения = ПараметрыОбмена.ПользовательИнформационнойБазыДляПодключенияДокументооборот;
		ОбработкаВыгрузкаДанных.ПарольИнформационнойБазыДляПодключения = ПараметрыОбмена.ПарольИнформационнойБазыДляПодключенияДокументооборот;
		ОбработкаВыгрузкаДанных.АутентификацияWindowsИнформационнойБазыДляПодключения = ПараметрыОбмена.АутентификацияWindowsИнформационнойБазыДляПодключенияДокументооборот;
		Если ОбработкаВыгрузкаДанных.ТипИнформационнойБазыДляПодключения = Ложь Тогда
		    ОбработкаВыгрузкаДанных.ИмяСервераИнформационнойБазыДляПодключения = ПараметрыОбмена.ИмяСервераИнформационнойБазыДляПодключенияДокументооборот;
		    ОбработкаВыгрузкаДанных.ИмяИнформационнойБазыНаСервереДляПодключения = ПараметрыОбмена.ИмяИнформационнойБазыНаСервереДляПодключенияДокументооборот;
		Иначе
		    ОбработкаВыгрузкаДанных.ВерсияПлатформыИнформационнойБазыДляПодключения = ПараметрыОбмена.ВерсияПлатформыИнформационнойБазыДляПодключенияДокументооборот;
		    ОбработкаВыгрузкаДанных.КаталогИнформационнойБазыДляПодключения = ПараметрыОбмена.КаталогИнформационнойБазыДляПодключенияДокументооборот;
		КонецЕсли;
	КонецЕсли;

	ОбработкаВыгрузкаДанных.ЭтоИнтерактивныйРежим=Ложь;
    ОбработкаВыгрузкаДанных.ТипУдаленияРегистрацииИзмененийДляУзловОбменаПослеВыгрузки = 1; 
	ОбработкаВыгрузкаДанных.ЗагрузитьПравилаОбмена();
    ОбработкаВыгрузкаДанных.ВыполнитьВыгрузку();
	ОбработкаВыгрузкаДанных = Неопределено;

	Если Константы.Renault_ЭтоМосковскаяБаза.Получить() = Истина Тогда
		ФайлыСДанными = НайтиФайлы(КаталогОбменаDMSПетровский,"ВыгрузкаДО_DMS_МСК_*.xml");	
	Иначе
    	ФайлыСДанными = НайтиФайлы(КаталогОбменаDMSПетровский,"ВыгрузкаДО_DMS_СПб_*.xml");
	КонецЕсли;
	
	 Для Каждого Файл из ФайлыСДанными Цикл
		ОбработкаВыгрузкаДанных = Обработки.УниверсальныйОбменДаннымиXML.Создать();
		ОбработкаВыгрузкаДанных.ИмяФайлаОбмена = Файл.ПолноеИмя;
		ОбработкаВыгрузкаДанных.РежимОбмена = "Загрузка";
		ОбработкаВыгрузкаДанных.ОткрытьФайлЗагрузки(Истина);
		ОбработкаВыгрузкаДанных.АрхивироватьФайл = Ложь;;
		ОбработкаВыгрузкаДанных.ВыполнитьЗагрузку();
		УдалитьФайлы(Файл.ПолноеИмя);
	КонецЦикла;
	
	ОбработкаВыгрузкаДанных = Неопределено;

	

	
КонецПроцедуры

//#КонецОбласти

Функция МодифицированностьОбъекта(Объект,РежимЗаписи = Неопределено)
	
	Если Объект.ЭтоНовый() Тогда
		Возврат Истина;
	КонецЕсли; 
	
	СсылкаОбъект = Объект.Ссылка;
	
	МетаданныеОбъекта = Объект.Метаданные(); 
	
	ЭтоСправочник 	 = DMS_ОбщегоНазначенияСервер.ЭтоСправочник(МетаданныеОбъекта);
	ЭтоДокумент   	 = DMS_ОбщегоНазначенияСервер.ЭтоДокумент(МетаданныеОбъекта);
	ЭтоЗадача    	 = DMS_ОбщегоНазначенияСервер.ЭтоЗадача(МетаданныеОбъекта);
	ЭтоБизнесПроцесс = DMS_ОбщегоНазначенияСервер.ЭтоБизнесПроцесс(МетаданныеОбъекта);
	ЭтоРегистр 		 = DMS_ОбщегоНазначенияСервер.ЭтоРегистр(МетаданныеОбъекта);
	
	Если ЭтоРегистр Тогда
		Возврат Истина;
	КонецЕсли; 
	
	Если ЭтоСправочник Тогда
	
		Если Объект["Наименование"] <> СсылкаОбъект["Наименование"] Тогда
			Возврат Истина;	
		КонецЕсли; 
	
		Если Объект["Код"] <> СсылкаОбъект["Код"] Тогда
			Возврат Истина;	
		КонецЕсли; 
		
	ИначеЕсли ЭтоДокумент Тогда 
		
		Если ИзмененоПроведениеДокумента(Объект,РежимЗаписи) Тогда 
			Возврат Истина
		КонецЕсли;
	
		Если Объект["Номер"] <> СсылкаОбъект["Номер"] Тогда
			Возврат Истина;	
		КонецЕсли; 
		
	КонецЕсли; 
	
	ИмяОбъекта = МетаданныеОбъекта.Имя;
	        
	РеквизитыОбъекта = МетаданныеОбъекта.Реквизиты;
	
	Для каждого РеквизитОбъекта Из РеквизитыОбъекта Цикл
	
		Если Объект[РеквизитОбъекта.Имя] <> СсылкаОбъект[РеквизитОбъекта.Имя] Тогда
			Возврат Истина;	
		КонецЕсли; 
	
	КонецЦикла; 
	
	ТабличныеЧасти = Объект.Метаданные().ТабличныеЧасти;
	                    
	Для каждого ТабличнаяЧасть Из ТабличныеЧасти Цикл
		
		РеквизитыТЧ = ТабличнаяЧасть.Реквизиты;
		
		РеквизитыСтрокой = "";
		
		Для каждого РеквизитТЧОбъекта Из РеквизитыТЧ Цикл
			РеквизитыСтрокой = РеквизитыСтрокой + РеквизитТЧОбъекта.Имя+","
		КонецЦикла; 
		
		РеквизитыСтрокой = Лев(РеквизитыСтрокой,СтрДлина(РеквизитыСтрокой)-1);
		
		Если Не КоллекцииИдентичны(Объект,ИмяОбъекта,ТабличнаяЧасть.Имя,РеквизитыСтрокой) Тогда
			Возврат Истина;				
		КонецЕсли; 
		
	КонецЦикла; 
	
	Возврат Ложь;
	
КонецФункции // МодифицированностьОбъекта()

Функция КоллекцииИдентичны(Объект,ИмяОбъекта,ИмяТЧ,РеквизитыТЧ)

	ТаблицаДоИзменения    = ПолучитьТаблицуРеквизитовРегистрацииТабличнойЧастиДоИзменения(Объект,ИмяОбъекта,ИмяТЧ,РеквизитыТЧ);
	ТаблицаПослеИзменения = ПолучитьТаблицуРеквизитовРегистрацииТабличнойЧастиПослеИзменения(Объект,ИмяТЧ,РеквизитыТЧ);
	
	ТаблицаДоИзменения.Колонки.Добавить("ИтераторТаблицыРеквизитовРегистрации",Новый ОписаниеТипов("Число",,,Новый КвалификаторыЧисла(10,0,ДопустимыйЗнак.Неотрицательный)));
	ТаблицаПослеИзменения.Колонки.Добавить("ИтераторТаблицыРеквизитовРегистрации",Новый ОписаниеТипов("Число",,,Новый КвалификаторыЧисла(10,0,ДопустимыйЗнак.Неотрицательный)));
	
	Для каждого ТекущаяСтрока Из ТаблицаДоИзменения Цикл
		ТекущаяСтрока.ИтераторТаблицыРеквизитовРегистрации = 1;
	КонецЦикла;  
	
	Для каждого ТекущаяСтрока Из ТаблицаПослеИзменения Цикл
		ТекущаяСтрока.ИтераторТаблицыРеквизитовРегистрации = -1;
	КонецЦикла;  
	
	ТаблицаРезультат = ТаблицаДоИзменения.Скопировать();
	
	Для каждого ТекущаяСтрока Из ТаблицаПослеИзменения Цикл
	
		НоваяСтрока = ТаблицаРезультат.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока,ТекущаяСтрока);
	
	КонецЦикла; 
	
	ТаблицаРезультат.Свернуть(РеквизитыТЧ,"ИтераторТаблицыРеквизитовРегистрации");
	
	СтруктураПоиска = Новый Структура("ИтераторТаблицыРеквизитовРегистрации",0);
	
	СтрокиТаблицы = ТаблицаРезультат.НайтиСтроки(СтруктураПоиска);
	
	Возврат СтрокиТаблицы.Количество() = ТаблицаПослеИзменения.Количество();
	
	//ВызватьИсключение;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ТаблицаДоИзменения",ТаблицаДоИзменения);
	Запрос.УстановитьПараметр("ТаблицаПослеИзменения",ТаблицаПослеИзменения);
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	"+РеквизитыТЧ+",
		|	1 КАК ИтераторТаблицыРеквизитовРегистрации
		|ПОМЕСТИТЬ мТаблицаДоИзменения
		|ИЗ
		|	&ТаблицаДоИзменения КАК ТаблицаДоИзменения
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	"+РеквизитыТЧ+",
		|	-1 КАК ИтераторТаблицыРеквизитовРегистрации
		|ПОМЕСТИТЬ мТаблицаПослеИзменения
		|ИЗ
		|	&ТаблицаПослеИзменения КАК ТаблицаПослеИзменения
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	"+РеквизитыТЧ+",
		|	мТаблицаДоИзменения.ИтераторТаблицыРеквизитовРегистрации
		|ПОМЕСТИТЬ ТаблицаСравнения
		|ИЗ
		|	мТаблицаДоИзменения КАК мТаблицаДоИзменения
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	"+РеквизитыТЧ+",
		|	мТаблицаПослеИзменения.ИтераторТаблицыРеквизитовРегистрации
		|ИЗ
		|	мТаблицаПослеИзменения КАК мТаблицаПослеИзменения
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	"+РеквизитыТЧ+",
		|	СУММА(ТаблицаСравнения.ИтераторТаблицыРеквизитовРегистрации) КАК ИтераторТаблицыРеквизитовРегистрации
		|ПОМЕСТИТЬ ТаблицаИзменений
		|ИЗ
		|	ТаблицаСравнения КАК ТаблицаСравнения
		|
		|СГРУППИРОВАТЬ ПО
		|	"+РеквизитыТЧ+"
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	"+РеквизитыТЧ+",
		|	ТаблицаИзменений.ИтераторТаблицыРеквизитовРегистрации
		|ИЗ
		|	ТаблицаИзменений КАК ТаблицаИзменений
		|ГДЕ
		|	ТаблицаИзменений.ИтераторТаблицыРеквизитовРегистрации <> 0";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Возврат РезультатЗапроса.Пустой();
	
КонецФункции // КоллекцииИдентичны()

Функция ПолучитьТаблицуРеквизитовРегистрацииТабличнойЧастиДоИзменения(Объект,ИмяОбъекта,ИмяТабличнойЧасти, РеквизитыРегистрации)

	Возврат Объект.Ссылка[ИмяТабличнойЧасти].Выгрузить(,РеквизитыРегистрации);	

КонецФункции

Функция ПолучитьТаблицуРеквизитовРегистрацииТабличнойЧастиПослеИзменения(Объект,ИмяТабличнойЧасти,РеквизитыРегистрации)

	Возврат Объект[ИмяТабличнойЧасти].Выгрузить(,РеквизитыРегистрации);	

КонецФункции // ПолучитьТаблицуРеквизитовРегистрацииТабличнойЧастиПослеИзменения()

Функция ИзмененоПроведениеДокумента(Источник, РежимЗаписи)
	
	Возврат (Источник.Проведен И РежимЗаписи = РежимЗаписиДокумента.ОтменаПроведения)
	 ИЛИ (НЕ Источник.Проведен И РежимЗаписи = РежимЗаписиДокумента.Проведение);

КонецФункции

Функция РазрешенаАвтоРегистрация()

	

КонецФункции // РазрешенаАвтоРегистрация()

// Определяет признак авторегистрации объекта метаданных в составе плана обмена.
//
// Параметры:
//  ИмяПланаОбмена   - Строка - имя плана обмена, как оно задано в конфигураторе, в состав которого входит объект
//                              метаданных.
//  Объект - Объект, для которого требуется получить признак авторегистрации.
//
//  Возвращаемое значение:
//   Истина - объект метаданных имеет признак авторегистрации "Разрешена" в составе плана обмена;
//   Ложь - объект метаданных имеет признак авторегистрации "Запрещена" в составе плана обмена
//          или объект метаданных не входит в состав плана обмена.
//
Функция АвтоРегистрацияРазрешена(Знач ИмяПланаОбмена, Знач Объект) Экспорт	
	
	ЭлементСоставаПланаОбмена = Метаданные.ПланыОбмена[ИмяПланаОбмена].Состав.Найти(Объект.Метаданные());
	
	Если ЭлементСоставаПланаОбмена = Неопределено Тогда
		Возврат Ложь; // Объект метаданных не входит в состав плана обмена.
	КонецЕсли;
	
	Возврат ЭлементСоставаПланаОбмена.АвтоРегистрация = АвтоРегистрацияИзменений.Разрешить;
	
КонецФункции

// Определяет признак вхождения объекта метаданных в состав плана обмена.
//
// Параметры:
//  ИмяПланаОбмена   - Строка - имя плана обмена, как оно задано в конфигураторе.
//  Объект - Строка - Объект, для которого требуется получить признак.
// 
//  Возвращаемое значение:
//   Истина - объект входит в состав плана обмена; Ложь - не входит.
//
Функция ПланОбменаСодержитОбъект(Знач ИмяПланаОбмена, Знач Объект) Экспорт
	
	ЭлементСоставаПланаОбмена = Метаданные.ПланыОбмена[ИмяПланаОбмена].Состав.Найти(Объект.Метаданные());
	
	Возврат ЭлементСоставаПланаОбмена <> Неопределено;
	
КонецФункции

Функция ПолучитьВсехПолучателей(ИмяУзла)
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ЭтотУзел", ПланыОбмена[ИмяУзла].ЭтотУзел());
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	DMS_ОбменСАвтосалоном.Ссылка КАК Ссылка
		|ИЗ
		|	ПланОбмена.DMS_ОбменСАвтосалоном КАК DMS_ОбменСАвтосалоном
		|ГДЕ
		|	НЕ DMS_ОбменСАвтосалоном.ПометкаУдаления
		|	И DMS_ОбменСАвтосалоном.Ссылка <> &ЭтотУзел
		|
		|УПОРЯДОЧИТЬ ПО
		|	Ссылка
		|АВТОУПОРЯДОЧИВАНИЕ";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Получатели = Новый Массив;
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Получатели.Добавить(ВыборкаДетальныеЗаписи.Ссылка);	
	КонецЦикла;
	
	Возврат Получатели;
	
КонецФункции // ПолучитьВсехПолучателей()

Процедура СократитьПолучателей(Объект, Узлы)
	
	Получатели = СократитьМассив(Объект.ОбменДанными.Получатели, Узлы);
	
	// Очищаем список получателей и заполняем его заново.
	Объект.ОбменДанными.Получатели.Очистить();
	
	// Добавляем узлы для регистрации объекта.
	ДополнитьПолучателей(Объект, Получатели);
	
КонецПроцедуры

// Вычитает один массив элементов из другого массива. Возвращает результат вычитания.
//
// Параметры:
//	Массив - Массив - Исходный массив.
//	МассивВычитания - Массив - Массив, вычитаемый из исходного массива.
//
Функция СократитьМассив(Массив, МассивВычитания) Экспорт
	
	Возврат Renault_ОбщегоНазначенияКлиентСервер.СократитьМассив(Массив, МассивВычитания);
	
КонецФункции

// Процедура дополняет список узлов-получателей объекта переданными значениями.
//
// Параметры:
//  Объект - объект, для которого выполняется правило регистрации.
//  Узлы   - Массив - узлы плана обмена, которые необходимо добавить в список узлов-получателей объекта.
//
Процедура ДополнитьПолучателей(Объект, Узлы) Экспорт
	
	Для Каждого Элемент Из Узлы Цикл
		
		Попытка
			Объект.ОбменДанными.Получатели.Добавить(Элемент);
		Исключение
			ИмяПланаОбмена = Элемент.Метаданные().Имя;
			ОбъектМетаданных = Объект.Метаданные();
			СтрокаСообщения = НСтр("ru = 'Для состава плана обмена [ИмяПланаОбмена] не указана регистрация объекта [ПолноеИмя]'");
			СтрокаСообщения = СтрЗаменить(СтрокаСообщения, "[ИмяПланаОбмена]", ИмяПланаОбмена);
			СтрокаСообщения = СтрЗаменить(СтрокаСообщения, "[ПолноеИмя]",      ОбъектМетаданных.ПолноеИмя());
			ВызватьИсключение СтрокаСообщения;
		КонецПопытки;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ВыполнитьРегистрациюДляОбъекта(Объект,ВспомогательныйРеквизит = "",ТолькоПоПредставителю = Ложь)
	
	СтруктураПараметров = ПолучитьПараметрыОтбораДляОбъекта(Объект,ВспомогательныйРеквизит = "",ТолькоПоПредставителю = Ложь);
	
	Получатели = ПолучателиПоОтборуУзла(СтруктураПараметров);
	
	ДополнитьПолучателей(Объект,Получатели);
	
КонецПроцедуры

Функция ПолучитьПараметрыОтбораДляОбъекта(Объект,ВспомогательныйРеквизит = "",ТолькоПоПредставителю = Ложь)
	
	МетаданныеОбъекта = Объект.Метаданные(); 
	
	Если ТипЗнч(Объект) = Тип("СправочникОбъект.CRM_ДилерскиеЦентры") Тогда 
		
		ПредставительОтбор = Справочники.DMS_Представители.ПустаяСсылка();
		ПропуститьОтборПоПредставителям = Истина;
		
		ДилерскийЦентрОтбор = Объект.Ссылка;
		ПропуститьОтборПоДилерскимЦентрам = Ложь;
		
	ИначеЕсли ТипЗнч(Объект) = Тип("СправочникОбъект.DMS_Представители") Тогда
		
		ПредставительОтбор = Объект.Ссылка;
		ПропуститьОтборПоПредставителям = Ложь;
		
		ДилерскийЦентрОтбор = Справочники.CRM_ДилерскиеЦентры.ПустаяСсылка();
		ПропуститьОтборПоДилерскимЦентрам = Истина;
		
	Иначе 	
	
		Если ВспомогательныйРеквизит = "" Тогда
			
			Если МетаданныеОбъекта.Реквизиты.Найти("Представитель") <> Неопределено Тогда
				ПредставительОтбор = Объект.Представитель;
				ПропуститьОтборПоПредставителям = Ложь;
			Иначе 
				ПредставительОтбор = Справочники.DMS_Представители.ПустаяСсылка();
				ПропуститьОтборПоПредставителям = Истина;
			КонецЕсли;
			
		Иначе 
			
			Если МетаданныеОбъекта.Реквизиты.Найти(ВспомогательныйРеквизит) <> Неопределено Тогда
				ПредставительОтбор = Объект[ВспомогательныйРеквизит].Представитель;
				ПропуститьОтборПоПредставителям = Ложь;
			Иначе 
				ПредставительОтбор = Справочники.DMS_Представители.ПустаяСсылка();
				ПропуститьОтборПоПредставителям = Истина;
			КонецЕсли;
			
		КонецЕсли; 
		
		Если ТолькоПоПредставителю Тогда 
			
			ДилерскийЦентрОтбор = Справочники.CRM_ДилерскиеЦентры.ПустаяСсылка();
			ПропуститьОтборПоДилерскимЦентрам = Истина;
			
		ИначеЕсли ВспомогательныйРеквизит = "" Тогда
			
			Если МетаданныеОбъекта.Реквизиты.Найти("ДилерскийЦентр") <> Неопределено Тогда
				ДилерскийЦентрОтбор = Объект.ДилерскийЦентр;
				ПропуститьОтборПоДилерскимЦентрам = Ложь;
			Иначе 
				ДилерскийЦентрОтбор = Справочники.CRM_ДилерскиеЦентры.ПустаяСсылка();
				ПропуститьОтборПоДилерскимЦентрам = Истина;
			КонецЕсли;
			
		Иначе 
			
			Если МетаданныеОбъекта.Реквизиты.Найти(ВспомогательныйРеквизит) <> Неопределено Тогда
				ДилерскийЦентрОтбор = Объект[ВспомогательныйРеквизит].ДилерскийЦентр;
				ПропуститьОтборПоДилерскимЦентрам = Ложь;
			Иначе 
				ДилерскийЦентрОтбор = Справочники.CRM_ДилерскиеЦентры.ПустаяСсылка();
				ПропуститьОтборПоДилерскимЦентрам = Истина;
			КонецЕсли;
			
		КонецЕсли; 
		
	КонецЕсли; 
	
	Возврат Новый Структура("Представитель,ПропуститьОтборПоПредставителям,ДилерскийЦентр,ПропуститьОтборПоДилерскимЦентрам",ПредставительОтбор,ПропуститьОтборПоПредставителям,ДилерскийЦентрОтбор,ПропуститьОтборПоДилерскимЦентрам);
	
КонецФункции // ПолучитьПараметрыОтбораДляОбъекта() 

Функция ПолучателиПоОтборуУзла(СтруктураПараметров)
			
	Запрос = Новый Запрос;
	
	Для каждого ПараметрОбъекта Из СтруктураПараметров Цикл
		Запрос.УстановитьПараметр(ПараметрОбъекта.Ключ,ПараметрОбъекта.Значение);	
	КонецЦикла; 
	
	Запрос.УстановитьПараметр("ЭтотУзел", ПланыОбмена.DMS_ОбменСАвтосалоном.ЭтотУзел());
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	DMS_ОбменСАвтосалоном.Ссылка
		|ПОМЕСТИТЬ УзлыОбмена
		|ИЗ
		|	ПланОбмена.DMS_ОбменСАвтосалоном КАК DMS_ОбменСАвтосалоном
		|ГДЕ
		|	DMS_ОбменСАвтосалоном.Ссылка <> &ЭтотУзел
		|	И НЕ DMS_ОбменСАвтосалоном.ПометкаУдаления
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	УзлыОбмена.Ссылка
		|ПОМЕСТИТЬ УзлыПоПредставителям
		|ИЗ
		|	УзлыОбмена КАК УзлыОбмена
		|		ЛЕВОЕ СОЕДИНЕНИЕ ПланОбмена.DMS_ОбменСАвтосалоном.Представители КАК ОтборыПоПредставителям
		|		ПО УзлыОбмена.Ссылка = ОтборыПоПредставителям.Ссылка
		|			И (ОтборыПоПредставителям.Представитель = &Представитель)
		|ГДЕ
		|	(НЕ ОтборыПоПредставителям.Ссылка ЕСТЬ NULL 
		|			ИЛИ НЕ УзлыОбмена.Ссылка.ИспользоватьОтборПоПредставителям
		|			ИЛИ &ПропуститьОтборПоПредставителям)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	УзлыПоПредставителям.Ссылка
		|ИЗ
		|	УзлыПоПредставителям КАК УзлыПоПредставителям
		|		ЛЕВОЕ СОЕДИНЕНИЕ ПланОбмена.DMS_ОбменСАвтосалоном.ДилерскиеЦентры КАК ОтборыПоДилерскимЦентрам
		|		ПО УзлыПоПредставителям.Ссылка = ОтборыПоДилерскимЦентрам.Ссылка
		|			И (ОтборыПоДилерскимЦентрам.ДилерскийЦентр = &ДилерскийЦентр)
		|ГДЕ
		|	(НЕ ОтборыПоДилерскимЦентрам.Ссылка ЕСТЬ NULL 
		|			ИЛИ НЕ УзлыПоПредставителям.Ссылка.ИспользоватьОтборПоДилерам ИЛИ &ПропуститьОтборПоДилерскимЦентрам)";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Получатели = Новый Массив;
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Получатели.Добавить(ВыборкаДетальныеЗаписи.Ссылка);
	КонецЦикла;
	
	Возврат Получатели;
	
КонецФункции // ПолучателиПоОтборуУзла()

Процедура ВыполнитьРегистрациюДляОбъектаRenault_ОбменСБП(Объект,ВспомогательныйРеквизит = "",ТолькоПоПредставителю = Ложь)
	
	СтруктураПараметров = ПолучитьПараметрыОтбораДляОбъекта(Объект,ВспомогательныйРеквизит = "",ТолькоПоПредставителю = Ложь);
	
	Получатели = ПолучателиПоОтборуУзлаRenault_ОбменСБП(СтруктураПараметров);
	
	ДополнитьПолучателей(Объект,Получатели);
	
КонецПроцедуры

Функция ПолучателиПоОтборуУзлаRenault_ОбменСБП(СтруктураПараметров)
			
	Запрос = Новый Запрос;
	
	Для каждого ПараметрОбъекта Из СтруктураПараметров Цикл
		Запрос.УстановитьПараметр(ПараметрОбъекта.Ключ,ПараметрОбъекта.Значение);	
	КонецЦикла; 
	
	Запрос.УстановитьПараметр("ЭтотУзел", ПланыОбмена.Renault_Advanced_ОбменСБухгалтерией.ЭтотУзел());
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	Renault_Advanced_ОбменСБухгалтерией.Ссылка
		|ИЗ
		|	ПланОбмена.Renault_Advanced_ОбменСБухгалтерией КАК Renault_Advanced_ОбменСБухгалтерией
		|ГДЕ
		|	Renault_Advanced_ОбменСБухгалтерией.Ссылка <> &ЭтотУзел
		|	И НЕ Renault_Advanced_ОбменСБухгалтерией.ПометкаУдаления";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Получатели = Новый Массив;
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Получатели.Добавить(ВыборкаДетальныеЗаписи.Ссылка);
	КонецЦикла;
	
	Возврат Получатели;
	
КонецФункции // ПолучателиПоОтборуУзла()


