Процедура УстановитьПараметры()
	
	ПериодОтчета = КомпоновщикНастроек.Настройки.ПараметрыДанных.Элементы.Найти("ПериодОтчета");
	НачалоПериода = КомпоновщикНастроек.Настройки.ПараметрыДанных.Элементы.Найти("НачалоПериода");
	КонецПериода = КомпоновщикНастроек.Настройки.ПараметрыДанных.Элементы.Найти("КонецПериода");
	
	//ПериодОтчета.Значение.ДатаНачала    = НачалоДня(ДобавитьМесяц(НачалоМесяца(ТекущаяДата()),-1));
	//ПериодОтчета.Значение.ДатаОкончания = КонецДня(ДобавитьМесяц(КонецМесяца(ТекущаяДата()),-1));
	//НачалоПериода.Значение = ПериодОтчета.Значение.ДатаНачала;
	//КонецПериода.Значение = ПериодОтчета.Значение.ДатаОкончания;
	
	Если Не ПериодОтчета = Неопределено Тогда
		Если обЗначениеНеЗаполнено(ПериодОтчета.Значение) Тогда
			ПериодОтчета.Значение.ДатаНачала    = НачалоДня(ДобавитьМесяц(НачалоМесяца(ТекущаяДата()),-1));
			ПериодОтчета.Значение.ДатаОкончания = КонецДня(ДобавитьМесяц(КонецМесяца(ТекущаяДата()),-1));
			НачалоПериода.Значение = ПериодОтчета.Значение.ДатаНачала;
			КонецПериода.Значение = ПериодОтчета.Значение.ДатаОкончания;			
  		КонецЕсли;
 	КонецЕсли;
   	
КонецПроцедуры

Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка) Экспорт
	
	УстановитьПараметры();
	
	ОтчетыСервер.ВывестиОтчет(ЭтотОбъект, СхемаКомпоновкиДанных, КомпоновщикНастроек.Настройки, ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка);
	
КонецПроцедуры
