
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Параметры.РежимВыбора Тогда Элементы.Список.РежимВыбора=Истина КонецЕсли;
	DMS_ОбщиеФункцииСервер.МультибрендОсновноеОформление(ЭтаФорма); //мультибренд
	
	//динамический отбор
	Если Параметры.Свойство("БезНДС") Тогда
		Эл=Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		Эл.ВидСравнения=ВидСравненияКомпоновкиДанных.Равно;
		Эл.ЛевоеЗначение=Новый ПолеКомпоновкиДанных("БезНДС");
		Эл.ПравоеЗначение=Параметры.БезНДС;
		Эл.Использование=Истина;
	КонецЕсли;	
	
КонецПроцедуры
