Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	
	Настройки =  КомпоновщикНастроек.ПолучитьНастройки();
	
	Параметры = Настройки.ПараметрыДанных.Элементы;
	
	ПараметрДатаНачала 	   = Параметры.Найти("НачалоПериода");
	ПараметрДатаОкончания  = Параметры.Найти("КонецПериода");
	
	ПараметрДатаНачала.Значение     = ДатаНачала;
	ПараметрДатаНачала.Использование = Истина;
	
	ПараметрДатаОкончания.Значение  = ДатаКонец;
	ПараметрДатаОкончания.Использование = Истина;

	КомпоновщикМакет = Новый КомпоновщикМакетаКомпоновкиДанных;
	
	Макет = КомпоновщикМакет.Выполнить(СхемаКомпоновкиДанных, Настройки, ДанныеРасшифровки);
	
	ПроцессорКомпоновки = Новый ПроцессорКомпоновкиДанных;
	ПроцессорКомпоновки.Инициализировать(Макет, , ДанныеРасшифровки);
	
	ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент;
	ПроцессорВывода.УстановитьДокумент(ДокументРезультат);
	ПроцессорВывода.Вывести(ПроцессорКомпоновки); 	
КонецПроцедуры

