Функция СформироватьТаблицуПросроченныхОплат() Экспорт
	
	Если обЗначениеНеЗаполнено(Контрагент) Тогда
		Возврат 0;
 	КонецЕсли; 
	
 	Если обЗначениеНеЗаполнено(ДоговорВзаиморасчетов) Тогда
		Возврат 0;
 	КонецЕсли; 
		
	Если Не обЗначениеНеЗаполнено(Дата) Тогда
		ДатаРасчета = КонецДня(Дата);	
 	Иначе	
        ДатаРасчета = КонецДня(ТекущаяДата());	
  	КонецЕсли; 
	
 	Запрос = Новый Запрос;
	
	Запрос.Текст = "ВЫБРАТЬ
	               |	ВзаиморасчетыКомпанииОстатки.Контрагент,
	               |	ВзаиморасчетыКомпанииОстатки.ДоговорВзаиморасчетов,
	               |	ВзаиморасчетыКомпанииОстатки.Сделка,
	               |	ВзаиморасчетыКомпанииОстатки.СуммаОстаток КАК Сумма,
	               |	ВзаиморасчетыКомпанииОстатки.ДоговорВзаиморасчетов.СрокОплатыЗадолженности КАК СрокОплатыЗадолженности,
	               |	ВзаиморасчетыКомпанииОстатки.Сделка.Дата КАК ДатаСделки,
	               |	ВзаиморасчетыКомпанииОстатки.Сделка.ХозОперация.Родитель КАК СделкаХозОперацияРодитель,
	               |	ДОБАВИТЬКДАТЕ(ВзаиморасчетыКомпанииОстатки.Сделка.Дата, ДЕНЬ, ВзаиморасчетыКомпанииОстатки.ДоговорВзаиморасчетов.СрокОплатыЗадолженности) КАК ОплатитьДо
	               |ИЗ
	               |	РегистрНакопления.ВзаиморасчетыКомпании.Остатки(
	               |			&ДатаРасчета,
	               |			Контрагент = &Контрагент
	               |				И ДоговорВзаиморасчетов = &ДоговорВзаиморасчетов) КАК ВзаиморасчетыКомпанииОстатки
	               |ГДЕ
	               |	ВзаиморасчетыКомпанииОстатки.СуммаОстаток > 0
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	ОплатитьДо УБЫВ";
	
	Запрос.УстановитьПараметр("Контрагент",    Контрагент);
	Запрос.УстановитьПараметр("ДоговорВзаиморасчетов", ДоговорВзаиморасчетов   );
  	Запрос.УстановитьПараметр("ДатаРасчета", ДатаРасчета);
	
	тзОтгрузкиТМЦ = Запрос.Выполнить().Выгрузить();
  
	Запрос = Новый Запрос;
	
	Запрос.Текст = "ВЫБРАТЬ
	               |	ВзаиморасчетыКомпанииОстатки.Контрагент,
	               |	ВзаиморасчетыКомпанииОстатки.ДоговорВзаиморасчетов,
	               |	ВзаиморасчетыКомпанииОстатки.Сделка,
	               |	ВзаиморасчетыКомпанииОстатки.СуммаОстаток КАК Сумма,
	               |	ВзаиморасчетыКомпанииОстатки.ДоговорВзаиморасчетов.СрокОплатыЗадолженности КАК СрокОплатыЗадолженности,
	               |	ВзаиморасчетыКомпанииОстатки.Сделка.Дата КАК ДатаСделки,
	               |	ВзаиморасчетыКомпанииОстатки.Сделка.ХозОперация.Родитель КАК СделкаХозОперацияРодитель,
	               |	ДОБАВИТЬКДАТЕ(ВзаиморасчетыКомпанииОстатки.Сделка.Дата, ДЕНЬ, ВзаиморасчетыКомпанииОстатки.ДоговорВзаиморасчетов.СрокОплатыЗадолженности) КАК ОплатитьДо
	               |ИЗ
	               |	РегистрНакопления.ВзаиморасчетыКомпании.Остатки(
	               |			&ДатаРасчета,
	               |			Контрагент = &Контрагент
	               |				И ДоговорВзаиморасчетов = &ДоговорВзаиморасчетов) КАК ВзаиморасчетыКомпанииОстатки
	               |ГДЕ
	               |	ВзаиморасчетыКомпанииОстатки.СуммаОстаток < 0
	               |	И ТИПЗНАЧЕНИЯ(ВзаиморасчетыКомпанииОстатки.Сделка) = ТИП(Документ.Выписка)
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	ОплатитьДо УБЫВ";
	
	Запрос.УстановитьПараметр("Контрагент",    Контрагент);
	Запрос.УстановитьПараметр("ДоговорВзаиморасчетов", ДоговорВзаиморасчетов   );
  	Запрос.УстановитьПараметр("ДатаРасчета", ДатаРасчета);
	
	тзОплаты = Запрос.Выполнить().Выгрузить();
	
  	ОстатокДолга = -тзОплаты.Итог("Сумма")-тзОтгрузкиТМЦ.Итог("Сумма");
	
	СуммаНеразнесенныхОплат = -тзОплаты.Итог("Сумма");
	
	ТабДок = Новый ТабличныйДокумент;
	
	Макет = ПолучитьМакет("МакетОплат");
	
	ОбластьМакета = Макет.ПолучитьОбласть("Заголовок");
	ОбластьМакета.Параметры.СуммаНеразнесенныхОплат = СуммаНеразнесенныхОплат;
	ОбластьМакета.Параметры.Контрагент = Контрагент;
	ОбластьМакета.Параметры.ДоговорВзаиморасчетов = ДоговорВзаиморасчетов;
 	ОбластьМакета.Параметры.ДатаРасчетаСтрокой = Формат(ДатаРасчета,"ДЛФ=DD");
  
	ТабДок.Вывести(ОбластьМакета);
	
	ОбластьМакета = Макет.ПолучитьОбласть("Шапка");
	ТабДок.Вывести(ОбластьМакета);
	
	ёё = 0;
	
	ПросрочкаСуществует = Ложь;
	
	СуммаПросроченнойЗадолженности = 0;
	
	Всего = 0; 
	
 	Для каждого Стр Из тзОтгрузкиТМЦ Цикл
		Если обЗначениеНеЗаполнено(Стр.ОплатитьДо) Тогда
			Продолжить;
 		КонецЕсли; 
		Если КонецДня(Стр.ОплатитьДо) > КонецДня(ДатаРасчета) Тогда
			ОбластьМакета = Макет.ПолучитьОбласть("Строка");
 		Иначе	
			ОбластьМакета = Макет.ПолучитьОбласть("СтрокаКрасная");
			ПросрочкаСуществует = Истина;
			СуммаПросроченнойЗадолженности = СуммаПросроченнойЗадолженности + Стр.Сумма;
		КонецЕсли; 
		ёё = ёё + 1;
 		ОбластьМакета.Параметры.Нстр = ёё;	
		ОбластьМакета.Параметры.Сделка = Стр.Сделка;
		ОбластьМакета.Параметры.СделкаДокумент = Стр.Сделка.ПолучитьОбъект();
		ОбластьМакета.Параметры.Сумма = Стр.Сумма;
		ОбластьМакета.Параметры.СрокОплатыЗадолженности = Стр.СрокОплатыЗадолженности;
		ОбластьМакета.Параметры.ДатаСделки = Формат(Стр.ДатаСделки,"ДЛФ=D");
		ОбластьМакета.Параметры.ОплатитьДо = Формат(Стр.ОплатитьДо,"ДЛФ=D");
		ТабДок.Вывести(ОбластьМакета);
		Всего = Всего + Стр.Сумма; 
 	КонецЦикла; 
	
	ОбластьМакета = Макет.ПолучитьОбласть("Подвал");
	ОбластьМакета.Параметры.ОбОтчете = "Отчет сформирован "+Формат(ТекущаяДата(),"ДЛФ=DDT")+" пользователем "+СокрЛП(ПараметрыСеанса.Пользователь);
	ОбластьМакета.Параметры.Всего = Формат(Всего,"ЧЦ=15; ЧДЦ=2; ДЛФ=");
	ОбластьМакета.Параметры.СуммаПросроченнойЗадолженности = Формат(СуммаПросроченнойЗадолженности,"ЧЦ=15; ЧДЦ=2; ДЛФ=");
 	ТабДок.Вывести(ОбластьМакета);
	
	Если ПросрочкаСуществует Тогда
		ТабДок.АвтоМасштаб=Истина;
		ТабДок.ОтображатьСетку=Ложь;
		ТабДок.ТолькоПросмотр=Истина;
  		ТабДок.Показать("Взаиморасчеты с оптовиком "+Контрагент,,Истина);
		//Сообщить("Просроченные оплаты контрагента выведены в отдельном окне: Взаиморасчеты с оптовиком",СтатусСообщения.Информация);
	КонецЕсли;
	
	Возврат СуммаПросроченнойЗадолженности;
   
КонецФункции
 //Бондаренко-- 20200907
