
&НаКлиенте
Процедура ОтправитьКомментарий(Команда)
	
	Если Не ЗначениеЗаполнено(НовыйКомментарий) Тогда
		Возврат;
	КонецЕсли;
	
	ДобавитьКомментарий(Автомобиль, НовыйКомментарий);
	ЗаполнитьСписокКомментариев();
	НовыйКомментарий = "";
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Заявка = Параметры.Заявка;
	Автомобиль = Параметры.Автомобиль;
	Статус = Параметры.Статус;
	СписокФайлов.Параметры.УстановитьЗначениеПараметра("Заявка", Заявка);
	СписокФайлов.Параметры.УстановитьЗначениеПараметра("Идентификатор", Автомобиль.VIN);
	Если Статус = Перечисления.Renault_СостоянияСогласованияКорпСкидок.ДопИнформация
		Или Статус = Перечисления.Renault_СостоянияСогласованияКорпСкидок.Согласован Тогда
		Элементы.Черновик.Видимость = Ложь;
		Элементы.СписокФайловДобавитьФайл.Доступность = Истина;
	ИначеЕсли Статус = Перечисления.Renault_СостоянияСогласованияКорпСкидок.НаСогласовании Тогда
		Элементы.ОтчетПредоставлен.Видимость = Ложь;
		Элементы.ОтчетаНеБудет.Видимость = Ложь;
		Элементы.Черновик.КнопкаПоУмолчанию = Истина;
		Элементы.СписокФайловДобавитьФайл.Доступность = Ложь;
	Иначе
		Элементы.ГруппаКнопки.Видимость = Ложь;
		Элементы.СписокФайловДобавитьФайл.Доступность = Ложь;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьФайл(Команда)
	
	Отбор = Новый Структура();
	Отбор.Вставить("Объект", Заявка);
	Отбор.Вставить("Идентификатор", Автомобиль.VIN);
	ФормаКартинок=РегистрыСведений.Renault_КартинкиИФайлы.ПолучитьФормуСписка(, ЭтаФорма);
	ФормаКартинок.ПараметрОтборПоИзмерению = Отбор;
	ФормаКартинок.Открыть();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Элементы.СписокФайлов.Обновить();
	
КонецПроцедуры

&НаКлиенте
Процедура ОтчетПредоставлен(Команда)
	
	НовыйСтатус = ПредопределенноеЗначение("Перечисление.Renault_СостоянияСогласованияКорпСкидок.ОтчетПредоставлен");
	СогласоватьНаСервере();
	Оповестить("ЗаписьVIN");
	ЭтаФорма.Закрыть();
	
КонецПроцедуры

&НаСервере
Процедура СогласоватьНаСервере()
	
	МенеджерЗаписи = РегистрыСведений.Renault_СостоянияVINВЗаявках.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.VIN = Автомобиль;
	МенеджерЗаписи.Заявка = Заявка;
	МенеджерЗаписи.Статус = НовыйСтатус;
	МенеджерЗаписи.Записать();
	
	НаборЗаписи = РегистрыСведений.Renault_СостоянияVINВЗаявках.СоздатьНаборЗаписей();
	НаборЗаписи.Отбор.VIN.Установить(Автомобиль);
	НаборЗаписи.Отбор.Заявка.Установить(Заявка);
	НаборЗаписи.Прочитать();
	Узел = ПланыОбмена.Renault_ОчередьЗаявокНаСкидку.ПоличитьУзелОбмена();
	ПланыОбмена.ЗарегистрироватьИзменения(Узел, НаборЗаписи);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьКомментарии()
	
	ИсторияКомментариев = ПолучитьИсториюКомментариевПоЗаявке(Автомобиль);
	ПодключитьОбработчикОжидания("ЗагрузитьКомментарии", 2, Ложь);
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьИсториюКомментариевПоЗаявке(Автомобиль)
	
	Возврат РегистрыСведений.RenaultFlotte_ИсторияКомментариев.ПолучитьКомментарииПоОбъектуСтрокой(Автомобиль.VIN);
	
КонецФункции

&НаСервереБезКонтекста
Процедура ДобавитьКомментарий(Автомобиль, Текст)
	
	ДатаДобавления = ТекущаяУниверсальнаяДата();
	
	РегистрыСведений.RenaultFlotte_ИсторияКомментариев.ДобавитьКомментарий(
		Автомобиль.VIN,
		Текст,
		ПараметрыСеанса.Renault_ПраваПользователя.ДилерскийЦентр,
		ДатаДобавления);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьСписокКомментариев()
	
	ОтключитьОбработчикОжидания("ЗаполнитьСписокКомментариев");
	ИсторияКомментариев = ПолучитьИсториюКомментариевПоЗаявке(Автомобиль);
	ПодключитьОбработчикОжидания("ЗаполнитьСписокКомментариев", 5, Ложь);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ПодключитьОбработчикОжидания("ЗаполнитьСписокКомментариев", 0.2, Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура ОтчетаНеБудет(Команда)
	
	НовыйСтатус = ПредопределенноеЗначение("Перечисление.Renault_СостоянияСогласованияКорпСкидок.ОтчетаНеБудет");
	СогласоватьНаСервере();
	Оповестить("ЗаписьVIN");
	ЭтаФорма.Закрыть();
	
КонецПроцедуры

&НаКлиенте
Процедура Черновик(Команда)
	
	НовыйСтатус = ПредопределенноеЗначение("Перечисление.Renault_СостоянияСогласованияКорпСкидок.Черновик");
	СогласоватьНаСервере();
	Оповестить("ЗаписьVIN");
	ЭтаФорма.Закрыть();
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФайл(Команда)
	
	ТекущиеДанные = Элементы.СписокФайлов.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	ОткрываемыйФайл = Новый Файл(ТекущиеДанные.ИмяФайла);
	Если ТекущиеДанные.ДанныеВоВнешнемФайле Тогда
		Если ОткрываемыйФайл.Существует() Тогда
			ЗапуститьПриложение(ОткрываемыйФайл.ПолноеИмя);
		Иначе
			Предупреждение("Указанный файл " + ОткрываемыйФайл.ПолноеИмя + " не существует", 10);
		КонецЕсли;
	Иначе
		ДанныеФайла = ПолучитьДвоичныеДанныеФайла(
			ТекущиеДанные.Объект,
			ТекущиеДанные.Идентификатор,
			ТекущиеДанные.Наименование);
		ИмяКаталога = КаталогВременныхФайлов();
		ИмяВременногоФайла = ИмяКаталога + ОткрываемыйФайл.Имя;
		Попытка
			ДанныеФайла.Записать(ИмяВременногоФайла);
		Исключение
			Предупреждение("Невозможно записать файл " + ИмяВременногоФайла, 10);
			Возврат;
		КонецПопытки;
		ЗапуститьПриложение(ИмяВременногоФайла);
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьДвоичныеДанныеФайла(Объект, Идентификатор, Наименование)
	
	Запись = РегистрыСведений.Renault_КартинкиИФайлы.СоздатьМенеджерЗаписи();
	Запись.Объект = Объект;
	Запись.Идентификатор = Идентификатор;
	Запись.Наименование = Наименование;
	Запись.Прочитать();
	ДанныеФайла = Запись.Данные.Получить();
	Возврат ДанныеФайла;
	
КонецФункции

&НаСервереБезКонтекста
Функция СформироватьОтчетЗаявкаНаКорпкидкуНаСервере(Ссылка)
	
	Возврат Отчеты.Renault_ОтчетПоЗаявкамНаКорпоративнуюСкидку.СформироватьОтчетНаСервере(Ссылка, "СхемаКомпоновкиДляДокумента");
	
КонецФункции

&НаКлиенте
Процедура СформироватьОтчет(Команда)
	
	Если ЗначениеЗаполнено(Заявка) Тогда
		Результат = СформироватьОтчетЗаявкаНаКорпкидкуНаСервере(Заявка);
		Результат.ОтображатьЗаголовки = Ложь;
		Результат.ОтображатьСетку = Ложь;
		Результат.Показать("Отчет по заявке на корп.скидку");
	КонецЕсли;
	
КонецПроцедуры

