&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Отказ = НЕ Параметры.Свойство("СтруктураНастроекСписка", СтруктураНастроекСписка);
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	ОтображаемыеТипыТрафика = СтруктураНастроекСписка.ОтображаемыеТипыТрафика;
	ЭтаФорма.ПоказыватьЛиды = ОтображаемыеТипыТрафика.ПоказыватьЛиды;
	ЭтаФорма.ПоказыватьОК = ОтображаемыеТипыТрафика.ПоказыватьОК;
	ЭтаФорма.ПоказыватьПочту = ОтображаемыеТипыТрафика.ПоказыватьПочту;
	ЭтаФорма.ВыводитьВсеНеобработанные = СтруктураНастроекСписка.ВыводитьВсеНеобработанные; 
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	НачальноеОформлениеФормы();
КонецПроцедуры

&НаКлиенте
Процедура НачальноеОформлениеФормы()
	МассивАктив = Новый Массив;
	МассивАктив.Добавить(Элементы.кнОК);
	
	Renault_ОбщиеФункции.МультибрендОсновноеОформление(МассивАктив);	
КонецПроцедуры

&НаКлиенте
Процедура ОК(Команда)
	СтруктураНастроекСписка.ОтображаемыеТипыТрафика.Вставить("ПоказыватьЛиды", ПоказыватьЛиды);
	СтруктураНастроекСписка.ОтображаемыеТипыТрафика.Вставить("ПоказыватьОК", ПоказыватьОК);
	СтруктураНастроекСписка.ОтображаемыеТипыТрафика.Вставить("ПоказыватьПочту", ПоказыватьПочту);
	СтруктураНастроекСписка.ВыводитьВсеНеобработанные = ВыводитьВсеНеобработанные;
	
	Закрыть(СтруктураНастроекСписка); 	
КонецПроцедуры


