
Перем мРегламентноеЗадание Экспорт;

Перем ИспользоватьПроксиСервер;
Перем АдресПрокси;
Перем ЛогинПрокси;
Перем ПарольПрокси;
Перем ПортПрокси;

//////////////////////////////////////////////////////////////
// Функции создания и настройки задачи

Функция НайтиРеглЗаданиеПоПараметру(УникальныйНомерЗадания)
	
	Попытка
		
		Если НЕ ПустаяСтрока(УникальныйНомерЗадания) Тогда
			
			УникальныйИдентификаторЗадания = Новый УникальныйИдентификатор(УникальныйНомерЗадания);
			ТекущееРегламентноеЗадание = РегламентныеЗадания.НайтиПоУникальномуИдентификатору(УникальныйИдентификаторЗадания);
			
		Иначе
			
			ТекущееРегламентноеЗадание = Неопределено;
			
		КонецЕсли;
		
	Исключение
		
		ТекущееРегламентноеЗадание = Неопределено;
		
	КонецПопытки;
	
	Возврат ТекущееРегламентноеЗадание;
	
КонецФункции

Функция НайтиРегламентноеЗаданиеПоНастройке() Экспорт
	
	ТекущееРегламентноеЗадание = НайтиРеглЗаданиеПоПараметру(РегламентноеЗадание);
	
	Возврат ТекущееРегламентноеЗадание;
	
КонецФункции

Функция ПолучитьОбъектРегламентногоЗадания() Экспорт
	
	Задание = НайтиРегламентноеЗаданиеПоНастройке();
	
	Возврат Задание;
	
КонецФункции

Процедура УстановитьЗначенияПеременныхРегламентныхНастроек() Экспорт
	
	Если мРегламентноеЗадание = Неопределено Тогда
		
		мРегламентноеЗадание = ПолучитьОбъектРегламентногоЗадания();
		
	КонецЕсли;
	
КонецПроцедуры

Процедура УстановитьПараметрыРегламентногоЗадания(РеквизитЗадания, ПараметрЗадания, КлючРегламентногоЗадания, Постфикс = "")
	
	Если ПараметрЗадания = Неопределено Тогда
		
		РеквизитЗадания = "";
		
	Иначе
		
		РеквизитЗадания = Строка(ПараметрЗадания.УникальныйИдентификатор);
		
		ПараметрЗадания.Наименование = Наименование + Постфикс;
		// генерируем уникальный ключ, что бы в один момент времени 2 регламентных задания не выполнялись
		Если ПустаяСтрока(ПараметрЗадания.Ключ) Тогда
			ПараметрЗадания.Ключ = КлючРегламентногоЗадания;
		КонецЕсли;
		
		МассивПараметров = Новый Массив();
		МассивПараметров.Добавить(ЭтотОбъект.Код);
		
		ПараметрЗадания.Параметры = МассивПараметров;
		ПараметрЗадания.Записать();
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриУстановкеНовогоКода(СтандартнаяОбработка, Префикс)
	Префикс = DMS_ОбщегоНазначенияСервер.ПолучитьПрефикс();
	//Если НЕ спПриУстановкеНовогоКода(ЭтотОбъект, СтандартнаяОбработка, Префикс) Тогда Возврат; КонецЕсли;
КонецПроцедуры

Процедура ПередЗаписью(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	УстановитьЗначенияПеременныхРегламентныхНастроек();
	
	Если мРегламентноеЗадание <> Неопределено 
		И Не ПустаяСтрока(мРегламентноеЗадание.Ключ) Тогда
		
		КлючРегламентногоЗадания = мРегламентноеЗадание.Ключ;
		
	Иначе
		
		КлючРегламентногоЗадания = Строка(Новый УникальныйИдентификатор);
		
	КонецЕсли;
	
	УстановитьПараметрыРегламентногоЗадания(РегламентноеЗадание, мРегламентноеЗадание, КлючРегламентногоЗадания);
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	
	мРегламентноеЗадание = Неопределено;
	РегламентноеЗадание = "";
	
КонецПроцедуры


/////////////////////////////////////////////////////////////////
//		Функции обработки задания

// Функция формирует файл с параметрами обмена
// tdfa1_*.props. Где * Код задания.
//
// Параметры
//  Нет
//
// Возвращаемое значение:
//   Строка с полным именем файла параметров tdfa1_*.props
//
Функция ПолучитьФайлПараметров_TDFa()
	
	//Для начала получаем значения констант
	ПутьКTDFa			 = Константы.Renault_Tdfa_КаталогПрограммы.Получить();
	КаталогОбменаФайлов	 = ПутьКTDFa + "\dcs-repository\";
	КаталогОбменаФайлов = СтрЗаменить(КаталогОбменаФайлов,"\\","\");
	
	ПутьКФайламНастроек = ПутьКTDFa + "config\";
	ПутьКФайламНастроек = СтрЗаменить(ПутьКФайламНастроек,"\\","\");
	
	ИмяФайлаНастроек = ПутьКФайламНастроек + "tdfa1_" + Код + ".props";
	
	//Теперь получаем в спецФормате
	// C:\tdfa\config\ -> C\:\\tdfa\\config\\
	ПутьКTDFaСпецФормат				= СтрЗаменить(СтрЗаменить(ПутьКTDFa,"\","\\"),":","\:"); 
	ПутьКФайламНастроекСпецФормат	= СтрЗаменить(СтрЗаменить(ПутьКФайламНастроек,"\","\\"),":","\:"); 
	КаталогОбменаФайловСпецФормат	= СтрЗаменить(СтрЗаменить(КаталогОбменаФайлов,"\","\\"),":","\:"); 
	
	ИдентификаторДилера = Renault_ОбщийМодуль.ПолучитьBIRБазыДанных();
	//*//Renault_ОбщийМодуль.ПолучитьИдентификатор(Организация);
	
	//Создаем макет параметров 
	МакетПараметров = ПолучитьМакет("tdfa1_props");
	
	ТекстМакета = МакетПараметров.ПолучитьТекст();
	
	//Теперь поставляем значения в параметрические показатели
	ТекстМакета = СтрЗаменить(ТекстМакета,"_ПутьКTDFAСпецФормат_",ПутьКTDFaСпецФормат);
	ТекстМакета = СтрЗаменить(ТекстМакета,"_КаталогОбменаФайловСпецФормат_",КаталогОбменаФайловСпецФормат);
	ТекстМакета = СтрЗаменить(ТекстМакета, "_BIR3M_", ИдентификаторДилера);
	
	Если ИспользоватьПроксиСервер тогда //Нужно записать Proxy.dat
		
		СформироватьПараметрыProxy(ПутьКФайламНастроек);
		ПараметрыПроксиСервера = "PROXYPATH="+ПутьКФайламНастроекСпецФормат+"proxy.dat";
		ТекстМакета = СтрЗаменить(ТекстМакета,"_ПараметрыПроксиСервера_",ПараметрыПроксиСервера);
		
	Иначе //Прокси не используется
		ТекстМакета = СтрЗаменить(ТекстМакета,"_ПараметрыПроксиСервера_","");
	КонецЕсли;
	
	
	//Добавляем текст по параметрам фильтрации
	ТекстФильтров = "";
	
	// Комментарий 
	//Дата создания - 21.12.2012 11:08:21; Автор - Окипний Андрей Евгеньевич
	//Из-за ввода статистики через TDFa, явные фильтры только 
	//на закачку или отправку отключаем.
	//
	//Если Направление = Перечисления.Renault_НаправленияПотоковTDFa.Down тогда
	//	ТекстФильтров = "MODE=DOWN" + Символы.ПС;
	//ИначеЕсли Направление = Перечисления.Renault_НаправленияПотоковTDFa.Up Тогда
	//	ТекстФильтров = "MODE=UP" + Символы.ПС;
	//Иначе
	//	ТекстФильтров = "";
	//КонецЕсли;
	
	ТекстМакета = СтрЗаменить(ТекстМакета,"_ПараметрыФильтрации_",ТекстФильтров);
		
	ТекстовыйФайл = Новый ТекстовыйДокумент;
	ТекстовыйФайл.Вывод = ИспользованиеВывода.Разрешить;
	
	ТекстовыйФайл.УстановитьТекст(ТекстМакета);
	ТекстовыйФайл.Записать(ИмяФайлаНастроек ,КодировкаТекста.ANSI);
	
	ЗаписьЖурналаРегистрации("Задача TDFa", УровеньЖурналаРегистрации.Информация,,
							ЭтотОбъект.Ссылка, "Путь к файлу параметров: " + ИмяФайлаНастроек);
	Возврат ИмяФайлаНастроек;
	
КонецФункции // ПолучитьФайлПараметров()

Функция ПолучитьФайлЗапускаTDFa() Экспорт
	
	ИмяФайлаНастроек = ПолучитьФайлПараметров_TDFa();
	
	ПутьКTDFa			 = Константы.Renault_Tdfa_КаталогПрограммы.Получить();
	КаталогОбменаФайлов	 = ПутьКTDFa + "\dcs-repository\";
	КаталогОбменаФайлов = СтрЗаменить(КаталогОбменаФайлов,"\\","\");
	
	ИмяИсполняемогоФайла = ПутьКTDFa+"\appli\applitdf1.bat";
	ИмяИсполняемогоФайла = СтрЗаменить(ИмяИсполняемогоФайла,"\\","\");
	
	МакетИсполнителя = ПолучитьМакет("applitdf1");
	
	ТекстМакета = МакетИсполнителя.ПолучитьТекст();
	
	//Теперь поставляем значения в параметрические показатели
	ТекстМакета = СтрЗаменить(ТекстМакета,"_ПутьКTDFA_",ПутьКTDFa);
	ТекстМакета = СтрЗаменить(ТекстМакета,"_КаталогОбменаФайлов_",КаталогОбменаФайлов);
	ТекстМакета = СтрЗаменить(ТекстМакета, "_ПутьКTDFAprops_", ИмяФайлаНастроек);
	
	//Теперь файл-Лог
	//Файл-Лог будем называть по коду задачи + дата 
	//пример 001_01122011.log
	ИмяЛога = Строка(КаталогОбменаФайлов) + Код + "_" + Формат(ТекущаяДата(),"ДФ=ддММгггг")+".log";
	ТекстМакета = СтрЗаменить(ТекстМакета, "_ФайлЛог_", ИмяЛога);
	
	ТекстовыйФайл = Новый ТекстовыйДокумент;
	ТекстовыйФайл.УстановитьТекст(ТекстМакета);
	ТекстовыйФайл.Вывод = ИспользованиеВывода.Разрешить;
	
	ТекстовыйФайл.Записать(ИмяИсполняемогоФайла ,КодировкаТекста.ANSI);
	
	ЗаписьЖурналаРегистрации("Задача TDFa", УровеньЖурналаРегистрации.Информация,,
							ЭтотОбъект.Ссылка, "Путь к исполняемому файлу: " + ИмяИсполняемогоФайла);
							
	Возврат ИмяИсполняемогоФайла;
	
КонецФункции

// Процедура производит запись файла Proxy.dat в каталог с параметрами.
//
// Параметры
//  ПутьКФайламНастроек  - строка - Путь, куда будет сохранен файл.
//
Процедура СформироватьПараметрыProxy(ПутьКФайламНастроек)

	ТекстФайла = "PROXYHOST=" + АдресПрокси + "
	|PROXYPORT=" + ПортПрокси + "
	|PROXYUSERNAME=" + ЛогинПрокси + "
	|PROXYUSERPWD=" + ПарольПрокси;
	
	ТекстПрокси = Новый ТекстовыйДокумент;
	ТекстПрокси.Вывод = ИспользованиеВывода.Разрешить;
	ТекстПрокси.УстановитьТекст(ТекстФайла);
	
	Попытка
		ТекстПрокси.Записать(ПутьКФайламНастроек+"proxy.dat", КодировкаТекста.ANSI);
	Исключение
	КонецПопытки;
	
	ЗаписьЖурналаРегистрации("Задача TDFa", УровеньЖурналаРегистрации.Информация,,
						ЭтотОбъект.Ссылка, "Путь к файлу параметров proxy: " + ПутьКФайламНастроек+"proxy.dat");
	
КонецПроцедуры // СформироватьПараметрыProxy()

ИспользоватьПроксиСервер = Константы.Renault_ИспользоватьПроксиCерверTDFa.Получить();
АдресПрокси				 = Константы.Renault_ПроксиСерверTDFa.Получить();
ЛогинПрокси				 = Константы.Renault_ЛогинПроксиСервераTDFa.Получить();
ПарольПрокси			 = Константы.Renault_ПарольПроксисервераTDFa.Получить();
ПортПрокси				 = Константы.Renault_ПортПроксиСервераTDFa.Получить();

