
&НаСервере
Процедура ЗаполнитьСпискиВыбора(НастройкиОтчета)
	
	// список типов группировки
	//Отчет.СписокДоступныхТиповГруппировки.Очистить();
	//Отчет.СписокДоступныхТиповГруппировки.Добавить("Элементы");
	//Отчет.СписокДоступныхТиповГруппировки.Добавить("Иерархия");
	//Отчет.СписокДоступныхТиповГруппировки.Добавить("ТолькоИерархия");
	
	// список доступных полей
	Отчет.ДоступныеПоляОтчета.Очистить();
	
	ОсновнаяСхемаКомпоновкиДанных = РеквизитФормыВЗначение("Отчет").СхемаКомпоновкиДанных;
	
	// поля
	Для Каждого Набор Из ОсновнаяСхемаКомпоновкиДанных.НаборыДанных Цикл
		Для Каждого выбПоле Из Набор.Поля Цикл
			Если (Найти(ВыбПоле.Поле, "Менеджер") <> 0 ИЛИ Найти(ВыбПоле.Поле, "Дилер") <> 0) Тогда
				нСтрока = Отчет.ДоступныеПоляОтчета.Добавить();
				нСтрока.Пометка = Истина;
				нСтрока.ИмяПоля = выбПоле.ПутьКДанным;
				//нСтрока.Ресурс = Ложь;
				нСтрока.ДополнительноеПоле = ПланыВидовХарактеристик.CRM_РеквизитыТрафика.ПустаяСсылка();
				нСтрока.Предопределенное = Истина;
			КонецЕсли;
		КонецЦикла;		
	КонецЦикла;
	
	// вычисляемые поля
	Для Каждого вычисляемоеПоле Из ОсновнаяСхемаКомпоновкиДанных.ВычисляемыеПоля Цикл
		нСтрока = Отчет.ДоступныеРесурсыОтчета.Добавить();
		нСтрока.Пометка = Ложь;
		нСтрока.ИмяПоля = вычисляемоеПоле.ПутьКДанным;
		нСтрока.Ресурс = Ложь;
		нСтрока.ДополнительноеПоле = ПланыВидовХарактеристик.CRM_РеквизитыТрафика.ПустаяСсылка();
		нСтрока.Предопределенное = Истина;
		
		
	КонецЦикла;
	
	// ресурсы
	Для Каждого ПолеКомпоновки Из НастройкиОтчета.Выбор.Элементы Цикл
		Если Не (ПолеКомпоновки.Поле = неопределено) Тогда
			 ПолеИтога = ОсновнаяСхемаКомпоновкиДанных.ПоляИтога.Найти(Строка(ПолеКомпоновки.Поле));
			 Если Не (ПолеИтога = Неопределено) Тогда
				 ДобавитьДоступныйРесурсОтчета(ПолеИтога,ОсновнаяСхемаКомпоновкиДанных);
			 КонецЕсли;
		 Иначе
			 Для Каждого ПолеКомп Из ПолеКомпоновки.Элементы Цикл
				  ПолеИтога = ОсновнаяСхемаКомпоновкиДанных.ПоляИтога.Найти(Строка(ПолеКомп.Поле));
			 Если Не (ПолеИтога = Неопределено) Тогда
				 ДобавитьДоступныйРесурсОтчета(ПолеИтога,ОсновнаяСхемаКомпоновкиДанных);
			 КонецЕсли;

			 КонецЦикла;
			 
		КонецЕсли;
		
		
		//Для Каждого полеИтога Из ОсновнаяСхемаКомпоновкиДанных.ПоляИтога Цикл
		//	
		//	Если Найти(полеИтога.ПутьКДанным, "Процент") = 0 Тогда
		//		врОтбор = Новый СТруктура;
		//		врОтбор.Вставить("ИмяПоля",полеИтога.ПутьКДанным);
		//		МассивСтрок = Отчет.ДоступныеРесурсыОтчета.НайтиСтроки(врОтбор);
		//		//Для Каждого текСтрока Из МассивСтрок Цикл
		//		//	текСтрока.Ресурс = Истина;
		//		//КонецЦикла;
		//		Если МассивСтрок.Количество() = 0 Тогда
		//			ПолеНабора = ОсновнаяСхемаКомпоновкиДанных.НаборыДанных[0].Поля.Найти(полеИтога.ПутьКДанным);
		//			
		//			нСтрока = Отчет.ДоступныеРесурсыОтчета.Добавить();
		//			нСтрока.Пометка = Истина;
		//			нСтрока.ИмяПоля = полеИтога.ПутьКДанным;
		//			нСтрока.Представление = ПолеНабора.Заголовок;
		//			нСтрока.Ресурс = Истина;
		//			нСтрока.ДополнительноеПоле = ПланыВидовХарактеристик.CRM_РеквизитыТрафика.ПустаяСсылка();
		//			нСтрока.Предопределенное = Истина;
		//			
		//		КонецЕсли;
		//	КонецЕсли;
		//КонецЦикла;
	КонецЦикла;
КонецПроцедуры
&НаСервере
Процедура ДобавитьДоступныйРесурсОтчета(ПолеИтога,ОсновнаяСхемаКомпоновкиДанных)
	Если Найти(полеИтога.ПутьКДанным, "Процент") = 0 Тогда
		врОтбор = Новый СТруктура;
		врОтбор.Вставить("ИмяПоля",полеИтога.ПутьКДанным);
		МассивСтрок = Отчет.ДоступныеРесурсыОтчета.НайтиСтроки(врОтбор);
				//Для Каждого текСтрока Из МассивСтрок Цикл
				//	текСтрока.Ресурс = Истина;
				//КонецЦикла;
		Если МассивСтрок.Количество() = 0 Тогда
			ПолеНабора = ОсновнаяСхемаКомпоновкиДанных.НаборыДанных[0].Поля.Найти(полеИтога.ПутьКДанным);
						
			нСтрока = Отчет.ДоступныеРесурсыОтчета.Добавить();
			нСтрока.Пометка = ВычислитьЗначениеПометки(ПолеИтога.ПутьКДанным);
			
			//нСтрока.Пометка = Истина;
			нСтрока.ИмяПоля = полеИтога.ПутьКДанным;
			нСтрока.Представление = ПолеНабора.Заголовок;
			нСтрока.Ресурс = Истина;
			нСтрока.ДополнительноеПоле = ПланыВидовХарактеристик.CRM_РеквизитыТрафика.ПустаяСсылка();
			нСтрока.Предопределенное = Истина;
					
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры

Функция ВычислитьЗначениеПометки (ИмяПоля)
	Итог = Истина;
	Если ИмяПоля = "ЗаявкиНаГарантию" Тогда
		Итог = Ложь;
	ИначеЕсли ИмяПоля = "ЗаявкиНаКредит" Тогда
		Итог = Ложь;
	ИначеЕсли ИмяПоля = "ЗаявкиНаОборудование" Тогда
		Итог = Ложь;
	ИначеЕсли ИмяПоля = "ЗаявкиНаСтраховку" Тогда
		Итог = Ложь;
	ИначеЕсли ИмяПоля = "ЗаявкиНаТрейдИн" Тогда
		Итог = Ложь;
	ИначеЕсли ИмяПоля = "ЗаявкиНаГарантиюВыполнено" Тогда
		Итог = Ложь;
	ИначеЕсли ИмяПоля = "ЗаявкиНаКредитВыполнено" Тогда
		Итог = Ложь;
	ИначеЕсли ИмяПоля = "ЗаявкиНаОборудованиеВыполнено" Тогда
		Итог = Ложь;
	ИначеЕсли ИмяПоля = "ЗаявкиНаСтраховкуВыполнено" Тогда
		Итог = Ложь;
	ИначеЕсли ИмяПоля = "ЗаявкиНаТрейдИнВыполнено" Тогда
		Итог = Ложь;
	ИначеЕсли ИмяПоля = "ВзятEmail" Тогда
		Итог = Ложь;
	ИначеЕсли ИмяПоля = "ВзятТелефон" Тогда
		Итог = Ложь;
	Иначе
		Итог = Истина;
	КонецЕсли;
	
Возврат Итог;
КонецФункции

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Отчет.Период.ДатаНачала = НачалоМесяца(ТекущаяДата());
	Отчет.Период.ДатаОкончания = КонецМесяца(ТекущаяДата());
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	// установим списки выбора для полей настроек отчета
	СписокДоступныхПолейДиаграммы = Новый СписокЗначений;
	СписокДоступныхПолейГруппировки = Новый СписокЗначений;
	Для Каждого текСтрока Из Отчет.ДоступныеПоляОтчета Цикл
		Если текСТрока.Ресурс Тогда
			СписокДоступныхПолейДиаграммы.Добавить(текСтрока.ИмяПоля);
		Иначе
			СписокДоступныхПолейГруппировки.Добавить(текСтрока.ИмяПоля);
		КонецЕсли;
	КонецЦикла;
	Для Каждого текСтрока Из Отчет.ДоступныеРесурсыОтчета Цикл
		Если текСТрока.Ресурс Тогда
			СписокДоступныхПолейДиаграммы.Добавить(текСтрока.ИмяПоля);
		Иначе
			СписокДоступныхПолейГруппировки.Добавить(текСтрока.ИмяПоля);
		КонецЕсли;
	КонецЦикла;
	
	СписокДоступныхПолейГруппировки.СортироватьПоЗначению(НаправлениеСортировки.Возр);
	
	//ЭтаФорма.Элементы.ГруппировкиТипГруппировки.СписокВыбора.ЗагрузитьЗначения(Отчет.СписокДоступныхТиповГруппировки.ВыгрузитьЗначения());
	//ЭтаФорма.Элементы.ГруппировкиПоле.СписокВыбора.ЗагрузитьЗначения(СписокДоступныхПолейГруппировки.ВыгрузитьЗначения());
	
	//ЭтаФорма.Элементы.ГруппировкаДиаграммы.СписокВыбора.ЗагрузитьЗначения(СписокДоступныхПолейГруппировки.ВыгрузитьЗначения());
	//Отчет.ГруппировкаДиаграммы = СписокДоступныхПолейГруппировки.ВыгрузитьЗначения()[0];
	
	СписокПоказателейВоронки = Новый СписокЗначений;
	СписокПоказателейВоронки.Добавить("Менеджер", "Менеджер");
	СписокПоказателейВоронки.Добавить("ПервичныйИнтерес", "Первичный интерес");
	ЭтаФорма.Элементы.ПоказательВоронки.СписокВыбора.ЗагрузитьЗначения(СписокПоказателейВоронки.ВыгрузитьЗначения());
	Отчет.ПоказательВоронки = "Менеджер";
	Если СформироватьПриОткрытии Тогда
		СкомпоноватьРезультат(РежимКомпоновкиРезультата.Авто);	
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ПриЗагрузкеВариантаНаСервере(Настройки)
	
	Если Настройки<>Неопределено Тогда
		ЗаполнитьСпискиВыбора(Настройки);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Настройка(Команда)
	
	Элементы.СтраницыНастроек.Видимость = Элементы.КнопкаНастройки.Пометка;
	Элементы.КнопкаНастройки.Пометка = НЕ Элементы.КнопкаНастройки.Пометка;
	
КонецПроцедуры

&НаКлиенте
Процедура ПоУмолчаниюПоля(Команда)
	// Вставить содержимое обработчика.
	Для Каждого ПолеСтрока Из Отчет.ДоступныеРесурсыОтчета Цикл
		ПолеСтрока.Пометка = ВычислитьЗначениеПометки(ПолеСтрока.ИмяПоля);

	КонецЦикла;
	
КонецПроцедуры
 &НаКлиенте
Процедура УстановитьВсеПоля(Команда)
	// Вставить содержимое обработчика.
	Для Каждого ПолеСтрока Из Отчет.ДоступныеРесурсыОтчета Цикл
		ПолеСтрока.Пометка = Истина;
	
	КонецЦикла;

КонецПроцедуры

&НаКлиенте
Процедура СнятьВсеПоля(Команда)
	// Вставить содержимое обработчика.
	Для Каждого ПолеСтрока Из Отчет.ДоступныеРесурсыОтчета Цикл
		ПолеСтрока.Пометка = Ложь;
	
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ПолеВверх(Команда)
	//// Вставить содержимое обработчика.
	//Если Не (Элементы.ДоступныеРесурсыОтчета.ТекущиеДанные =  неопределено) Тогда
	//	//Индекс = Отчет.ДоступныеПоляОтчета.Индекс(Элементы.ДоступныеРесурсыОтчета.ТекущиеДанные);
	//	ТекИндекс = Элементы.ДоступныеРесурсыОтчета.ТекущиеДанные.НомерСтроки;
	//	Значение = Отчет.ДоступныеРесурсыОтчета[ТекИндекс-1];
	//	Если ТекИндекс = 1 Тогда
	//		Отчет.ДоступныеРесурсыОтчета.Удалить(ТекИндекс-1);
	//		Тек = Отчет.ДоступныеРесурсыОтчета.Вставить(Отчет.ДоступныеРесурсыОтчета.Количество());
	//		ЗаполнитьЗначенияСвойств(Тек,Значение,,"НомерСтроки");
	//		Элементы.ДоступныеРесурсыОтчета.ТекущаяСтрока = Отчет.ДоступныеРесурсыОтчета.Количество(); 
	//	Иначе
	//		Отчет.ДоступныеРесурсыОтчета.Удалить(ТекИндекс-1);
	//		Тек =Отчет.ДоступныеРесурсыОтчета.Вставить(ТекИндекс-2);
	//		ЗаполнитьЗначенияСвойств(Тек,Значение,,"НомерСтроки");
	//		Элементы.ДоступныеРесурсыОтчета.ТекущаяСтрока = Тек.НомерСтроки-1;
	//		//Отчет.ДоступныеРесурсыОтчета.Сдвинуть(Элементы.ДоступныеРесурсыОтчета.ТекущаяСтрока,-1);
	//	КонецЕсли;
	//КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПолеВниз(Команда)
	//// Вставить содержимое обработчика.
	//Если Не (Элементы.ДоступныеРесурсыОтчета.ТекущиеДанные =  неопределено) Тогда
	//	//Индекс = Отчет.ДоступныеПоляОтчета.Индекс(Элементы.ДоступныеРесурсыОтчета.ТекущиеДанные);
	//	ТекИндекс = Элементы.ДоступныеРесурсыОтчета.ТекущиеДанные.НомерСтроки;
	//	Значение = Отчет.ДоступныеРесурсыОтчета[ТекИндекс-1];
	//	Если ТекИндекс = Отчет.ДоступныеРесурсыОтчета.Количество() Тогда
	//		Отчет.ДоступныеРесурсыОтчета.Удалить(ТекИндекс-1);
	//		Тек = Отчет.ДоступныеРесурсыОтчета.Вставить(0);
	//		ЗаполнитьЗначенияСвойств(Тек,Значение,,"НомерСтроки");
	//		Элементы.ДоступныеРесурсыОтчета.ТекущаяСтрока = 1; 
	//	Иначе
	//		Отчет.ДоступныеРесурсыОтчета.Удалить(ТекИндекс-1);
	//		Тек =Отчет.ДоступныеРесурсыОтчета.Вставить(ТекИндекс);
	//		ЗаполнитьЗначенияСвойств(Тек,Значение,,"НомерСтроки");
	//		Элементы.ДоступныеРесурсыОтчета.ТекущаяСтрока = ТекИндекс;
	//		//Отчет.ДоступныеРесурсыОтчета.Сдвинуть(Элементы.ДоступныеРесурсыОтчета.ТекущаяСтрока,-1);
	//	КонецЕсли;
	//КонецЕсли;
 
КонецПроцедуры



