////////////////////////////////////////////////////////////////////////////////
// Подсистема "Базовая функциональность".
// Серверные процедуры и функции общего назначения:
// - для работы с данными в базе;
// - для работы с прикладными типами и коллекциями значений;
// - математические процедуры и функции;
// - для работы с внешним соединением;
// - для работы с формами;
// - для работы с типами, объектами метаданных и их строковыми представлениями;
// - функции определения типов объектов метаданных;
// - сохранение, чтение и удаление настроек из хранилищ;
// - для работы с табличными документами;
// - для работы с журналом регистрации;
// - для работы в режиме разделения данных;
// - версионирование программных интерфейсов;
// - вспомогательные процедуры и функции.
//
////////////////////////////////////////////////////////////////////////////////

////////////////////////////////////////////////////////////////////////////////
// ПРОГРАММНЫЙ ИНТЕРФЕЙС

////////////////////////////////////////////////////////////////////////////////
// Общие процедуры и функции для работы с данными в базе

// Возвращает структуру, содержащую значения реквизитов прочитанные из информационной базы
// по ссылке на объект.
// 
//  Если доступа к одному из реквизитов нет, возникнет исключение прав доступа.
//  Если необходимо зачитать реквизит независимо от прав текущего пользователя,
//  то следует использовать предварительный переход в привилегированный режим.
// 
// Параметры:
//  Ссылка    - Ссылка на объект - элемент справочника, документ, ...
//
//  Реквизиты - Строка - имена реквизитов, перечисленные через запятую, в формате
//              требований к свойствам структуры.
//              Например, "Код, Наименование, Родитель".
//            - Структура, ФиксированнаяСтруктура - в качестве ключа передается
//              псевдоним поля для возвращаемой структуры с результатом, а в качестве
//              значения (опционально) фактическое имя поля в таблице.
//              Если значение не определено, то имя поля берется из ключа.
//            - Массив, ФиксированныйМассив - имена реквизитов в формате требований
//              к свойствам структуры.
//
// Возвращаемое значение:
//  Структура - содержит имена (ключи) и значения затребованных реквизитов.
//              Если строка затребованных реквизитов пуста, то возвращается пустая структура
//
Функция ЗначенияРеквизитовОбъекта(Ссылка, Реквизиты) Экспорт
	
	Если ТипЗнч(Реквизиты) = Тип("Строка") Тогда
		Если ПустаяСтрока(Реквизиты) Тогда
			Возврат Новый Структура;
		КонецЕсли;
		
		СтруктураРеквизитов = Новый Структура(Реквизиты);
		
	ИначеЕсли ТипЗнч(Реквизиты) = Тип("Структура")
	      ИЛИ ТипЗнч(Реквизиты) = Тип("ФиксированнаяСтруктура") Тогда
		
		СтруктураРеквизитов = Реквизиты;
		
	ИначеЕсли ТипЗнч(Реквизиты) = Тип("Массив")
	      ИЛИ ТипЗнч(Реквизиты) = Тип("ФиксированныйМассив") Тогда
		
		СтруктураРеквизитов = Новый Структура;
		Для каждого Реквизит Из Реквизиты Цикл
			СтруктураРеквизитов.Вставить(Реквизит);
		КонецЦикла;
	Иначе
		ВызватьИсключение Renault_СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru = 'Неверный тип второго параметра Реквизиты: %1'"),
			Строка(ТипЗнч(Реквизиты)));
	КонецЕсли;
	
	ТекстПолей = "";
	Для Каждого КлючИЗначение Из СтруктураРеквизитов Цикл
		
		ИмяПоля   = ?(ЗначениеЗаполнено(КлючИЗначение.Значение),
		              СокрЛП(КлючИЗначение.Значение),
		              СокрЛП(КлючИЗначение.Ключ));
		
		Псевдоним = СокрЛП(КлючИЗначение.Ключ);
		
		ТекстПолей  = ТекстПолей + ?(ПустаяСтрока(ТекстПолей), "", ",") + "
		|	" + ИмяПоля + " КАК " + Псевдоним;
		
	КонецЦикла;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.Текст =
	"ВЫБРАТЬ
	|" + ТекстПолей + "
	|ИЗ
	|	" + Ссылка.Метаданные().ПолноеИмя() + " КАК ПсевдонимЗаданнойТаблицы
	|ГДЕ
	|	ПсевдонимЗаданнойТаблицы.Ссылка = &Ссылка
	|";
	Выборка = Запрос.Выполнить().Выбрать();
	Выборка.Следующий();
	
	Результат = Новый Структура;
	Для Каждого КлючИЗначение Из СтруктураРеквизитов Цикл
		Результат.Вставить(КлючИЗначение.Ключ);
	КонецЦикла;
	ЗаполнитьЗначенияСвойств(Результат, Выборка);
	
	Возврат Результат;
	
КонецФункции

// Возвращает значение реквизита, прочитанного из информационной базы по ссылке на объект.
// 
//  Если доступа к реквизиту нет, возникнет исключение прав доступа.
//  Если необходимо зачитать реквизит независимо от прав текущего пользователя,
//  то следует использовать предварительный переход в привилегированный режим.
// 
// Параметры:
//  Ссылка       - ссылка на объект, - элемент справочника, документ, ...
//  ИмяРеквизита - Строка, например, "Код".
// 
// Возвращаемое значение:
//  Произвольный    - зависит от типа значения прочитанного реквизита.
// 
Функция ЗначениеРеквизитаОбъекта(Ссылка, ИмяРеквизита) Экспорт
	
	Результат = ЗначенияРеквизитовОбъекта(Ссылка, ИмяРеквизита);
	Возврат Результат[ИмяРеквизита];
	
КонецФункции 

// Процедура удаляет из массива МассивРеквизитов элементы, соответствующие именам 
// реквизитов объекта из массива МассивНепроверяемыхРеквизитов.
// Для использования в обработчиках события ОбработкаПроверкиЗаполнения.
//
// Параметры:
//	МассивРеквизитов              - Массив - массив строк с именами реквизитов объекта.
//	МассивНепроверяемыхРеквизитов - Массив строк с именами реквизитов объекта, не требующих проверки.
//
Процедура УдалитьНепроверяемыеРеквизитыИзМассива(МассивРеквизитов, МассивНепроверяемыхРеквизитов) Экспорт
	
	Для Каждого ЭлементМассива Из МассивНепроверяемыхРеквизитов Цикл
	
		ПорядковыйНомер = МассивРеквизитов.Найти(ЭлементМассива);
		Если ПорядковыйНомер <> Неопределено Тогда
			МассивРеквизитов.Удалить(ПорядковыйНомер);
		КонецЕсли;
	
	КонецЦикла;
	
КонецПроцедуры

Процедура Renault_ЗаписьОбновлениеСоставаПрофиляКонтрагентыПриЗаписи(Источник, Отказ) Экспорт
	
	Если Отказ =Истина Тогда
		
		Возврат;
		
	КонецЕсли;
     	
	Если Источник.ОбменДанными.Загрузка Тогда 		
		Возврат;  		
	КонецЕсли;
	
	//Если Справочники.Renault_ПрофилиКлиентов.Используются() Тогда
		
		Справочники.Renault_ПрофилиКлиентов.СохранитьКлиентаВПрофиль(Источник.Ссылка);
		
	//КонецЕсли;
	
КонецПроцедуры


Функция НайтиАвтоПоVIN(VIN) Экспорт

	ВалютаУчета = Константы.ВалютаУправленческогоУчетаКомпании.Получить();
	ВерсияАльфаАвто = Renault_CRM.ВерсияАльфаАвто();
		
	//Если ВерсияАльфаАвто = "5" Тогда		
	
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	Автомобили.Ссылка
		|ИЗ
		|	Справочник.Автомобили КАК Автомобили
		|ГДЕ
		|	(Автомобили.VIN = &VIN
		|			ИЛИ Автомобили.ОригинальныйVIN = &VIN)";
		
	//Иначе
	//	
	//	Запрос = Новый Запрос;
	//	Запрос.Текст = 
	//	"ВЫБРАТЬ
	//	|	Автомобили.Ссылка
	//	|ИЗ
	//	|	Справочник.Автомобили КАК Автомобили
	//	|ГДЕ
	//	|	Автомобили.VIN = &VIN";
	//	
	//КонецЕсли;
	
	Запрос.УстановитьПараметр("VIN", VIN);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Автомобиль = Выборка.Ссылка;
	Иначе	
		Автомобиль = Справочники.Автомобили.ПустаяСсылка();
	КонецЕсли;

	Возврат Автомобиль;
	
КонецФункции 

// Функция - Получить стоимость базовой комплектации по тарифу ЦенаКлиентская
//
Функция ПолучитьЦенуБазовойКомплектацииПоТарифу(VIN, УчитыватьФиксацию = Истина, пДатаФиксации = Неопределено, Модель = Неопределено, ВариантКомплектации = Неопределено, ГодВыпуска = Неопределено) Экспорт

	Если Не ЗначениеЗаполнено(VIN) И Модель = Неопределено Тогда
		Возврат 0;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(VIN) И ЗначениеЗаполнено(Модель) Тогда
		Автомобиль = Новый Структура;
		Автомобиль.Вставить("Модель", Модель);
		Автомобиль.Вставить("ВариантКомплектации", ВариантКомплектации);
		
		ГодВыпуска = ?(ЗначениеЗаполнено(ГодВыпуска), ГодВыпуска, Неопределено);
		ТекущийТариф = Справочники.Renault_ТарифыНаАвтомобили.ПолучитьТарифДляРасчетаЦены(ГодВыпуска);
	Иначе
		
		Автомобиль = НайтиАвтоПоVIN(VIN);
		
		Если Не ЗначениеЗаполнено(Автомобиль) Тогда
			#Если Клиент Тогда
				Сообщить("Не найден автомобиль по VIN");
			#КонецЕсли
			
			Возврат 0;
		КонецЕсли;
		
		Запись = РегистрыСведений.CRM_ДополнительнаяИнформацияПоАвтомобилям.СоздатьМенеджерЗаписи();
		Запись.Автомобиль = Автомобиль;
		Запись.Прочитать();
		
		Если ЗначениеЗаполнено(пДатаФиксации) Тогда
			ТекущийТариф = ПолучитьТарифПоДатеФиксации(пДатаФиксации);		
		ИначеЕсли Запись.ЦенаФиксирована И УчитыватьФиксацию Тогда
			ТекущийТариф = ПолучитьТарифПоДатеФиксации(Запись.ДатаФиксации);		
		Иначе
			ГодВыпуска = ?(ЗначениеЗаполнено(Автомобиль.ГодВыпуска), Год(Автомобиль.ГодВыпуска), Неопределено);
			ТекущийТариф = Справочники.Renault_ТарифыНаАвтомобили.ПолучитьТарифДляРасчетаЦены(ГодВыпуска);
		КонецЕсли;	
		
	КонецЕсли;
	
	Запрос = Новый Запрос;
			
	Запрос.УстановитьПараметр("Модель", Автомобиль.Модель);
	Запрос.УстановитьПараметр("ВариантКомплектации", Автомобиль.ВариантКомплектации);
	Запрос.УстановитьПараметр("ТекущийТариф", ТекущийТариф);
			
	Запрос.Текст = "ВЫБРАТЬ
	               |	Renault_ТарифНаКомплектацииАвтомобилейСрезПоследних.ЦенаКлиентская
	               |ИЗ
	               |	РегистрСведений.Renault_ТарифНаКомплектацииАвтомобилей.СрезПоследних КАК Renault_ТарифНаКомплектацииАвтомобилейСрезПоследних
	               |ГДЕ
	               |	Renault_ТарифНаКомплектацииАвтомобилейСрезПоследних.Модель = &Модель
	               |	И Renault_ТарифНаКомплектацииАвтомобилейСрезПоследних.ВариантКомплектации = &ВариантКомплектации
	               |	И Renault_ТарифНаКомплектацииАвтомобилейСрезПоследних.Тариф = &ТекущийТариф";
	
	Если ПараметрыСеанса.DMS_Бренд = Справочники.CRM_МаркаАвтомобиля.LADA И ЗначениеЗаполнено(Автомобиль.ГодВыпуска) Тогда
		Запрос.УстановитьПараметр("ГодПТС", Год(Автомобиль.ГодВыпуска));
		Запрос.Текст = "ВЫБРАТЬ
		               |	Renault_ТарифНаКомплектацииАвтомобилейСрезПоследних.ЦенаКлиентская
		               |ИЗ
		               |	РегистрСведений.Renault_ТарифНаКомплектацииАвтомобилей.СрезПоследних КАК Renault_ТарифНаКомплектацииАвтомобилейСрезПоследних
		               |ГДЕ
		               |	Renault_ТарифНаКомплектацииАвтомобилейСрезПоследних.Модель = &Модель
		               |	И Renault_ТарифНаКомплектацииАвтомобилейСрезПоследних.ВариантКомплектации = &ВариантКомплектации
		               |	И Renault_ТарифНаКомплектацииАвтомобилейСрезПоследних.Тариф = &ТекущийТариф
		               |	И Renault_ТарифНаКомплектацииАвтомобилейСрезПоследних.ГодПТС = &ГодПТС";
	КонецЕсли;
	
	Выборка = Запрос.Выполнить().Выбрать();	
	Если Выборка.Следующий() Тогда
		ЦенаПродажиБаза = Выборка.ЦенаКлиентская;
	Иначе
		ЦенаПродажиБаза = 0;
	КонецЕсли;
	
	Возврат ЦенаПродажиБаза;
	
КонецФункции

Функция ПолучитьСтоимостьЗаводскихОпцийПоТарифу(VIN, УчитыватьФиксацию = Истина, пДатаФиксации = Неопределено) Экспорт

	Если Не ЗначениеЗаполнено(VIN) Тогда
		Возврат 0;
	КонецЕсли;
	
	Автомобиль = НайтиАвтоПоVIN(VIN);
	
	Если Не ЗначениеЗаполнено(Автомобиль) Тогда
		#Если Клиент Тогда
			Сообщить("Не найден автомобиль по VIN");
		#КонецЕсли
		
		Возврат 0;
	КонецЕсли;
	
	Запись = РегистрыСведений.CRM_ДополнительнаяИнформацияПоАвтомобилям.СоздатьМенеджерЗаписи();
	Запись.Автомобиль = Автомобиль;
	Запись.Прочитать();
	
	Если ЗначениеЗаполнено(пДатаФиксации) Тогда
		ТекущийТариф = ПолучитьТарифПоДатеФиксации(пДатаФиксации);		
	ИначеЕсли Запись.ЦенаФиксирована И УчитыватьФиксацию Тогда
		ТекущийТариф = ПолучитьТарифПоДатеФиксации(Запись.ДатаФиксации);		
	Иначе
		ГодВыпуска = ?(ЗначениеЗаполнено(Автомобиль.ГодВыпуска), Год(Автомобиль.ГодВыпуска), Неопределено);
		ТекущийТариф = Справочники.Renault_ТарифыНаАвтомобили.ПолучитьТарифДляРасчетаЦены(ГодВыпуска);
	КонецЕсли;	
	
	Запись = РегистрыСведений.CRM_СостояниеАвтомобилейПроизводителя_v2.СоздатьМенеджерЗаписи();
	Запись.VIN = Автомобиль.VIN;
	Запись.Прочитать();
	Если ЗначениеЗаполнено(Запись.OPTIONS) Тогда	
		//Получим таблицы опций для парсинга
		ТаблицаПакетовОпций = Renault_ЗагрузкаДанныхОбАвтомобиляхПроизводителя.ПолучитьТаблицуСоставныхОпций();
		ТаблицаОтдельныхОпций = Renault_ЗагрузкаДанныхОбАвтомобиляхПроизводителя.ПолучитьТаблицуОтдельныхОпций();
		
		МассивОпцийАвтомобиля = Renault_ЗагрузкаДанныхОбАвтомобиляхПроизводителя.МассивОпцийПоСтроке(Запись.OPTIONS, ТаблицаПакетовОпций, ТаблицаОтдельныхОпций, Автомобиль.ВариантКомплектации, ТекущийТариф);		
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |	Renault_ТарифНаОпцииАвтомобилейСрезПоследних.Опция.Ссылка КАК Опция,
	               |	Renault_ТарифНаОпцииАвтомобилейСрезПоследних.Опция.Артикул КАК Код,
	               |	ВЫРАЗИТЬ(Renault_ТарифНаОпцииАвтомобилейСрезПоследних.НаименованиеОпции КАК СТРОКА(150)) КАК Наименование,
	               |	Renault_ТарифНаОпцииАвтомобилейСрезПоследних.ЦенаКлиентская КАК Цена,
	               |	Renault_ТарифНаОпцииАвтомобилейСрезПоследних.ЦенаДилерская
	               |ИЗ
	               |	РегистрСведений.Renault_ТарифНаОпцииАвтомобилей.СрезПоследних(
	               |			,
	               |			Тариф = &ТекущийТариф
	               |				И Опция.Ссылка В (&МассивОпций)
	               |				И ВариантКомплектации.Ссылка = &ВариантКомплектации) КАК Renault_ТарифНаОпцииАвтомобилейСрезПоследних";
	Запрос.УстановитьПараметр("ТекущийТариф", ТекущийТариф);
	Запрос.УстановитьПараметр("МассивОпций", МассивОпцийАвтомобиля);
	Запрос.УстановитьПараметр("ВариантКомплектации", Автомобиль.ВариантКомплектации);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	ЦенаПродажиОпции = 0;
	
	Пока Выборка.Следующий() Цикл
		Если ЗначениеЗаполнено(Выборка.Цена) Тогда
			ЦенаПродажиОпции = ЦенаПродажиОпции + Выборка.Цена;
		КонецЕсли;
	КонецЦикла;
	
	Возврат ЦенаПродажиОпции;
	
КонецФункции

Функция ПолучитьТарифПоДатеФиксации(ДатаФиксации)

	Запрос = Новый Запрос;
	
	Запрос.УстановитьПараметр("Дата", ДатаФиксации);
	
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	               |	Renault_ТарифыНаАвтомобили.Ссылка
	               |ИЗ
	               |	Справочник.Renault_ТарифыНаАвтомобили КАК Renault_ТарифыНаАвтомобили
	               |ГДЕ
	               |	Renault_ТарифыНаАвтомобили.НачалоДействия <= &Дата
	               |	И (Renault_ТарифыНаАвтомобили.ОкончаниеДействия >= &Дата
	               |			ИЛИ Renault_ТарифыНаАвтомобили.ОкончаниеДействия = ДАТАВРЕМЯ(1, 1, 1))";
				   
	Выборка = Запрос.Выполнить().Выбрать();
	
	Тариф = Справочники.Renault_ТарифыНаАвтомобили.ПустаяСсылка();
	Если Выборка.Следующий() Тогда
		Тариф = Выборка.Ссылка;
	КонецЕсли;

	Возврат Тариф;
	
КонецФункции

Функция ПолучитьСтоимостьОборудования(VIN, ВидРемонта) Экспорт

	Если Не ЗначениеЗаполнено(VIN) Тогда
		Возврат 0;
	КонецЕсли;
	
	Автомобиль = НайтиАвтоПоVIN(VIN);
	
	Если Не ЗначениеЗаполнено(Автомобиль) Тогда
		#Если Клиент Тогда
			Сообщить("Не найден автомобиль по VIN");
		#КонецЕсли
		
		Возврат 0;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	СУММА(ЗаказНаряд.СуммаДокумента) КАК Сумма
	               |ИЗ
	               |	Документ.ЗаказНаряд КАК ЗаказНаряд
	               |ГДЕ
	               |	ЗаказНаряд.Автомобиль = &Автомобиль
	               |	И ЗаказНаряд.ВидРемонта = &ВидРемонта
	               |	И ЗаказНаряд.Состояние = ЗНАЧЕНИЕ(Справочник.ВидыСостоянийЗаказНарядов.Закрыт)";
	
	Запрос.УстановитьПараметр("ВидРемонта", ВидРемонта);
	Запрос.УстановитьПараметр("Автомобиль", Автомобиль);

	Выборка = Запрос.Выполнить().Выбрать();
	
	СтоимостьОборудования = 0;
	Пока Выборка.Следующий() Цикл
		СтоимостьОборудования = Выборка.Сумма;
	КонецЦикла;

	Возврат СтоимостьОборудования;
	
КонецФункции

Функция ПолучитьСтоимостьОборудованияПоЗаявке(VIN,IDK) Экспорт

	Если Не ЗначениеЗаполнено(VIN) Тогда
		Возврат 0;
	КонецЕсли;
	
	Автомобиль = НайтиАвтоПоVIN(VIN);
	
	Если Не ЗначениеЗаполнено(Автомобиль) Тогда
		#Если Клиент Тогда
			Сообщить("Не найден автомобиль по VIN");
		#КонецЕсли
		
		Возврат 0;
	КонецЕсли;
	
//v+
	Сумма=0;
	Запрос=Новый Запрос("Выбрать Ссылка Из Документ.Renault_CRM_ЗаявкаНаСервис ГДЕ НЕ ПометкаУдаления И ВидРемонта=Значение(Справочник.ВидыРемонта.КомплектацияАвтомобиля) И Автомобиль=&Автомобиль");
	//Запрос.УстановитьПараметр("IDK",IDK);
	Запрос.УстановитьПараметр("Автомобиль",Автомобиль);
	Для Каждого Заявка Из Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка") Цикл
		Сумма=Сумма+Заявка.Работы.Итог("Сумма")+Заявка.Товары.Итог("Сумма");//+Заявка.ДополнительноеОборудование.Итог("ЦенаДляКлиентаСумма");
	КонецЦикла;	
	Возврат Сумма
//v-
	
	//Запрос = Новый Запрос;
	//
	//Запрос.Текст = "ВЫБРАТЬ
	//               |	СУММА(Renault_CRM_ЗаявкаНаСервис.СуммаДокумента) КАК Сумма
	//               |ИЗ
	//               |	Документ.Renault_CRM_ЗаявкаНаСервис КАК Renault_CRM_ЗаявкаНаСервис
	//               |ГДЕ
	//               |	Renault_CRM_ЗаявкаНаСервис.ПометкаУдаления = ЛОЖЬ
	//               |	И Renault_CRM_ЗаявкаНаСервис.Автомобиль = &Автомобиль
	//               |	И Renault_CRM_ЗаявкаНаСервис.СтатусПодготовкиКПродаже = ЗНАЧЕНИЕ(Перечисление.Renault_СтатусыЗаявкиНаПрепродажнуюПодготовку.ОтправленаВРаботу)
	//               |	И Renault_CRM_ЗаявкаНаСервис.ВидРемонта = &ВидРемонта";
	//			   
	//Запрос.УстановитьПараметр("ВидРемонта", Справочники.ВидыРемонта.ДополнительноеОборудование);
	//Запрос.УстановитьПараметр("Автомобиль", Автомобиль);
	//
	//СтоимостьОборудования = 0;
	//Выборка = Запрос.Выполнить().Выбрать();	
	//Если Выборка.Следующий() Тогда
	//	СтоимостьОборудования = Выборка.Сумма;
	//КонецЕсли;
	//
	//Возврат СтоимостьОборудования;
	
КонецФункции

Функция ПолучитьСуммуСкидкиПоУтилизации(VIN, Модель = Неопределено, ВариантКомплектации = Неопределено, ГодВыпуска = Неопределено, ТолькоИтоги = Истина) Экспорт

	Если Не ЗначениеЗаполнено(VIN) И Модель = Неопределено Тогда
		Если ТолькоИтоги Тогда
			Возврат 0;
		Иначе
			Возврат Неопределено;
		КонецЕсли;
	КонецЕсли;
	
	Возврат ПолучитьСуммуСкидкиПоПрограммамОбновления(VIN, "Утилизация", Модель, ВариантКомплектации, ГодВыпуска, ТолькоИтоги);
	
КонецФункции

Функция ПолучитьСуммуСкидкиПоТрейдИн(VIN, Модель = Неопределено, ВариантКомплектации = Неопределено, ГодВыпуска = Неопределено, ТолькоИтоги = Истина, ДатаДоговора = Неопределено) Экспорт

	Если Не ЗначениеЗаполнено(VIN) И Модель = Неопределено Тогда
		Если ТолькоИтоги Тогда
			Возврат 0;
		Иначе
			Возврат Неопределено;
		КонецЕсли;
	КонецЕсли;
	
	Возврат ПолучитьСуммуСкидкиПоПрограммамОбновления(VIN, "ТрейдИн", Модель, ВариантКомплектации, ГодВыпуска, ТолькоИтоги, ДатаДоговора);

КонецФункции

// Функция - Получить сумму скидки по программам обновления
//
// Параметры:
//  VIN				 - Строка	 - VIN автомобиля
//  Вид				 - 	Строка -  Вид коммерческой акции: "ТрейдИн" / "Утилизация" / "Прочее"
Функция ПолучитьСуммуСкидкиПоПрограммамОбновления(VIN, Вид, Модель, ВариантКомплектации, ГодВыпуска, ТолькоИтоги = Истина, ДатаДоговора = Неопределено)

	Если Не ЗначениеЗаполнено(VIN) И Модель = Неопределено И НЕ Вид = "Утилизация" Тогда
		Если ТолькоИтоги Тогда
			Возврат 0;
		Иначе
			Возврат Неопределено;
		КонецЕсли;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(VIN) Тогда
		Автомобиль = НайтиАвтоПоVIN(VIN);
		
		Если Не ЗначениеЗаполнено(Автомобиль) Тогда
			#Если Клиент Тогда
				Сообщить("Не найден автомобиль по VIN");
			#КонецЕсли
			Возврат 0;
		КонецЕсли;
		
		Если ГодВыпуска = Неопределено Тогда 
			ГодВыпуска = ПолучитьГодВыпуска(Автомобиль); 
		КонецЕсли;

	Иначе	
		Автомобиль = Новый Структура;
		Автомобиль.Вставить("Модель", Модель);
		Автомобиль.Вставить("ВариантКомплектации", ВариантКомплектации);
		Если ГодВыпуска = Неопределено Тогда 
			ГодВыпуска = 0; 
		КонецЕсли;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	
	Если ДатаДоговора = Неопределено Тогда
		Запрос.УстановитьПараметр("Дата", НачалоДня(ТекущаяДатаСеанса()));
	Иначе	
		Запрос.УстановитьПараметр("Дата", НачалоДня(ДатаДоговора));
	КонецЕсли;
	Запрос.УстановитьПараметр("Модель", Автомобиль.Модель);
	Запрос.УстановитьПараметр("Версия", Автомобиль.ВариантКомплектации);
	Запрос.УстановитьПараметр("ГодВыпуска", ГодВыпуска);
	Запрос.УстановитьПараметр("Вид", Вид);
	
	Запрос.Текст = "ВЫБРАТЬ
	               |	DMS_КоммерческиеАкцииУсловия.Ссылка КАК Ссылка,
	               |	МАКСИМУМ(DMS_КоммерческиеАкцииУсловия.ЗначениеСкидки) КАК ЗначениеСкидки,
	               |	МАКСИМУМ(DMS_КоммерческиеАкцииУсловия.ЗначениеСкидкиУчастиеДилера) КАК ЗначениеСкидкиУчастиеДилера,
	               |	DMS_КоммерческиеАкцииУсловия.ВариантСкидки КАК ВариантСкидки
	               |ИЗ
	               |	Справочник.DMS_КоммерческиеАкции.Условия КАК DMS_КоммерческиеАкцииУсловия
	               |ГДЕ
	               |	DMS_КоммерческиеАкцииУсловия.НачалоДействия <= &Дата
	               |	И (DMS_КоммерческиеАкцииУсловия.ОкончаниеДействия >= &Дата
	               |			ИЛИ DMS_КоммерческиеАкцииУсловия.ОкончаниеДействия = ДАТАВРЕМЯ(1, 1, 1))
	               |	И (DMS_КоммерческиеАкцииУсловия.Объект = &Модель
	               |			ИЛИ DMS_КоммерческиеАкцииУсловия.Объект = &Версия)
	               |	И (&Вид = ""Утилизация""
	               |				И DMS_КоммерческиеАкцииУсловия.Ссылка.ТипАкции = 3
	               |			ИЛИ &Вид = ""ТрейдИн""
	               |				И DMS_КоммерческиеАкцииУсловия.Ссылка.ТипАкции = 2)
	               |	И DMS_КоммерческиеАкцииУсловия.ВариантСкидки = ""Сумма""
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	DMS_КоммерческиеАкцииУсловия.Ссылка,
	               |	DMS_КоммерческиеАкцииУсловия.ВариантСкидки";
	
	//Запрос.Текст = "ВЫБРАТЬ
	//               |	Renault_КоммерческиеАкции.КлючСтроки КАК КлючСтроки,
	//               |	МАКСИМУМ(Renault_КоммерческиеАкции.ЗначениеСкидки) КАК ЗначениеСкидки,
	//               |	МАКСИМУМ(Renault_КоммерческиеАкции.ЗначениеСкидкиУчастиеДилера) КАК ЗначениеСкидкиУчастиеДилера,
	//               |	Renault_КоммерческиеАкции.КоммерческаяАкцияGUID КАК КоммерческаяАкцияGUID,
	//               |	Renault_КоммерческиеАкции.ВариантСкидки КАК ВариантСкидки,
	//               |	Renault_КоммерческиеАкции.Вид КАК Вид
	//               |ПОМЕСТИТЬ ВТ_Подготовка
	//               |ИЗ
	//               |	РегистрСведений.Renault_КоммерческиеАкции КАК Renault_КоммерческиеАкции
	//               |ГДЕ
	//               |	Renault_КоммерческиеАкции.ДатаНачалаДействия <= &Дата
	//               |	И (Renault_КоммерческиеАкции.ДатаОкончанияДействия >= &Дата
	//               |			ИЛИ Renault_КоммерческиеАкции.ДатаОкончанияДействия = ДАТАВРЕМЯ(1, 1, 1))
	//               |	И Renault_КоммерческиеАкции.Модель = &Модель
	//               |	И Renault_КоммерческиеАкции.Версия = &Версия
	//               |	И Renault_КоммерческиеАкции.Вид = &Вид
	//               |	И Renault_КоммерческиеАкции.ВариантСкидки = ""Сумма""
	//               |
	//               |СГРУППИРОВАТЬ ПО
	//               |	Renault_КоммерческиеАкции.КлючСтроки,
	//               |	Renault_КоммерческиеАкции.КоммерческаяАкцияGUID,
	//               |	Renault_КоммерческиеАкции.ВариантСкидки,
	//               |	Renault_КоммерческиеАкции.Вид
	//               |
	//               |ОБЪЕДИНИТЬ ВСЕ
	//               |
	//               |ВЫБРАТЬ
	//               |	Renault_КоммерческиеАкции.КлючСтроки,
	//               |	МАКСИМУМ(Renault_КоммерческиеАкции.ЗначениеСкидки),
	//               |	МАКСИМУМ(Renault_КоммерческиеАкции.ЗначениеСкидкиУчастиеДилера),
	//               |	Renault_КоммерческиеАкции.КоммерческаяАкцияGUID,
	//               |	Renault_КоммерческиеАкции.ВариантСкидки,
	//               |	Renault_КоммерческиеАкции.Вид
	//               |ИЗ
	//               |	РегистрСведений.Renault_КоммерческиеАкции КАК Renault_КоммерческиеАкции
	//               |ГДЕ
	//               |	Renault_КоммерческиеАкции.ДатаНачалаДействия <= &Дата
	//               |	И (Renault_КоммерческиеАкции.ДатаОкончанияДействия >= &Дата
	//               |			ИЛИ Renault_КоммерческиеАкции.ДатаОкончанияДействия = ДАТАВРЕМЯ(1, 1, 1))
	//               |	И Renault_КоммерческиеАкции.Модель = &Модель
	//               |	И Renault_КоммерческиеАкции.Версия = ЗНАЧЕНИЕ(Справочник.ВариантыКомплектации.ПустаяСсылка)
	//               |	И Renault_КоммерческиеАкции.Вид = &Вид
	//               |	И Renault_КоммерческиеАкции.ВариантСкидки = ""Сумма""
	//               |
	//               |СГРУППИРОВАТЬ ПО
	//               |	Renault_КоммерческиеАкции.КлючСтроки,
	//               |	Renault_КоммерческиеАкции.КоммерческаяАкцияGUID,
	//               |	Renault_КоммерческиеАкции.ВариантСкидки,
	//               |	Renault_КоммерческиеАкции.Вид
	//               |
	//               |ОБЪЕДИНИТЬ ВСЕ
	//               |
	//               |ВЫБРАТЬ
	//               |	Renault_КоммерческиеАкции.КлючСтроки,
	//               |	МАКСИМУМ(Renault_КоммерческиеАкции.ЗначениеСкидки),
	//               |	МАКСИМУМ(Renault_КоммерческиеАкции.ЗначениеСкидкиУчастиеДилера),
	//               |	Renault_КоммерческиеАкции.КоммерческаяАкцияGUID,
	//               |	Renault_КоммерческиеАкции.ВариантСкидки,
	//               |	Renault_КоммерческиеАкции.Вид
	//               |ИЗ
	//               |	РегистрСведений.Renault_КоммерческиеАкции КАК Renault_КоммерческиеАкции
	//               |ГДЕ
	//               |	Renault_КоммерческиеАкции.ДатаНачалаДействия <= &Дата
	//               |	И (Renault_КоммерческиеАкции.ДатаОкончанияДействия >= &Дата
	//               |			ИЛИ Renault_КоммерческиеАкции.ДатаОкончанияДействия = ДАТАВРЕМЯ(1, 1, 1))
	//               |	И Renault_КоммерческиеАкции.Модель = ЗНАЧЕНИЕ(Справочник.Модели.ПустаяСсылка)
	//               |	И Renault_КоммерческиеАкции.Версия = ЗНАЧЕНИЕ(Справочник.ВариантыКомплектации.ПустаяСсылка)
	//               |	И Renault_КоммерческиеАкции.Вид = &Вид
	//               |	И Renault_КоммерческиеАкции.ВариантСкидки = ""Сумма""
	//               |
	//               |СГРУППИРОВАТЬ ПО
	//               |	Renault_КоммерческиеАкции.КлючСтроки,
	//               |	Renault_КоммерческиеАкции.КоммерческаяАкцияGUID,
	//               |	Renault_КоммерческиеАкции.ВариантСкидки,
	//               |	Renault_КоммерческиеАкции.Вид
	//               |;
	//               |
	//               |////////////////////////////////////////////////////////////////////////////////
	//               |ВЫБРАТЬ
	//               |	ВТ_Подготовка.КлючСтроки КАК КлючСтроки,
	//               |	ВТ_Подготовка.ЗначениеСкидки КАК ЗначениеСкидки,
	//               |	ВТ_Подготовка.ЗначениеСкидкиУчастиеДилера КАК ЗначениеСкидкиУчастиеДилера,
	//               |	ВТ_Подготовка.КоммерческаяАкцияGUID КАК КоммерческаяАкцияGUID,
	//               |	ВТ_Подготовка.ВариантСкидки КАК ВариантСкидки,
	//               |	ВТ_Подготовка.Вид КАК Вид,
	//               |	Renault_КоммерческиеАкции.КоммерческаяАкция КАК КоммерческаяАкция,
	//               |	Renault_КоммерческиеАкции.УсловиеПредоставления
	//               |ПОМЕСТИТЬ ВТ_АкцииУсловия
	//               |ИЗ
	//               |	ВТ_Подготовка КАК ВТ_Подготовка
	//               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.Renault_КоммерческиеАкции КАК Renault_КоммерческиеАкции
	//               |		ПО ВТ_Подготовка.КоммерческаяАкцияGUID = Renault_КоммерческиеАкции.КоммерческаяАкцияGUID
	//               |			И ВТ_Подготовка.КлючСтроки = Renault_КоммерческиеАкции.КлючСтроки
	//               |;
	//               |
	//               |////////////////////////////////////////////////////////////////////////////////
	//               |ВЫБРАТЬ РАЗЛИЧНЫЕ
	//               |	ВТ_АкцииУсловия.КоммерческаяАкцияGUID,
	//               |	ВТ_АкцииУсловия.КлючСтроки
	//               |ПОМЕСТИТЬ ВТ_АкцииКИсключению
	//               |ИЗ
	//               |	ВТ_АкцииУсловия КАК ВТ_АкцииУсловия
	//               |ГДЕ
	//               |	ВТ_АкцииУсловия.УсловиеПредоставления.Наименование = ""Автомобили 2015 года выпуска""
	//               |	И &ГодВыпуска <> 2015
	//               |
	//               |ОБЪЕДИНИТЬ
	//               |
	//               |ВЫБРАТЬ РАЗЛИЧНЫЕ
	//               |	ВТ_АкцииУсловия.КоммерческаяАкцияGUID,
	//               |	ВТ_АкцииУсловия.КлючСтроки
	//               |ИЗ
	//               |	ВТ_АкцииУсловия КАК ВТ_АкцииУсловия
	//               |ГДЕ
	//               |	ВТ_АкцииУсловия.УсловиеПредоставления.Наименование = ""Автомобили 2016 года выпуска""
	//               |	И &ГодВыпуска <> 2016
	//               |
	//               |ОБЪЕДИНИТЬ
	//               |
	//               |ВЫБРАТЬ
	//               |	ВТ_АкцииУсловия.КоммерческаяАкцияGUID,
	//               |	ВТ_АкцииУсловия.КлючСтроки
	//               |ИЗ
	//               |	ВТ_АкцииУсловия КАК ВТ_АкцииУсловия
	//               |ГДЕ
	//               |	ВТ_АкцииУсловия.УсловиеПредоставления.Наименование = ""Автомобили 2017 года выпуска""
	//               |	И &ГодВыпуска <> 2017
	//               |;
	//               |
	//               |////////////////////////////////////////////////////////////////////////////////
	//               |ВЫБРАТЬ ПЕРВЫЕ 1
	//               |	ВТ_АкцииУсловия.КлючСтроки КАК КлючСтроки,
	//               |	МАКСИМУМ(ВТ_АкцииУсловия.ЗначениеСкидки) КАК ЗначениеСкидки,
	//               |	МАКСИМУМ(ВТ_АкцииУсловия.ЗначениеСкидкиУчастиеДилера) КАК ЗначениеСкидкиУчастиеДилера,
	//               |	ВТ_АкцииУсловия.КоммерческаяАкцияGUID КАК КоммерческаяАкцияGUID,
	//               |	ВТ_АкцииУсловия.КоммерческаяАкция КАК КоммерческаяАкция
	//               |ИЗ
	//               |	ВТ_АкцииУсловия КАК ВТ_АкцииУсловия
	//               |		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_АкцииКИсключению КАК ВТ_АкцииКИсключению
	//               |		ПО ВТ_АкцииУсловия.КоммерческаяАкцияGUID = ВТ_АкцииКИсключению.КоммерческаяАкцияGUID
	//               |			И ВТ_АкцииУсловия.КлючСтроки = ВТ_АкцииКИсключению.КлючСтроки
	//               |ГДЕ
	//               |	ВТ_АкцииКИсключению.КоммерческаяАкцияGUID ЕСТЬ NULL
	//               |
	//               |СГРУППИРОВАТЬ ПО
	//               |	ВТ_АкцииУсловия.КлючСтроки,
	//               |	ВТ_АкцииУсловия.КоммерческаяАкцияGUID,
	//               |	ВТ_АкцииУсловия.КоммерческаяАкция";
	
	Если ТолькоИтоги Тогда
		ВыборкаАкция = Запрос.Выполнить().Выбрать();
		ЗначениеСкидки = 0;
		Пока ВыборкаАкция.Следующий() Цикл
			ЗначениеСкидки = ВыборкаАкция.ЗначениеСкидки;
		КонецЦикла;
		Возврат ЗначениеСкидки;
	Иначе
		Возврат Запрос.Выполнить().Выгрузить();
	КонецЕсли;
	
КонецФункции 


// Функция - Получить стоимость базовой комплектации по тарифу ЦенаДилерская 
///Блинков дописания установки базовой цены комплектации DMSREN-723
//
//Наследование от ПолучитьЦенуБазовойКомплектацииПоТарифу
Функция ПолучитьЦенуДилераБазовойКомплектацииПоТарифу(VIN, УчитыватьФиксацию = Истина, пДатаФиксации = Неопределено, Модель = Неопределено, ВариантКомплектации = Неопределено, ГодВыпуска = Неопределено) Экспорт

	Если Не ЗначениеЗаполнено(VIN) И Модель = Неопределено Тогда
		Возврат 0;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(VIN) И ЗначениеЗаполнено(Модель) Тогда
		Автомобиль = Новый Структура;
		Автомобиль.Вставить("Модель", Модель);
		Автомобиль.Вставить("ВариантКомплектации", ВариантКомплектации);
		
		ГодВыпуска = ?(ЗначениеЗаполнено(ГодВыпуска), ГодВыпуска, Неопределено);
		ТекущийТариф = Справочники.Renault_ТарифыНаАвтомобили.ПолучитьТарифДляРасчетаЦены(ГодВыпуска);
	Иначе
		
		Автомобиль = НайтиАвтоПоVIN(VIN);
		
		Если Не ЗначениеЗаполнено(Автомобиль) Тогда
			#Если Клиент Тогда
				Сообщить("Не найден автомобиль по VIN");
			#КонецЕсли
			
			Возврат 0;
		КонецЕсли;
		
		Запись = РегистрыСведений.CRM_ДополнительнаяИнформацияПоАвтомобилям.СоздатьМенеджерЗаписи();
		Запись.Автомобиль = Автомобиль;
		Запись.Прочитать();
		
		Если ЗначениеЗаполнено(пДатаФиксации) Тогда
			ТекущийТариф = ПолучитьТарифПоДатеФиксации(пДатаФиксации);		
		ИначеЕсли Запись.ЦенаФиксирована И УчитыватьФиксацию Тогда
			ТекущийТариф = ПолучитьТарифПоДатеФиксации(Запись.ДатаФиксации);		
		Иначе
			ГодВыпуска = ?(ЗначениеЗаполнено(Автомобиль.ГодВыпуска), Год(Автомобиль.ГодВыпуска), Неопределено);
			ТекущийТариф = Справочники.Renault_ТарифыНаАвтомобили.ПолучитьТарифДляРасчетаЦены(ГодВыпуска);
		КонецЕсли;	
		
	КонецЕсли;
	
	Запрос = Новый Запрос;
			
	Запрос.УстановитьПараметр("Модель", Автомобиль.Модель);
	Запрос.УстановитьПараметр("ВариантКомплектации", Автомобиль.ВариантКомплектации);
	Запрос.УстановитьПараметр("ТекущийТариф", ТекущийТариф);
			
	Запрос.Текст = "ВЫБРАТЬ
	               |	Renault_ТарифНаКомплектацииАвтомобилейСрезПоследних.ЦенаДилерская
	               |ИЗ
	               |	РегистрСведений.Renault_ТарифНаКомплектацииАвтомобилей.СрезПоследних КАК Renault_ТарифНаКомплектацииАвтомобилейСрезПоследних
	               |ГДЕ
	               |	Renault_ТарифНаКомплектацииАвтомобилейСрезПоследних.Модель = &Модель
	               |	И Renault_ТарифНаКомплектацииАвтомобилейСрезПоследних.ВариантКомплектации = &ВариантКомплектации
	               |	И Renault_ТарифНаКомплектацииАвтомобилейСрезПоследних.Тариф = &ТекущийТариф";
	
	Если ПараметрыСеанса.DMS_Бренд = Справочники.CRM_МаркаАвтомобиля.LADA И ЗначениеЗаполнено(Автомобиль.ГодВыпуска) Тогда
		Запрос.УстановитьПараметр("ГодПТС", Год(Автомобиль.ГодВыпуска));
		Запрос.Текст = "ВЫБРАТЬ
		               |	Renault_ТарифНаКомплектацииАвтомобилейСрезПоследних.ЦенаДилерская
		               |ИЗ
		               |	РегистрСведений.Renault_ТарифНаКомплектацииАвтомобилей.СрезПоследних КАК Renault_ТарифНаКомплектацииАвтомобилейСрезПоследних
		               |ГДЕ
		               |	Renault_ТарифНаКомплектацииАвтомобилейСрезПоследних.Модель = &Модель
		               |	И Renault_ТарифНаКомплектацииАвтомобилейСрезПоследних.ВариантКомплектации = &ВариантКомплектации
		               |	И Renault_ТарифНаКомплектацииАвтомобилейСрезПоследних.Тариф = &ТекущийТариф
		               |	И Renault_ТарифНаКомплектацииАвтомобилейСрезПоследних.ГодПТС = &ГодПТС";
	КонецЕсли;
	
	Выборка = Запрос.Выполнить().Выбрать();	
	Если Выборка.Следующий() Тогда
		ЦенаПродажиБаза = Выборка.ЦенаДилерская;
	Иначе
		ЦенаПродажиБаза = 0;
	КонецЕсли;
	
	Возврат ЦенаПродажиБаза;
	
КонецФункции


//Функция ПолучитьСуммуСкидокПоКоммерческимАкциям(VIN, Модель = Неопределено, ВариантКомплектации = Неопределено, ГодВыпуска = Неопределено, СтоимостьАвтоИБазовыхОпций = 0) Экспорт

//	Если Не ЗначениеЗаполнено(VIN) И Модель = Неопределено Тогда
//		Возврат 0;
//	КонецЕсли;
//	
//	Если ЗначениеЗаполнено(VIN) Тогда
//		Автомобиль = НайтиАвтоПоVIN(VIN);
//		
//		Если Не ЗначениеЗаполнено(Автомобиль) Тогда
//			#Если Клиент Тогда
//				Сообщить("Не найден автомобиль по VIN");
//			#КонецЕсли
//			
//			Возврат 0;
//		КонецЕсли;
//	Иначе	
//		Автомобиль = Новый Структура;
//		Автомобиль.Вставить("Модель", Модель);
//		Автомобиль.Вставить("ВариантКомплектации", ВариантКомплектации);
//	КонецЕсли;

//	Если ГодВыпуска = Неопределено Тогда ГодВыпуска = ПолучитьГодВыпуска(Автомобиль); КонецЕсли;
//	
//	Запрос = Новый Запрос;
//			
//	Запрос.УстановитьПараметр("Дата", НачалоДня(ТекущаяДатаСеанса()));
//	Запрос.УстановитьПараметр("Модель", Автомобиль.Модель);
//	Запрос.УстановитьПараметр("Версия", Автомобиль.ВариантКомплектации);
//	Запрос.УстановитьПараметр("ГодВыпуска", ГодВыпуска);
//	Запрос.УстановитьПараметр("Вид", "Прочее");
//	Запрос.УстановитьПараметр("СтоимостьАвтоИБазовыхОпций", СтоимостьАвтоИБазовыхОпций);
//		
//	Запрос.Текст = "ВЫБРАТЬ
//	               |	Renault_КоммерческиеАкции.КлючСтроки КАК КлючСтроки,
//	               |	МАКСИМУМ(Renault_КоммерческиеАкции.ЗначениеСкидки) КАК ЗначениеСкидки,
//	               |	МАКСИМУМ(Renault_КоммерческиеАкции.ЗначениеСкидкиУчастиеДилера) КАК ЗначениеСкидкиУчастиеДилера,
//	               |	Renault_КоммерческиеАкции.КоммерческаяАкцияGUID КАК КоммерческаяАкцияGUID,
//	               |	Renault_КоммерческиеАкции.ВариантСкидки КАК ВариантСкидки,
//	               |	Renault_КоммерческиеАкции.Вид КАК Вид
//	               |ПОМЕСТИТЬ ВТ_Подготовка
//	               |ИЗ
//	               |	РегистрСведений.Renault_КоммерческиеАкции КАК Renault_КоммерческиеАкции
//	               |ГДЕ
//	               |	Renault_КоммерческиеАкции.ДатаНачалаДействия <= &Дата
//	               |	И (Renault_КоммерческиеАкции.ДатаОкончанияДействия >= &Дата
//	               |			ИЛИ Renault_КоммерческиеАкции.ДатаОкончанияДействия = ДАТАВРЕМЯ(1, 1, 1))
//	               |	И Renault_КоммерческиеАкции.Модель = &Модель
//	               |	И Renault_КоммерческиеАкции.Версия = &Версия
//	               |	И Renault_КоммерческиеАкции.Вид = &Вид
//	               |	И (Renault_КоммерческиеАкции.ВариантСкидки = ""Сумма""
//	               |			ИЛИ Renault_КоммерческиеАкции.ВариантСкидки = """"
//	               |			ИЛИ Renault_КоммерческиеАкции.ВариантСкидки = ""Процент"")
//	               |
//	               |СГРУППИРОВАТЬ ПО
//	               |	Renault_КоммерческиеАкции.КлючСтроки,
//	               |	Renault_КоммерческиеАкции.КоммерческаяАкцияGUID,
//	               |	Renault_КоммерческиеАкции.ВариантСкидки,
//	               |	Renault_КоммерческиеАкции.Вид
//	               |
//	               |ОБЪЕДИНИТЬ ВСЕ
//	               |
//	               |ВЫБРАТЬ
//	               |	Renault_КоммерческиеАкции.КлючСтроки,
//	               |	МАКСИМУМ(Renault_КоммерческиеАкции.ЗначениеСкидки),
//	               |	МАКСИМУМ(Renault_КоммерческиеАкции.ЗначениеСкидкиУчастиеДилера),
//	               |	Renault_КоммерческиеАкции.КоммерческаяАкцияGUID,
//	               |	Renault_КоммерческиеАкции.ВариантСкидки,
//	               |	Renault_КоммерческиеАкции.Вид
//	               |ИЗ
//	               |	РегистрСведений.Renault_КоммерческиеАкции КАК Renault_КоммерческиеАкции
//	               |ГДЕ
//	               |	Renault_КоммерческиеАкции.ДатаНачалаДействия <= &Дата
//	               |	И (Renault_КоммерческиеАкции.ДатаОкончанияДействия >= &Дата
//	               |			ИЛИ Renault_КоммерческиеАкции.ДатаОкончанияДействия = ДАТАВРЕМЯ(1, 1, 1))
//	               |	И Renault_КоммерческиеАкции.Модель = &Модель
//	               |	И Renault_КоммерческиеАкции.Версия = ЗНАЧЕНИЕ(Справочник.ВариантыКомплектации.ПустаяСсылка)
//	               |	И Renault_КоммерческиеАкции.Вид = &Вид
//	               |	И (Renault_КоммерческиеАкции.ВариантСкидки = ""Сумма""
//	               |			ИЛИ Renault_КоммерческиеАкции.ВариантСкидки = """"
//	               |			ИЛИ Renault_КоммерческиеАкции.ВариантСкидки = ""Процент"")
//	               |
//	               |СГРУППИРОВАТЬ ПО
//	               |	Renault_КоммерческиеАкции.КлючСтроки,
//	               |	Renault_КоммерческиеАкции.КоммерческаяАкцияGUID,
//	               |	Renault_КоммерческиеАкции.ВариантСкидки,
//	               |	Renault_КоммерческиеАкции.Вид
//	               |
//	               |ОБЪЕДИНИТЬ ВСЕ
//	               |
//	               |ВЫБРАТЬ
//	               |	Renault_КоммерческиеАкции.КлючСтроки,
//	               |	МАКСИМУМ(Renault_КоммерческиеАкции.ЗначениеСкидки),
//	               |	МАКСИМУМ(Renault_КоммерческиеАкции.ЗначениеСкидкиУчастиеДилера),
//	               |	Renault_КоммерческиеАкции.КоммерческаяАкцияGUID,
//	               |	Renault_КоммерческиеАкции.ВариантСкидки,
//	               |	Renault_КоммерческиеАкции.Вид
//	               |ИЗ
//	               |	РегистрСведений.Renault_КоммерческиеАкции КАК Renault_КоммерческиеАкции
//	               |ГДЕ
//	               |	Renault_КоммерческиеАкции.ДатаНачалаДействия <= &Дата
//	               |	И (Renault_КоммерческиеАкции.ДатаОкончанияДействия >= &Дата
//	               |			ИЛИ Renault_КоммерческиеАкции.ДатаОкончанияДействия = ДАТАВРЕМЯ(1, 1, 1))
//	               |	И Renault_КоммерческиеАкции.Модель = ЗНАЧЕНИЕ(Справочник.Модели.ПустаяСсылка)
//	               |	И Renault_КоммерческиеАкции.Версия = ЗНАЧЕНИЕ(Справочник.ВариантыКомплектации.ПустаяСсылка)
//	               |	И Renault_КоммерческиеАкции.Вид = &Вид
//	               |	И (Renault_КоммерческиеАкции.ВариантСкидки = ""Сумма""
//	               |			ИЛИ Renault_КоммерческиеАкции.ВариантСкидки = """"
//	               |			ИЛИ Renault_КоммерческиеАкции.ВариантСкидки = ""Процент"")
//	               |
//	               |СГРУППИРОВАТЬ ПО
//	               |	Renault_КоммерческиеАкции.КлючСтроки,
//	               |	Renault_КоммерческиеАкции.КоммерческаяАкцияGUID,
//	               |	Renault_КоммерческиеАкции.ВариантСкидки,
//	               |	Renault_КоммерческиеАкции.Вид
//	               |;
//	               |
//	               |////////////////////////////////////////////////////////////////////////////////
//	               |ВЫБРАТЬ
//	               |	ВТ_Подготовка.КлючСтроки КАК КлючСтроки,
//	               |	МАКСИМУМ(ВЫБОР
//	               |			КОГДА ВТ_Подготовка.ВариантСкидки = ""Процент""
//	               |				ТОГДА &СтоимостьАвтоИБазовыхОпций / 100 * ВТ_Подготовка.ЗначениеСкидки
//	               |			ИНАЧЕ ВТ_Подготовка.ЗначениеСкидки
//	               |		КОНЕЦ) КАК ЗначениеСкидки,
//	               |	ВТ_Подготовка.КоммерческаяАкцияGUID КАК КоммерческаяАкцияGUID,
//	               |	Renault_КоммерческиеАкции.КоммерческаяАкция,
//	               |	Renault_КоммерческиеАкции.УсловиеПредоставления
//	               |ПОМЕСТИТЬ ВТ_АкцииУсловия
//	               |ИЗ
//	               |	ВТ_Подготовка КАК ВТ_Подготовка
//	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.Renault_КоммерческиеАкции КАК Renault_КоммерческиеАкции
//	               |		ПО ВТ_Подготовка.КоммерческаяАкцияGUID = Renault_КоммерческиеАкции.КоммерческаяАкцияGUID
//	               |			И ВТ_Подготовка.КлючСтроки = Renault_КоммерческиеАкции.КлючСтроки
//	               |
//	               |СГРУППИРОВАТЬ ПО
//	               |	ВТ_Подготовка.КоммерческаяАкцияGUID,
//	               |	ВТ_Подготовка.КлючСтроки,
//	               |	Renault_КоммерческиеАкции.КоммерческаяАкция,
//	               |	Renault_КоммерческиеАкции.УсловиеПредоставления
//	               |
//	               |ИНДЕКСИРОВАТЬ ПО
//	               |	КоммерческаяАкцияGUID
//	               |;
//	               |
//	               |////////////////////////////////////////////////////////////////////////////////
//	               |ВЫБРАТЬ РАЗЛИЧНЫЕ
//	               |	ВТ_АкцииУсловия.КоммерческаяАкцияGUID КАК КоммерческаяАкцияGUID,
//	               |	ВТ_АкцииУсловия.КлючСтроки
//	               |ПОМЕСТИТЬ ВТ_АкцииКИсключению
//	               |ИЗ
//	               |	ВТ_АкцииУсловия КАК ВТ_АкцииУсловия
//	               |ГДЕ
//	               |	ВТ_АкцииУсловия.УсловиеПредоставления.Наименование = ""Автомобили 2015 года выпуска""
//	               |	И &ГодВыпуска <> 2015
//	               |
//	               |ОБЪЕДИНИТЬ
//	               |
//	               |ВЫБРАТЬ РАЗЛИЧНЫЕ
//	               |	ВТ_АкцииУсловия.КоммерческаяАкцияGUID,
//	               |	ВТ_АкцииУсловия.КлючСтроки
//	               |ИЗ
//	               |	ВТ_АкцииУсловия КАК ВТ_АкцииУсловия
//	               |ГДЕ
//	               |	ВТ_АкцииУсловия.УсловиеПредоставления.Наименование = ""Автомобили 2016 года выпуска""
//	               |	И &ГодВыпуска <> 2016
//	               |
//	               |ОБЪЕДИНИТЬ
//	               |
//	               |ВЫБРАТЬ
//	               |	ВТ_АкцииУсловия.КоммерческаяАкцияGUID,
//	               |	ВТ_АкцииУсловия.КлючСтроки
//	               |ИЗ
//	               |	ВТ_АкцииУсловия КАК ВТ_АкцииУсловия
//	               |ГДЕ
//	               |	ВТ_АкцииУсловия.УсловиеПредоставления.Наименование = ""Автомобили 2017 года выпуска""
//	               |	И &ГодВыпуска <> 2017
//	               |
//	               |ИНДЕКСИРОВАТЬ ПО
//	               |	КоммерческаяАкцияGUID
//	               |;
//	               |
//	               |////////////////////////////////////////////////////////////////////////////////
//	               |ВЫБРАТЬ
//	               |	ВТ_АкцииУсловия.КлючСтроки,
//	               |	ВТ_АкцииУсловия.КоммерческаяАкцияGUID,
//	               |	МАКСИМУМ(ВТ_АкцииУсловия.ЗначениеСкидки) КАК ЗначениеСкидки
//	               |ПОМЕСТИТЬ ВТ_Акции
//	               |ИЗ
//	               |	ВТ_АкцииУсловия КАК ВТ_АкцииУсловия
//	               |		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_АкцииКИсключению КАК ВТ_АкцииКИсключению
//	               |		ПО ВТ_АкцииУсловия.КоммерческаяАкцияGUID = ВТ_АкцииКИсключению.КоммерческаяАкцияGUID
//	               |			И ВТ_АкцииУсловия.КлючСтроки = ВТ_АкцииКИсключению.КлючСтроки
//	               |ГДЕ
//	               |	ВТ_АкцииКИсключению.КоммерческаяАкцияGUID ЕСТЬ NULL
//	               |
//	               |СГРУППИРОВАТЬ ПО
//	               |	ВТ_АкцииУсловия.КлючСтроки,
//	               |	ВТ_АкцииУсловия.КоммерческаяАкцияGUID
//	               |;
//	               |
//	               |////////////////////////////////////////////////////////////////////////////////
//	               |ВЫБРАТЬ
//	               |	ВТ_Акции.КоммерческаяАкцияGUID,
//	               |	СУММА(ВТ_Акции.ЗначениеСкидки) КАК ЗначениеСкидки
//	               |ИЗ
//	               |	ВТ_Акции КАК ВТ_Акции
//	               |
//	               |СГРУППИРОВАТЬ ПО
//	               |	ВТ_Акции.КоммерческаяАкцияGUID
//	               |
//	               |ИМЕЮЩИЕ
//	               |	СУММА(ВТ_Акции.ЗначениеСкидки) > 0";				   
//				   
//	Скидки = Запрос.Выполнить().Выгрузить();

//	Если Скидки.Количество() > 0 Тогда
//		Скидки = УдалитьНесовместимыеСкидкиRenault(Скидки);	
//	КонецЕсли;
//	
//	Возврат Скидки.Итог("ЗначениеСкидки");
//	
//КонецФункции

// Функция - Удалить несовместимые скидки renault
//
// Параметры:
//  Скидки	 - ТаблицаЗначений	 - таблица скидок
Функция УдалитьНесовместимыеСкидкиRenault(Знач Скидки) Экспорт

	//Запрос = Новый Запрос;
	//
	//Запрос.УстановитьПараметр("Скидки", Скидки);
	//
	//Запрос.Текст = "ВЫБРАТЬ
	//               |	Скидки.КоммерческаяАкцияGUID
	//               |ПОМЕСТИТЬ ВТ_СкидкиRenault
	//               |ИЗ
	//               |	&Скидки КАК Скидки
	//               |;
	//               |
	//               |////////////////////////////////////////////////////////////////////////////////
	//               |ВЫБРАТЬ
	//               |	Renault_КоммерческиеАкции.КоммерческаяАкцияGUID
	//               |ПОМЕСТИТЬ ВТ_АкцииПодготовка1
	//               |ИЗ
	//               |	ВТ_СкидкиRenault КАК ВТ_СкидкиRenault
	//               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.Renault_КоммерческиеАкции КАК Renault_КоммерческиеАкции
	//               |		ПО ВТ_СкидкиRenault.КоммерческаяАкцияGUID = Renault_КоммерческиеАкции.КоммерческаяАкцияGUID
	//               |			И (Renault_КоммерческиеАкции.АкцияGUID = """")
	//               |
	//               |СГРУППИРОВАТЬ ПО
	//               |	Renault_КоммерческиеАкции.КоммерческаяАкцияGUID
	//               |;
	//               |
	//               |////////////////////////////////////////////////////////////////////////////////
	//               |ВЫБРАТЬ
	//               |	Renault_КоммерческиеАкции.КоммерческаяАкцияGUID КАК КоммерческаяАкцияGUID
	//               |ПОМЕСТИТЬ ВТ_АкцииСовместимыНекоторыеПодготовка
	//               |ИЗ
	//               |	ВТ_СкидкиRenault КАК ВТ_СкидкиRenault
	//               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.Renault_КоммерческиеАкции КАК Renault_КоммерческиеАкции
	//               |		ПО ВТ_СкидкиRenault.КоммерческаяАкцияGUID = Renault_КоммерческиеАкции.КоммерческаяАкцияGUID
	//               |			И (Renault_КоммерческиеАкции.Комбинируется)
	//               |
	//               |СГРУППИРОВАТЬ ПО
	//               |	Renault_КоммерческиеАкции.КоммерческаяАкцияGUID
	//               |;
	//               |
	//               |////////////////////////////////////////////////////////////////////////////////
	//               |ВЫБРАТЬ
	//               |	Renault_КоммерческиеАкции.КоммерческаяАкцияGUID КАК КоммерческаяАкцияGUID
	//               |ПОМЕСТИТЬ ВТ_АкцииСовместимыНекоторыеПодготовка2
	//               |ИЗ
	//               |	ВТ_СкидкиRenault КАК ВТ_СкидкиRenault
	//               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.Renault_КоммерческиеАкции КАК Renault_КоммерческиеАкции
	//               |		ПО ВТ_СкидкиRenault.КоммерческаяАкцияGUID = Renault_КоммерческиеАкции.КоммерческаяАкцияGUID
	//               |			И (Renault_КоммерческиеАкции.Комбинируется)
	//               |ГДЕ
	//               |	(Renault_КоммерческиеАкции.АкцияGUID В
	//               |				(ВЫБРАТЬ
	//               |					ВТ_АкцииПодготовка1.КоммерческаяАкцияGUID
	//               |				ИЗ
	//               |					ВТ_АкцииПодготовка1 КАК ВТ_АкцииПодготовка1)
	//               |			ИЛИ НЕ 1 В
	//               |					(ВЫБРАТЬ ПЕРВЫЕ 1
	//               |						1
	//               |					ИЗ
	//               |						ВТ_АкцииПодготовка1 КАК ВТ_АкцииПодготовка1))
	//               |	И Renault_КоммерческиеАкции.КоммерческаяАкцияGUID В
	//               |			(ВЫБРАТЬ
	//               |				ВТ_АкцииСовместимыНекоторыеПодготовка.КоммерческаяАкцияGUID
	//               |			ИЗ
	//               |				ВТ_АкцииСовместимыНекоторыеПодготовка КАК ВТ_АкцииСовместимыНекоторыеПодготовка)
	//               |
	//               |СГРУППИРОВАТЬ ПО
	//               |	Renault_КоммерческиеАкции.КоммерческаяАкцияGUID
	//               |;
	//               |
	//               |////////////////////////////////////////////////////////////////////////////////
	//               |ВЫБРАТЬ
	//               |	Renault_КоммерческиеАкции.КоммерческаяАкцияGUID КАК КоммерческаяАкцияGUID,
	//               |	Renault_КоммерческиеАкции.АкцияGUID КАК КомбинируемаяАкцияGUID
	//               |ПОМЕСТИТЬ ВТ_АкцииСовместимыНекоторые
	//               |ИЗ
	//               |	ВТ_АкцииСовместимыНекоторыеПодготовка2 КАК ВТ_АкцииСовместимыНекоторыеПодготовка2
	//               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.Renault_КоммерческиеАкции КАК Renault_КоммерческиеАкции
	//               |		ПО ВТ_АкцииСовместимыНекоторыеПодготовка2.КоммерческаяАкцияGUID = Renault_КоммерческиеАкции.КоммерческаяАкцияGUID
	//               |
	//               |СГРУППИРОВАТЬ ПО
	//               |	Renault_КоммерческиеАкции.КоммерческаяАкцияGUID,
	//               |	Renault_КоммерческиеАкции.АкцияGUID
	//               |;
	//               |
	//               |////////////////////////////////////////////////////////////////////////////////
	//               |ВЫБРАТЬ
	//               |	ВТ_АкцииПодготовка1.КоммерческаяАкцияGUID
	//               |ИЗ
	//               |	ВТ_АкцииПодготовка1 КАК ВТ_АкцииПодготовка1
	//               |;
	//               |
	//               |////////////////////////////////////////////////////////////////////////////////
	//               |ВЫБРАТЬ
	//               |	ВТ_АкцииСовместимыНекоторые.КоммерческаяАкцияGUID КАК КоммерческаяАкцияGUID,
	//               |	ВТ_АкцииСовместимыНекоторые.КомбинируемаяАкцияGUID,
	//               |	АкцииКолвоСовместимых.Колво КАК Колво
	//               |ИЗ
	//               |	ВТ_АкцииСовместимыНекоторые КАК ВТ_АкцииСовместимыНекоторые
	//               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	//               |			ВТ_АкцииСовместимыНекоторые.КоммерческаяАкцияGUID КАК КоммерческаяАкцияGUID,
	//               |			КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ВТ_АкцииСовместимыНекоторые.КомбинируемаяАкцияGUID) КАК Колво
	//               |		ИЗ
	//               |			ВТ_АкцииСовместимыНекоторые КАК ВТ_АкцииСовместимыНекоторые
	//               |		
	//               |		СГРУППИРОВАТЬ ПО
	//               |			ВТ_АкцииСовместимыНекоторые.КоммерческаяАкцияGUID) КАК АкцииКолвоСовместимых
	//               |		ПО ВТ_АкцииСовместимыНекоторые.КоммерческаяАкцияGUID = АкцииКолвоСовместимых.КоммерческаяАкцияGUID
	//               |
	//               |УПОРЯДОЧИТЬ ПО
	//               |	Колво УБЫВ
	//               |ИТОГИ ПО
	//               |	КоммерческаяАкцияGUID";
	//
	//Результат = Запрос.ВыполнитьПакет();
	//
	//Совместимые = Результат[Результат.Количество()-2].Выбрать();
	//СовместимыеНекоторые = Результат[Результат.Количество()-1].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	//
	//СписокАкций = Новый Массив;
	//
	//Пока Совместимые.Следующий() Цикл
	//	СписокАкций.Добавить(Совместимые.КоммерческаяАкцияGUID);	
	//КонецЦикла;	

	//ТЗ_Свертка = Новый ТаблицаЗначений;
	//ТЗ_Свертка.Колонки.Добавить("Акция", Новый ОписаниеТипов("Строка",, Новый КвалификаторыСтроки(36)));
	//ТЗ_Свертка.Колонки.Добавить("общ"  , Новый ОписаниеТипов("Булево"));
	//ТЗ_Свертка.Колонки.Добавить("тек"  , Новый ОписаниеТипов("Булево"));
	//
	//ПЦ = Истина;
	//общСписокСовместимых = Новый Массив;
	//Пока СовместимыеНекоторые.Следующий() Цикл
	//	
	//	Если ПЦ Тогда
	//	
	//		СписокАкций.Добавить(СовместимыеНекоторые.КоммерческаяАкцияGUID);	
	//		
	//		ВыборкаДЗ = СовместимыеНекоторые.Выбрать();
	//		
	//		общСписокСовместимых = Новый Массив;
	//		Пока ВыборкаДЗ.Следующий() Цикл
	//			общСписокСовместимых.Добавить(ВыборкаДЗ.КомбинируемаяАкцияGUID);
	//		КонецЦикла;
	//		
	//		ПЦ = Ложь;
	//		
	//	Иначе
	//		
	//		Если общСписокСовместимых.Найти(СовместимыеНекоторые.КоммерческаяАкцияGUID) = Неопределено Тогда
	//			Продолжить;
	//		КонецЕсли;
	//		
	//		ВыборкаДЗ = СовместимыеНекоторые.Выбрать();
	//		
	//		текСписокСовместимых = Новый Массив;
	//		Пока ВыборкаДЗ.Следующий() Цикл
	//			текСписокСовместимых.Добавить(ВыборкаДЗ.КомбинируемаяАкцияGUID);
	//		КонецЦикла;
	//		
	//		Отказ = Ложь;
	//		Для каждого стрАкция Из СписокАкций Цикл
	//			Если текСписокСовместимых.Найти(стрАкция) = Неопределено Тогда
	//				Отказ = Истина;
	//				Прервать;
	//			КонецЕсли;
	//		КонецЦикла;
	//		
	//		ТЗ_Свертка.Очистить();
	//		Если Не Отказ Тогда
	//			
	//			СписокАкций.Добавить(СовместимыеНекоторые.КоммерческаяАкцияGUID);	
	//			
	//			// Выбираем из двух массивов значения, которые есть и там и там
	//			
	//			Для каждого Эл Из общСписокСовместимых Цикл
	//				НС = ТЗ_Свертка.Добавить();
	//				НС.общ = Истина;
	//				НС.Акция = Эл;
	//			КонецЦикла;

	//			Для каждого Эл Из текСписокСовместимых Цикл
	//				Если ТЗ_Свертка.НайтиСтроки(Новый Структура("Акция", Эл)).Количество() > 0 Тогда
	//					НС = ТЗ_Свертка.НайтиСтроки(Новый Структура("Акция", Эл))[0];
	//				Иначе	
	//					НС = ТЗ_Свертка.Добавить();
	//				КонецЕсли;
	//				НС.тек = Истина;
	//				НС.Акция = Эл;
	//			КонецЦикла;
	//			
	//			Для Сч=0 По ТЗ_Свертка.Количество()-1 Цикл
	//				
	//				Если Сч > ТЗ_Свертка.Количество()-1 Тогда
	//					Прервать;
	//				КонецЕсли;
	//				
	//				стр = ТЗ_Свертка[Сч];
	//				
	//				Если Не стр.тек ИЛИ Не стр.общ Тогда
	//					ТЗ_Свертка.Удалить(стр);
	//					Сч = Сч - 1;
	//				КонецЕсли;
	//				
	//			КонецЦикла;
	//		КонецЕсли;
	//	КонецЕсли;
	//КонецЦикла;	
	//
	//Для Сч = 0 По Скидки.Количество()-1 Цикл
	//	
	//	Если Сч > Скидки.Количество()-1 Тогда
	//		Прервать;
	//	КонецЕсли;
	//	
	//	стр = Скидки.Получить(Сч);
	//	
	//	Если СписокАкций.Найти(стр.КоммерческаяАкцияGUID) = Неопределено Тогда
	//		Скидки.Удалить(стр);	
	//		
	//	    Сч = Сч - 1;
	//	КонецЕсли;
	//КонецЦикла;
	//
	//Возврат Скидки;
	Возврат Неопределено;
	
КонецФункции

Функция ПолучитьСуммуПоПрочимСкидкам(Договор) Экспорт
	//в прочие не берем комм. акции!!
	СуммаПрочихСкидок = 0;
	ТипСкидки_Renault = Справочники.ТипыСкидок.НайтиПоКоду("RenltCA");
	
	Для Каждого Стр Из Договор.СкидкиДоговора Цикл
		Если Стр.ТипСкидки<>ТипСкидки_Renault Тогда
			СуммаПрочихСкидок = СуммаПрочихСкидок+Стр.СуммаСкидки;
		КонецЕсли;
	КонецЦикла;
	Возврат СуммаПрочихСкидок;
	
КонецФункции

Функция ПолучитьДолгПоДоговоруКП(РеализацияАвтомобиля) Экспорт
	
	Если Не ЗначениеЗаполнено(РеализацияАвтомобиля) Тогда
		Возврат 0;
	КонецЕсли;
	
	ДолгПоДоговору = 0;
	
	Если ЗначениеЗаполнено(РеализацияАвтомобиля.ДоговорВзаиморасчетов) Тогда
		// получим долг
		СтруктураОтбора = Новый Структура("Контрагент,ДоговорВзаиморасчетов",РеализацияАвтомобиля.Контрагент,РеализацияАвтомобиля.ДоговорВзаиморасчетов);
		тзДолги = РегистрыНакопления.ВзаиморасчетыКомпании.Остатки(,СтруктураОтбора,,"Сумма,СуммаУпр");
		ДолгПоДоговору = тзДолги.Итог("Сумма");
	КонецЕсли;

	Возврат ДолгПоДоговору;
	
КонецФункции

Функция ПолучитьСтатусАванса(ЗаказНаАвтомобиль) Экспорт

	Если Не ЗначениеЗаполнено(ЗаказНаАвтомобиль) Тогда
		Возврат "Не внесен";
	КонецЕсли;
	
	ДолгПоДоговору = 0;
	ВзаиморасчетыРассчитаны = Ложь;
	
	Если ЗначениеЗаполнено(ЗаказНаАвтомобиль.ДоговорВзаиморасчетов) Тогда
		
		// получим долг
		
		Запрос = Новый Запрос;
				
		Запрос.УстановитьПараметр("ДоговорВзаиморасчетов", ЗаказНаАвтомобиль.ДоговорВзаиморасчетов);
		Запрос.УстановитьПараметр("Контрагент", ЗаказНаАвтомобиль.Контрагент);
		Запрос.УстановитьПараметр("ЗаказНаАвтомобиль", ЗаказНаАвтомобиль);
				
		Запрос.Текст = "ВЫБРАТЬ
		               |	ВзаиморасчетыКомпанииОстаткиИОбороты.Контрагент,
		               |	ВзаиморасчетыКомпанииОстаткиИОбороты.ДоговорВзаиморасчетов,
		               |	ВзаиморасчетыКомпанииОстаткиИОбороты.Сделка,
		               |	ВзаиморасчетыКомпанииОстаткиИОбороты.СуммаКонечныйОстаток КАК СуммаОстаток
		               |ИЗ
		               |	РегистрНакопления.ВзаиморасчетыКомпании.ОстаткиИОбороты(
		               |			,
		               |			,
		               |			,
		               |			,
		               |			ДоговорВзаиморасчетов = &ДоговорВзаиморасчетов
		               |				И Контрагент = &Контрагент
		               |				И Сделка = &ЗаказНаАвтомобиль) КАК ВзаиморасчетыКомпанииОстаткиИОбороты
		               |ГДЕ
		               |	ВзаиморасчетыКомпанииОстаткиИОбороты.СуммаРасход > 0";
		
		Выборка = Запрос.Выполнить().Выбрать();
		Если Выборка.Следующий() Тогда
			ДолгПоДоговору = Выборка.СуммаОстаток;
			ВзаиморасчетыРассчитаны = Истина;
		КонецЕсли;
	КонецЕсли;

	Если Не ВзаиморасчетыРассчитаны Тогда
		АвансВнесен = Ложь;	
	ИначеЕсли ДолгПоДоговору > 0 Тогда
		АвансВнесен = Ложь;	
	Иначе	
		АвансВнесен = Истина;
	КонецЕсли;
	
	Возврат ?(АвансВнесен, "Внесен", "Не внесен");

КонецФункции

Функция ПолучитьСтатусЦеныПродажиАвтомобиля(VIN) Экспорт

	Если Не ЗначениеЗаполнено(VIN) Тогда
		Возврат "По тарифу";
	КонецЕсли;
	
	Автомобиль = НайтиАвтоПоVIN(VIN);
	
	Если Не ЗначениеЗаполнено(Автомобиль) Тогда
		#Если Клиент Тогда
			Сообщить("Не найден автомобиль по VIN");
		#КонецЕсли
		
		Возврат Неопределено;
	КонецЕсли;

	Запись = РегистрыСведений.CRM_ДополнительнаяИнформацияПоАвтомобилям.СоздатьМенеджерЗаписи();
	Запись.Автомобиль = Автомобиль;
	Запись.Прочитать();
	Если Запись.ЦенаФиксирована = Истина Тогда
		СтатусЦены = "Фиксирована";	
	ИначеЕсли Запись.ЦенаПродажиРОП	<> 0 Тогда
		СтатусЦены = "Установлена";
	Иначе
		СтатусЦены = "По тарифу";
	КонецЕсли;
	
	Возврат СтатусЦены;
	
КонецФункции

Функция ПолучитьДатуТарифаНаАвтомобиль(VIN) Экспорт

	ДатаТарифа = Дата("00010101");
	
	Если Не ЗначениеЗаполнено(VIN) Тогда
		Возврат ДатаТарифа;
	КонецЕсли;
	
	Автомобиль = НайтиАвтоПоVIN(VIN);
	
	Если Не ЗначениеЗаполнено(Автомобиль) Тогда
		#Если Клиент Тогда
			Сообщить("Не найден автомобиль по VIN");
		#КонецЕсли
		
		Возврат 0;
	КонецЕсли;
	
	Запись = РегистрыСведений.CRM_ДополнительнаяИнформацияПоАвтомобилям.СоздатьМенеджерЗаписи();
	Запись.Автомобиль = Справочники.Автомобили.НайтиПоРеквизиту("VIN",Автомобиль.VIN);
	Запись.Прочитать();
	Если Запись.ЦенаФиксирована Тогда
		Возврат ПолучитьДатуТарифаПоДатеФиксации(Автомобиль, Запись.ДатаФиксации);	
	КонецЕсли;
	
	ГодВыпуска = ?(ЗначениеЗаполнено(Автомобиль.ГодВыпуска), Год(Автомобиль.ГодВыпуска), Неопределено);
	
	ТекущийТариф = Справочники.Renault_ТарифыНаАвтомобили.ПолучитьТарифДляРасчетаЦены(ГодВыпуска);
	
	Запрос = Новый Запрос;
			
	Запрос.УстановитьПараметр("Модель", Автомобиль.Модель);
	Запрос.УстановитьПараметр("ВариантКомплектации", Автомобиль.ВариантКомплектации);
	Запрос.УстановитьПараметр("ТекущийТариф", ТекущийТариф);
			
	Запрос.Текст = "ВЫБРАТЬ
	               |	Renault_ТарифНаКомплектацииАвтомобилейСрезПоследних.Период КАК ДатаТарифа,
	               |	Renault_ТарифНаКомплектацииАвтомобилейСрезПоследних.ЦенаКлиентская
	               |ИЗ
	               |	РегистрСведений.Renault_ТарифНаКомплектацииАвтомобилей.СрезПоследних КАК Renault_ТарифНаКомплектацииАвтомобилейСрезПоследних
	               |ГДЕ
	               |	Renault_ТарифНаКомплектацииАвтомобилейСрезПоследних.Модель = &Модель
	               |	И Renault_ТарифНаКомплектацииАвтомобилейСрезПоследних.ВариантКомплектации = &ВариантКомплектации
	               |	И Renault_ТарифНаКомплектацииАвтомобилейСрезПоследних.Тариф = &ТекущийТариф";
	
	Выборка = Запрос.Выполнить().Выбрать();	
	Если Выборка.Следующий() Тогда
		ДатаТарифа = Выборка.ДатаТарифа;
	КонецЕсли;
	
	Возврат ДатаТарифа;

КонецФункции

Функция ПолучитьДатуТарифаПоДатеФиксации(Автомобиль, ДатаФиксации)

	Запрос = Новый Запрос;
			
	Запрос.УстановитьПараметр("Дата", ДатаФиксации);
	Запрос.УстановитьПараметр("Модель", Автомобиль.Модель);
	Запрос.УстановитьПараметр("ВариантКомплектации", Автомобиль.ВариантКомплектации);
			
	Запрос.Текст = "ВЫБРАТЬ
	               |	Renault_ТарифыНаАвтомобили.Ссылка
	               |ПОМЕСТИТЬ ВТ_Тариф
	               |ИЗ
	               |	Справочник.Renault_ТарифыНаАвтомобили КАК Renault_ТарифыНаАвтомобили
	               |ГДЕ
	               |	Renault_ТарифыНаАвтомобили.НачалоДействия <= &Дата
	               |	И (Renault_ТарифыНаАвтомобили.ОкончаниеДействия >= &Дата
	               |			ИЛИ Renault_ТарифыНаАвтомобили.ОкончаниеДействия = ДАТАВРЕМЯ(1, 1, 1))
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ ПЕРВЫЕ 1
	               |	Renault_ТарифНаКомплектацииАвтомобилей.ЦенаКлиентская,
	               |	Renault_ТарифНаКомплектацииАвтомобилей.Период
	               |ИЗ
	               |	РегистрСведений.Renault_ТарифНаКомплектацииАвтомобилей КАК Renault_ТарифНаКомплектацииАвтомобилей
	               |ГДЕ
	               |	Renault_ТарифНаКомплектацииАвтомобилей.Модель = &Модель
	               |	И Renault_ТарифНаКомплектацииАвтомобилей.ВариантКомплектации = &ВариантКомплектации
	               |	И Renault_ТарифНаКомплектацииАвтомобилей.Тариф В
	               |			(ВЫБРАТЬ
	               |				ВТ_Тариф.Ссылка
	               |			ИЗ
	               |				ВТ_Тариф КАК ВТ_Тариф)";
	
	Выборка = Запрос.Выполнить().Выбрать();	
	ДатаТарифа = Дата("00010101");	
	Если Выборка.Следующий() Тогда
		ДатаТарифа = Выборка.Период;	
	КонецЕсли;
	
	Возврат ДатаТарифа;

КонецФункции // ПолучитьТарифПоДатеФиксации()

Функция ПолучитьДолгПоЗН(VIN) Экспорт

	Если Не ЗначениеЗаполнено(VIN) Тогда
		Возврат 0;
	КонецЕсли;
	
	Автомобиль = НайтиАвтоПоVIN(VIN);
	
	Если Не ЗначениеЗаполнено(Автомобиль) Тогда
		#Если Клиент Тогда
			Сообщить("Не найден автомобиль по VIN");
		#КонецЕсли
		
		Возврат 0;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	СУММА(ЗаказНаряд.СуммаДокумента) КАК Сумма
	               |ИЗ
	               |	Документ.ЗаказНаряд КАК ЗаказНаряд
	               |ГДЕ
	               |	ЗаказНаряд.Автомобиль = &Автомобиль
	               |	И ЗаказНаряд.ВидРемонта = &ВидРемонта
	               |	И ЗаказНаряд.Состояние = ЗНАЧЕНИЕ(Справочник.ВидыСостоянийЗаказНарядов.Закрыт)";
	
	Запрос.УстановитьПараметр("ВидРемонта", Справочники.ВидыРемонта.ДополнительноеОборудование);
	Запрос.УстановитьПараметр("Автомобиль", Автомобиль);

	Выборка = Запрос.Выполнить().Выбрать();
	
	ДолгПоЗН = 0;
	Пока Выборка.Следующий() Цикл
		ДолгПоЗН = Выборка.Сумма;
	КонецЦикла;
	
	Возврат ДолгПоЗН;
	
КонецФункции

Функция ПолучитьЦенуРОП(Автомобиль) Экспорт

	ЦенаРОП = 0;
	
	Если Не ЗначениеЗаполнено(Автомобиль) Тогда
		Возврат ЦенаРОП;
	КонецЕсли;
	
	Запрос = Новый Запрос;             
			
	Запрос.УстановитьПараметр("Автомобиль", Автомобиль); 
			
	Запрос.Текст = "ВЫБРАТЬ
	               |	CRM_ДополнительнаяИнформацияПоАвтомобилям.ЦенаПродажиРОП
	               |ИЗ
	               |	РегистрСведений.CRM_ДополнительнаяИнформацияПоАвтомобилям КАК CRM_ДополнительнаяИнформацияПоАвтомобилям
	               |ГДЕ
	               |	CRM_ДополнительнаяИнформацияПоАвтомобилям.Автомобиль = &Автомобиль";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		ЦенаРОП = Выборка.ЦенаПродажиРОП;
	КонецЕсли;
	
	Возврат ЦенаРОП;
	
КонецФункции // ПолучитьЦенуРОП()

Функция ПолучитьГодВыпуска(Автомобиль) Экспорт

	Если Автомобиль.Пустая() Тогда Возврат 0; КонецЕсли;
	
	ГодВыпуска = Год(Автомобиль.ГодВыпуска); 
	Если обЗначениеНеЗаполнено(Автомобиль.ГодВыпуска) Тогда
		Запрос = Новый Запрос("ВЫБРАТЬ
		                      |	МАКСИМУМ(CRM_СостояниеАвтомобилейПроизводителя_v2.YEAR) КАК ГодВыпуска
		                      |ИЗ
		                      |	РегистрСведений.CRM_СостояниеАвтомобилейПроизводителя_v2 КАК CRM_СостояниеАвтомобилейПроизводителя_v2
		                      |ГДЕ
		                      |	CRM_СостояниеАвтомобилейПроизводителя_v2.Автомобиль = &Автомобиль");
		
		Запрос.УстановитьПараметр("Автомобиль", Автомобиль);
		Выборка = Запрос.Выполнить().Выбрать();
		Если Выборка.Следующий() Тогда ГодВыпуска = Выборка.ГодВыпуска; КонецЕсли;
	КонецЕсли;

	Возврат ?(ГодВыпуска=1,0,ГодВыпуска);
	
КонецФункции // ПолучитьГодВыпуска()

/// ******************

// Проверяет проведенность документов
//
// Параметры:
//  Документы - Массив - документы, проведенность которых необходимо проверить
//
// Возвращаемое значение:
//  Массив - непроведенные документы из массива Документы
//
Функция ПроверитьПроведенностьДокументов(знач Документы) Экспорт
	
	Результат = Новый Массив;
	
	ШаблонЗапроса = 	
		"ВЫБРАТЬ
		|	Документ.Ссылка КАК Ссылка
		|ИЗ
		|	&ИмяДокумента КАК Документ
		|ГДЕ
		|	Документ.Ссылка В(&МассивДокументов)
		|	И (НЕ Документ.Проведен)";
	
	ТекстОбъединитьВсе =
		"
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|";
		
	ИменаДокументов = Новый Массив;
	Для Каждого Документ Из Документы Цикл
		ИмяДокумента = Документ.Метаданные().ПолноеИмя();
		Если ИменаДокументов.Найти(ИмяДокумента) = Неопределено
		   и Метаданные.Документы.Содержит(Метаданные.НайтиПоПолномуИмени(ИмяДокумента)) Тогда	
			ИменаДокументов.Добавить(ИмяДокумента);
		КонецЕсли;
	КонецЦикла;
	
	ТекстЗапроса = "";
	Для Каждого ИмяДокумента Из ИменаДокументов Цикл
		Если Не ПустаяСтрока(ТекстЗапроса) Тогда
			ТекстЗапроса = ТекстЗапроса + ТекстОбъединитьВсе;
		КонецЕсли;
		ТекстПодзапроса = СтрЗаменить(ШаблонЗапроса, "&ИмяДокумента", ИмяДокумента);
		ТекстЗапроса = ТекстЗапроса + ТекстПодзапроса;
	КонецЦикла;
		
	Запрос = Новый Запрос;
	Запрос.Текст = ТекстЗапроса;
	Запрос.УстановитьПараметр("МассивДокументов", Документы);
	
	Если Не ПустаяСтрока(ТекстЗапроса) Тогда
		Результат = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Выполняет попытку проведения документов.
//
// Параметры:
//	Документы                - Массив - документы, которые необходимо провести.
//
// Возвращаемое значение:
//	Массив - массив структур с полями:
//									Ссылка         - документ, который не удалось провести;
//									ОписаниеОшибки - текст описания ошибки при проведении.
//
Функция ПровестиДокументы(Документы) Экспорт
	
	НепроведенныеДокументы = Новый Массив;
	
	Для Каждого ДокументСсылка Из Документы Цикл
		
		ВыполненоУспешно = Ложь;
		ДокументОбъект = ДокументСсылка.ПолучитьОбъект();
		Если ДокументОбъект.ПроверитьЗаполнение() Тогда
			Попытка
				ДокументОбъект.Записать(РежимЗаписиДокумента.Проведение);
				ВыполненоУспешно = Истина;
			Исключение
				ПредставлениеОшибки = КраткоеПредставлениеОшибки(ИнформацияОбОшибке());
				ТекстСообщенияОбОшибке = НСтр("ru = 'Ошибка при попытке проведения документа: %1'");
				ТекстСообщенияОбОшибке = Renault_СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ТекстСообщенияОбОшибке, ПредставлениеОшибки);
				ЗаписьЖурналаРегистрации(НСтр("ru = 'Проведение документов при печати'"),
					УровеньЖурналаРегистрации.Информация, ДокументОбъект.Метаданные(), ДокументСсылка, 
					ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
			КонецПопытки;
		Иначе
			ПредставлениеОшибки = НСтр("ru = 'Поля документа не заполнены.'");
		КонецЕсли;
		
		Если Не ВыполненоУспешно Тогда
			НепроведенныеДокументы.Добавить(Новый Структура("Ссылка,ОписаниеОшибки", ДокументСсылка, ПредставлениеОшибки));
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат НепроведенныеДокументы;
	
КонецФункции 

// Загружает настройку из хранилища общих настроек.
//
// Параметры:
//   Соответствуют методу ХранилищеОбщихНастроек.Загрузить,
//   подробнее - см. параметры функции ХранилищеЗагрузить()
//
Функция ХранилищеОбщихНастроекЗагрузить(КлючОбъекта, КлючНастроек = "", ЗначениеПоУмолчанию = Неопределено, 
	ОписаниеНастроек = Неопределено, ИмяПользователя = "") Экспорт //DMSREN-378
	
	Возврат ХранилищеЗагрузить(
		ХранилищеОбщихНастроек,
		КлючОбъекта,
		КлючНастроек,
		ЗначениеПоУмолчанию,
		ОписаниеНастроек,
		ИмяПользователя
	);
	
КонецФункции

// Загружает настройку из хранилища настроек через его менеджер.
//
// Параметры:
//   МенеджерХранилища   (СтандартноеХранилищеНастроекМенеджер) Хранилище, из которого загружается настройка
//   КлючОбъекта         (Строка) Ключ объекта настройки. 
//                                Подробнее см. раздел справки "Настройки, автоматически сохраняемые в системном хранилище".
//   КлючНастроек        (Строка) Ключ сохраняемых настроек.
//   ЗначениеПоУмолчанию (*)      Значение, которое необходимо подставить если настройки не были загружены.
//   ОписаниеНастроек    (ОписаниеНастроек) Через данный параметр при загрузке можно получить описание настроек.
//   ИмяПользователя     (Строка) Имя пользователя, настройки которого загружается.
//                                Если не указано, то загружается настройки текущего пользователя.
// 
// Возвращаемое значение: 
//   (*) Настройки, загруженные из хранилища. Неопределено, если настройки не найдены. 
// 
Функция ХранилищеЗагрузить(МенеджерХранилища, КлючОбъекта, КлючНастроек, ЗначениеПоУмолчанию,
	ОписаниеНастроек, ИмяПользователя)
	
	Результат = Неопределено;
	
	Если ПравоДоступа("СохранениеДанныхПользователя", Метаданные) Тогда
		Результат = МенеджерХранилища.Загрузить(КлючОбъекта, КлючНастроек, ОписаниеНастроек, ИмяПользователя);
	КонецЕсли;
	
	Если (Результат = Неопределено) И (ЗначениеПоУмолчанию <> Неопределено) Тогда
		Результат = ЗначениеПоУмолчанию;
	КонецЕсли;

	Возврат Результат;
	
КонецФункции

// Сохраняет настройку в хранилище общих настроек.
// 
// Параметры:
//   Соответствуют методу ХранилищеОбщихНастроекСохранить.Сохранить, 
//   подробнее - см. параметры процедуры ХранилищеСохранить()
// 
Процедура ХранилищеОбщихНастроекСохранить(КлючОбъекта, КлючНастроек = "", Значение,
	ОписаниеНастроек = Неопределено, ИмяПользователя = "", //DMSREN-378
	НужноОбновитьПовторноИспользуемыеЗначения = Ложь) Экспорт
	
	ХранилищеСохранить(
		ХранилищеОбщихНастроек,
		КлючОбъекта,
		КлючНастроек,
		Значение,
		ОписаниеНастроек,
		ИмяПользователя,
		НужноОбновитьПовторноИспользуемыеЗначения
	);
	
КонецПроцедуры

// Сохраняет настройку в хранилище настроек через его менеджер.
// 
// Параметры:
//   МенеджерХранилища (СтандартноеХранилищеНастроекМенеджер) Хранилище, в котором сохраняется настройка
//   КлючОбъекта       (Строка) Ключ объекта настройки. 
//                              Подробнее см. раздел справки "Настройки, автоматически сохраняемые в системном хранилище".
//   КлючНастроек      (Строка) Ключ сохраняемых настроек.
//   Значение          (*)      Содержит настройки, которые нужно сохранить в хранилище. 
//   ОписаниеНастроек  (ОписаниеНастроек) Содержит информацию об описании настройки.
//   ИмяПользователя   (Строка) Имя пользователя, настройки которого сохраняются.
//                              Если не указано, то сохраняются настройки текущего пользователя.
//   НужноОбновитьПовторноИспользуемыеЗначения (Булево)
// 
Процедура ХранилищеСохранить(МенеджерХранилища, КлючОбъекта, КлючНастроек, Значение,
	ОписаниеНастроек, ИмяПользователя, НужноОбновитьПовторноИспользуемыеЗначения)
	
	Если НЕ ПравоДоступа("СохранениеДанныхПользователя", Метаданные) Тогда
		Возврат;
	КонецЕсли;
	
	МенеджерХранилища.Сохранить(КлючОбъекта, КлючНастроек, Значение, ОписаниеНастроек, ИмяПользователя);
	
	Если НужноОбновитьПовторноИспользуемыеЗначения Тогда
		ОбновитьПовторноИспользуемыеЗначения();
	КонецЕсли;
	
КонецПроцедуры

// Возвращает менеджер объекта по полному имени объекта метаданных
//
// Не обрабатываются точки маршрутов бизнес-процессов
//
// Параметры:
//  ПолноеИмя    - Строка, полное имя объекта метаданных,
//                 например, "Справочник.Организации"
//
// Возвращаемое значение:
//  СправочникМенеджер, ДокументМенеджер, ...
// 
Функция МенеджерОбъектаПоПолномуИмени(ПолноеИмя) Экспорт
	
	ЧастиИмени = Renault_СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(ПолноеИмя, ".");
	
	КлассОМ = ЧастиИмени[0];
	ИмяОМ   = ЧастиИмени[1];
	
	Если      ВРег(КлассОМ) = "ПЛАНОБМЕНА" Тогда
		Возврат ПланыОбмена[ИмяОМ];
		
	ИначеЕсли ВРег(КлассОМ) = "СПРАВОЧНИК" Тогда
		Возврат Справочники[ИмяОМ];
		
	ИначеЕсли ВРег(КлассОМ) = "ДОКУМЕНТ" Тогда
		Возврат Документы[ИмяОМ];
		
	ИначеЕсли ВРег(КлассОМ) = "ЖУРНАЛДОКУМЕНТОВ" Тогда
		Возврат ЖурналыДокументов[ИмяОМ];
		
	ИначеЕсли ВРег(КлассОМ) = "ПЕРЕЧИСЛЕНИЕ" Тогда
		Возврат Перечисления[ИмяОМ];
		
	ИначеЕсли ВРег(КлассОМ) = "ОТЧЕТ" Тогда
		Возврат Отчеты[ИмяОМ];
		
	ИначеЕсли ВРег(КлассОМ) = "ОБРАБОТКА" Тогда
		Возврат Обработки[ИмяОМ];
		
	ИначеЕсли ВРег(КлассОМ) = "ПЛАНВИДОВХАРАКТЕРИСТИК" Тогда
		Возврат ПланыВидовХарактеристик[ИмяОМ];
		
	ИначеЕсли ВРег(КлассОМ) = "ПЛАНСЧЕТОВ" Тогда
		Возврат ПланыСчетов[ИмяОМ];
		
	ИначеЕсли ВРег(КлассОМ) = "ПЛАНВИДОВРАСЧЕТА" Тогда
		Возврат ПланЫВидовРасчета[ИмяОМ];
		
	ИначеЕсли ВРег(КлассОМ) = "РЕГИСТРСВЕДЕНИЙ" Тогда
		Возврат РегистрыСведений[ИмяОМ];
		
	ИначеЕсли ВРег(КлассОМ) = "РЕГИСТРНАКОПЛЕНИЯ" Тогда
		Возврат РегистрыНакопления[ИмяОМ];
		
	ИначеЕсли ВРег(КлассОМ) = "РЕГИСТРБУХГАЛТЕРИИ" Тогда
		Возврат РегистрыБухгалтерии[ИмяОМ];
		
	ИначеЕсли ВРег(КлассОМ) = "РЕГИСТРРАСЧЕТА" Тогда
		Возврат РегистрыРасчета[ИмяОМ];
		
	ИначеЕсли ВРег(КлассОМ) = "БИЗНЕСПРОЦЕСС" Тогда
		Возврат БизнесПроцессы[ИмяОМ];
		
	ИначеЕсли ВРег(КлассОМ) = "ЗАДАЧА" Тогда
		Возврат Задачи[ИмяОМ];
	Иначе
		ВызватьИсключение Renault_СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru='Неизвестный тип объекта метаданных (%1)'"), КлассОМ);
	КонецЕсли;
	
КонецФункции

Процедура СообщитьИнформациюПользователю(СтрокаСообщенияПользователю) Экспорт
	
	#Если Клиент Тогда
	Сообщить(СтрокаСообщенияПользователю);
	#КонецЕсли
	
КонецПроцедуры

// Функция СтрокаТаблицыЗначенийВСтруктуру создает
// структуру со свойствами, как колонки таблицы
// значений передаваемой строки
// и устанавливает этим свойствам значения
// из строки таблицы значений
// 
// Параметры:
//  СтрокаТаблицыЗначений - СтрокаТаблицыЗначений
//
// ВозвращаемоеЗначение:
//  Структура
//
Функция СтрокаТаблицыЗначенийВСтруктуру(СтрокаТаблицыЗначений) Экспорт
	
	Структура = Новый Структура;
	Для каждого Колонка Из СтрокаТаблицыЗначений.Владелец().Колонки Цикл
		Структура.Вставить(Колонка.Имя, СтрокаТаблицыЗначений[Колонка.Имя]);
	КонецЦикла;
	
	Возврат Структура;
	
КонецФункции

Функция ТекущийПользователь() Экспорт
	Возврат ПараметрыСеанса.Renault_ПраваПользователя.Пользователь;
КонецФункции

// Возвращает Истина, если информационная база - файловая.
//
// Параметры:
//    СтрокаСоединенияСБД - Строка - строка соединения. Если параметр не задан, 
//                                   то используется текущая информационная база.
//
Функция ИнформационнаяБазаФайловая(СтрокаСоединенияСБД = "") Экспорт
			
	СтрокаСоединенияСБД = ?(ПустаяСтрока(СтрокаСоединенияСБД), СтрокаСоединенияИнформационнойБазы(), СтрокаСоединенияСБД);
	
	// в зависимости от того файловый это вариант БД или нет немного по-разному путь в БД формируется
	ПозицияПоиска = Найти(Врег(СтрокаСоединенияСБД), "FILE=");
	
	Возврат ПозицияПоиска = 1;	
	
КонецФункции
