

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Код=Параметры.Код;
	Заголовок=Заголовок+" "+Параметры.Код+" - "+Параметры.Наименование;
КонецПроцедуры


&НаКлиенте
Процедура ПриОткрытии(Отказ)
	offset=0;limit=1000;
	ВладелецФормы.ФормыПАВставить("ПрайсУФ",ЭтаФорма);
	ЭтаФорма.ЗакрыватьПриЗакрытииВладельца=Истина;
	Запрос="{""action"":""getPrice"",""schema"":""price"",""idPrice"":"""+Сред(Код,3)+"""}";
	//+""",""limit"":"+Формат(limit,"ЧГ=")+"}";
	ВладелецФормы.СендерОтправить(Запрос); // Загрузка
КонецПроцедуры

&НаКлиенте
Процедура Загрузка(Данные) Экспорт
	Для каждого Стр Из Данные цикл
		ЗаполнитьЗначенияСвойств(Прайс.Добавить(),Стр);
	КонецЦикла;
	//Если Данные.Количество()=limit Тогда
	//	offset=offset+limit;
	//	Запрос="{""action"":""getPrice"",""schema"":""price"",""idPrice"":"""+Сред(Код,3)+""",""limit"":"
	//	+Формат(limit,"ЧГ=")+",""offset"":"+Формат(offset,"ЧГ=")+"}";
	//	ВладелецФормы.СендерОтправить(Запрос); // Загрузка
	//КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии()
	ВладелецФормы.ФормыПАУдалить("ПрайсУФ");
КонецПроцедуры
