
Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)
	
	Если НЕ ЭтотОбъект.КомпоновщикНастроек.ПользовательскиеНастройки.Элементы[0].Использование Тогда
		ЭтотОбъект.КомпоновщикНастроек.ПользовательскиеНастройки.Элементы[0].Значение = Дата(1,1,1);
	КонецЕсли;
	Если НЕ ЭтотОбъект.КомпоновщикНастроек.ПользовательскиеНастройки.Элементы[1].Использование Тогда
		ЭтотОбъект.КомпоновщикНастроек.ПользовательскиеНастройки.Элементы[1].Значение = ТекущаяДата();
	КонецЕсли;
	
КонецПроцедуры
