
Перем СтоимостьДоставкиПоУмолчанию;

Процедура ОбработкаНаСервере() Экспорт
	
	ПолучитьДанные();
	
КонецПроцедуры

Процедура ПолучитьДанные() Экспорт
	
	Renault_ЗагрузкаДанныхОбАвтомобиляхПроизводителя.ЗагрузкаДанныхПоАвтомобилямПроизводителя();
		
КонецПроцедуры

Процедура СброситьДатыАктуальности() Экспорт
	
	Выборка = РегистрыСведений.CRM_СостояниеАвтомобилейПроизводителя_v2.Выбрать();
	Пока Выборка.Следующий() Цикл
		МенеджерЗаписи = РегистрыСведений.CRM_СостояниеАвтомобилейПроизводителя_v2.СоздатьМенеджерЗаписи();
		МенеджерЗаписи.VIN = Выборка.VIN;
		МенеджерЗаписи.Прочитать();
		
		Если МенеджерЗаписи.Выбран() Тогда
			МенеджерЗаписи.LastSyncDate = Дата(1,1,1);
			МенеджерЗаписи.Записать();
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры