//+общие функции
Функция ИмяЗакладки() Возврат ПунктыМеню[ТекущаяЗакладкаМеню].Значение КонецФункции
Функция ИмяСписка() Возврат "сп"+ИмяЗакладки() КонецФункции 
Функция ТекстЗапросИсточникаДанных(ИмяСписка) Возврат ?(ЭтаФорма[ИмяСписка].ПроизвольныйЗапрос,ЭтаФорма[ИмяСписка].ТекстЗапроса,"") КонецФункции	
Функция ПолучитьИсточникНаСервере(ИмяСписка) Возврат Renault_ОбщиеФункции.ИсточникДанныхФормы(ЭтаФорма,ИмяСписка) КонецФункции
Функция ПолучитьПроизвольныйИсточникНаСервере(ИмяСписка) Возврат Renault_ОбщиеФункции.ПроизвольныйИсточникДанных(ТекстЗапросИсточникаДанных(ИмяСписка)) КонецФункции
//-общие функции

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если НЕ ПараметрыСеанса.Renault_ПраваПользователя.РазрешитьРаботуСАрмРОП Тогда
		Отказ = Истина;
		Сообщить("У вас нет прав на работу с АРМ Руководителя", СтатусСообщения.Внимание);
		Возврат;
	КонецЕсли;
	
	//Порядок элементов списка должен соответствовать порядку кнопок на форме
	ПунктыМеню.Добавить("РабочиеЛисты");
	ПунктыМеню.Добавить("События");
	ПунктыМеню.Добавить("РаботаСТрафиком");
	ПунктыМеню.Добавить("ЗапросыНаЗакрытие");
	
	ТекущаяЗакладкаМеню=0;
	
	Дата1=НачалоМесяца(ТекущаяДата());
	Дата2=ТекущаяДата();
	УстановитьЗаголовок();
	
	Отдел=Renault_CRM.ПолучитьОтделАвтосалона();
	ДилерскийЦентр=Отдел.ДилерскийЦентр;
	УстановитьОтбор();
	УстановитьПараметрыСписков();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Массив=Новый Массив;
	Массив.Добавить(Элементы.Logo);
	Renault_ОбщиеФункции.МультибрендЗадатьОформление(Массив,"Картинка","Логотип");
	
	УправлениеМеню();
КонецПроцедуры

Процедура УстановитьОтбор()
	
	Сп=Новый Массив;
	Сп.Добавить(спРабочиеЛисты);
	Сп.Добавить(спСобытия);
	Сп.Добавить(спРаботаСТрафиком);
	Сп.Добавить(спЗапросыНаЗакрытие);
	Для Каждого Список Из Сп Цикл
		Эл=Список.Отбор.Элементы[0]; Эл.ПравоеЗначение=ДилерскийЦентр; Эл.Использование=Не ДилерскийЦентр.Пустая();
		Эл=Список.Отбор.Элементы[1]; Эл.ПравоеЗначение=Отдел; Эл.Использование=Не Отдел.Пустая();
	КонецЦикла;	
	
КонецПроцедуры	
Процедура УстановитьПараметрыСписков()
	
	Сп=Новый Массив;
	Сп.Добавить(спРабочиеЛисты);
	Сп.Добавить(спСобытия);
	Сп.Добавить(спРаботаСТрафиком);
	Сп.Добавить(спЗапросыНаЗакрытие);
	
	//период
	Для Каждого Список Из Сп Цикл
		Эл=Список.Параметры.Элементы.Найти("Дата1");
		Эл.Значение=?(Дата1='00010101','20000101',Дата1);
		Эл.Использование=Истина;
		
		Эл=Список.Параметры.Элементы.Найти("Дата2");
		Эл.Значение=?(Дата2='00010101',КонецГода(ТекущаяДата()),Дата2);
		Эл.Использование=Истина;
	КонецЦикла;	
	
	//ТекПользователь
	Эл=спРабочиеЛисты.Параметры.Элементы.Найти("ТекПользователь"); Эл.Значение=Renault_ОбщиеФункцииСервер.ТекущийПользователь(); Эл.Использование=Истина;
	Эл=спЗапросыНаЗакрытие.Параметры.Элементы.Найти("ТекПользователь"); Эл.Значение=Renault_ОбщиеФункцииСервер.ТекущийПользователь(); Эл.Использование=Истина;
	
	//рабочие листы
	Эл=спРабочиеЛисты.Параметры.Элементы.Найти("ОтборАрхив"); Эл.Значение=ОтборАрхив; Эл.Использование=Истина;
	Эл=спРабочиеЛисты.Параметры.Элементы.Найти("ОтборНаПроверку"); Эл.Значение=ОтборНаПроверку; Эл.Использование=Истина;
	Эл=спРабочиеЛисты.Параметры.Элементы.Найти("ОтборБезСобытий"); Эл.Значение=ОтборБезСобытий; Эл.Использование=Истина;
	
	//события
	Эл=спСобытия.Параметры.Элементы.Найти("ТекДата"); Эл.Значение=ТекущаяДата(); Эл.Использование=Истина;
	Эл=спСобытия.Параметры.Элементы.Найти("ОтборАрхив"); Эл.Значение=ОтборАрхив; Эл.Использование=Истина;
	Эл=спСобытия.Параметры.Элементы.Найти("ТекПользователь"); Эл.Значение=Renault_ОбщиеФункцииСервер.ТекущийПользователь(); Эл.Использование=Истина;
	Эл=спСобытия.Параметры.Элементы.Найти("ОтборСвоиСобытия"); Эл.Значение=ОтборСвоиСобытия; Эл.Использование=Истина;
	Эл=спСобытия.Параметры.Элементы.Найти("ОтборУпущенные"); Эл.Значение=ОтборУпущенные; Эл.Использование=Истина;
	
КонецПроцедуры	

Процедура УстановитьЗаголовок() Заголовок="АРМ Руководителя ("+Renault_ОбщиеФункцииСервер.ПериодСтрокой(Дата1,Дата2)+")" КонецПроцедуры	

&НаКлиенте
Процедура НажатиеКнМеню(Команда)
	ПунктыМенюКоличество = ПунктыМеню.Количество();
	Для Н = 0 По ПунктыМенюКоличество - 1 Цикл
		Если Найти(ТекущийЭлемент.Имя, ПунктыМеню[Н].Значение) > 0 Тогда 
			ТекущаяЗакладкаМеню = Н;
			Прервать;
		КонецЕсли;	
	КонецЦикла;
	
	УправлениеМеню();
КонецПроцедуры
&НаКлиенте
Процедура УправлениеМеню()
	//скрыть или показать пункты меню в зависимости от набора прав
	Для Каждого Эл Из Элементы.кнМеню.ПодчиненныеЭлементы Цикл Эл.Видимость=ПунктыМеню.НайтиПоЗначению(Сред(Эл.Имя,3))<>Неопределено КонецЦикла;	
	
	//скрыть показать списки
	Для Н=0 По ПунктыМеню.Количество()-1 Цикл 
		Эл=Элементы.Найти("сп"+ПунктыМеню[Н]);
		Если Эл=Неопределено Тогда Продолжить КонецЕсли;
		Эл.Видимость=Н=ТекущаяЗакладкаМеню;
	КонецЦикла;	
	
	//цвета кнопок меню
	ПарамОфр=Renault_ОбщиеФункции.МультибрендПараметрыОформления();
	ЦветВкл=Вычислить(ПарамОфр.ОсновнойЦвет); //Вкл=Новый Цвет(255,207,0);
	ЦветВыкл=Новый Цвет(189,195,206); //ЦветВыкл=Вычислить(ПарамОфр.ДопЦвет1);
	ЦветВыклСерый=Новый Цвет(231,231,231); //ЦветВыклСерый=Вычислить(ПарамОфр.ДопЦвет1);
	
	Для Н=1 По Элементы.кнМеню.ПодчиненныеЭлементы.Количество() Цикл
		Эл=Элементы.кнМеню.ПодчиненныеЭлементы[Н-1];
		Если НЕ Эл.Видимость Тогда Продолжить КонецЕсли;
		ЭтоТекущаяЗакладка=Сред(Эл.Имя,3)=ПунктыМеню[ТекущаяЗакладкаМеню].Значение;
		Эл.ЦветФона=?(ЭтоТекущаяЗакладка,ЦветВкл,ЦветВыкл);  //?(Н=ТекущаяЗакладкаМеню,ЦветВкл,ЦветВыкл);
		Эл.ЦветРамки=?(ЭтоТекущаяЗакладка,ЦветВкл,ЦветВыкл);
	КонецЦикла;
	
	//кнопки быстрого отбора
	Массив=Новый Массив;
	Массив.Добавить(Элементы.кнНаПРоверку);
	Массив.Добавить(Элементы.кнБезСобытий);
	Массив.Добавить(Элементы.кнСегодня);
	Массив.Добавить(Элементы.кнАрхив);
	Массив.Добавить(Элементы.кнСвоиСобытия);
	Массив.Добавить(Элементы.кнУпущенные);
	Для Каждого Эл Из Массив Цикл
		Цвет=?(ЭтаФорма[СтрЗаменить(Эл.Имя,"кн","Отбор")],ЦветВкл,ЦветВыклСерый);
		Эл.ЦветФона=Цвет;
		Эл.ЦветРамки=Цвет;
	КонецЦикла;
	
	ИмяЗакладки=ИмяЗакладки();
	Если ИмяЗакладки="РабочиеЛисты" Тогда
		Элементы.кнАрхив.Видимость=Истина;
		Элементы.кнНаПРоверку.Видимость=Истина;
		Элементы.кнБезСобытий.Видимость=Истина;
		Элементы.кнСвоиСобытия.Видимость=Ложь;
		Элементы.кнУпущенные.Видимость=Ложь;
		Элементы.кнЗапросНаЗакрытие.Видимость=Ложь;
	ИначеЕсли ИмяЗакладки="События" Тогда
		Элементы.кнАрхив.Видимость=Истина;
		Элементы.кнНаПРоверку.Видимость=Ложь;
		Элементы.кнБезСобытий.Видимость=Ложь;
		Элементы.кнСвоиСобытия.Видимость=Истина;
		Элементы.кнУпущенные.Видимость=Истина;
		Элементы.кнЗапросНаЗакрытие.Видимость=Ложь;
	ИначеЕсли ИмяЗакладки="РаботаСТрафиком" Тогда
		Элементы.кнАрхив.Видимость=Ложь;
		Элементы.кнНаПРоверку.Видимость=Ложь;
		Элементы.кнБезСобытий.Видимость=Ложь;
		Элементы.кнСвоиСобытия.Видимость=Ложь;
		Элементы.кнУпущенные.Видимость=Ложь;
		Элементы.кнЗапросНаЗакрытие.Видимость=Ложь;
	ИначеЕсли ИмяЗакладки="ЗапросыНаЗакрытие" Тогда		
		Элементы.кнАрхив.Видимость=Ложь;
		Элементы.кнНаПРоверку.Видимость=Ложь;
		Элементы.кнБезСобытий.Видимость=Ложь;
		Элементы.кнСвоиСобытия.Видимость=Ложь;
		Элементы.кнУпущенные.Видимость=Ложь;
		Элементы.кнЗапросНаЗакрытие.Видимость=Истина;
	//Иначе	...
	КонецЕсли;	
	
КонецПроцедуры	

&НаКлиенте
Процедура НажатиеКнМенюСписка(Команда)
	ИмяСписка=ИмяСписка();
	
	Если ТекущийЭлемент.Имя="кнПериод" Тогда
		ПараметрыФормы = Новый Структура("Дата1, Дата2", Дата1, Дата2);
		ОпОповещения = Новый ОписаниеОповещения("УстановкаДанныхПериода", ЭтаФорма);
		ОткрытьФорму("ОбщаяФорма.Renault_ВыборПериода", ПараметрыФормы, ЭтаФорма,,,, ОпОповещения, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);

	ИначеЕсли ТекущийЭлемент.Имя="кнОтбор" Тогда
		Источник=ПолучитьПроизвольныйИсточникНаСервере(ИмяСписка);
		Renault_ОбщиеФункции.ОткрытьФормуОтбора(ЭтаФорма,Источник,ЭтаФорма[ИмяСписка].КомпоновщикНастроек,"ОтборСписка",ИмяСписка,,Истина)
		
	ИначеЕсли ТекущийЭлемент.Родитель=Элементы.грБыстрыйОтбор Тогда
		ЭтаФорма[СтрЗаменить(ТекущийЭлемент.Имя,"кн","Отбор")]=НЕ ЭтаФорма[СтрЗаменить(ТекущийЭлемент.Имя,"кн","Отбор")];
		УправлениеМеню();
		УстановитьПараметрыСписков();
		
	ИначеЕсли ТекущийЭлемент.Имя="кнЗакрыть" Тогда 
		Если Вопрос("Лист будет закрыт и отправлен в архив. Продолжить?",РежимДиалогаВопрос.ДаНет)=КодВозвратаДиалога.Да 
			И ЗакрытьРЛ(Элементы[ИмяСписка].ТекущаяСтрока.IDK)=Истина 
		Тогда Элементы[ИмяСписка].Обновить() КонецЕсли
	ИначеЕсли ТекущийЭлемент.Имя="кнВернутьВРаботу" Тогда
		Стр="";	
		IDK=Элементы[ИмяСписка].ТекущаяСтрока.IDK;
		Если ВвестиСтроку(Стр,"Комментарий",0,Истина) Тогда 
			Если ВернутьВРаботуРЛ(IDK,Стр)=Истина Тогда
				ФормаСобытия=ПолучитьФорму("Документ.CRM_СобытияПоРабочимЛистам.ФормаОбъекта",,ЭтаФорма,УникальныйИдентификатор);
				ФормаСобытия.IDK=IDK;
				ФормаСобытия.ВидСобытия=Справочники.CRM_ВидыСобытий.Прочее;
				ФормаСобытия.Открыть();
			КонецЕсли;	
		КонецЕсли;
	ИначеЕсли ТекущийЭлемент.Имя="кнОбновить" Тогда Элементы[ИмяСписка].Обновить()
	КонецЕсли;
	
	Элементы.ИнформацияПоСтроке.Видимость=Ложь; //ТекстИнформации(Элементы[ИмяСписка].ТекущаяСтрока);
	
КонецПроцедуры

Процедура ТекстИнформации(Ссылка) Если Renault_ОбщиеФункции.СтараяПлатформа() Тогда Возврат КонецЕсли;
	//ТекСсылка
	Если Ссылка=Неопределено Тогда ИнформацияПоСтроке=""; Возврат КонецЕсли;
	ИмяПунктаМеню=ИмяЗакладки();
	Сп=Новый СписокЗначений;
	Если ИмяПунктаМеню="Задачи" Тогда
		//Сп.Добавить(Ссылка.ДилерскийЦентр,"Дилерский центр");
		//Сп.Добавить(Ссылка.Подразделение,"Подразделение");
		//Сп.Добавить(Ссылка.Отдел,"Отдел");
		//Сп.Добавить(Ссылка.Сотрудник,"Сотрудник");
		//Сп.Добавить(Ссылка.Исполнитель,"Исполнитель");
		//Сп.Добавить(Ссылка.Автор,"Автор");
		//Сп.Добавить(Ссылка.Объект,"Объект задачи");
		//Сп.Добавить(Ссылка.Контрагент,"Контрагент");
		//Сп.Добавить(Ссылка.ВидСобытия,"Вид события");
		//Сп.Добавить(Ссылка.Состояние,"Состояние");
		//Сп.Добавить(Ссылка.Наименование,"Задача");
		//Сп.Добавить(Ссылка.Комментарий,"Комментарий");
		//Сп.Добавить(Ссылка.ДатаЗакрытия,"Дата закрытия");
		
	ИначеЕсли ИмяПунктаМеню="..." Тогда
	КонецЕсли;		
	
	//для HTML
	//Тело="";
	//Шаблон="<span><FONT color=#FFB600><STRONG>%Имя%:</STRONG></FONT> %Значение%</span><BR>";
	//Для Каждого Эл Из Соотв Цикл
	//	Тело=Тело+СтрЗаменить( СтрЗаменить(Шаблон,"%Имя%",Эл.Ключ) ,"%Значение%",Эл.Значение)
	//КонецЦикла;	
	//Возврат СтрЗаменить(Обработки.Renault_АРМ_ОФУ.ПолучитьМакет("html").ПолучитьТекст(),"%тело%",Тело)
	
//проблемы совместимости
	//Массив=Новый Массив;
	//Для Каждого Эл Из Сп Цикл
	//	Массив.Добавить(Новый ФорматированнаяСтрока(Эл.Представление+": ",Новый Шрифт(,,Истина),Новый Цвет(49,49,49)));
	//	Массив.Добавить(Представление(Эл.Значение)+Символы.ПС);
	//КонецЦикла;
	//ИнформацияПоСтроке=Новый ФорматированнаяСтрока(Массив);
	
	Если Не Renault_ОбщиеФункции.СтараяПлатформа() Тогда
		Выполнить("
		|	Массив=Новый Массив;
		|	Для Каждого Эл Из Сп Цикл
		|		Массив.Добавить(Новый ФорматированнаяСтрока(Эл.Представление+"": "",Новый Шрифт(,,Истина),Новый Цвет(49,49,49)));
		|		Массив.Добавить(Представление(Эл.Значение)+Символы.ПС);
		|	КонецЦикла;
		|	ИнформацияПоСтроке=Новый ФорматированнаяСтрока(Массив);
		|		")
	КонецЕсли;	
	
	//Элементы.ИнформацияПоСтроке.Высота=Макс(Сп.Количество()-1,2);
КонецПроцедуры

&НаКлиенте
Процедура ОтборСписка(КомпНастроек,ИмяСписка) Экспорт //интерактивный отбор
	Если КомпНастроек=Неопределено Тогда Возврат КонецЕсли;		
	ЭтаФорма[ИмяСписка].КомпоновщикНастроек.ЗагрузитьФиксированныеНастройки(КомпНастроек.ФиксированныеНастройки);
	УстановитьПараметрыСписков();
	
	//отключим быстрый отбор
	ОтборАрхив=Ложь;
	ОтборБезСобытий=Ложь;
	ОтборНаПроверку=Ложь;
	ОтборСегодня=Ложь;
	УправлениеМеню();
	
	//Если ИмяСписка="спСтраховыеПолисы" Тогда
	//	спСтраховыеПолисы.Параметры.Элементы.Найти("ТекущаяДата").Значение=ТекущаяДата();
	//	спСтраховыеПолисы.Параметры.Элементы.Найти("ТекущаяДата").Использование=Истина;
	//	спСтраховыеПолисы.Параметры.Элементы.Найти("Пролонгация").Значение=ТолькоПролонгация;
	//	спСтраховыеПолисы.Параметры.Элементы.Найти("Пролонгация").Использование=Истина;
	//КонецЕсли;	
	
	//ЭтаФорма[ИмяСписка].КомпоновщикНастроек.ЗагрузитьНастройки(КомпоновщикНастроек.Настройки);
	//ЭтаФорма[ИмяСписка].КомпоновщикНастроек.ЗагрузитьПользовательскиеНастройки(КомпоновщикНастроек.ПользовательскиеНастройки);
	//ЭтаФорма[ИмяСписка].КомпоновщикНастроек.ЗагрузитьФиксированныеНастройки(КомпоновщикНастроек.ФиксированныеНастройки);
КонецПроцедуры

&НаКлиенте
Процедура УстановкаДанныхПериода(ДанныеПериода, ДополнительныеПараменты="") Экспорт
	Если ДанныеПериода=Неопределено Тогда Возврат КонецЕсли;
	Дата1=ДанныеПериода.Дата1;
	Дата2=КонецДня(ДанныеПериода.Дата2); 
	
	УстановитьПараметрыСписков();
	ИмяСписка=ИмяСписка();
	Элементы[ИмяСписка].Обновить();
КонецПроцедуры

&НаКлиенте
Процедура кнСтарыйИнтерфейс(Команда) ОткрытьФорму("Обработка.Renault_ARM_Руководитель.Форма.Форма") КонецПроцедуры

&НаКлиенте
Процедура РаботаСоСписком(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	СтандартнаяОбработка=Ложь;
	ИмяСписка=ИмяСписка();
	Оповещение=Новый ОписаниеОповещения("ОбновитьСписок",ЭтаФорма,ИмяСписка);
	//Элементы[ИмяСписка].ТекущаяСтрока;
	Если ИмяСписка="спРабочиеЛисты" Тогда Renault_CRM.ОткрытьФормуРЛ(Элементы[ИмяСписка].ТекущиеДанные.НомерРЛ)
	ИначеЕсли ИмяСписка="спРаботаСТрафиком" Тогда
	ИначеЕсли ИмяСписка="спСобытия" Тогда ОткрытьФорму("Документ.CRM_СобытияПоРабочимЛистам.ФормаОбъекта",Новый Структура("Ключ",Элементы[ИмяСписка].ТекущаяСтрока),ЭтаФорма,УникальныйИдентификатор,,,Оповещение)
	ИначеЕсли ИмяСписка="спЗапросыНаЗакрытие" Тогда ОткрытьФорму("РегистрСведений.Renault_РабочиеЛисты.ФормаЗаписи",Новый Структура("Ключ",Элементы[ИмяСписка].ТекущаяСтрока),ЭтаФорма,УникальныйИдентификатор,,,Оповещение)
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьСписок(Парам1,Парам2) Экспорт Элементы[Парам2].Обновить() КонецПроцедуры	

Функция ЗакрытьРЛ(НомерРЛ)
	ЗаписьРЛ=Renault_CRM.ПолучитьЗаписьРЛПоIDK(НомерРЛ);
	Если ЗаписьРЛ<>Неопределено Тогда
		ЗаписьРЛ.ЛистЗакрыт=Истина;
		ЗаписьРЛ.Период=ТекущаяДата();
		ЗаписьРЛ.Записать();
	КонецЕсли;
	Возврат Истина
КонецФункции
Функция ВернутьВРаботуРЛ(НомерРЛ,Комментарий)
	ЗаписьРЛ=Renault_CRM.ПолучитьЗаписьРЛПоIDK(НомерРЛ);
	Если ЗаписьРЛ=Неопределено Тогда Возврат Ложь КонецЕсли;
	
	Менеджер=РегистрыСведений.CRM_Комментарии.СоздатьМенеджерЗаписи();
	Менеджер.IDK=ЗаписьРЛ.IDK;
	Менеджер.Автор=Renault_ОбщиеФункцииСервер.ТекущийПользователь().Сотрудник;
	Менеджер.Дата=ТекущаяДата();
	Менеджер.Идентификатор=Строка(Новый УникальныйИдентификатор());
	Менеджер.ТекстКомментария=Комментарий;
	Менеджер.Записать();
	
	ЗаписьРЛ.ЗапросНаЗакрытие=Ложь;
	ЗаписьРЛ.Период=ТекущаяДата();
	ЗаписьРЛ.Записать();
	
	Возврат Истина
КонецФункции