
&НаСервереБезКонтекста
Процедура ОбновитьСоответствиеНаСервере()
	
	НаборОчистки = РегистрыСведений.DMS_СоответствиеИменИОтчества.СоздатьНаборЗаписей();
	НаборОчистки.Записать(Истина);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	DMS_ДанныеФизическихЛиц.Имя
		|ИЗ
		|	РегистрСведений.DMS_ДанныеФизическихЛиц КАК DMS_ДанныеФизическихЛиц
		|ГДЕ
		|	DMS_ДанныеФизическихЛиц.Имя <> """"
		|	И DMS_ДанныеФизическихЛиц.Пол <> ЗНАЧЕНИЕ(Перечисление.Renault_ПолФизическогоЛица.Женский)";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	НедопустимыеСимволы = "!,#,$,%,^,&,*,(,),+,`,~,|,\,/,=,"",«,»,@";
	
	МассивНедопустимыхСимволов = Renault_СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивСлов(НедопустимыеСимволы,",");
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		Имя = СокрЛП(ВыборкаДетальныеЗаписи.Имя);
		
		Для каждого ТекущийСимвол Из МассивНедопустимыхСимволов Цикл
			Имя = СокрЛП(СтрЗаменить(Имя,ТекущийСимвол,""));	
		КонецЦикла; 
		
		Если ПустаяСтрока(Имя) Тогда
			Продолжить;
		КонецЕсли; 
		
		//Мужской
		Отчество = ?(Прав(Имя,1) = "й",Лев(Имя,СтрДлина(Имя)-1)+"евич",Имя+"ович");
		
		//Если ЕстьОтчество(Отчество) Тогда
			
			СтруктураДанных = Новый Структура("Имя,Отчество",Имя,Отчество);
			
			DMS_ФизическиеЛицаСервер.ДобавитьЗаписьВРегистрСведений(СтруктураДанных,"DMS_СоответствиеИменИОтчества");
		
		//КонецЕсли; 
		
		//Женский
		Отчество = ?(Прав(Имя,1) = "й",Лев(Имя,СтрДлина(Имя)-1)+"евна",Имя+"овна");
		
		//Если ЕстьОтчество(Отчество) Тогда
			
			СтруктураДанных = Новый Структура("Имя,Отчество",Имя,Отчество);
			
			DMS_ФизическиеЛицаСервер.ДобавитьЗаписьВРегистрСведений(СтруктураДанных,"DMS_СоответствиеИменИОтчества");
		
		//КонецЕсли; 
		
	КонецЦикла;

КонецПроцедуры

&НаКлиенте
Процедура ОбновитьСоответствие(Команда)
	ОбновитьСоответствиеНаСервере();
КонецПроцедуры

&НаСервереБезКонтекста
Функция ЕстьОтчество(Отчество)
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Отчество", Отчество);
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ ПЕРВЫЕ 1
		|	ДанныеФизическихЛиц.Отчество
		|ИЗ
		|	РегистрСведений.DMS_ДанныеФизическихЛиц КАК ДанныеФизическихЛиц
		|ГДЕ
		|	ДанныеФизическихЛиц.Отчество = &Отчество";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Возврат Не РезультатЗапроса.Пустой();
	
КонецФункции // ЕстьОтчество()
 

