
&НаСервере
Процедура ОбновитьОтображениеФормы ()
	мТипЗаказа = Новый Массив;
	мТипЗаказа.Добавить(Справочники.ТипыЗаказов.ZMP4Складской);
	мТипЗаказа.Добавить(Справочники.ТипыЗаказов.ZMP4ПрямаяПоставка);
	мТипЗаказа.Добавить(Справочники.ТипыЗаказов.ZMP9Промо);
	Если мТипЗаказа.Найти(ЗаказПоставщику.ТипЗаказа) = Неопределено Тогда
		Элементы.СрокПоставки.Видимость = Ложь;
	КонецЕсли;
	Элементы.ГруппаПодменныйАвтомобиль.Видимость = Renault_ПодменныйАвтомобиль;
	Если ЗаказПоставщику.ТипЗаказа = Справочники.ТипыЗаказов.ZMP2Гарантийный 
		или  ЗаказПоставщику.ТипЗаказа = Справочники.ТипыЗаказов.ZMP1PVI Тогда
		Элементы.Renault_ПодменныйАвтомобиль.Видимость = Истина;
		Элементы.ГруппаАвтомобиль.Видимость = Истина;
		Элементы.ТаблицаRenaultАвтомобиль.Видимость = Истина;
		Элементы.ТаблицаRenaultВИН.Видимость = Истина;
	Иначе
		Элементы.Renault_ПодменныйАвтомобиль.Видимость = Ложь;
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	Renault_КаталогРеферансов.Номенклатура
		|ИЗ
		|	РегистрСведений.Renault_КаталогРеферансов КАК Renault_КаталогРеферансов
		|ГДЕ
		|	НЕ Renault_КаталогРеферансов.НаличиеВSAPе
		|	И Renault_КаталогРеферансов.Номенклатура В(&Номенклатура)";
		ТабДокумента = ЗаказПоставщику.Товары; 
		Запрос.УстановитьПараметр("Номенклатура", ТабДокумента.ВыгрузитьКолонку("Номенклатура"));
		Результат = Запрос.Выполнить(); 
		Выборка = Результат.Выбрать();
		Если (Выборка.Количество() <> 0 и Выборка.Количество() = ЗаказПоставщику.Товары.Количество()) 
				или ЗаказПоставщику.ТипЗаказа = Справочники.ТипыЗаказов.ZMP2Кодовые  Тогда
			Элементы.ТаблицаRenaultАвтомобиль.Видимость = Истина;
			Элементы.ТаблицаRenaultВИН.Видимость = Истина;
		Иначе 
			Элементы.ГруппаАвтомобиль.Видимость = Ложь;
			Элементы.ТаблицаRenaultАвтомобиль.Видимость = Ложь;
			Элементы.ТаблицаRenaultВИН.Видимость = Ложь;
		КонецЕсли;
	КонецЕсли;
	Если ЗначениеЗаполнено(Renault_Автомобиль) Тогда
		Элементы.Renault_VIN.ТолькоПросмотр = Истина;
	ИначеЕсли ЗначениеЗаполнено(Renault_VIN) Тогда
		Элементы.Renault_Автомобиль.ТолькоПросмотр = Истина;
	Иначе
		Элементы.Renault_VIN.ТолькоПросмотр = Ложь;
		Элементы.Renault_Автомобиль.ТолькоПросмотр = Ложь
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура Renault_ПодменныйАвтомобильПриИзменении(Элемент)
	ОбновитьОтображениеФормы ();
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ЗаполнитьЗначенияДопРеквизитов();
	ОбновитьОтображениеФормы ();
КонецПроцедуры

&НаКлиенте
Процедура Renault_АвтомобильПриИзменении(Элемент)
	Renault_VIN = Renault_Автомобиль.VIN;
	Перезаполнять = Вопрос("Перезапонять поле автомобиль в таблице", РежимДиалогаВопрос.ДаНет) = КодВозвратаДиалога.Да; 
	ОбработатьТаблицуНаСервере(Перезаполнять);
КонецПроцедуры

&НаСервере 
Процедура ОбработатьТаблицуНаСервере (Перезаполнять)
	
	Для Каждого СтрокаТЧ из ТаблицаRenault Цикл
		
		Если (ЗначениеЗаполнено(СтрокаТЧ.Автомобиль) или ЗначениеЗаполнено(СтрокаТЧ.вин)) и не Перезаполнять Тогда
			Продолжить;
		КонецЕсли;
		СтрокаТЧ.Автомобиль =  Renault_Автомобиль;
		СтрокаТЧ.ВИН = Renault_VIN;
		
	КонецЦикла;
	ОбновитьОтображениеФормы();
КонецПроцедуры

&НаКлиенте
Процедура ВИНПриИзменении(Элемент)
	Перезаполнять = Вопрос("Перезапонять поле VIN в таблице", РежимДиалогаВопрос.ДаНет) = КодВозвратаДиалога.Да; 
	ОбработатьТаблицуНаСервере(Перезаполнять);
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаRenaultАвтомобильПриИзменении(Элемент)
	ТекущаяСтрока = Элементы.ТаблицаRenault.ТекущиеДанные;
	ТекущаяСтрока.ВИН = ПолучитьВИННаСервере(ТекущаяСтрока.Автомобиль);
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьВИННаСервере (Автомобиль)
	Возврат Автомобиль.VIN;
КонецФункции

&НаКлиенте
Процедура ТаблицаRenaultВИНПриИзменении(Элемент)
	ТекущаяСтрока = Элементы.ТаблицаRenault.ТекущиеДанные;
	ТекущаяСтрока.Автомобиль = ПредопределенноеЗначение("Справочник.Автомобили.ПустаяСсылка");
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, СтандартнаяОбработка)
	ЭтоДокументРено = ПолучитьТипДокумента();
	Если  ОтправлятьВRenault Тогда
		Для Каждого СтрокаТЧ из ТаблицаRenault Цикл
			Если ЗаказПоставщику.ТипЗаказа = ПредопределенноеЗначение("Справочник.ТипыЗаказов.ZMP2Гарантийный")
				или ЗаказПоставщику.ТипЗаказа = ПредопределенноеЗначение("Справочник.ТипыЗаказов.ZMP1PVI")
					или ЗаказПоставщику.ТипЗаказа = ПредопределенноеЗначение("Справочник.ТипыЗаказов.ZMP2Кодовые")
						или ЭтоДокументРено Тогда
				Если Не ЗначениеЗаполнено(СтрокаТЧ.ВИН) Тогда
					Отказ = Истина;
					Предупреждение("Отправка невозможна. Поле VIN обязательно для заполнения");
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
		Если Renault_ПодменныйАвтомобиль и Не ЗначениеЗаполнено(ДатаВыдачиПодменногоАвтомобиля) Тогда
			Отказ = Истина;
			Предупреждение("Дата выдачи обязательна для заполнения");
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Функция ПолучитьТипДокумента ()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Renault_КаталогРеферансов.Номенклатура
	|ИЗ
	|	РегистрСведений.Renault_КаталогРеферансов КАК Renault_КаталогРеферансов
	|ГДЕ
	|	НЕ Renault_КаталогРеферансов.НаличиеВSAPе
	|	И Renault_КаталогРеферансов.Номенклатура В(&Номенклатура)";
	Запрос.УстановитьПараметр("Номенклатура", ЗаказПоставщику.Товары.ВыгрузитьКолонку("Номенклатура"));
	Результат = Запрос.Выполнить();
	Если Результат.Пустой() Тогда
		Возврат Ложь;
	КонецЕсли; 
	
	Выборка = Результат.Выбрать();
	Возврат Выборка.Количество() = ЗаказПоставщику.Товары.Количество();
	
КонецФункции

&НаКлиенте
Процедура СрокПоставкиПриИзменении(Элемент)

КонецПроцедуры

&НаКлиенте
Процедура СрокПоставкиОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	Если ВыбранноеЗначение <= НачалоДня(ТекущаяДата()) Тогда
		Предупреждение("Дата не может быть меньше и равной текущей даты");
		СтандартнаяОбработка = Ложь;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии()
	ПриЗакрытииНаСервере();
КонецПроцедуры

&НаСервере
Процедура ПриЗакрытииНаСервере()
	Счетчик = 1;
	
	Менеджер = РегистрыСведений.Renault_ДопРеквизитыЗаказаПоставщику.СоздатьМенеджерЗаписи();
	Менеджер.ЗаказПоставщику = ЗаказПоставщику;
	Менеджер.Автомобиль = Renault_Автомобиль;
	Менеджер.ВыданПодменныйАвтомобиль = Renault_ПодменныйАвтомобиль;
	Менеджер.ДатаВыдачиПодменногоАвтомобиля = ДатаВыдачиПодменногоАвтомобиля;
	Менеджер.ОтправлятьВRenault = ОтправлятьВRenault;
	Менеджер.ПодменныйАвтомобиль = ПодменныйАвтомобиль;
	//Менеджер.ТипЗаказаSappr = Перечисления.SAPPR_ВидЗаказаПоставщику[Лев(Справочники.ТипыЗаказов.ПолучитьИмяПредопределенного(ЗаказПоставщику.ТипЗаказа),4)];
	Менеджер.Записать();
	
	Набор = РегистрыСведений.Renault_ДопТабЧастиЗаказПоставщику.СоздатьНаборЗаписей();
	Набор.Отбор.ЗаказПоставщику.Установить(ЗаказПоставщику);
	Набор.Записать();
	
	Для Каждого СтрокаТЗ из ТаблицаRenault Цикл
		
		Менеджер = РегистрыСведений.Renault_ДопТабЧастиЗаказПоставщику.СоздатьМенеджерЗаписи();
		Менеджер.НомерСтрокиТЗ = Счетчик;
		Менеджер.Номенклатура = СтрокаТЗ.Номенклатура;
		Менеджер.Автомобиль = СтрокаТЗ.Автомобиль;
		Менеджер.ЗаказПоставщику = ЗаказПоставщику;
		Менеджер.ВИН = СтрокаТЗ.ВИН;
		Менеджер.Комментарий = СтрокаТЗ.Комментарий;
		Менеджер.Записать();
		Счетчик = Счетчик +1;
		
	КонецЦикла;
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьЗначенияДопРеквизитов ()
	
	Если ЗначениеЗаполнено(ЗаказПоставщику) Тогда
		
		Менедеджер = РегистрыСведений.Renault_ДопРеквизитыЗаказаПоставщику.СоздатьМенеджерЗаписи();
		Менедеджер.ЗаказПоставщику = ЗаказПоставщику;
		Менедеджер.Прочитать();
		ЗаполнитьЗначенияСвойств(ЭтаФорма, Менедеджер,,"ЗаказПоставщику");
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЗаказПоставщикуТовары.Номенклатура,
		|	ЗаказПоставщикуТовары.Ссылка
		|ПОМЕСТИТЬ ВТ_Тованы
		|ИЗ
		|	Документ.ЗаказПоставщику.Товары КАК ЗаказПоставщикуТовары
		|ГДЕ
		|	ЗаказПоставщикуТовары.Ссылка = &Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_Тованы.Номенклатура,
		|	Renault_ДопТабЧастиЗаказПоставщику.Автомобиль,
		|	Renault_ДопТабЧастиЗаказПоставщику.Комментарий,
		|	Renault_ДопТабЧастиЗаказПоставщику.ВИН
		|ИЗ
		|	ВТ_Тованы КАК ВТ_Тованы
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.Renault_ДопТабЧастиЗаказПоставщику КАК Renault_ДопТабЧастиЗаказПоставщику
		|		ПО ВТ_Тованы.Номенклатура = Renault_ДопТабЧастиЗаказПоставщику.Номенклатура
		|			И ВТ_Тованы.Ссылка = Renault_ДопТабЧастиЗаказПоставщику.ЗаказПоставщику";
		Запрос.УстановитьПараметр("Ссылка", ЗаказПоставщику);
		ТаблицаRenault.Загрузить(Запрос.Выполнить().Выгрузить());
		
	КонецЕсли;
	
КонецПроцедуры

