&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Параметры.РежимВыбора Тогда Элементы.Список.РежимВыбора=Истина КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура кнДобавитьПредопределенный(Команда)
	Парам=Новый Структура;
	Парам.Вставить("Список",СписокПравил());
	Парам.Вставить("Заголовок","Предопределенные правила");
	Парам.Вставить("МножественныйВыбор",Истина);
	//Парам.Вставить("КоличествоЭлементовВСтроке",4);
	Парам.Вставить("ШиринаЭлемента",17);
	Парам.Вставить("ВысотаЭлемента",2);
	//Парам.Вставить("Иерархия",Истина);
	ОткрытьФорму("Обработка.DMS_Диалог.Форма.ДиалогВыбораСписка",Парам,ЭтаФорма,УникальныйИдентификатор,,,Новый ОписаниеОповещения("ДобавитьПравила",ЭтаФорма));
КонецПроцедуры
Функция СписокПравил()
	Сп=Новый СписокЗначений;
	Для Каждого Эл Из Метаданные.ПланыОбмена.DMS_Consolidation.Макеты Цикл Сп.Добавить(Эл.Имя,Эл.Синоним) КонецЦикла;
	Возврат Сп
КонецФункции

&НаКлиенте
Процедура ДобавитьПравила(Массив,Парам2) Экспорт ДобавитьПравилаСервер(Массив); Элементы.Список.Обновить(); КонецПроцедуры
Процедура ДобавитьПравилаСервер(Массив) Экспорт
	Если Массив=Неопределено Тогда Возврат КонецЕсли;
	Для Каждого Эл Из Массив Цикл
		СтруктураПравил=СтруктураПравил(Эл);
		
		Запрос=Новый Запрос("Выбрать Ссылка Из Справочник.DMS_ПравилаКонвертации ГДЕ Имя=&Имя");
		Запрос.УстановитьПараметр("Имя",СтруктураПравил.Имя);
		Выборка=Запрос.Выполнить().Выбрать();
		
		Спр=?(Выборка.Следующий(),Выборка.Ссылка.ПолучитьОбъект(),Справочники.DMS_ПравилаКонвертации.СоздатьЭлемент());
		Спр.Стандартные=Истина;
		ЗаполнитьЗначенияСвойств(Спр,СтруктураПравил);
		Спр.Записать();
	КонецЦикла;	
КонецПроцедуры

Функция СтруктураПравил(Имя) 
	Макет=ПланыОбмена.DMS_Consolidation.ПолучитьМакет(Имя);
	МД=Метаданные.ПланыОбмена.DMS_Consolidation.Макеты[Имя];
	//Возврат Новый Структура("Имя,Наименование,Правила,Описание",Имя,МД.Синоним,Макет.ПолучитьТекст(),МД.Комментарий) 
	Возврат Новый Структура("Имя,Наименование,Правила,Описание",Имя,МД.Синоним,"ПланыОбмена.DMS_Consolidation.ПолучитьМакет("""+Имя+""")",МД.Комментарий) 
КонецФункции	

