Функция ЗаписатьРаботы(ТаблицаРабот) Экспорт
	
	Попытка
		ТаблицаЗаказов = ТаблицаРабот.Скопировать(,"ЗаказНаряд");
		ТаблицаЗаказов.Свернуть("ЗаказНаряд");
		
		ЗаказНаряд = ТаблицаЗаказов[0].ЗаказНаряд;
		
		НЗ = СоздатьНаборЗаписей();
		НЗ.Отбор.ЗаказНаряд.Установить(ЗаказНаряд);
		НЗ.Прочитать();
		
		НЗ.Загрузить(ТаблицаРабот);
		НЗ.Записать();
	
		Возврат Истина;
		
	Исключение
		Возврат Ложь;
	КонецПопытки;
	
КонецФункции

Процедура ОбновитьРаботы(ТаблицаРабот, ЗаказНарядСсылка = Неопределено) Экспорт
	
	ТаблицаЗаказов = ТаблицаРабот.Скопировать(,"ЗаказНаряд");
	ТаблицаЗаказов.Свернуть("ЗаказНаряд");
	
	//%+ Дата изменения - 16.07.2012 9:55:09; Автор - Окипний Андрей Евгеньевич
	//
	// Описание изменений
	//  Корректировка записи пустых наборов
	//
	//%-
	
	////$+ Комментарий 
	// Дата создания - 16.07.2012 9:56:28;
	// Автор - Окипний Андрей Евгеньевич
	// В таблице с записями может не быть строк, из-за чего нет возможности выбрать 
	// ЗаказНаряд. Для таких случаев передаем заказ наряд отдельной переменной.
	//
	//$-
	
	Если ТаблицаЗаказов.Количество() > 0 тогда
		
		ЗаказНаряд = ТаблицаЗаказов[0].ЗаказНаряд;
		
	Иначе
		
		ЗаказНаряд = ЗаказНарядСсылка;
		
	КонецЕсли;
	
	НЗ = СоздатьНаборЗаписей();
	НЗ.Отбор.ЗаказНаряд.Установить(ЗаказНаряд);
	НЗ.Прочитать();
	
	НЗ.Загрузить(ТаблицаРабот);
	НЗ.Записать();
	
КонецПроцедуры

Процедура УдалитьЗаписиПоЗаказНаряду(ЗаказНаряд) Экспорт
	
	НЗ = СоздатьНаборЗаписей();
	НЗ.Отбор.ЗаказНаряд.Установить(ЗаказНаряд);
	
	НЗ.Прочитать();
	
	Если НЗ.Количество() > 0 тогда
		
		НЗ.Очистить();
		НЗ.Записать();
		
	КонецЕсли;
	
КонецПроцедуры