Перем КоличествоЗаписей Экспорт;

Перем ДрайверОбъект Экспорт;
Перем ДрайверFTPОбъект Экспорт;
Перем ДрайверTDFa_Объект Экспорт;

Перем ВрФайлыДрайверов Экспорт;
Перем ВремИмяФайла;

Процедура ПолучитьДрайвер(Драйвер, Маркер) 
	
	Если Драйвер = Неопределено тогда
		//Нужно получить драйвер из макета и создать объект
		
		ИмяМакета = "Драйвер" + Маркер;
		ДвоичныеДанныеДрайвера = ЭтотОбъект.ПолучитьМакет(ИмяМакета);
		
		//Сохраняем во временный файл
		ИмяВрФайлаДрайвера = ПолучитьИмяВременногоФайла("epf");
		
		ДвоичныеДанныеДрайвера.Записать(ИмяВрФайлаДрайвера);
		
		//Теперь подключаем обработку к системе
		Драйвер = ВнешниеОбработки.Создать(ИмяВрФайлаДрайвера, ложь);
		
		ВрФайлыДрайверов.Добавить(ИмяВрФайлаДрайвера);
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗаписатьИзмененияВНастройку()
	
	//Получим двоичные данные файла источника
	Дданные = Новый ДвоичныеДанные(ВремИмяФайла);
	
	НастройкаОбъект = НастройкаПотока.ПолучитьОбъект();
	
	Сжатие = Новый СжатиеДанных(9);
	ВремХранилище = Новый ХранилищеЗначения(Дданные, Сжатие);
	
	//Запишем двоичные данные в настройку 
	НастройкаОбъект.ФайлДанных = ВремХранилище;
	
	//и дату загрузки
	НастройкаОбъект.ДатаПоследнейЗагрузки = ТекущаяДата();
	
	НастройкаОбъект.Записать();
	
	//Теперь нужно обновить Ссылку на измененную настройку
	Настройка = НастройкаОбъект.Ссылка;
	
КонецПроцедуры

Функция ПолучитьДанныеИзНастройки()
	
	//Получим двоичные данные из настройки
	ДДанные = НастройкаПотока.ФайлДанных.Получить();
	
	//Запишем во временный файл
	Попытка
		ДДанные.Записать(ВремИмяФайла);
	Исключение 
		Сообщить("-----------------------------------------------" + символы.ПС +
		"Сохраненных данных не обнаружено!");
	КонецПопытки;
	//Передадим имя временного файла в файловый драйвер
	Возврат ВремИмяФайла;

КонецФункции

Процедура ЗаполнитьПараметрыFTP()
	
	ДрайверFTPОбъект.ПутьКФайлу	= ВремИмяФайла;
	
	ДрайверFTPОбъект.МаскаФайла	= НастройкаПотока.МаскаФайла;
	ДрайверFTPОбъект.FTPСервер	= НастройкаПотока.FTPСервер;
	ДрайверFTPОбъект.FTPКаталог	= НастройкаПотока.FTPКаталог;
	ДрайверFTPОбъект.FTPЛогин	= НастройкаПотока.FTPЛогин;
	ДрайверFTPОбъект.FTPПароль	= НастройкаПотока.FTPПароль;
	ДрайверFTPОбъект.FTPПорт	= НастройкаПотока.FTPПорт;
	
	ДрайверFTPОбъект.ИспользоватьПрокси	= НастройкаПотока.ИспользоватьПрокси;
	ДрайверFTPОбъект.АдресПрокси		= НастройкаПотока.АдресПрокси;
	ДрайверFTPОбъект.ПортПрокси			= НастройкаПотока.ПортПрокси;
	ДрайверFTPОбъект.ЛогинПрокси		= НастройкаПотока.ЛогинПрокси;
	ДрайверFTPОбъект.ПарольПрокси		= НастройкаПотока.ПарольПрокси;
	
КонецПроцедуры


////@+ Функция ПолучитьДанныеИзДрайвера()
// Дата создания - 28.05.2012 10:11:36; 
// Автор - Окипний Андрей Евгеньевич
//
// Описание функции
// Функция производит получение и обработку данных по указанной настройке потока.
//
// Параметры
//  Без параметров
//
// Возвращаемое значение
//  Результат  - Булево - флаг обработки. Истина - удачно, ложь - не удачно
//
//@-
Функция ПолучитьДанныеИзДрайвера() Экспорт
	
	//Первоначальная инициализация
	Результат = Истина;
	
	//Основная обработка данных производится в файловом драйвере
	//остальные драйвера только получают файл с данными из спец. источника
	
	//Смотрим данные о последней загрузке в настройке.
	//Проверяем дату последней загрузки
	Если НачалоДня(ТекущаяДата()) = НачалоДня(НастройкаПотока.ДатаПоследнейЗагрузки) тогда //Файл уже загружали
		
		ПутьКФайлу = ПолучитьДанныеИзНастройки();
		
	Иначе
		
		//Основная обработка данных производится в файловом драйвере
		//остальные драйвера только получают файл с данными из спец. источника
		Попытка
			Если НастройкаПотока.Драйвер = "Файл" тогда
				
				ПутьКФайлу = НастройкаПотока.ПутьКФайлу;
				
			ИначеЕсли ВРег(НастройкаПотока.Драйвер) = "FTP" тогда 
				
				ПолучитьДрайвер(ДрайверFTPОбъект, "FTP");
				ЗаполнитьПараметрыFTP();
				
				ПутьКФайлу = ДрайверFTPОбъект.ПолучитьиСохранитьФайл();
				Если НЕ ЗначениеЗаполнено(ПутьКФайлу) тогда
					
					Сообщить("Не удалось получить данные с FTP");
					Результат = Ложь;
				
					Возврат Результат;
				КонецЕсли;
				
				//Заносим данные в настройку
				ЗаписатьИзмененияВНастройку();
				
				ПолучитьДрайвер(ДрайверОбъект, "Файл");
				
			ИначеЕсли ВРег(НастройкаПотока.Драйвер) = "TDFA" тогда
				
				// Комментарий 
				//Дата создания - 29.05.2012 12:04:01; Автор - Окипний Андрей Евгеньевич
				//Система должна автоматически получать данные через TDFa. И автоматически 
				//Загружать в хранилище.
				//Соответственно сюда мы попадать не должны.
				//Если все же попали, значит Задача TDFa не отработала!
				//Сообщим об этом пользователю.
				Сообщить("Новые данные по TDFa не были получены. " + Символы.ПС + 
						 "Проверте в каталоге ""TDFa\dcs-repository\in"" файлов *.VEH.* или *.VE_.*" + Символы.ПС +
						 "Отображаются устаревшие данные");
				
				ПутьКФайлу = ПолучитьДанныеИзНастройки();
				
				Результат = Истина;
				
			Иначе
				
				Сообщить("В настройке потока указан не поддерживаемый драйвер. Проверте настройки системы.");
				Возврат ложь;
				
			КонецЕсли;
			
		Исключение 
			
			Сообщить(ОписаниеОшибки());
			Возврат ложь;
			
		КонецПопытки;
	КонецЕсли;

	//Общее
	ПолучитьДрайвер(ДрайверОбъект, "Файл");
	
	ДрайверОбъект.ПутьКФайлу = ПутьКФайлу;
	
	Если ДрайверОбъект.ПолучитьИОбработатьФайлы() тогда
		
		//Предварительно очистим таблицы 
		ТаблицаSedr.Очистить();
		
		//Зполним таблицу из драйвера
		ТаблицаSedr.Загрузить(ДрайверОбъект.ТаблицаSedr.Выгрузить());
		
	Иначе
		Результат = Ложь;
		Сообщить(ДрайверОбъект.ОшибкиОбработки);
	КонецЕсли;
	
	КоличествоЗаписей = ТаблицаSedr.Количество();
	
	Возврат Результат;
	
КонецФункции // ПолучитьДанныеИзДрайвера()

////@+ Процедура ОбработкаНаСервере()
// Дата создания - 28.05.2012 10:14:19; 
// Автор - Окипний Андрей Евгеньевич
// 
// Описание процедуры
//  Процедура является точкой входа для сервера.
//  В этой процедуре производится только получение данных из файла
//  и помещение их в хранилище настройки потока.
//
// Параметры
//  Без параметров
//@-
Процедура ОбработкаНаСервере() Экспорт

	МассивФайлов = НайтиФайлы(ПутьКФайлу,"*.VEH.*");
	
	Если НЕ МассивФайлов.Количество() = 0 тогда
		
		ВремИмяФайла = МассивФайлов[0].ПолноеИмя;
		
		//Заносим данные в настройку
		ЗаписатьИзмененияВНастройку();
		
		//Теперь переименуем файл;
		
		Путь = МассивФайлов[0].Путь;
		ИмяБезРасширения = СтрЗаменить(МассивФайлов[0].ИмяБезРасширения, ".VEH.",".VE_.");
		Расширение = МассивФайлов[0].Расширение;
		
		МассивФайлов = Неопределено;
		
		ПереместитьФайл(ВремИмяФайла, Путь+ИмяБезРасширения+Расширение);
		
	КонецЕсли;
	
КонецПроцедуры // ОбработкаНаСервере()

/////////////////////////////////////////////////////////
//		Функции управляемой формы

////@+ Функция ПолучитьКоличествоЗаписей()
// Дата создания - 28.05.2012 11:35:08; 
// Автор - Окипний Андрей Евгеньевич
//
// Описание функции
// Функция возвращает значение переменной КоличествоЗаписей в управляемую форму.
//
// Параметры
//  Без параметров
//
// Возвращаемое значение
//  КоличествоЗаписей  - Число - Глобальная переменная объекта,
//					которая хранит количество считанных записей
//@-
Функция ПолучитьКоличествоЗаписей() Экспорт
	
	Возврат КоличествоЗаписей;
	
КонецФункции // ПолучитьКоличествоЗаписей()

////@+ Функция ПолучитьДанныеИзДрайвераУпр()
// Дата создания - 28.05.2012 12:01:37; 
// Автор - Окипний Андрей Евгеньевич
//
// Описание функции
// <Вставить описание>
//
// Параметры
//  Без параметров
//
// Возвращаемое значение
//  Результат  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//@-
Функция ПолучитьДанныеИзДрайвераУпр() Экспорт
	
	//Первоначальная инициализация
	Результат = неопределено;
	
	//УстановитьБезопасныйРежим(Ложь);
	
	Результат = ПолучитьДанныеИзДрайвера();
	
	Возврат Результат;
	
КонецФункции // ПолучитьДанныеИзДрайвераУпр()

//УстановитьБезопасныйРежим(Ложь);

ВрФайлыДрайверов = Новый Массив;

ВремИмяФайла = ПолучитьИмяВременногоФайла("csv");
ВрФайлыДрайверов.Добавить(ВремИмяФайла);