
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("Автомобиль") Тогда
		Объект.Владелец = Параметры.Автомобиль;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Объект.Владелец) Тогда
		Отказ = Истина;
		ВызватьИсключение "Не указан автомобиль";
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Объект.Ссылка) Тогда
		НаборЗаписиФотографии = РегистрыСведений.Renault_ФотографииАвтомобилей.СоздатьНаборЗаписей();
		НаборЗаписиФотографии.Отбор.Автомобиль.Установить(Объект.Владелец);
		НаборЗаписиФотографии.Прочитать();
		Объект.Фотографии.Очистить();
		Для Каждого Запись Из НаборЗаписиФотографии Цикл
			НоваяСтрока = Объект.Фотографии.Добавить();
			НоваяСтрока.Ракурс = Запись.Ракурс;
			НоваяСтрока.Фотография = Запись.Фотография;
		КонецЦикла;
	КонецЕсли;
	
	Если Объект.АктивностьОт <> ТекущаяДата() 
		и Объект.Статус <> Перечисления.Renault_СтатусыРазмещенияНаКаналах.Размещено
		и Объект.Статус <> Перечисления.Renault_СтатусыРазмещенияНаКаналах.Отправлено Тогда
		Объект.АктивностьОт = ТекущаяДата();
	КонецЕсли;
	
	Ответ = Неопределено;
	DMS_DataExchange.sendMessage(DMS_ОбщиеПовторныеФункции.ПараметрыHTTPСоединения(),,"UsedCars_serv.GetAllCatalog",,Ответ);
	
	Элементы.КодЦвета.СписокВыбора.Очистить();
	Элементы.СостояниеАвтомобиля.СписокВыбора.Очистить();
	Элементы.СтатусОбъявления.СписокВыбора.Очистить();

	Если ТипЗнч(Ответ) = Тип("Структура") Тогда
		Если Ответ.Свойство("color") И ТипЗнч(Ответ.color) = Тип("Массив") Тогда
			Для Каждого сЦвет из Ответ.color Цикл 
				Элементы.КодЦвета.СписокВыбора.Добавить(сЦвет.ID, сЦвет.name);
			КонецЦикла;
		КонецЕсли;
		
		Если Ответ.Свойство("condition") И ТипЗнч(Ответ.condition) = Тип("Массив") Тогда
			Для Каждого сСостояние из Ответ.condition Цикл
				Элементы.СостояниеАвтомобиля.СписокВыбора.Добавить(сСостояние.ID, сСостояние.name);
			КонецЦикла;
		КонецЕсли;
		
		Если Ответ.Свойство("status") И ТипЗнч(Ответ.status) = Тип("Массив") Тогда
			Для Каждого сСтатус из Ответ.status Цикл 
				Элементы.СтатусОбъявления.СписокВыбора.Добавить(сСтатус.ID, сСтатус.name);
			КонецЦикла;
		КонецЕсли;
	КонецЕсли;
	
	ПроверитьСоответствиеСтандартамФотографии();
	
	ПраваРено = ПараметрыСеанса.Renault_ПраваПользователя;
	ЭтоРОП = ПраваРено.РазрешитьРаботуСАрмРОП;
	ТекущийСотрудник = ПараметрыСеанса.Пользователь.Сотрудник;
	
КонецПроцедуры

&НаСервере
Процедура ПроверитьСоответствиеСтандартамФотографии()
	
	Результат = Истина;
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Renault_КаналыПродажТребованияКФотографиям.Ракурс,
		|	Renault_КаналыПродажТребованияКФотографиям.Обязательный
		|ИЗ
		|	Справочник.Renault_КаналыПродаж.ТребованияКФотографиям КАК Renault_КаналыПродажТребованияКФотографиям
		|ГДЕ
		|	Renault_КаналыПродажТребованияКФотографиям.Обязательный = &Обязательный";
		

	Запрос.УстановитьПараметр("Обязательный", Истина);
	
	Требования = Запрос.Выполнить().Выгрузить();
	
	Для Каждого СтрокаТребования Из Требования Цикл 
		
		ФотоНайдено = Ложь;
		Для Каждого СтрокаФото Из Объект.Фотографии Цикл
			Если СтрокаФото.Ракурс = СтрокаТребования.Ракурс Тогда
				ФотоНайдено = Истина;
			КонецЕсли;
		КонецЦикла;
		
		Если Не ФотоНайдено Тогда
			Результат = Ложь;
			Прервать;
		КонецЕсли;
		
	КонецЦикла;
		
	Если Результат Тогда
		Элементы.ДекорацияФотографииСоотвествиеСтандартам.Заголовок = "Количество и ракурсы фотографий соответствуют стандартам канала.";
	Иначе
		Элементы.ДекорацияФотографииСоотвествиеСтандартам.Заголовок = "Количество и ракурсы фотографий не соответствуют стандартам канала.";
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ФотографииПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	
	Отказ = Истина;
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Автомобиль", Объект.Владелец);
	
	ОткрытьФорму("РегистрСведений.Renault_ФотографииАвтомобилей.ФормаЗаписи", ПараметрыФормы);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "ЗаписьФотографии" Тогда
		НоваяСтрока = Объект.Фотографии.Добавить();
		НоваяСтрока.Ракурс = Параметр.Ракурс;
		НоваяСтрока.Фотография = Параметр.Фотография;
		ПроверитьСоответствиеСтандартамФотографии();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ФотографииВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	Если Поле.Имя = "ФотографииФотография" Тогда
		СтандартнаяОбработка = Ложь;
		ТекущиеДанные = Элементы.фотографии.ТекущиеДанные;
		Если ТекущиеДанные = Неопределено Тогда
			Возврат;
		КонецЕсли;
		ИмяФайла = ПолучитьИмяВременногоФайла("jpeg");
		ДвоичныеДанные = ПолучитьДвоичныеДанныеФотографии(ТекущиеДанные.Фотография);
		ДвоичныеДанные.Записать(ИмяФайла);
		ЗапуститьПриложение(ИмяФайла);
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьДвоичныеДанныеФотографии(Фотография)
	
	Возврат Фотография.Фотография.Получить();
	
КонецФункции

&НаКлиенте
Процедура ФотографииПриИзменении(Элемент)
	ПроверитьСоответствиеСтандартамФотографии();
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	Объект.Наименование = "" + Строка(Объект.Владелец);
	Объект.Статус = ПредопределенноеЗначение("Перечисление.Renault_СтатусыРазмещенияНаКаналах.Черновик");
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьДоступностьОтправки()
	
	//Элементы.ФормаОтправитьВКанал.Доступность
	//	= (Объект.Статус = ПредопределенноеЗначение("Перечисление.Renault_СтатусыРазмещенияНаКаналах.ГотовоКОтправке"));
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	УстановитьДоступностьОтправки();
	УстановитьДоступностьСогласованияЦены();
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	УстановитьДоступностьОтправки();
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьДоступностьСогласованияЦены()
	
	Элементы.ЦенаПродажиСогласоватьЦену.Доступность = ЭтоРОП;	
	
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьВсеФотографииАвтомобиля(Команда)
	ЗагрузитьВсеФотографииАвтомобиляНаСервере();
КонецПроцедуры

&НаСервере
Процедура ЗагрузитьВсеФотографииАвтомобиляНаСервере()
	
	НаборЗаписиФотографии = РегистрыСведений.Renault_ФотографииАвтомобилей.СоздатьНаборЗаписей();
	НаборЗаписиФотографии.Отбор.Автомобиль.Установить(Объект.Владелец);
	НаборЗаписиФотографии.Прочитать();
	Объект.Фотографии.Очистить();
	Для Каждого Запись Из НаборЗаписиФотографии Цикл
		НоваяСтрока = Объект.Фотографии.Добавить();
		НоваяСтрока.Ракурс = Запись.Ракурс;
		НоваяСтрока.Фотография = Запись.Фотография;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ЦенаПродажиПередУдалением(Элемент, Отказ)
	
	Если Не ЭтоРОП Тогда
		Отказ = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СогласоватьЦену(Команда)
	
	ТекущиеДанные = Элементы.ЦенаПродажи.ТекущиеДанные;
	Если ЗначениеЗаполнено(ТекущиеДанные.ДатаСогласования) Тогда
		Возврат;
	КонецЕсли;
	
	ТекущиеДанные.ДатаСогласования = ТекущаяДата();
	ТекущиеДанные.Согласовал = ТекущийСотрудник;
	
КонецПроцедуры

&НаКлиенте
Процедура ЦенаПродажиПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	
	Отказ = Истина;
	НоваяСтрока = Объект.ЦенаПродажи.Добавить();
	НоваяСтрока.ДатаУстановки = ТекущаяДата();
	НоваяСтрока.Автор = ТекущийСотрудник;
	
КонецПроцедуры

&НаКлиенте
Процедура ЦенаПродажиПриАктивизацииСтроки(Элемент)
	
	ТекущиеДанные = Элементы.ЦенаПродажи.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Элементы.ЦенаПродажиЦена.Доступность = Истина;
	Элементы.ЦенаПродажиПричинаИзменения.Доступность = Истина;
	
	Если ЗначениеЗаполнено(ТекущиеДанные.ДатаСогласования) Тогда
		Элементы.ЦенаПродажиЦена.Доступность = Ложь;
		Элементы.ЦенаПродажиПричинаИзменения.Доступность = Ложь;
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Процедура ПросмотретьФайлДляОтправки(Команда)
	
	ДвоичныеДанные = ПолучитьДвоичныеДанныеФайла(Объект.Ссылка);
	Если ДвоичныеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	ИмяФайла = ПолучитьИмяВременногоФайла("xml");
	ДвоичныеДанные.Записать(ИмяФайла);
	ЗапуститьПриложение(ИмяФайла);
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьДвоичныеДанныеФайла(Ссылка)
	
	Возврат Ссылка.Хранилище.Получить();	
	
КонецФункции

&НаКлиенте
Процедура ОтправитьВКанал(Команда)
	ОтправитьВКаналНаСервере();
КонецПроцедуры

&НаСервере
Процедура ОтправитьВКаналНаСервере()
	
	Записать(); 
	Если не ПроверитьНаВозможностьОтправки () Тогда
		Возврат;
	КонецЕсли;
	
	сОтвет = Справочники.Renault_РазмещениеАвтоНаКанале.СформироватьФайл(Объект.Ссылка);
	Если сОтвет.Ошибка Тогда
		Сообщить("Файл не был сформирован. Проверьте наличие Заяки на трейд-ин для данного авто!");
		Возврат;
	Иначе
		Ответ = Неопределено;
		DMS_DataExchange.sendMessage(DMS_ОбщиеПовторныеФункции.ПараметрыHTTPСоединения(),,"UsedCars_serv.PostAdvert",DMS_DataExchange.newPackage(сОтвет), Ответ);
	КонецЕсли;
	Прочитать();
	Объект.ДатаОтправкиНаКанал = ТекущаяДата();
	Объект.Активно = Истина;
	Записать();
	
КонецПроцедуры

&НаСервере
Функция ПроверитьНаВозможностьОтправки ()
	
	Если Объект.ЗаявкаТрейдИн.РучнойВвод Тогда
		Сообщить("Автомобиль в заявке на трейд-ин введен вручную. Автоматическая публикация не возможна.");
		Возврат Ложь;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Объект.СтатусОбъявления) Тогда
		Сообщить("Не заполнен статус объявления");
		Возврат Ложь;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Объект.АктивностьДо) Тогда
		Сообщить("Не заполенна дата ""Активность до""");
		Возврат Ложь;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Объект.КодЦвета) Тогда
		Сообщить("Не заполнен цвет по класификатору");
		Возврат Ложь;
	КонецЕсли;
	
	Если не ЗначениеЗаполнено(Объект.СостояниеАвтомобиля) Тогда
		Сообщить("Не заполнено состояние автомобиля");
		Возврат Ложь;
	КонецЕсли;
	
	Возврат Истина;
КонецФункции

&НаСервере
Процедура УдалитьПубликациюНаСервере()
	Ответ = Неопределено;
	сПараметры = Новый Структура;
	сПараметры.Вставить("GUID", Строка(Объект.Ссылка.УникальныйИдентификатор()));
	DMS_DataExchange.sendMessage(DMS_ОбщиеПовторныеФункции.ПараметрыHTTPСоединения(),,"UsedCars_serv.DeleteAdvert", DMS_DataExchange.newPackage(сПараметры), Ответ);
	Прочитать();
	Объект.ДатаОтправкиНаКанал = Дата(1,1,1);
	Объект.Активно = Ложь;
	Записать();
КонецПроцедуры

&НаКлиенте
Процедура УдалитьПубликацию(Команда)
	УдалитьПубликациюНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура АктивностьДоПриИзменении(Элемент)
	Если Объект.АктивностьДо < Объект.АктивностьОт Тогда
		Объект.АктивностьДо = Дата(1,1,1);
		Сообщить("Дата не может быть меньше даты актуальности от");
	КонецЕсли;
КонецПроцедуры
