
Процедура ПриЗаписи(Отказ, Замещение)
	
	Для Каждого Запись Из ЭтотОбъект Цикл
		СоздатьЗадачу(Запись);
	КонецЦикла
	
КонецПроцедуры

Процедура СоздатьЗадачу(Запись)
	
	Если Renault_ЗадачаУжеЕсть(Запись.Обращение) Тогда
		
		Возврат;
		
	КонецЕсли;
	
	Док = Документы.Renault_Задачи.СоздатьДокумент();
	Док.Автор = ПараметрыСеанса.Пользователь;
	Док.ВидЗадачи = Справочники.Renault_ТипыЗадач.СвязатьсяСКлиентомПовреждения;
	Док.Комментарий = "" + Строка(Запись.Автомобиль) + ", " + Запись.ЗонаПовреждения + ?(Запись.Комментарий="", "", ", " + Запись.Комментарий);
	Док.ДокументОснование = Запись.Обращение;
	Док.Приоритет = Перечисления.DMS_ВариантыВажностиЗадачи.Обычная;
	Док.Дата = ТекущаяДата();
	Для Каждого Пользователь Из ПользователиКузовногоРемонта() Цикл
		Стр = Док.Пользователи.Добавить();
		Стр.Пользователь = Пользователь;
		Стр.СостояниеЗадачи = Перечисления.СостоянияСобытий.Запланировано;
		Стр.ДатаНачалаПлан = ТекущаяДата();
		Стр.ДатаОкончанияПлан = ТекущаяДата();
		Стр.Пояснение = "Связаться с клиентов по кузовным повреждениям";
	КонецЦикла;
	
	Док.Записать();
	
КонецПроцедуры

Функция ПользователиКузовногоРемонта()
	
	Запрос=Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Пользователи.Ссылка
	|ИЗ
	|	Справочник.Пользователи КАК Пользователи
	|ГДЕ
	|	Пользователи.Сотрудник В
	|			(ВЫБРАТЬ
	|				Справочник.Сотрудники.Ссылка КАК Сотрудник
	|			ИЗ
	|				Справочник.Сотрудники
	|			ГДЕ
	|				НЕ Справочник.Сотрудники.ПометкаУдаления
	|				И Справочник.Сотрудники.Подразделение В
	|					(ВЫБРАТЬ
	|						Справочник.CRM_Отделы.Подразделения.Подразделение
	|					ИЗ
	|						Справочник.CRM_Отделы.Подразделения
	|					ГДЕ
	|						Справочник.CRM_Отделы.Подразделения.Ссылка.КлассификацияRenault = ЗНАЧЕНИЕ(Перечисление.CRM_КлассификацияОтделов.ОтделКузовногоРемонта)))";
	
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");
	
КонецФункции

Функция Renault_ЗадачаУжеЕсть(Приемка) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Renault_Задачи.Ссылка
	|ИЗ
	|	Документ.Renault_Задачи КАК Renault_Задачи
	|ГДЕ
	|	Renault_Задачи.ДокументОснование = &ДокументОснование
	|	И Renault_Задачи.ВидЗадачи = &ВидЗадачи";
	
	Запрос.УстановитьПараметр("ДокументОснование", Приемка);
	Запрос.УстановитьПараметр("ВидЗадачи", Справочники.Renault_ТипыЗадач.СвязатьсяСКлиентомПовреждения);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		
		Возврат Истина;
		
	КонецЕсли;
	
	Возврат Ложь;
	
КонецФункции
