
&НаКлиенте
Процедура кнВыполнить(Команда) 
	Если ВыполнитьВыгрузку() Тогда
		Сообщить("Выгрузка выполнена успешно",СтатусСообщения.Информация);
	Иначе
		Сообщить("Выгрузка не выполнена",СтатусСообщения.Внимание);
	КонецЕсли;	
КонецПроцедуры
Функция ВыполнитьВыгрузку()
	МассивДанных=СписокОбъектов.ВыгрузитьЗначения();
	Для Каждого ОбъектМД Из СписокПроизвольныхОбъектов.ВыгрузитьЗначения() Цикл МассивДанных.Добавить(ОбъектМД) КонецЦикла;	
	Возврат Renault_ПередачаДанныхВСторонниеСистемы.ВыгрузкаВыполнена(МассивДанных,Перезаписать)
КонецФункции 	

//интерфейс
&НаКлиенте
Процедура СписокПроизвольныхОбъектовЗначениеНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка=Ложь;
	ОткрытьФорму("ВнешнийИсточникДанных.Renault_ПередачаДанныхВСторонниеСистемы.Таблица.ОбъектыМД.ФормаВыбора",
		Новый Структура("РежимВыбора,БазаДанных",Истина,Renault_ПередачаДанныхВСторонниеСистемы.ТекущаяБазаДанных()),
		ЭтаФорма,УникальныйИдентификатор,,,Новый ОписаниеОповещения("ВыборОбъектаМД",ЭтаФорма));
КонецПроцедуры

Процедура ВыборОбъектаМД(Парам1,Парам2) Экспорт
	СписокПроизвольныхОбъектов.Добавить(Парам1)//,,,Картинка(Парам1.Имя))
КонецПроцедуры	

&НаКлиенте
Процедура СписокПроизвольныхОбъектовПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	Отказ=Истина;
	ОткрытьФорму("ВнешнийИсточникДанных.Renault_ПередачаДанныхВСторонниеСистемы.Таблица.ОбъектыМД.ФормаВыбора",
		Новый Структура("РежимВыбора,БазаДанных",Истина,Renault_ПередачаДанныхВСторонниеСистемы.ТекущаяБазаДанных()),
		ЭтаФорма,УникальныйИдентификатор,,,Новый ОписаниеОповещения("ВыборОбъектаМД",ЭтаФорма));
КонецПроцедуры

&НаКлиенте
Процедура СписокПроизвольныхОбъектовЗначениеПриИзменении(Элемент)
	Элемент.Родитель.ТекущиеДанные.Картинка=Картинка(Элемент.Родитель.ТекущиеДанные.Значение.Имя)
КонецПроцедуры

Функция Картинка(ИмяМД)
	Тип=Renault_ПередачаДанныхВСторонниеСистемы.СтруктураМетаданных(ИмяМД).Тип;
	Возврат БиблиотекаКартинок[Тип]
КонецФункции	

