
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Параметры.Свойство("ОтчетВладелец", ОтчетВладелец);
	
	МассивКлиентов = Параметры.Клиенты.ВыгрузитьЗначения();
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	Renault_Трафик.Период КАК Дата,
	               |	NULL КАК Ид,
	               |	Renault_Трафик.ТипТрафика КАК Событие,
	               |	"""" КАК Примечание,
	               |	Renault_Трафик.Менеджер
	               |ИЗ
	               |	РегистрСведений.Renault_Трафик КАК Renault_Трафик
	               |ГДЕ
	               |	Renault_Трафик.Клиент В(&МассивКлиентов)
	               |	И Renault_Трафик.Отдел.ПродажаАвтомобилей = ИСТИНА
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	Renault_РабочиеЛисты.ДатаID,
	               |	Renault_РабочиеЛисты.IDK,
	               |	""Рабочий лист"",
	               |	"""",
	               |	Renault_РабочиеЛисты.Сотрудник
	               |ИЗ
	               |	РегистрСведений.Renault_РабочиеЛисты КАК Renault_РабочиеЛисты
	               |ГДЕ
	               |	Renault_РабочиеЛисты.Клиент В(&МассивКлиентов)
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	CRM_КоммерческоеПредложениеСостав.Ссылка.Дата,
	               |	CRM_КоммерческоеПредложениеСостав.Ссылка,
	               |	""Коммерческое предложение"",
	               |	CRM_КоммерческоеПредложениеСостав.Конфигурация.Модель,
	               |	Renault_РабочиеЛисты.Сотрудник
	               |ИЗ
	               |	Документ.CRM_КоммерческоеПредложение.Состав КАК CRM_КоммерческоеПредложениеСостав
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.Renault_РабочиеЛисты КАК Renault_РабочиеЛисты
	               |		ПО CRM_КоммерческоеПредложениеСостав.Ссылка.РабочийЛист = Renault_РабочиеЛисты.IDK
	               |ГДЕ
	               |	Renault_РабочиеЛисты.Клиент В(&МассивКлиентов)
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	CRM_ЗаписиНаТестДрайв.ДатаНачала,
	               |	CRM_ЗаписиНаТестДрайв.IDK,
	               |	""Тест-драйв"",
	               |	CRM_ЗаписиНаТестДрайв.Автомобиль.Модель,
	               |	Renault_РабочиеЛисты.Сотрудник
	               |ИЗ
	               |	РегистрСведений.CRM_ЗаписиНаТестДрайв КАК CRM_ЗаписиНаТестДрайв
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.Renault_РабочиеЛисты КАК Renault_РабочиеЛисты
	               |		ПО CRM_ЗаписиНаТестДрайв.IDK = Renault_РабочиеЛисты.IDK
	               |ГДЕ
	               |	Renault_РабочиеЛисты.Клиент В(&МассивКлиентов)
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	Renault_Договор.Дата,
	               |	Renault_Договор.Ссылка,
	               |	""Договор на продажу а/м"",
	               |	Renault_Договор.СтатусДоговора,
	               |	Renault_РабочиеЛисты.Сотрудник
	               |ИЗ
	               |	Документ.Renault_Договор КАК Renault_Договор
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.Renault_РабочиеЛисты КАК Renault_РабочиеЛисты
	               |		ПО Renault_Договор.РабочийЛист = Renault_РабочиеЛисты.IDK
	               |ГДЕ
	               |	Renault_РабочиеЛисты.Клиент В(&МассивКлиентов)";
	Запрос.УстановитьПараметр("МассивКлиентов", МассивКлиентов);
	ТаблицаВзаимодействия.Загрузить(Запрос.Выполнить().Выгрузить());
	
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаВзаимодействияВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	Если Элементы.ТаблицаВзаимодействия.ТекущиеДанные.Событие = "Рабочий лист" Тогда
		//Откроем рабочий лист		
		КлючЛиста = ПолучитьКлючРабочегоЛиста(Элементы.ТаблицаВзаимодействия.ТекущиеДанные.Ид);
		Если КлючЛиста = Неопределено Тогда
			Возврат;
		КонецЕсли;
		ПараметрыФормы = Новый Структура;
		ПараметрыФормы.Вставить("Ключ", КлючЛиста);
		ОткрытьФорму("РегистрСведений.Renault_РабочиеЛисты.Форма.ФормаЗаписи", ПараметрыФормы);
	ИначеЕсли Элементы.ТаблицаВзаимодействия.ТекущиеДанные.Событие = "Договор на продажу а/м" 
		Или Элементы.ТаблицаВзаимодействия.ТекущиеДанные.Событие = "Коммерческое предложени" Тогда	
		
		ОткрытьЗначение(Элементы.ТаблицаВзаимодействия.ТекущиеДанные.Ид);
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьКлючРабочегоЛиста(Ид)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Renault_РабочиеЛисты.ID,
		|	Renault_РабочиеЛисты.IDK,
		|	Renault_РабочиеЛисты.Отдел,
		|	Renault_РабочиеЛисты.Подразделение,
		|	Renault_РабочиеЛисты.ДилерскийЦентр
		|ИЗ
		|	РегистрСведений.Renault_РабочиеЛисты КАК Renault_РабочиеЛисты
		|ГДЕ
		|	Renault_РабочиеЛисты.IDK = &IDK";
	Запрос.УстановитьПараметр("IDK", Ид);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Не Выборка.Следующий() Тогда
		Возврат Неопределено;
	КонецЕсли;
	СтруктураОтбора = Новый Структура;
	СтруктураОтбора.Вставить("ID", Выборка.ID);
	СтруктураОтбора.Вставить("IDK", Выборка.IDK);
	СтруктураОтбора.Вставить("Отдел", Выборка.Отдел);
	СтруктураОтбора.Вставить("Подразделение", Выборка.Подразделение);
	СтруктураОтбора.Вставить("ДилерскийЦентр", Выборка.ДилерскийЦентр);
	
	КлючЛиста = РегистрыСведений.Renault_РабочиеЛисты.СоздатьКлючЗаписи(СтруктураОтбора);
	Возврат КлючЛиста;
	
КонецФункции

&НаКлиенте
Процедура ПриЗакрытии()
	
	Если ОтчетВладелец = "Renault_ОтчетПоКлиентамЗаписанныхНаТекущуюДату" Тогда
		Оповестить("ФормаВзаимодействияСОтделомПродаж");
	КонецЕсли;
	
КонецПроцедуры


