//Честный_знак_10.10.2024

Процедура ПроведениеДокументовСМаркировкойОбработкаПроведения(Источник, Отказ, РежимПроведения) Экспорт
	
	Если Не Константы.Проверки_По_Честному_Знаку.Получить() Тогда 
		Возврат;
	КонецЕсли;
	
	Тип_Источника = ТипЗнч(Источник);
	
	Если Тип_Источника = Тип("ДокументОбъект.ПоступлениеТоваров") Тогда	
		Если ТипЗнч(Источник.ДокументОснование) = Тип("ДокументСсылка.РеализацияТоваров") Тогда
			Возврат;     //Пропуск при перепродажах
		КонецЕсли;
		Модуль_ГВС.Запрет_Проведения_БУ_Шин(Отказ,Источник.Товары);
		Модуль_ГВС.Проведение_С_Маркированной_Номенклатурой(Источник,Отказ);	
		Возврат;		
	КонецЕсли; 
	
	Если Тип_Источника = Тип("ДокументОбъект.ПеремещениеТоваровВПроизводство") ИЛИ Тип_Источника = Тип("ДокументОбъект.РеализацияТоваров")Тогда
		Параметры = Модуль_ГВС.Присутствие_Маркированная_Номенклатура(Источник.Товары);
		Если Параметры.Маркировка_Присутствует Тогда
			Количество_Маркированной_Номенклатуры = Параметры.Сумма_Количество_В_Позициях;
			Если Количество_Маркированной_Номенклатуры <> Источник.КодыМаркировки.Количество() Тогда
				//Бондаренко++ 20260130
				Если РольДоступна("ПолныеПрава") ИЛИ РольДоступна("СМ_ИТОтдел") Тогда
					Сообщить("При проведении обнаружены ошибки маркировки!!!"); 				
 				Иначе	
				//Бондаренко-- 20260130		
					Сообщить("Проведение отменено,так как осутствует маркировка!!!"); 
					Отказ = Истина;
					Возврат;
				//Бондаренко++ 20260130     
				КонецЕсли;					
				//Бондаренко-- 20260130
			КонецЕсли;		
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

//Честный_знак_10.10.2024
