#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

////#Область СлужебныеПроцедурыИФункции

// Процедура добавляет запись в регистр по переданным значениям структуры.
Процедура ДобавитьЗапись(СтруктураЗаписи) Экспорт
	
	DMS_ОбменДаннымиСДМСервер.ДобавитьЗаписьВРегистрСведений(СтруктураЗаписи, "DMS_СостоянияОбменовДанными");
	
КонецПроцедуры

Процедура УдалитьЗапись(СтруктураЗаписи) Экспорт
	
	DMS_ОбменДаннымиСДМСервер.УдалитьНаборЗаписейВРегистреСведений(СтруктураЗаписи, "DMS_СостоянияОбменовДанными");
	
КонецПроцедуры

////#КонецОбласти

#КонецЕсли