
&НаКлиенте
Процедура ВыполнитьНажатие(Команда)
	Ошибка = "";
	Если Renault_внОбщийМодуль.СозданиеБДИсторииНаСервере(ТипБД, СерверВнешнейИБ, ИмяВнешнейИБ, ПользовательВнешнейИБ, ПарольВнешнейИБ, Ошибка) Тогда
		Предупреждение("База данных истории создана!");
		Закрыть(Истина);
	Иначе
		Предупреждение(Ошибка);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПолучитьСкриптДляСозданияВручную(Команда)
	
	ТД = Новый ТекстовыйДокумент;
	ТД.ДобавитьСтроку(Renault_внОбщийМодуль.ПолучитьТекстЗапросаСозданияБД(ИмяВнешнейИБ));
	ТД.Показать("Запрос SQL для создания БД журнала на сервере");

КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ТипБД = Перечисления.Renault_внТипБД.MSSQL;
КонецПроцедуры

&НаКлиенте
Процедура ТипБДОчистка(Элемент, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
КонецПроцедуры
