//Козлов Е.А. Начало 02.06.2016 Процедуры и функции для функционала Трейд-ин в форме записи регистра сведений Рабочие листы
//Функции исправить
Функция СессияДляТрейдИн() Экспорт
	ВебСервис = Renault_СПробегомСервер.ПолучитьВебСервисПодержанныхАвто();
	
	СессияТрейдИн = Renault_СПробегомСервер.ПолучитьИДСессии(ВебСервис);
	
	Возврат СессияТрейдИн;
КонецФункции

Функция ЗагрузитьСправочникиТрейдИн(Сессия) Экспорт	
	Выборка = Справочники.Renault_Used_ТипыАвтомобилей.Выбрать();
	Если Не Выборка.Следующий() Тогда
		Renault_СПробегомСервер.ЗагрузитьВсеСправочники(Сессия);
	КонецЕсли;
КонецФункции
	
Функция СписокПроизводителейДляТрейдИн(Сессия, ТипАвтомобиля) Экспорт
	ВебСервис = Renault_СПробегомСервер.ПолучитьВебСервисПодержанныхАвто();
	
	Производители = Renault_СПробегомСервер.ПолучитьСписокПроизводителей(Сессия, ТипАвтомобиля, ВебСервис);
	
	Возврат Производители;
КонецФункции
	
Функция СписокГодовВыпускаДляТрейдИн(Сессия, ТипАвтомобиля, Производитель) Экспорт
	ВебСервис = Renault_СПробегомСервер.ПолучитьВебСервисПодержанныхАвто();
	
	ГодыВыпуска = Renault_СПробегомСервер.ПолучитьСписокГодовВыпуска(Сессия, ТипАвтомобиля, Производитель, ВебСервис);
	
	Возврат ГодыВыпуска;
КонецФункции

Функция СписокМоделейДляТрейдИн(Сессия, ТипАвтомобиля, Производитель, МесяцВыпуска, ГодВыпуска) Экспорт
	ВебСервис = Renault_СПробегомСервер.ПолучитьВебСервисПодержанныхАвто();
	
	Модели = Renault_СПробегомСервер.ПолучитьСписокМоделей(Сессия, ТипАвтомобиля, Производитель, МесяцВыпуска, ГодВыпуска, ВебСервис);
	
	Возврат Модели;
КонецФункции

Функция СписокКузововДляТрейдИн(Сессия, ТипАвтомобиля, Производитель, МесяцВыпуска, ГодВыпуска, Модель) Экспорт
	ВебСервис = Renault_СПробегомСервер.ПолучитьВебСервисПодержанныхАвто();

	Кузова = Renault_СПробегомСервер.ПолучитьСписокТиповКузовов(Сессия, ТипАвтомобиля, Производитель, МесяцВыпуска, ГодВыпуска, Модель, ВебСервис);
	
	Возврат Кузова;
КонецФункции

Функция СписокДвигателейДляТрейдИн(Сессия, ТипАвтомобиля, Производитель, МесяцВыпуска, ГодВыпуска, Модель, Кузов) Экспорт
	ВебСервис = Renault_СПробегомСервер.ПолучитьВебСервисПодержанныхАвто();
	
	Двигатели = Renault_СПробегомСервер.ПолучитьСписокДвигателей(Сессия, ТипАвтомобиля, Производитель, МесяцВыпуска, ГодВыпуска, Модель, Кузов, ВебСервис);
	
	Возврат Двигатели;
КонецФункции
	
Функция СписокКППДляТрейдИн(Сессия, ТипАвтомобиля, Производитель, МесяцВыпуска, ГодВыпуска, Модель, Кузов, Двигатель) Экспорт
	ВебСервис = Renault_СПробегомСервер.ПолучитьВебСервисПодержанныхАвто();
	
	КПП = Renault_СПробегомСервер.ПолучитьСписокТрансмиссий(Сессия, ТипАвтомобиля, Производитель, МесяцВыпуска, ГодВыпуска, Модель, Кузов, Двигатель, ВебСервис);
	
	Возврат КПП;
КонецФункции

Функция СписокМодификацийДляТрейдИн(Сессия, ТипАвтомобиля, Производитель, МесяцВыпуска, ГодВыпуска, Модель, Кузов, Двигатель, КПП) Экспорт
	ВебСервис = Renault_СПробегомСервер.ПолучитьВебСервисПодержанныхАвто();
	
	Модификации = Renault_СПробегомСервер.ПолучитьСписокМодификаций(Сессия, ТипАвтомобиля, Производитель, МесяцВыпуска, ГодВыпуска, Модель, Кузов, Двигатель, КПП, ВебСервис);
	
	Возврат Модификации;
КонецФункции

Функция СписокОпцийДляТрейдИн(Сессия, Модификация) Экспорт
	ВебСервис = Renault_СПробегомСервер.ПолучитьВебСервисПодержанныхАвто();
	
	Опции = Renault_СПробегомСервер.ПолучитьСписокОпций(Сессия, Модификация, ВебСервис);
	
	Возврат Опции;
КонецФункции

Процедура ВыполнитьОценкуЗаявкиНаТрейдИн(Сессия, ЗаявкаНаТрейдИн) Экспорт
	ЗаявкаОбъект = ЗаявкаНаТрейдИн.ПолучитьОбъект();
	
	Renault_СПробегомСервер.ВыполнитьОценку(Сессия, ЗаявкаОбъект);
	
	ЗаявкаОбъект.Записать();
КонецПроцедуры
//Козлов Е.А. Конец