Процедура УстановитьПараметры()
	
	ПериодОтчета = КомпоновщикНастроек.Настройки.ПараметрыДанных.Элементы.Найти("ПериодОтчета");
	ДатаН = КомпоновщикНастроек.Настройки.ПараметрыДанных.Элементы.Найти("ДатаН");
	ДатаК = КомпоновщикНастроек.Настройки.ПараметрыДанных.Элементы.Найти("ДатаК");
 	
 	Если обЗначениеНеЗаполнено(ПериодОтчета.Значение) Тогда
		ПериодОтчета.Значение.ДатаНачала    = НачалоДня(ТекущаяДата()-2678000);
		ПериодОтчета.Значение.ДатаОкончания = НачалоДня(ТекущаяДата()        );
 	КонецЕсли;
	
	ДатаН.Значение = ПериодОтчета.Значение.ДатаНачала;
	ДатаК.Значение = ПериодОтчета.Значение.ДатаОкончания;			

КонецПроцедуры

Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка) Экспорт
	
	УстановитьПараметры();
	
	ОтчетыСервер.ВывестиОтчет(ЭтотОбъект, СхемаКомпоновкиДанных, КомпоновщикНастроек.Настройки, ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка);
	
КонецПроцедуры
