
&НаКлиенте
Процедура Нормализовать(Команда)
	
	НормализоватьНаСервере();
	
	Элементы.Список.Обновить();
	
КонецПроцедуры

&НаКлиенте
Процедура Очистить(Команда)
	
	ОчиститьНаСервере();
	
	Элементы.Список.Обновить();
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура НормализоватьНаСервере()
	РегистрыСведений.Renault_НормализованныеКонтактыДляПоиска.НормализоватьВсеКонтакты();
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ОчиститьНаСервере()
	
	Набор = РегистрыСведений.Renault_НормализованныеКонтактыДляПоиска.СоздатьНаборЗаписей();
	
	Набор.Очистить();
	
	Набор.Записать();
	
КонецПроцедуры

