Процедура ПриУстановкеНовогоКода(СтандартнаяОбработка, Префикс)
	Префикс = DMS_ОбщегоНазначенияСервер.ПолучитьПрефикс();
	//Если НЕ спПриУстановкеНовогоКода(ЭтотОбъект, СтандартнаяОбработка, Префикс) Тогда Возврат; КонецЕсли;
КонецПроцедуры

Процедура ПередЗаписью(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	#Если Клиент Тогда
		
		ОтборДЦ = Renault_РаботаСПравамиПользователя.ДилерскийЦентрПоУмолчанию(ПараметрыСеанса.Пользователь);
		
		// Проверка на доступ к работе с АРМ
		Если НЕ Renault_РаботаСПравамиПользователя.ЕстьПравоИзменятьПрограммуЛояльности(ПараметрыСеанса.Пользователь) Тогда
			Предупреждение("У вас нет прав на изменение программы лояльности.");
			Отказ=Истина;
			Возврат;
		КонецЕсли;
		
	#КонецЕсли
	
КонецПроцедуры  

Процедура ПриЗаписи(Отказ)
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
КонецПроцедуры
