Процедура ВыгрузитьДляХарабоВЭксЭмЭльМодуль() Экспорт
	
	#Если Клиент Тогда
		СМГ_Сообщить("Выгрузка начата: "+ТекущаяДата()); 
	#КонецЕсли
	
	Выборка =  Справочники.ПодразделенияКомпании.Выбрать(Справочники.ПодразделенияКомпании.ОсновноеПодразделение,,,);
	
	Пока Выборка.Следующий() Цикл 
		Если Выборка.Ссылка.ПометкаУдаления Тогда
			Продолжить;		
		КонецЕсли;
		//Если Выборка.Ссылка.МаркиАвтомобилей.Количество() = 0 Тогда
		//	Продолжить;		
		//КонецЕсли;
		//Сообщить(СокрЛП(Выборка.Ссылка)+", Родитель: "+СокрЛП(Выборка.Ссылка.Родитель));	
		СформироватьЭксЭмЭльФайлИВыгрузитьНаФТП(Выборка.Ссылка);
	КонецЦикла;
	
	#Если Клиент Тогда
		СМГ_Сообщить("Выгрузка завершена: "+ТекущаяДата());	
	#КонецЕсли
	
	
КонецПроцедуры  

Процедура СформироватьЭксЭмЭльФайлИВыгрузитьНаФТП(ТекПодр) Экспорт

	СписокПодразделений = ПолучитьСписокПодразделенийСДочернимиИзЗапроса(ТекПодр);	
	
	//ТекЭлСписка = СписокПодразделений.ВыбратьЭлемент("Выберите",ТекЭлСписка);
	
	Если СписокПодразделений.Количество() > 0 Тогда
		
		//СписокМарок = ПолучитьСписокМарокАвто(ТекПодр);
		
		СписокМарок = Неопределено;
		
		//Если СписокМарок.Количество() > 0 Тогда
		
		ФайлXML = ПолучитьИмяВременногоФайла("XML"); 
		
		НормИмяФайла = СокрЛП(ТекПодр);
		НормИмяФайла = СтрокаЛатиницей(НормИмяФайла);
		ФайлПолучательXML = Нрег(НормИмяФайла+".XML");
		
		ПолучитьXMLОбъявленийTDealer(СписокПодразделений, СписокМарок, ФайлXML, ТекПодр);  
		
		Если НЕ обЗначениеНеЗаполнено(ФайлXML) Тогда
			
			//АдресFTP = "ftp://sm01c/1C/"; 
			АдресFTP = "31.31.196.113";
			ИмяПользователя = "u0094666_adaptiv";
			ПарольПользователя = "GaB7psMF44%";
			
			Попытка
				Соединение = ПодключитьсяКFTPСерверу(АдресFTP,ИмяПользователя,ПарольПользователя);
			Исключение
				СМГ_Сообщить("Ошибка подключения к ftp",СтатусСообщения.ОченьВажное);
				Возврат;
			КонецПопытки;
			
			СМГ_Сообщить("Подключение к ftp выполнено",СтатусСообщения.Информация);
			
			Попытка
				Соединение.Записать(ФайлXML, ФайлПолучательXML);
			Исключение
				СМГ_Сообщить("Ошибка копирования на ftp",СтатусСообщения.ОченьВажное);
				Возврат;
			КонецПопытки;                                                          
			
			СМГ_Сообщить("Копирование на ftp выполнено",СтатусСообщения.Информация);
			
		КонецЕсли; 
		
		//	ФайлДляУдаления = Новый Файл(ФайлXML);
			
		//	Если ФайлДляУдаления.Существует() Тогда
				
		//		Попытка
		//			УдалитьФайлы(ФайлДляУдаления.Путь,ФайлДляУдаления.Имя);                                                         
		//		Исключение
		//		КонецПопытки;
		//		
		//	КонецЕсли;

 		//КонецЕсли;      
		
	КонецЕсли; 
 
КонецПроцедуры //СформироватьЭксЭмЭльФайл(ТекПодр)
 
Функция ПолучитьСписокПодразделенийСДочернимиИзЗапроса(ТекПодр) Экспорт
	
	СписокПодразделенийСДочерними = Новый СписокЗначений;
 	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ПодразделенияКомпании.Ссылка,
	|	ПодразделенияКомпании.Родитель.Код,
	|	ПодразделенияКомпании.Код
	|ИЗ
	|	Справочник.ПодразделенияКомпании КАК ПодразделенияКомпании
	|ГДЕ
	|	ПодразделенияКомпании.Родитель = &ТекПодр
	|	И НЕ ПодразделенияКомпании.ПометкаУдаления";
	
	Запрос.УстановитьПараметр("ТекПодр", ТекПодр);
	
	СписокПодразделенийСДочерними = Новый СписокЗначений;
	СписокПодразделенийСДочерними.ЗагрузитьЗначения(Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка"));
	
	Возврат СписокПодразделенийСДочерними; 
	
КонецФункции

Функция ПолучитьСписокМарокАвто(ТекПодр) Экспорт
	
	СЗ = Новый СписокЗначений;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ПодразделенияКомпанииМаркиАвтомобилей.Ссылка,
	|	ПодразделенияКомпанииМаркиАвтомобилей.Марка
	|ИЗ
	|	Справочник.ПодразделенияКомпании.МаркиАвтомобилей КАК ПодразделенияКомпанииМаркиАвтомобилей
	|ГДЕ
	|	ПодразделенияКомпанииМаркиАвтомобилей.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", ТекПодр);
	
	СЗ.ЗагрузитьЗначения(Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Марка"));
	
	Если СЗ.Количество() = 0 Тогда
		Если НЕ обЗначениеНеЗаполнено(ТекПодр.Родитель) Тогда
			СЗ = ПолучитьСписокМарокАвто(ТекПодр.Родитель);
			Если СЗ.Количество() > 0 Тогда
				Возврат СЗ;	 	
			КонецЕсли;
		Иначе
			Возврат СЗ;	 	
		КонецЕсли; 
	Иначе	
		Возврат СЗ;	 
	КонецЕсли; 
	
КонецФункции // ПолучитьСписокМарок()

Процедура ПолучитьXMLОбъявленийTDealer(СписокПодразделений, ДополнительныйСписокМарок, ФайлXML, ТекПодр) Экспорт
	
	//Бондаренко++ 20201030
	СписокАвтоТестДрайва = ПолучитьАвтомобилиДляТестДрайва();
	//Бондаренко-- 20201030
	
	ТЗ = Новый ТаблицаЗначений;
	
	Запрос = Новый Запрос;
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ОстаткиАвтомобилейОстатки.Автомобиль,
	|	ОстаткиАвтомобилейОстатки.Автомобиль.VIN КАК VIN,
	|	СУММА(ОстаткиАвтомобилейОстатки.КоличествоОстаток) КАК Остаток,
	|	ЦенаАвто.Цена + ЦенаАвто.Автомобиль.СтоимостьДопОборудования КАК Цена,
	|	ХарАвто.Значение КАК ВидАвто,
	|	ОстаткиАвтомобилейОстатки.СкладКомпании.Подразделение КАК Подразделение,
	|	ОстаткиАвтомобилейОстатки.СкладКомпании.Подразделение.ДилерскийЦентр КАК ДилерскийЦентр,
	|	ОстаткиАвтомобилейОстатки.Автомобиль.Модель.МодельАвтоРу.МаркаАвтоРу КАК МаркаАвтоРу,
	|	ОстаткиАвтомобилейОстатки.Автомобиль.Модель.МодельАвтоРу КАК МодельАвтоРу,
	|	ОстаткиАвтомобилейОстатки.Автомобиль.ВариантКомплектации.МодификацияАвтоРу КАК МодификацияАвтоРу,
	|	ОстаткиАвтомобилейОстатки.Автомобиль.ВариантКомплектации.КомплектацияАвтоРу КАК КомплектацияАвтоРу,
	|	ОстаткиАвтомобилейОстатки.Автомобиль.СпециальнаяЦена КАК СпециальнаяЦена,
	|	ОстаткиАвтомобилейОстатки.Автомобиль.СкидкаПриПокупкеВКредит КАК СкидкаПриПокупкеВКредит,
	|	ОстаткиАвтомобилейОстатки.Автомобиль.СкидкаПриСтраховании КАК СкидкаПриСтраховании,
	|	ОстаткиАвтомобилейОстатки.Автомобиль.СкидаПриПокупкеВТрейдИн КАК СкидаПриПокупкеВТрейдИн,
	|	ОстаткиАвтомобилейОстатки.Автомобиль.СкидкаМаксимальная КАК СкидкаМаксимальная,
	|	ОстаткиАвтомобилейОстатки.Автомобиль.Цвет.ЦветАвтоРу КАК ЦветАвтоРу,
	|	ОстаткиАвтомобилейОстатки.Автомобиль.Цвет.ОкраскаМеталлик КАК ОкраскаМеталлик,
	|	ОстаткиАвтомобилейОстатки.Автомобиль.ВариантКомплектации.Руль КАК Руль,
	|	ОстаткиАвтомобилейОстатки.Автомобиль.ВариантКомплектации.КоличествоДверей КАК КоличествоДверей,
	|	ОстаткиАвтомобилейОстатки.Автомобиль.Модель.КатегорияТС,
	|	ПробегиАвто.Значение КАК Пробег,
	|	ОстаткиАвтомобилейОстатки.Автомобиль.Состояние КАК Состояние,
	|	ОстаткиАвтомобилейОстатки.Автомобиль.КоличествоВладельцевПоПТС КАК КоличествоВладельцев,
	|	ОстаткиАвтомобилейОстатки.Автомобиль.ВариантКомплектации.ТипКузова.ТипКузоваАвтоРу КАК ТипКузоваВариантаКомплектации,
	|	ОстаткиАвтомобилейОстатки.Автомобиль.Модель.ТипКузова.ТипКузоваАвтоРу КАК ТипКузоваМодели,
	|	ОстаткиАвтомобилейОстатки.Автомобиль.Цвет.Артикул,
	|	ОстаткиАвтомобилейОстатки.Автомобиль.ВариантКомплектации.Артикул,
	|	""В наличии"" КАК Доступность
	|ИЗ
	|	РегистрНакопления.ОстаткиАвтомобилей.Остатки КАК ОстаткиАвтомобилейОстатки
	|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|			ЦеныАвтомобилейСрезПоследних.Цена КАК Цена,
	|			ЦеныАвтомобилейСрезПоследних.Автомобиль КАК Автомобиль,
	|			ЦеныАвтомобилейСрезПоследних.ВариантКомплектации КАК ВариантКомплектации,
	|			ЦеныАвтомобилейСрезПоследних.ТипЦен КАК ТипЦен
	|		ИЗ
	|			РегистрСведений.ЦеныАвтомобилей.СрезПоследних КАК ЦеныАвтомобилейСрезПоследних
	|		ГДЕ
	|			ЦеныАвтомобилейСрезПоследних.ТипЦен = ЗНАЧЕНИЕ(Справочник.ТипыЦен.ОсновнойТипЦенПродажи)) КАК ЦенаАвто
	|		ПО ОстаткиАвтомобилейОстатки.Автомобиль = ЦенаАвто.Автомобиль
	|			И ОстаткиАвтомобилейОстатки.Автомобиль.ВариантКомплектации = ЦенаАвто.Автомобиль.ВариантКомплектации
	|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|			АвтомобилиСрезПоследних.Автомобиль КАК Автомобиль,
	|			АвтомобилиСрезПоследних.ВидЗначения КАК ВидЗначения,
	|			АвтомобилиСрезПоследних.Значение КАК Значение
	|		ИЗ
	|			РегистрСведений.Автомобили.СрезПоследних КАК АвтомобилиСрезПоследних
	|		ГДЕ
	|			АвтомобилиСрезПоследних.ВидЗначения = ЗНАЧЕНИЕ(Перечисление.ДополнительнаяИнформацияАвтомобилей.ВидАвтомобиля)) КАК ХарАвто
	|		ПО ОстаткиАвтомобилейОстатки.Автомобиль = ХарАвто.Автомобиль
	|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ                                                                                 
	|			АвтомобилиСрезПоследних.Автомобиль КАК Автомобиль,
	|			АвтомобилиСрезПоследних.ВидЗначения КАК ВидЗначения,
	|			АвтомобилиСрезПоследних.Значение КАК Значение
	|		ИЗ
	|			РегистрСведений.Автомобили.СрезПоследних КАК АвтомобилиСрезПоследних
	|		ГДЕ
	|			АвтомобилиСрезПоследних.ВидЗначения = ЗНАЧЕНИЕ(Перечисление.ДополнительнаяИнформацияАвтомобилей.Пробег)) КАК ПробегиАвто
	|		ПО ОстаткиАвтомобилейОстатки.Автомобиль = ПробегиАвто.Автомобиль
	|ГДЕ
	|	ОстаткиАвтомобилейОстатки.КоличествоОстаток > 0
	|	И ХарАвто.Значение = ЗНАЧЕНИЕ(Перечисление.ВидАвтомобиля.Новый)
	|	И ОстаткиАвтомобилейОстатки.СкладКомпании.Подразделение В(&СписокПодразделений)
	|	И ОстаткиАвтомобилейОстатки.Автомобиль.Модель.КатегорияТС = ЗНАЧЕНИЕ(Справочник.КатегорииТранспортныхСредств.АвтомобилиЛегковые)
	|
	|СГРУППИРОВАТЬ ПО
	|	ОстаткиАвтомобилейОстатки.Автомобиль,
	|	ОстаткиАвтомобилейОстатки.Автомобиль.VIN,
	|	ХарАвто.Значение,
	|	ОстаткиАвтомобилейОстатки.СкладКомпании.Подразделение.ДилерскийЦентр,
	|	ОстаткиАвтомобилейОстатки.Автомобиль.Модель.МодельАвтоРу.МаркаАвтоРу,
	|	ОстаткиАвтомобилейОстатки.Автомобиль.Модель.МодельАвтоРу,
	|	ОстаткиАвтомобилейОстатки.Автомобиль.ВариантКомплектации.МодификацияАвтоРу,
	|	ОстаткиАвтомобилейОстатки.Автомобиль.СпециальнаяЦена,
	|	ОстаткиАвтомобилейОстатки.Автомобиль.СкидкаПриПокупкеВКредит,
	|	ОстаткиАвтомобилейОстатки.Автомобиль.СкидкаПриСтраховании,
	|	ОстаткиАвтомобилейОстатки.Автомобиль.СкидаПриПокупкеВТрейдИн,
	|	ОстаткиАвтомобилейОстатки.Автомобиль.СкидкаМаксимальная,
	|	ОстаткиАвтомобилейОстатки.Автомобиль.ВариантКомплектации.КомплектацияАвтоРу,
	|	ОстаткиАвтомобилейОстатки.Автомобиль.Цвет.ЦветАвтоРу,
	|	ОстаткиАвтомобилейОстатки.Автомобиль.Цвет.ОкраскаМеталлик,
	|	ОстаткиАвтомобилейОстатки.Автомобиль.ВариантКомплектации.Руль,
	|	ОстаткиАвтомобилейОстатки.Автомобиль.ВариантКомплектации.КоличествоДверей,
	|	ПробегиАвто.Значение,
	|	ОстаткиАвтомобилейОстатки.Автомобиль.Состояние,
	|	ОстаткиАвтомобилейОстатки.Автомобиль.КоличествоВладельцевПоПТС,
	|	ОстаткиАвтомобилейОстатки.Автомобиль.ВариантКомплектации.ТипКузова.ТипКузоваАвтоРу,
	|	ОстаткиАвтомобилейОстатки.СкладКомпании.Подразделение,
	|	ОстаткиАвтомобилейОстатки.Автомобиль.Модель.ТипКузова.ТипКузоваАвтоРу,
	|	ОстаткиАвтомобилейОстатки.Автомобиль.Цвет.Артикул,
	|	ОстаткиАвтомобилейОстатки.Автомобиль.ВариантКомплектации.Артикул,
	|	ОстаткиАвтомобилейОстатки.Автомобиль.Модель.КатегорияТС,
	|	ЦенаАвто.Цена + ЦенаАвто.Автомобиль.СтоимостьДопОборудования
	|
	|УПОРЯДОЧИТЬ ПО
	|	VIN";
	
	Запрос.УстановитьПараметр("СписокПодразделений",СписокПодразделений);
	
	ТЗ = Запрос.Выполнить().Выгрузить();  
	
	//Бондаренко++ 20211027 =========================================================================
	
	ТаблицаИсточник = Новый ТаблицаЗначений;
	
	Запрос = Новый Запрос;
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ЗаказыПоставщикамНаАвтомобилиОстатки.Автомобиль,
	|	ВЫБОР
	|		КОГДА ЗаказыПоставщикамНаАвтомобилиОстатки.Автомобиль.VIN = """"
	|			ТОГДА ЗаказыПоставщикамНаАвтомобилиОстатки.ЗаказПоставщику.ВнешнийНомерЗаказа
	|		ИНАЧЕ ЗаказыПоставщикамНаАвтомобилиОстатки.Автомобиль.VIN
	|	КОНЕЦ КАК VIN,
	|	СУММА(ЗаказыПоставщикамНаАвтомобилиОстатки.КоличествоОстаток) КАК Остаток,
	|	ЦенаАвто.Цена + ЦенаАвто.Автомобиль.СтоимостьДопОборудования КАК Цена,
	|	ХарАвто.Значение КАК ВидАвто,
	|	ЗаказыПоставщикамНаАвтомобилиОстатки.ЗаказПоставщику.ПодразделениеКомпании КАК Подразделение,
	|	ЗаказыПоставщикамНаАвтомобилиОстатки.ЗаказПоставщику.ПодразделениеКомпании.ДилерскийЦентр КАК ДилерскийЦентр,
	|	ЗаказыПоставщикамНаАвтомобилиОстатки.Автомобиль.Модель.МодельАвтоРу.МаркаАвтоРу КАК МаркаАвтоРу,
	|	ЗаказыПоставщикамНаАвтомобилиОстатки.Автомобиль.Модель.МодельАвтоРу КАК МодельАвтоРу,
	|	ЗаказыПоставщикамНаАвтомобилиОстатки.Автомобиль.ВариантКомплектации.МодификацияАвтоРу КАК МодификацияАвтоРу,
	|	ЗаказыПоставщикамНаАвтомобилиОстатки.Автомобиль.ВариантКомплектации.КомплектацияАвтоРу КАК КомплектацияАвтоРу,
	|	ЗаказыПоставщикамНаАвтомобилиОстатки.Автомобиль.СпециальнаяЦена КАК СпециальнаяЦена,
	|	ЗаказыПоставщикамНаАвтомобилиОстатки.Автомобиль.СкидкаПриПокупкеВКредит КАК СкидкаПриПокупкеВКредит,
	|	ЗаказыПоставщикамНаАвтомобилиОстатки.Автомобиль.СкидкаПриСтраховании КАК СкидкаПриСтраховании,
	|	ЗаказыПоставщикамНаАвтомобилиОстатки.Автомобиль.СкидаПриПокупкеВТрейдИн КАК СкидаПриПокупкеВТрейдИн,
	|	ЗаказыПоставщикамНаАвтомобилиОстатки.Автомобиль.СкидкаМаксимальная КАК СкидкаМаксимальная,
	|	ЗаказыПоставщикамНаАвтомобилиОстатки.Автомобиль.Цвет.ЦветАвтоРу КАК ЦветАвтоРу,
	|	ЗаказыПоставщикамНаАвтомобилиОстатки.Автомобиль.Цвет.ОкраскаМеталлик КАК ОкраскаМеталлик,
	|	ЗаказыПоставщикамНаАвтомобилиОстатки.Автомобиль.ВариантКомплектации.Руль КАК Руль,
	|	ЗаказыПоставщикамНаАвтомобилиОстатки.Автомобиль.ВариантКомплектации.КоличествоДверей КАК КоличествоДверей,
	|	ЗаказыПоставщикамНаАвтомобилиОстатки.Автомобиль.Модель.КатегорияТС,
	|	ПробегиАвто.Значение КАК Пробег,
	|	ЗаказыПоставщикамНаАвтомобилиОстатки.Автомобиль.Состояние КАК Состояние,
	|	ЗаказыПоставщикамНаАвтомобилиОстатки.Автомобиль.КоличествоВладельцевПоПТС КАК КоличествоВладельцев,
	|	ЗаказыПоставщикамНаАвтомобилиОстатки.Автомобиль.ВариантКомплектации.ТипКузова.ТипКузоваАвтоРу КАК ТипКузоваВариантаКомплектации,
	|	ЗаказыПоставщикамНаАвтомобилиОстатки.Автомобиль.Модель.ТипКузова.ТипКузоваАвтоРу КАК ТипКузоваМодели,
	|	ЗаказыПоставщикамНаАвтомобилиОстатки.Автомобиль.Цвет.Артикул,
	|	ЗаказыПоставщикамНаАвтомобилиОстатки.Автомобиль.ВариантКомплектации.Артикул,
	|	""На заказ"" КАК Доступность
	|ИЗ
	|	РегистрНакопления.ЗаказыПоставщикамНаАвтомобили.Остатки КАК ЗаказыПоставщикамНаАвтомобилиОстатки
	|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|			ЦеныАвтомобилейСрезПоследних.Цена КАК Цена,
	|			ЦеныАвтомобилейСрезПоследних.Автомобиль КАК Автомобиль,
	|			ЦеныАвтомобилейСрезПоследних.ВариантКомплектации КАК ВариантКомплектации,
	|			ЦеныАвтомобилейСрезПоследних.ТипЦен КАК ТипЦен
	|		ИЗ
	|			РегистрСведений.ЦеныАвтомобилей.СрезПоследних КАК ЦеныАвтомобилейСрезПоследних
	|		ГДЕ
	|			ЦеныАвтомобилейСрезПоследних.ТипЦен = ЗНАЧЕНИЕ(Справочник.ТипыЦен.ОсновнойТипЦенПродажи)) КАК ЦенаАвто
	|		ПО ЗаказыПоставщикамНаАвтомобилиОстатки.Автомобиль = ЦенаАвто.Автомобиль
	|			И ЗаказыПоставщикамНаАвтомобилиОстатки.Автомобиль.ВариантКомплектации = ЦенаАвто.Автомобиль.ВариантКомплектации
	|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|			АвтомобилиСрезПоследних.Автомобиль КАК Автомобиль,
	|			АвтомобилиСрезПоследних.ВидЗначения КАК ВидЗначения,
	|			АвтомобилиСрезПоследних.Значение КАК Значение
	|		ИЗ
	|			РегистрСведений.Автомобили.СрезПоследних КАК АвтомобилиСрезПоследних
	|		ГДЕ
	|			АвтомобилиСрезПоследних.ВидЗначения = ЗНАЧЕНИЕ(Перечисление.ДополнительнаяИнформацияАвтомобилей.ВидАвтомобиля)) КАК ХарАвто
	|		ПО ЗаказыПоставщикамНаАвтомобилиОстатки.Автомобиль = ХарАвто.Автомобиль
	|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|			АвтомобилиСрезПоследних.Автомобиль КАК Автомобиль,
	|			АвтомобилиСрезПоследних.ВидЗначения КАК ВидЗначения,
	|			АвтомобилиСрезПоследних.Значение КАК Значение
	|		ИЗ
	|			РегистрСведений.Автомобили.СрезПоследних КАК АвтомобилиСрезПоследних
	|		ГДЕ
	|			АвтомобилиСрезПоследних.ВидЗначения = ЗНАЧЕНИЕ(Перечисление.ДополнительнаяИнформацияАвтомобилей.Пробег)) КАК ПробегиАвто
	|		ПО ЗаказыПоставщикамНаАвтомобилиОстатки.Автомобиль = ПробегиАвто.Автомобиль
	|ГДЕ
	|	ЗаказыПоставщикамНаАвтомобилиОстатки.КоличествоОстаток > 0
	|	И (ХарАвто.Значение = ЗНАЧЕНИЕ(Перечисление.ВидАвтомобиля.Новый)
	|			ИЛИ ХарАвто.Значение ЕСТЬ NULL)
	|	И ЗаказыПоставщикамНаАвтомобилиОстатки.ЗаказПоставщику.ПодразделениеКомпании В(&СписокПодразделений)
	|	И ЗаказыПоставщикамНаАвтомобилиОстатки.Автомобиль.Модель.КатегорияТС = ЗНАЧЕНИЕ(Справочник.КатегорииТранспортныхСредств.АвтомобилиЛегковые)
	|
	|СГРУППИРОВАТЬ ПО
	|	ЗаказыПоставщикамНаАвтомобилиОстатки.Автомобиль,
	|	ХарАвто.Значение,
	|	ЗаказыПоставщикамНаАвтомобилиОстатки.ЗаказПоставщику.ПодразделениеКомпании.ДилерскийЦентр,
	|	ЗаказыПоставщикамНаАвтомобилиОстатки.Автомобиль.Модель.МодельАвтоРу.МаркаАвтоРу,
	|	ЗаказыПоставщикамНаАвтомобилиОстатки.Автомобиль.Модель.МодельАвтоРу,
	|	ЗаказыПоставщикамНаАвтомобилиОстатки.Автомобиль.ВариантКомплектации.МодификацияАвтоРу,
	|	ЗаказыПоставщикамНаАвтомобилиОстатки.Автомобиль.СпециальнаяЦена,
	|	ЗаказыПоставщикамНаАвтомобилиОстатки.Автомобиль.СкидкаПриПокупкеВКредит,
	|	ЗаказыПоставщикамНаАвтомобилиОстатки.Автомобиль.СкидкаПриСтраховании,
	|	ЗаказыПоставщикамНаАвтомобилиОстатки.Автомобиль.СкидаПриПокупкеВТрейдИн,
	|	ЗаказыПоставщикамНаАвтомобилиОстатки.Автомобиль.СкидкаМаксимальная,
	|	ЗаказыПоставщикамНаАвтомобилиОстатки.Автомобиль.ВариантКомплектации.КомплектацияАвтоРу,
	|	ЗаказыПоставщикамНаАвтомобилиОстатки.Автомобиль.Цвет.ЦветАвтоРу,
	|	ЗаказыПоставщикамНаАвтомобилиОстатки.Автомобиль.Цвет.ОкраскаМеталлик,
	|	ЗаказыПоставщикамНаАвтомобилиОстатки.Автомобиль.ВариантКомплектации.Руль,
	|	ЗаказыПоставщикамНаАвтомобилиОстатки.Автомобиль.ВариантКомплектации.КоличествоДверей,
	|	ПробегиАвто.Значение,
	|	ЗаказыПоставщикамНаАвтомобилиОстатки.Автомобиль.Состояние,
	|	ЗаказыПоставщикамНаАвтомобилиОстатки.Автомобиль.КоличествоВладельцевПоПТС,
	|	ЗаказыПоставщикамНаАвтомобилиОстатки.Автомобиль.ВариантКомплектации.ТипКузова.ТипКузоваАвтоРу,
	|	ЗаказыПоставщикамНаАвтомобилиОстатки.ЗаказПоставщику.ПодразделениеКомпании,
	|	ЗаказыПоставщикамНаАвтомобилиОстатки.Автомобиль.Модель.ТипКузова.ТипКузоваАвтоРу,
	|	ЗаказыПоставщикамНаАвтомобилиОстатки.Автомобиль.Цвет.Артикул,
	|	ЗаказыПоставщикамНаАвтомобилиОстатки.Автомобиль.ВариантКомплектации.Артикул,
	|	ЗаказыПоставщикамНаАвтомобилиОстатки.Автомобиль.Модель.КатегорияТС,
	|	ЦенаАвто.Цена + ЦенаАвто.Автомобиль.СтоимостьДопОборудования,
	|	ВЫБОР
	|		КОГДА ЗаказыПоставщикамНаАвтомобилиОстатки.Автомобиль.VIN = """"
	|			ТОГДА ЗаказыПоставщикамНаАвтомобилиОстатки.ЗаказПоставщику.ВнешнийНомерЗаказа
	|		ИНАЧЕ ЗаказыПоставщикамНаАвтомобилиОстатки.Автомобиль.VIN
	|	КОНЕЦ
	|
	|УПОРЯДОЧИТЬ ПО
	|	VIN";
	
	Запрос.УстановитьПараметр("СписокПодразделений",СписокПодразделений);
	
	ТаблицаИсточник = Запрос.Выполнить().Выгрузить(); 
	
	Если ТаблицаИсточник.Количество() > 0 Тогда
		Для Каждого СтрокаТаблицыИсточник Из ТаблицаИсточник Цикл
			НайденнаяСтрока = ТЗ.Найти(СтрокаТаблицыИсточник.VIN, "VIN");
			Если НайденнаяСтрока = Неопределено Тогда
				ЗаполнитьЗначенияСвойств(ТЗ.Добавить(), СтрокаТаблицыИсточник);
			КонецЕсли;	
		КонецЦикла;
	КонецЕсли;
	
	ВсегоАвтомобилей = ТЗ.Количество();
	
	//Если ВсегоАвтомобилей = 0 Тогда
	//	Возврат; 
	//  КонецЕсли;

	//Бондаренко-- 20211027 ==============================================================================
	
	//СписокМарок = Новый СписокЗначений;
	
	XML=Новый ЗаписьXML();
	
	//XML.УстановитьСтроку(Новый ПараметрыЗаписиXML("UTF-8","1.0",false));
	
	XML.ОткрытьФайл(ФайлXML,"UTF-8",false);
  	 
	XML.ЗаписатьОбъявлениеXML();
	
	XML.ЗаписатьНачалоЭлемента("data");
	
	XML.ЗаписатьНачалоЭлемента("cars");
	
	Счетчик = 0; 
	 
	Для каждого Стр1 Из ТЗ Цикл
		
		//Бондаренко++ 20220713
		Если НЕ Стр1.Автомобиль.ВыгружатьАвтомобильНаСайт Тогда
			Продолжить;	
		КонецЕсли; 
		//Бондаренко-- 20220713
		
		//Бондаренко++ 20201030
		Если СписокАвтоТестДрайва.НайтиПоЗначению(Стр1.Автомобиль) <> Неопределено Тогда
			Продолжить;
		КонецЕсли; 
		//Бондаренко-- 20201030
		
		//Бондаренко++ 20220315        
		Если ДополнительныйСписокМарок <> Неопределено Тогда
			Если ДополнительныйСписокМарок.НайтиПоЗначению(Стр1.Автомобиль.Модель.Марка) = Неопределено Тогда
				Продолжить;
			КонецЕсли; 
		КонецЕсли;
		//Бондаренко-- 20220315
		
 		//Бондаренко++ 20220317        
		Если НЕ Стр1.Автомобиль.ВыгружатьАвтомобильНаСайт Тогда
			Продолжить;
		КонецЕсли;
		//Бондаренко-- 20220317

		Счетчик = Счетчик + 1; 		
		
		XML.ЗаписатьНачалоЭлемента("car");
		XML.ЗаписатьНачалоЭлемента("mark_id");               XML.ЗаписатьТекст(Стр1.Автомобиль.Модель.Марка.МаркаАвтоРу.Наименование);                     XML.ЗаписатьКонецЭлемента();
		XML.ЗаписатьНачалоЭлемента("folder_id");             XML.ЗаписатьТекст(Стр1.Автомобиль.Модель.МодельАвтоРу.Наименование);                          XML.ЗаписатьКонецЭлемента();
		XML.ЗаписатьНачалоЭлемента("modification_id");       XML.ЗаписатьТекст(Стр1.Автомобиль.ВариантКомплектации.МодификацияАвтоРу.Наименование);        XML.ЗаписатьКонецЭлемента(); 

		Если НЕ обЗначениеНеЗаполнено(Стр1.Автомобиль.ВариантКомплектации.ТипКузова.ТипКузоваАвтоРу) Тогда
			XML.ЗаписатьНачалоЭлемента("body_type");         XML.ЗаписатьТекст(СокрЛП(Стр1.Автомобиль.ВариантКомплектации.ТипКузова.ТипКузоваАвтоРу));     XML.ЗаписатьКонецЭлемента();
		ИначеЕсли НЕ обЗначениеНеЗаполнено(Стр1.Автомобиль.Модель.ТипКузова.ТипКузоваАвтоРу) Тогда
			XML.ЗаписатьНачалоЭлемента("body_type");         XML.ЗаписатьТекст(СокрЛП(Стр1.Автомобиль.Модель.ТипКузова.ТипКузоваАвтоРу));                  XML.ЗаписатьКонецЭлемента();
		КонецЕсли; 
		
		XML.ЗаписатьНачалоЭлемента("drive");                 XML.ЗаписатьТекст(СокрЛП(Стр1.Автомобиль.ВариантКомплектации.Привод));                        XML.ЗаписатьКонецЭлемента();
		XML.ЗаписатьНачалоЭлемента("complectation_name");    XML.ЗаписатьТекст(Стр1.Автомобиль.ВариантКомплектации.КомплектацияАвтоРу.Наименование);       XML.ЗаписатьКонецЭлемента();
		
 		
		XML.ЗаписатьНачалоЭлемента("wheel");                 XML.ЗаписатьТекст(СокрЛП(Стр1.Руль));                                                         XML.ЗаписатьКонецЭлемента();
		XML.ЗаписатьНачалоЭлемента("color");                 XML.ЗаписатьТекст(СокрЛП(Стр1.ЦветАвтоРу));                                                   XML.ЗаписатьКонецЭлемента();
		XML.ЗаписатьНачалоЭлемента("metallic");              XML.ЗаписатьТекст(СокрЛП(Нрег(Стр1.Автомобиль.Цвет.ОкраскаМеталлик)));                        XML.ЗаписатьКонецЭлемента();  
		
 		//XML.ЗаписатьНачалоЭлемента("availability");        XML.ЗаписатьТекст("В наличии");                                                               XML.ЗаписатьКонецЭлемента();
		XML.ЗаписатьНачалоЭлемента("availability");          XML.ЗаписатьТекст(СокрЛП(Стр1.Доступность));                                                  XML.ЗаписатьКонецЭлемента();
 		
		XML.ЗаписатьНачалоЭлемента("custom");                XML.ЗаписатьТекст("Растаможен");                                                              XML.ЗаписатьКонецЭлемента();
		
		Состояние = СокрЛП(Стр1.Состояние);
 		Если Состояние = "" Тогда
			XML.ЗаписатьНачалоЭлемента("state");             XML.ЗаписатьТекст("Отличное");                                                                XML.ЗаписатьКонецЭлемента();
 		Иначе
			XML.ЗаписатьНачалоЭлемента("state");             XML.ЗаписатьТекст(Состояние);                                                                 XML.ЗаписатьКонецЭлемента();
 		КонецЕсли;
		
 		XML.ЗаписатьНачалоЭлемента("pts");                   XML.ЗаписатьТекст("Оригинал");                                                                XML.ЗаписатьКонецЭлемента();
		
		XML.ЗаписатьНачалоЭлемента("owners_number");         XML.ЗаписатьТекст("Не было владельцев");                                                      XML.ЗаписатьКонецЭлемента();
		
		Пробег = СокрЛП(Стр1.Пробег);
		Если Пробег = "" Тогда
	 		XML.ЗаписатьНачалоЭлемента("run");               XML.ЗаписатьТекст("0");                                                                       XML.ЗаписатьКонецЭлемента();
 		Иначе
	 		XML.ЗаписатьНачалоЭлемента("run");               XML.ЗаписатьТекст(Пробег);                                                                    XML.ЗаписатьКонецЭлемента(); 
 		КонецЕсли;
		
		//Бондаренко++ 20230420
		Если Стр1.Автомобиль.ГодВыпуска = Дата(1,1,1) Тогда
			XML.ЗаписатьНачалоЭлемента("year");              XML.ЗаписатьТекст(Формат(НачалоГода(ТекущаяДата()),"ДФ=yyyy"));                               XML.ЗаписатьКонецЭлемента();
		Иначе	                                             
			XML.ЗаписатьНачалоЭлемента("year");              XML.ЗаписатьТекст(Формат(Стр1.Автомобиль.ГодВыпуска,"ДФ=yyyy"));                              XML.ЗаписатьКонецЭлемента();
		КонецЕсли;             
		//Бондаренко-- 20230420
		 
		//XML.ЗаписатьНачалоЭлемента("registry_year");       XML.ЗаписатьТекст(Формат(Стр1.Автомобиль.ГодВыпуска,"ДФ=yyyy"));                              XML.ЗаписатьКонецЭлемента();
		XML.ЗаписатьНачалоЭлемента("price");                 XML.ЗаписатьТекст(СокрЛП(СтрЗаменить(Стр1.Цена,Символы.НПП,"")));                             XML.ЗаписатьКонецЭлемента(); 
		XML.ЗаписатьНачалоЭлемента("exchange");              XML.ЗаписатьТекст("Рассмотрю варианты");                                                      XML.ЗаписатьКонецЭлемента(); 
		XML.ЗаписатьНачалоЭлемента("online_view_available"); XML.ЗаписатьТекст("true");                                                                    XML.ЗаписатьКонецЭлемента(); 
		XML.ЗаписатьНачалоЭлемента("currency");              XML.ЗаписатьТекст("RUR");                                                                     XML.ЗаписатьКонецЭлемента();
		//XML.ЗаписатьНачалоЭлемента("registry_year");         XML.ЗаписатьТекст(Формат(Стр1.Автомобиль.ГодВыпуска,"ДФ=yyyy"));                            XML.ЗаписатьКонецЭлемента();
  		XML.ЗаписатьНачалоЭлемента("vin");                   XML.ЗаписатьТекст(Стр1.VIN);                                                                  XML.ЗаписатьКонецЭлемента();
		
		ТекстКлассифайда = СокрЛП(Стр1.Автомобиль.Модель.ТекстКлассифайда);
		Если обЗначениеНеЗаполнено(ТекстКлассифайда) Тогда
			ТекстКлассифайда = СокрЛП(Стр1.Подразделение.ТекстКлассифайда);
			Если обЗначениеНеЗаполнено(ТекстКлассифайда) Тогда
				ТекстКлассифайда = СокрЛП(Стр1.Подразделение.Родитель.ТекстКлассифайда);
			КонецЕсли; 
		КонецЕсли; 
 		XML.ЗаписатьНачалоЭлемента("description");   XML.ЗаписатьТекст(ТекстКлассифайда);                                                                  XML.ЗаписатьКонецЭлемента();
		XML.ЗаписатьНачалоЭлемента("unique_id");     XML.ЗаписатьТекст(СокрЛП(Стр1.Автомобиль.Код));                                                       XML.ЗаписатьКонецЭлемента();		
		
		//Бондаренко++ 20201026
		//XML.ЗаписатьНачалоЭлемента("doors_count");         XML.ЗаписатьТекст(СокрЛП(Стр1.КоличествоДверей));                                             XML.ЗаписатьКонецЭлемента();
		//XML.ЗаписатьНачалоЭлемента("ColorCode");           XML.ЗаписатьТекст(Стр1.Автомобиль.Цвет.Артикул);                                              XML.ЗаписатьКонецЭлемента();
		//XML.ЗаписатьНачалоЭлемента("SpecId");              XML.ЗаписатьТекст(Стр1.Автомобиль.ВариантКомплектации.Артикул);                               XML.ЗаписатьКонецЭлемента();
		//Бондаренко-- 20201026
		
		 
		//XML.ЗаписатьНачалоЭлемента("special_price");       XML.ЗаписатьТекст(СокрЛП(СтрЗаменить(Стр1.СпециальнаяЦена,Символы.НПП,"")));                  XML.ЗаписатьКонецЭлемента(); 
		//XML.ЗаписатьНачалоЭлемента("credit_discount");     XML.ЗаписатьТекст(СокрЛП(СтрЗаменить(Стр1.СкидкаПриПокупкеВКредит,Символы.НПП,"")));          XML.ЗаписатьКонецЭлемента(); 
		//XML.ЗаписатьНачалоЭлемента("insurance_discount");  XML.ЗаписатьТекст(СокрЛП(СтрЗаменить(Стр1.СкидкаПриСтраховании,Символы.НПП,"")));             XML.ЗаписатьКонецЭлемента();  
		//XML.ЗаписатьНачалоЭлемента("tradein_discount");    XML.ЗаписатьТекст(СокрЛП(СтрЗаменить(Стр1.СкидаПриПокупкеВТрейдИн,Символы.НПП,"")));          XML.ЗаписатьКонецЭлемента();  
		//XML.ЗаписатьНачалоЭлемента("max_discount");        XML.ЗаписатьТекст(СокрЛП(СтрЗаменить(Стр1.СкидкаМаксимальная,Символы.НПП,"")));               XML.ЗаписатьКонецЭлемента(); 
		
		ИмяСервиса = "https://it.sokolmotors.ru/alfaauto-noauth/hs/advert/photo/";
		Если Стр1.Автомобиль.ПутьКФото.Количество() > 0 Тогда
			XML.ЗаписатьНачалоЭлемента("images");
			Для каждого СтрТЧ Из Стр1.Автомобиль.ПутьКФото Цикл
				XML.ЗаписатьНачалоЭлемента("image");
  				XML.ЗаписатьТекст(ИмяСервиса+Стр1.Автомобиль.УникальныйИдентификатор()+"/"+СтрТЧ.GUID+".jpg");
 				XML.ЗаписатьКонецЭлемента(); //image	
			КонецЦикла; 
			XML.ЗаписатьКонецЭлемента(); //images	
		КонецЕсли; 

		//Бондаренко++ 20220929                    
		ВидеоДляСайта = "";
		ВидеоДляСайта = СМ_ВыгрузкаОбъявленийОПродажеАвто.СМГ_СправочникВернутьЗначениеРеквизита("СсылкаНаВидео",Стр1.Автомобиль.ПолучитьОбъект());
		ВидеоДляСайта = СтрЗаменить(ВидеоДляСайта,"https://youtu.be/","https://www.youtube.com/watch?v=");		
		//Бондаренко-- 20220929		
		
		Если НЕ обЗначениеНеЗаполнено(ВидеоДляСайта) Тогда
			XML.ЗаписатьНачалоЭлемента("video");           XML.ЗаписатьТекст(ВидеоДляСайта); 	                                                           XML.ЗаписатьКонецЭлемента(); 		
		КонецЕсли; 
		
		XML.ЗаписатьНачалоЭлемента("action");              XML.ЗаписатьТекст("show"); 		                                                               XML.ЗаписатьКонецЭлемента();		
		
  		ПодразделениеАдрес = киПолучитьПредставлениеКИ(ТекПодр, Справочники.ВидыКонтактнойИнформации.АдресФактический);
		Если обЗначениеНеЗаполнено(ПодразделениеАдрес) Тогда
 			ПодразделениеАдрес = киПолучитьПредставлениеКИ(ТекПодр, Справочники.ВидыКонтактнойИнформации.АдресПочтовый);
		КонецЕсли;
  		XML.ЗаписатьНачалоЭлемента("poi_id");              XML.ЗаписатьТекст(ПодразделениеАдрес);                                                          XML.ЗаписатьКонецЭлемента();		
		
		XML.ЗаписатьНачалоЭлемента("contact_info");
		XML.ЗаписатьНачалоЭлемента("contact");		
		
		XML.ЗаписатьНачалоЭлемента("name");                XML.ЗаписатьТекст("Менеджер отдела продаж");                                                    XML.ЗаписатьКонецЭлемента();
		
		ТелефонОП = "";
		ТелефонОП = ПолучитьТелефонОП(ТекПодр,Стр1.Автомобиль.Модель.Марка);
		Если СокрЛП(ТелефонОП) = "" Тогда
			ТелефонОП = киПолучитьПредставлениеКИ(ТекПодр, Справочники.ВидыКонтактнойИнформации.ТелефонКонтактный);		
		КонецЕсли;			
		Если СокрЛП(ТелефонОП) = "" Тогда
			ТелефонОП = киПолучитьПредставлениеКИ(ТекПодр, Справочники.ВидыКонтактнойИнформации.ТелефонРабочий);
 		КонецЕсли;
  		XML.ЗаписатьНачалоЭлемента("phone");               XML.ЗаписатьТекст(СокрЛП(ТелефонОП));                                                           XML.ЗаписатьКонецЭлемента();			
		
		XML.ЗаписатьНачалоЭлемента("time");                XML.ЗаписатьТекст("9:00-19:00");                                                                XML.ЗаписатьКонецЭлемента();			
		
		XML.ЗаписатьКонецЭлемента(); //contact 
		XML.ЗаписатьКонецЭлемента(); //contact info
		
		XML.ЗаписатьКонецЭлемента(); //car
		
	КонецЦикла; 
	
	XML.ЗаписатьКонецЭлемента();	 //cars
	
	XML.ЗаписатьКонецЭлемента();     //data
	
	//Если Счетчик > 0 Тогда
	XML.Закрыть();
	#Если Клиент Тогда
		СМГ_Сообщить("Сформирован файл: "+ФайлXML+" по подразделению "+ТекПодр);			 
	#КонецЕсли
	//КонецЕсли;
  	
КонецПроцедуры

//Бондаренко++ 20201030
Функция ПолучитьАвтомобилиДляТестДрайва() Экспорт 
	Запрос=Новый Запрос;
	Запрос.Текст="ВЫБРАТЬ
	|	ЗначенияСвойствОбъектов.Объект КАК Автомобиль
	|ИЗ
	|	РегистрСведений.ЗначенияСвойствОбъектов КАК ЗначенияСвойствОбъектов
	|ГДЕ
	|	ЗначенияСвойствОбъектов.Объект ССЫЛКА Справочник.Автомобили
	|	И ЗначенияСвойствОбъектов.Свойство = ЗНАЧЕНИЕ(ПланВидовХарактеристик.СвойстваОбъектов.ИспользоватьДляТестДрайва)
	|	И ЗначенияСвойствОбъектов.Значение = ИСТИНА";
	СписокАвто = Новый СписокЗначений;
	СписокАвто.ЗагрузитьЗначения(Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Автомобиль")); 
	Возврат СписокАвто;
КонецФункции
//Бондаренко-- 20201030

Функция ПодключитьсяКFTPСерверу(АдресFTP,ИмяПользователя,ПарольПользователя) Экспорт
	Соединение = Новый FTPСоединение(
        АдресFTP, // адрес ftp сервера
        21, // порт сервера
        ИмяПользователя, // имя пользователя
        ПарольПользователя, // пароль пользователя
        Неопределено, // прокси не используется
        Истина, // пассивный режим работы
        0, // таймаут (0 - без ограничений)
        Неопределено // незащищенное соединение
    );
 
    // Для случаев, когда у ftp сервера нет возможности
    // обращаться к нам (мы находимся за межсетевым экраном)
    // следует использовать пассивный режим работы.
	
	Соединение.УстановитьТекущийКаталог("/www/sokolmotors.ru/new_autos");
	
    Возврат Соединение;
КонецФункции      

Функция ПолучитьТелефонОП(Подр,Марка) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПодразделенияКомпанииМаркиАвтомобилей.Ссылка,
		|	ПодразделенияКомпанииМаркиАвтомобилей.Марка,
		|	ПодразделенияКомпанииМаркиАвтомобилей.ПредставлениеТелефона
		|ИЗ
		|	Справочник.ПодразделенияКомпании.МаркиАвтомобилей КАК ПодразделенияКомпанииМаркиАвтомобилей
		|ГДЕ
		|	ПодразделенияКомпанииМаркиАвтомобилей.Ссылка = &Подр
		|	И ПодразделенияКомпанииМаркиАвтомобилей.Марка = &Марка";
	
	Запрос.УстановитьПараметр("Марка", Марка);
	Запрос.УстановитьПараметр("Подр", Подр);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Возврат ВыборкаДетальныеЗаписи.ПредставлениеТелефона;
	КонецЦикла;
	
	Возврат ""; 
	
КонецФункции // ПолучитьТелефонОП()
 
Функция СтрокаЛатиницей(Стр) Экспорт
    СтрЗамен = "A,B,V,G,D,E,Yo,Zh,Z,I,Y,K,L,M,N,O,P,R,S,T,U,F,H,C,Ch,Sh,Sch,Y,E,Yu,Ya";
    СтрКириллица = "А,Б,В,Г,Д,Е,Ё,Ж,З,И,Й,К,Л,М,Н,О,П,Р,С,Т,У,Ф,Х,Ц,Ч,Ш,Щ,,Ы,,Э,Ю,Я";    
    МасЗамен = СтрРазделить(СтрЗамен, ",");
    МасКириллица = СтрРазделить(СтрКириллица, ",");
    
    СтрЛат = "0,1,2,3,4,5,6,7,8,9,A,B,C,D,E,F,G,H,I,J,K,L,M,N,O,P,R,S,T,Q,U,V,X,Y,Z,W";    
    МасЛат = СтрРазделить(СтрЛат, ",");
    Результат = "";
    Для сч = 1 по СтрДлина(Стр) Цикл
        Симв = Сред(Стр, сч, 1);
        Если МасЛат.Найти(ВРег(Симв)) <> Неопределено Тогда
            СимвЛат = Симв;    
        Иначе
            Инд = МасКириллица.Найти(ВРег(Симв));
            Если Инд = Неопределено Тогда
                Продолжить;
            КонецЕсли;
            Если Симв = МасКириллица[Инд] Тогда   //значит исходный символ в верхнем регистре
                СимвЛат = МасЗамен[Инд];
			Иначе      
				Попытка
					СимвЛат = НРег(МасЗамен[Инд]);
 				Исключение
					СимвЛат = "";				
				КонецПопытки;
             КонецЕсли;
        КонецЕсли;
        Результат = Результат + СимвЛат;
    КонецЦикла;
    Возврат Результат;
КонецФункции 