
/////ОПРЕДЕЛЕНИЕ ПРИНАДЛЕЖНОСТИ ОБЪЕКТА МЕТАДАННЫХ

// Определяет принадлежность объекта метаданных к общему типу "Документ".
//
// Параметры:
//  ОбъектМетаданных - ОбъектМетаданных - объект, для которого необходимо определить принадлежность к заданному типу.
// 
//  Возвращаемое значение:
//   Булево.
//
Функция ЭтоДокумент(ОбъектМетаданных) Экспорт
	
	Возврат Метаданные.Документы.Содержит(ОбъектМетаданных);
	
КонецФункции

// Определяет принадлежность объекта метаданных к общему типу "Справочник".
//
// Параметры:
//  ОбъектМетаданных - ОбъектМетаданных - объект, для которого необходимо определить принадлежность к заданному типу.
// 
//  Возвращаемое значение:
//   Булево.
//
Функция ЭтоСправочник(ОбъектМетаданных) Экспорт
	
	Возврат Метаданные.Справочники.Содержит(ОбъектМетаданных);
	
КонецФункции

// Определяет принадлежность объекта метаданных к общему типу "Бизнес-процесс".
//
// Параметры:
//  ОбъектМетаданных - ОбъектМетаданных - объект, для которого необходимо определить принадлежность к заданному типу.
// 
//  Возвращаемое значение:
//   Булево.
//
Функция ЭтоБизнесПроцесс(ОбъектМетаданных) Экспорт
	
	Возврат Метаданные.БизнесПроцессы.Содержит(ОбъектМетаданных);
	
КонецФункции

// Определяет принадлежность объекта метаданных к общему типу "Задача".
//
// Параметры:
//  ОбъектМетаданных - ОбъектМетаданных - объект, для которого необходимо определить принадлежность к заданному типу.
// 
//  Возвращаемое значение:
//   Булево.
//
Функция ЭтоЗадача(ОбъектМетаданных) Экспорт
	
	Возврат Метаданные.Задачи.Содержит(ОбъектМетаданных);
	
КонецФункции

// Определяет принадлежность объекта метаданных к типу регистр.
//
// Параметры:
//  ОбъектМетаданных - ОбъектМетаданных - объект, для которого необходимо определить принадлежность к заданному типу.
// 
//  Возвращаемое значение:
//   Булево.
//
Функция ЭтоРегистр(ОбъектМетаданных) Экспорт
	
	Возврат Метаданные.РегистрыБухгалтерии.Содержит(ОбъектМетаданных)
		Или Метаданные.РегистрыНакопления.Содержит(ОбъектМетаданных)
		Или Метаданные.РегистрыРасчета.Содержит(ОбъектМетаданных)
		Или Метаданные.РегистрыСведений.Содержит(ОбъектМетаданных);
		
КонецФункции

// Регистры

// Определяет принадлежность объекта метаданных к общему типу "Регистр сведений".
//
// Параметры:
//  ОбъектМетаданных - ОбъектМетаданных - объект, для которого необходимо определить принадлежность к заданному типу.
// 
//  Возвращаемое значение:
//   Булево.
//
Функция ЭтоРегистрСведений(ОбъектМетаданных) Экспорт
	
	Возврат Метаданные.РегистрыСведений.Содержит(ОбъектМетаданных);
	
КонецФункции

// Определяет принадлежность объекта метаданных к общему типу "Регистр накопления".
//
// Параметры:
//  ОбъектМетаданных - ОбъектМетаданных - объект, для которого необходимо определить принадлежность к заданному типу.
// 
//  Возвращаемое значение:
//   Булево.
//
Функция ЭтоРегистрНакопления(ОбъектМетаданных) Экспорт
	
	Возврат Метаданные.РегистрыНакопления.Содержит(ОбъектМетаданных);
	
КонецФункции

// Определяет принадлежность объекта метаданных к общему типу "Регистр бухгалтерии".
//
// Параметры:
//  ОбъектМетаданных - ОбъектМетаданных - объект, для которого необходимо определить принадлежность к заданному типу.
// 
//  Возвращаемое значение:
//   Булево.
//
Функция ЭтоРегистрБухгалтерии(ОбъектМетаданных) Экспорт
	
	Возврат Метаданные.РегистрыБухгалтерии.Содержит(ОбъектМетаданных);
	
КонецФункции

// Определяет принадлежность объекта метаданных к общему типу "Регистр расчета".
//
// Параметры:
//  ОбъектМетаданных - ОбъектМетаданных - объект, для которого необходимо определить принадлежность к заданному типу.
// 
//  Возвращаемое значение:
//   Булево.
//
Функция ЭтоРегистрРасчета(ОбъектМетаданных) Экспорт
	
	Возврат Метаданные.РегистрыРасчета.Содержит(ОбъектМетаданных);
	
КонецФункции

// Процедура удаляет из массива МассивРеквизитов элементы, соответствующие именам 
// реквизитов объекта из массива МассивНепроверяемыхРеквизитов.
// Для использования в обработчиках события ОбработкаПроверкиЗаполнения.
//
// Параметры:
//	МассивРеквизитов              - Массив - массив строк с именами реквизитов объекта.
//	МассивНепроверяемыхРеквизитов - Массив строк с именами реквизитов объекта, не требующих проверки.
//
Процедура УдалитьНепроверяемыеРеквизитыИзМассива(МассивРеквизитов, МассивНепроверяемыхРеквизитов) Экспорт
	
	Для Каждого ЭлементМассива Из МассивНепроверяемыхРеквизитов Цикл
	
		ПорядковыйНомер = МассивРеквизитов.Найти(ЭлементМассива);
		Если ПорядковыйНомер <> Неопределено Тогда
			МассивРеквизитов.Удалить(ПорядковыйНомер);
		КонецЕсли;
	
	КонецЦикла;
	
КонецПроцедуры

// Функция формирует массив имен регистров, по которым документ имеет движения.
// Вызывается при подготовке записей к регистрации движений.
//
Функция ПолучитьМассивИспользуемыхРегистров(Регистратор, Движения, МассивИсключаемыхРегистров = Неопределено) Экспорт

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Регистратор", Регистратор);

	Результат = Новый Массив;
	МаксимумТаблицВЗапросе = 256;

	СчетчикТаблиц   = 0;
	СчетчикДвижений = 0;

	ВсегоДвижений = Движения.Количество();
	ТекстЗапроса  = "";
	Для Каждого Движение Из Движения Цикл

		СчетчикДвижений = СчетчикДвижений + 1;

		ПропуститьРегистр = МассивИсключаемыхРегистров <> Неопределено
							И МассивИсключаемыхРегистров.Найти(Движение.Имя) <> Неопределено;

		Если Не ПропуститьРегистр Тогда

			Если СчетчикТаблиц > 0 Тогда

				ТекстЗапроса = ТекстЗапроса + "
				|ОБЪЕДИНИТЬ ВСЕ
				|";

			КонецЕсли;

			СчетчикТаблиц = СчетчикТаблиц + 1;

			ТекстЗапроса = ТекстЗапроса + 
			"
			|ВЫБРАТЬ ПЕРВЫЕ 1
			|""" + Движение.Имя + """ КАК ИмяРегистра
			|
			|ИЗ " + Движение.ПолноеИмя() + "
			|
			|ГДЕ Регистратор = &Регистратор
			|";

		КонецЕсли;

		Если СчетчикТаблиц = МаксимумТаблицВЗапросе Или СчетчикДвижений = ВсегоДвижений Тогда

			Запрос.Текст  = ТекстЗапроса;
			ТекстЗапроса  = "";
			СчетчикТаблиц = 0;

			Если Результат.Количество() = 0 Тогда

				Результат = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("ИмяРегистра");

			Иначе

				Выборка = Запрос.Выполнить().Выбрать();
				Пока Выборка.Следующий() Цикл
					Результат.Добавить(Выборка.ИмяРегистра);
				КонецЦикла;

			КонецЕсли;
		КонецЕсли;
	КонецЦикла;

	Возврат Результат;

КонецФункции

// Возвращает структуру, содержащую значения реквизитов прочитанные из информационной базы
// по ссылке на объект.
// 
//  Если доступа к одному из реквизитов нет, возникнет исключение прав доступа.
//  Если необходимо зачитать реквизит независимо от прав текущего пользователя,
//  то следует использовать предварительный переход в привилегированный режим.
// 
// Функция не предназначена для получения значений реквизитов пустых ссылок.
//
// Параметры:
//  Ссылка    - ЛюбаяСсылка - объект, значения реквизитов которого необходимо получить.
//
//  Реквизиты - Строка - имена реквизитов, перечисленные через запятую, в формате
//              требований к свойствам структуры.
//              Например, "Код, Наименование, Родитель".
//            - Структура, ФиксированнаяСтруктура - в качестве ключа передается
//              псевдоним поля для возвращаемой структуры с результатом, а в качестве
//              значения (опционально) фактическое имя поля в таблице.
//              Если значение не определено, то имя поля берется из ключа.
//            - Массив, ФиксированныйМассив - имена реквизитов в формате требований
//              к свойствам структуры.
//
// Возвращаемое значение:
//  Структура - содержит имена (ключи) и значения затребованных реквизитов.
//              Если строка затребованных реквизитов пуста, то возвращается пустая структура.
//              Если в качестве объекта передана пустая ссылка, то все реквизиты вернутся со значением Неопределено.
//
Функция ЗначенияРеквизитовОбъекта(Ссылка, Знач Реквизиты) Экспорт
	
	Если ТипЗнч(Реквизиты) = Тип("Строка") Тогда
		Если ПустаяСтрока(Реквизиты) Тогда
			Возврат Новый Структура;
		КонецЕсли;
		Реквизиты = Renault_СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(Реквизиты, ",", Истина);
	КонецЕсли;
	
	СтруктураРеквизитов = Новый Структура;
	Если ТипЗнч(Реквизиты) = Тип("Структура") Или ТипЗнч(Реквизиты) = Тип("ФиксированнаяСтруктура") Тогда
		СтруктураРеквизитов = Реквизиты;
	ИначеЕсли ТипЗнч(Реквизиты) = Тип("Массив") Или ТипЗнч(Реквизиты) = Тип("ФиксированныйМассив") Тогда
		Для Каждого Реквизит Из Реквизиты Цикл
			СтруктураРеквизитов.Вставить(СтрЗаменить(Реквизит, ".", ""), Реквизит);
		КонецЦикла;
	Иначе
		ВызватьИсключение Renault_СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru = 'Неверный тип второго параметра Реквизиты: %1'"),
			Строка(ТипЗнч(Реквизиты)));
	КонецЕсли;
	
	ТекстПолей = "";
	Для Каждого КлючИЗначение Из СтруктураРеквизитов Цикл
		ИмяПоля   = ?(ЗначениеЗаполнено(КлючИЗначение.Значение),
		              СокрЛП(КлючИЗначение.Значение),
		              СокрЛП(КлючИЗначение.Ключ));
		
		Псевдоним = СокрЛП(КлючИЗначение.Ключ);
		
		ТекстПолей  = ТекстПолей + ?(ПустаяСтрока(ТекстПолей), "", ",") + "
		|	" + ИмяПоля + " КАК " + Псевдоним;
	КонецЦикла;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.Текст =
	"ВЫБРАТЬ
	|" + ТекстПолей + "
	|ИЗ
	|	" + Ссылка.Метаданные().ПолноеИмя() + " КАК ПсевдонимЗаданнойТаблицы
	|ГДЕ
	|	ПсевдонимЗаданнойТаблицы.Ссылка = &Ссылка
	|";
	Выборка = Запрос.Выполнить().Выбрать();
	Выборка.Следующий();
	
	Результат = Новый Структура;
	Для Каждого КлючИЗначение Из СтруктураРеквизитов Цикл
		Результат.Вставить(КлючИЗначение.Ключ);
	КонецЦикла;
	ЗаполнитьЗначенияСвойств(Результат, Выборка);
	
	Возврат Результат;
	
КонецФункции

// Возвращает значение реквизита, прочитанного из информационной базы по ссылке на объект.
// 
//  Если доступа к реквизиту нет, возникнет исключение прав доступа.
//  Если необходимо зачитать реквизит независимо от прав текущего пользователя,
//  то следует использовать предварительный переход в привилегированный режим.
//
// Функция не предназначена для получения значений реквизитов пустых ссылок.
// 
// Параметры:
//  Ссылка       - ссылка на объект, - элемент справочника, документ, ...
//  ИмяРеквизита - Строка, например, "Код".
// 
// Возвращаемое значение:
//  Произвольный    - зависит от типа значения прочитанного реквизита.
// 
Функция ЗначениеРеквизитаОбъекта(Ссылка, ИмяРеквизита) Экспорт
	
	Результат = ЗначенияРеквизитовОбъекта(Ссылка, ИмяРеквизита);
	Возврат Результат[СтрЗаменить(ИмяРеквизита, ".", "")];
	
КонецФункции 

// Возвращает значения реквизитов, прочитанные из информационной базы
// для нескольких объектов.
// 
//  Если доступа к одному из реквизитов нет, возникнет исключение прав доступа.
//  Если необходимо зачитать реквизит независимо от прав текущего пользователя,
//  то следует использовать предварительный переход в привилегированный режим.
//
// Функция не предназначена для получения значений реквизитов пустых ссылок.
// 
// Параметры:
//  МассивСсылок - массив ссылок на объекты одного типа.
//				ВАЖНО! значения массива должны быть ссылками на 
//				объекты одного типа!
//  ИменаРеквизитов - Строка, имена реквизитов перечисленные через запятую,
//				в формате требований к свойствам структуры.
//				Например, "Код, Наименование, Родитель".
// 
// Возвращаемое значение:
//  Соответствие - где ключ - ссылка на объект, а Значение - структура, которая 
//		   		содержит список свойств, как список имен в строке.
//				ИменаРеквизитов, со значениям реквизитов, прочитанными из информационной базы.
// 
Функция ЗначенияРеквизитовОбъектов(МассивСсылок, ИменаРеквизитов) Экспорт
	
	ЗначенияРеквизитов = Новый Соответствие;
	Если МассивСсылок.Количество() = 0 Тогда
		Возврат ЗначенияРеквизитов;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	Ссылка КАК Ссылка, " + ИменаРеквизитов + "
		|ИЗ
		|	" + МассивСсылок[0].Метаданные().ПолноеИмя() + " КАК Таблица
		|ГДЕ
		|	Таблица.Ссылка В (&МассивСсылок)";
	Запрос.УстановитьПараметр("МассивСсылок", МассивСсылок);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Результат = Новый Структура(ИменаРеквизитов);
		ЗаполнитьЗначенияСвойств(Результат, Выборка);
		ЗначенияРеквизитов[Выборка.Ссылка] = Результат;
	КонецЦикла;
	
	Возврат ЗначенияРеквизитов;
	
КонецФункции

// Возвращает значения реквизита, прочитанного из информационной базы для нескольких объектов.
// 
//  Если доступа к реквизиту нет, возникнет исключение прав доступа.
//  Если необходимо зачитать реквизит независимо от прав текущего пользователя,
//  то следует использовать предварительный переход в привилегированный режим.
// 
// Функция не предназначена для получения значений реквизитов пустых ссылок.
//
// Параметры:
//  МассивСсылок - массив ссылок на объекты одного типа.
//				ВАЖНО! значения массива должны быть ссылками на 
//				объекты одного типа!
//  ИмяРеквизита - Строка, например, "Код".
// 
// Возвращаемое значение:
//  Соответствие - Ключ - ссылка на объект, Значение - значение прочитанного реквизита.
// 
Функция ЗначениеРеквизитаОбъектов(МассивСсылок, ИмяРеквизита) Экспорт
	
	ЗначенияРеквизитов = ЗначенияРеквизитовОбъектов(МассивСсылок, ИмяРеквизита);
	Для Каждого Элемент Из ЗначенияРеквизитов Цикл
		ЗначенияРеквизитов[Элемент.Ключ] = Элемент.Значение[ИмяРеквизита];
	КонецЦикла;
		
	Возврат ЗначенияРеквизитов;
	
КонецФункции

// Выводит сообщение об ошибке и выставляет параметр Отказ в "Истина".
//
// Параметры:
//  ТекстСообщения - строка, текст сообщения.
//  Отказ          - булево, признак отказа (необязательный).
//
Процедура СообщитьОбОшибке(ТекстСообщения, Отказ = Ложь) Экспорт
	
	Отказ = Истина;
	
	Renault_ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
	
КонецПроцедуры

// Получает имя значения перечисления как объекта метаданных.
//
// Параметры:
//  Значение - значение перечисления для которого необходимо получить имя перечисления.
//
// Возвращаемое значение:
//  Строка - имя значения перечисления как объекта метаданных.
//
Функция ИмяЗначенияПеречисления(Значение) Экспорт
	
	ОбъектМетаданных = Значение.Метаданные();
	
	ИндексЗначения = Перечисления[ОбъектМетаданных.Имя].Индекс(Значение);
	
	Возврат ОбъектМетаданных.ЗначенияПеречисления[ИндексЗначения].Имя;
	
КонецФункции 

// Обработчик события ПередЗаписью предопределенных элементов.
Процедура ЗапретитьПометкуУдаленияПредопределенныхЭлементовПередЗаписью(Источник, Отказ) Экспорт
	
	Если Источник.ОбменДанными.Загрузка
	 Или Источник.ИмяПредопределенныхДанных = ""
	 Или Источник.ПометкаУдаления <> Истина Тогда
		Возврат;
	КонецЕсли;
	
	Если Источник.ЭтоНовый() Тогда
		ВызватьИсключение
			НСтр("ru = 'Недопустимо создавать предопределенный элемент помеченный на удаление.'");
	Иначе
		СтарыеСвойства = Renault_ОбщегоНазначения.ЗначенияРеквизитовОбъекта(
			Источник.Ссылка, "ПометкаУдаления, ИмяПредопределенныхДанных");
		
		Если СтарыеСвойства.ИмяПредопределенныхДанных <> ""
		   И СтарыеСвойства.ПометкаУдаления <> Истина Тогда
			
			ВызватьИсключение Renault_СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				НСтр("ru = 'Недопустимо помечать на удаление предопределенный элемент:
				           |""%1"".'"),
				Строка(Источник.Ссылка));
			
		ИначеЕсли СтарыеСвойства.ИмяПредопределенныхДанных = ""
		        И СтарыеСвойства.ПометкаУдаления = Истина Тогда
			
			ВызватьИсключение Renault_СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				НСтр("ru = 'Недопустимо связывать с именем предопределенного элемент, помеченный на удаление:
				           |""%1"".'"),
				Строка(Источник.Ссылка));
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

// Обработчик события ПередУдалением предопределенных элементов.
Процедура ЗапретитьУдалениеПредопределенныхЭлементовПередУдалением(Источник, Отказ) Экспорт
	
	Если Источник.ОбменДанными.Загрузка
	 Или Источник.ИмяПредопределенныхДанных = "" Тогда
		Возврат;
	КонецЕсли;
	
	ВызватьИсключение Renault_СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
		НСтр("ru = 'Недопустимо удалять предопределенный элемент
		           |""%1"".'"),
		Строка(Источник.Ссылка));
	
КонецПроцедуры

// Проверяет физическое наличие записи в информационной базе данных о переданном значении ссылки.
//
// Параметры:
//  ЛюбаяСсылка - значение любой ссылки информационной базы данных.
// 
// Возвращаемое значение:
//  Булево.
//
Функция СсылкаСуществует(ЛюбаяСсылка) Экспорт
	
	ТекстЗапроса = "
	|ВЫБРАТЬ
	|	Ссылка КАК Ссылка
	|ИЗ
	|	[ИмяТаблицы]
	|ГДЕ
	|	Ссылка = &Ссылка
	|";
	
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "[ИмяТаблицы]", ИмяТаблицыПоСсылке(ЛюбаяСсылка));
	
	Запрос = Новый Запрос;
	Запрос.Текст = ТекстЗапроса;
	Запрос.УстановитьПараметр("Ссылка", ЛюбаяСсылка);
	
	УстановитьПривилегированныйРежим(Истина);
	
	Возврат НЕ Запрос.Выполнить().Пустой();
	
КонецФункции

// Возвращает полное имя объекта метаданных по переданному значению ссылки.
// Примеры:
//  "Справочник.Номенклатура";
//  "Документ.ПриходнаяНакладная".
//
// Параметры:
//  Ссылка - ЛюбаяСсылка - объект, для которого необходимо получить имя таблицы ИБ.
// 
// Возвращаемое значение:
//  Строка - полное имя объекта метаданных для указанного объекта.
//
Функция ИмяТаблицыПоСсылке(Ссылка) Экспорт
	
	Возврат Ссылка.Метаданные().ПолноеИмя();
	
КонецФункции

Процедура DMS_ПередЗаписьюДокументов(Источник, Отказ, РежимЗаписи, РежимПроведения) Экспорт
	
	Если Источник.ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли; 
	
	ТипИсточника = ТипЗнч(Источник);
	
	Если ТипИсточника = Тип("ДокументОбъект.Renault_Договор") Тогда
		
		Если Не ЗначениеЗаполнено(Источник.ДилерскийЦентр) Тогда
			Возврат;
		КонецЕсли; 
		
		Если Не Источник.ДилерскийЦентр.DMS_ИспользоватьДоговораВзаиморасчетовСДоговорамиПродаж Тогда
			Возврат;
		КонецЕсли; 
		
		Если Источник.Клиент = Неопределено 
			Или Не ЗначениеЗаполнено(Источник.Клиент) Тогда
			Сообщить("В договоре не заполнен клиент, создание договора взаиморасчетов не возможно. Необходимо создать контрагента и перезаписать договор.",СтатусСообщения.Информация);
			ЗаписьЖурналаРегистрации("Запись документа 'Договор на продажу автомобиля (Renault CRM)'",УровеньЖурналаРегистрации.Ошибка,,,"В договоре не заполнен клиент, создание договора взаиморасчетов не возможно.");
			Возврат;
		ИначеЕсли ТипЗнч(Источник.Клиент) = Тип("СправочникСсылка.Контрагенты") 
			И Не ЗначениеЗаполнено(Источник.Клиент) Тогда 
			Сообщить("В договоре не заполнен клиент, создание договора взаиморасчетов не возможно. Необходимо создать контрагента и перезаписать договор.",СтатусСообщения.Информация);
			ЗаписьЖурналаРегистрации("Запись документа 'Договор на продажу автомобиля (Renault CRM)'",УровеньЖурналаРегистрации.Ошибка,,,"В договоре не заполнен клиент, создание договора взаиморасчетов не возможно.");
			Возврат;
		ИначеЕсли ТипЗнч(Источник.Клиент) = Тип("СправочникСсылка.CRM_ПотенциальныеКонтрагенты")
			И Не ЗначениеЗаполнено(Источник.Клиент.Контрагент)Тогда
			Сообщить("В договоре не заполнен клиент, создание договора взаиморасчетов не возможно. Необходимо создать контрагента и перезаписать договор.",СтатусСообщения.Информация);
			ЗаписьЖурналаРегистрации("Запись документа 'Договор на продажу автомобиля (Renault CRM)'",УровеньЖурналаРегистрации.Ошибка,,,"В договоре не заполнен клиент, создание договора взаиморасчетов не возможно.");
			Возврат;
		КонецЕсли; 
		
		СтруктураРеквизитовДоговора = ПолучитьРеквизитыДоговора(Источник,РежимЗаписи);
		
		Если Источник.ЭтоНовый() Тогда
			
			Источник.DMS_ДоговорВзаиморасчетов = СоздатьДоговорВзаиморасчетов(СтруктураРеквизитовДоговора);
			
		ИначеЕсли Не ЗначениеЗаполнено(Источник.DMS_ДоговорВзаиморасчетов) Тогда 
			
			Источник.DMS_ДоговорВзаиморасчетов = СоздатьДоговорВзаиморасчетов(СтруктураРеквизитовДоговора);
			
		ИначеЕсли ЗначениеЗаполнено(Источник.DMS_ДоговорВзаиморасчетов) 
			И ДоговорВзаиморасчетовНужноИзменить(Источник.DMS_ДоговорВзаиморасчетов,СтруктураРеквизитовДоговора) Тогда  
			
			ДоговорОбъект = Источник.DMS_ДоговорВзаиморасчетов.ПолучитьОбъект();
			ЗаполнитьЗначенияСвойств(ДоговорОбъект,СтруктураРеквизитовДоговора);
			
			ДоговорОбъект.Наименование = СформироватьНаименованиеДоговораВзаиморасчетов(ДоговорОбъект);
			
			Попытка
				ДоговорОбъект.Записать();
			Исключение
			  	Сообщить(КраткоеПредставлениеОшибки(ИнформацияОбОшибке()));
				ЗаписьЖурналаРегистрации("Запись документа 'Договор на продажу автомобиля (Renault CRM)'",УровеньЖурналаРегистрации.Ошибка,,,ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
				Возврат;
			КонецПопытки;
		
		КонецЕсли; 
		
	ИначеЕсли ТипИсточника = Тип("ДокументОбъект.ПоступлениеАвтомобилей") Тогда
				
		РежимДопОпераций = Справочники.Renault_СлужебныеНастройкиБазыДанных[ПараметрыСеанса.DMS_Бренд.Наименование].ВключитьРежимДопОперацийДляПоступленияАвтомобилей;
		
		Если РежимДопОпераций И Не ЗначениеЗаполнено(Источник.DMS_ВидАвтомобиля) Тогда
			Сообщить("Не указан тип автомобилей: Консигнация, Конверсия, Подменный, Демонстрационный, Выкуп, Зачет Комиссия, Агентский");
			Отказ = Истина;
			Возврат;
		КонецЕсли;		
	
	КонецЕсли; 
	
КонецПроцедуры

Функция СоздатьДоговорВзаиморасчетов(СтруктураРеквизитовДоговора)
	
	ДоговорОбъект = Справочники.ДоговорыВзаиморасчетов.СоздатьЭлемент();
	ЗаполнитьЗначенияСвойств(ДоговорОбъект,СтруктураРеквизитовДоговора);
	
	ДоговорОбъект.Наименование = СформироватьНаименованиеДоговораВзаиморасчетов(ДоговорОбъект);
	ДоговорОбъект.ЕдиницаИзмеренияАвтоработВПечатныхФормах = обПраво("ЕдиницаИзмеренияАвтоработВПечатныхФормах"); // DMSREN-1228
	Попытка
		ДоговорОбъект.Записать();
	Исключение
		Сообщить(КраткоеПредставлениеОшибки(ИнформацияОбОшибке()));
		ЗаписьЖурналаРегистрации("Запись документа 'Договор на продажу автомобиля (Renault CRM)'",УровеньЖурналаРегистрации.Ошибка,,,ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		Возврат Неопределено
	КонецПопытки;
	
	Возврат ДоговорОбъект.Ссылка;
	
КонецФункции // СоздатьДоговорВзаиморасчетов()

Функция ДоговорВзаиморасчетовНужноИзменить(ДоговорВзаиморасчетов,СтруктураРеквизитовДоговора)
	
	СтруктураПроверкиРеквизитов = Новый Структура;
	
	Для каждого РеквизитДоговора Из СтруктураРеквизитовДоговора Цикл
		СтруктураПроверкиРеквизитов.Вставить(РеквизитДоговора.Ключ);	
	КонецЦикла; 
	
	Результат = ЗначенияРеквизитовОбъекта(ДоговорВзаиморасчетов, СтруктураПроверкиРеквизитов);
	
	Для каждого РеквизитПроверки Из Результат Цикл
	
		Если СтруктураРеквизитовДоговора[РеквизитПроверки.Ключ] <> РеквизитПроверки.Значение Тогда
			Возврат Истина;
		КонецЕсли; 	
		
	КонецЦикла;
	
	Возврат Ложь;
	
КонецФункции

// Формирует стандартное наименование договора
// вида Договор поставки №ХХХХХ а Валюте от ДД.ММ.ГГГГ
// Используется как при интерактивном, так и при программном создании
Функция СформироватьНаименованиеДоговораВзаиморасчетов(Договор) Экспорт
	
	Возврат СокрЛП(Строка(Договор.ВидДоговора))
	             + ?(ПустаяСтрока(Договор.НомерДоговора),""," № " + СокрЛП(Договор.НомерДоговора))
	             + " в " + Договор.ВалютаВзаиморасчетов.Наименование
	             + " от "+Формат(Договор.ДатаНачала,"ДФ=дд.ММ.гг");
				 
КонецФункции // СформироватьНаименованиеДоговораВзаиморасчетов()
			 
Функция ПолучитьРеквизитыДоговора(Объект,РежимЗаписи)
	
	Права = Неопределено;
	
	#Если Клиент Тогда
		Права = глПрава;
	#КонецЕсли
	
	Если Объект.ЭтоНовый() Тогда
		
		ВалютаВзаиморасчетов = обПраво("ОсновнаяВалютаВзаиморасчетов",Права);
		
		Если Не ЗначениеЗаполнено(ВалютаВзаиморасчетов) Тогда
			ВалютаВзаиморасчетов = Константы.ВалютаУправленческогоУчетаКомпании.Получить();
		КонецЕсли; 
		
		Если ЗначениеЗаполнено(Объект.DMS_Подразделение) Тогда
			Подразделение = Объект.DMS_Подразделение;
		Иначе 	
			Подразделение = ПараметрыСеанса.ПодразделениеКомпании;
		КонецЕсли; 
		
	Иначе 
		
		ВалютаВзаиморасчетов = Объект.DMS_ДоговорВзаиморасчетов.ВалютаВзаиморасчетов;
		
		Если Не ЗначениеЗаполнено(ВалютаВзаиморасчетов) Тогда
			ВалютаВзаиморасчетов = Константы.ВалютаУправленческогоУчетаКомпании.Получить();
		КонецЕсли;
		
		Если ЗначениеЗаполнено(Объект.DMS_Подразделение) Тогда
			Подразделение = Объект.DMS_Подразделение;
		Иначе 	
			Подразделение = Объект.DMS_ДоговорВзаиморасчетов.Подразделение;
		КонецЕсли; 
		
	КонецЕсли; 
	
	СтруктураРеквизитов = Новый Структура;
	
	СтруктураРеквизитов.Вставить("ДатаНачала",	  Объект.ДатаДоговора);
	СтруктураРеквизитов.Вставить("НомерДоговора", Объект.Номер );
	
	Если ТипЗнч(Объект.Клиент) = Тип("СправочникСсылка.CRM_ПотенциальныеКонтрагенты") Тогда
		СтруктураРеквизитов.Вставить("Владелец", Объект.Клиент.Контрагент);
	Иначе 
		СтруктураРеквизитов.Вставить("Владелец", Объект.Клиент);
	КонецЕсли;
	
	ВидОплаты = Неопределено;
	
	Если Объект.ОсновнаяФормаОплаты = Справочники.Renault_ФормыОплатыДоговоров.БезналичныйПеревод Тогда 
		ВидОплаты = Перечисления.ВидыОплаты.БезналичныйРасчет;
	ИначеЕсли Объект.ОсновнаяФормаОплаты = Справочники.Renault_ФормыОплатыДоговоров.Наличными Тогда 
		ВидОплаты = Перечисления.ВидыОплаты.НаличныйРасчет;
	ИначеЕсли Объект.ОсновнаяФормаОплаты = Справочники.Renault_ФормыОплатыДоговоров.КредитПрочиеБанки Тогда 
		ВидОплаты = Перечисления.ВидыОплаты.БезналичныйРасчет;
	ИначеЕсли Объект.ОсновнаяФормаОплаты = Справочники.Renault_ФормыОплатыДоговоров.КредитРНБанк Тогда 
		ВидОплаты = Перечисления.ВидыОплаты.БезналичныйРасчет;
	Иначе  
		ВидОплаты = Перечисления.ВидыОплаты.ПроизвольнаяОплата;
	КонецЕсли;
	
	СтруктураРеквизитов.Вставить("Организация",			 Объект.Организация);
	СтруктураРеквизитов.Вставить("ВидДоговора",			 Перечисления.ВидыДоговоров.Продажа);
	СтруктураРеквизитов.Вставить("ВидОплаты",			 ВидОплаты);
	СтруктураРеквизитов.Вставить("Комментарий",			 Объект.Комментарий);
	СтруктураРеквизитов.Вставить("ВалютаВзаиморасчетов", ВалютаВзаиморасчетов);
	
	Если Объект.ЭтоНовый() И РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда
		СтруктураРеквизитов.Вставить("ПометкаУдаления", Ложь);
	ИначеЕсли Объект.Проведен И РежимЗаписи = РежимЗаписиДокумента.ОтменаПроведения Тогда 
		СтруктураРеквизитов.Вставить("ПометкаУдаления", Истина);
	ИначеЕсли ТипЗнч(Объект) = Тип("ДокументОбъект.Renault_Договор") Тогда 
		СтруктураРеквизитов.Вставить("ПометкаУдаления", Ложь);
	Иначе 
		СтруктураРеквизитов.Вставить("ПометкаУдаления", Объект.ПометкаУдаления Или Не Объект.Проведен Или Объект.СтатусДоговора = Перечисления.CRM_СтатусыДоговоровНаПродажуАвтомобиля.Черновик Или Объект.СтатусДоговора = Перечисления.CRM_СтатусыДоговоровНаПродажуАвтомобиля.Расторгнут);
	КонецЕсли; 
	
	СтруктураРеквизитов.Вставить("Подразделение", Подразделение);
	
	//Если Объект.СоставДоговора.Количество() > 0 Тогда
	//	СтрокаСоставДоговора = Объект.СоставДоговора[0];	
	//	СтруктураРеквизитов.Вставить("DMS_Автомобиль", СтрокаСоставДоговора.Автомобиль);
	//Иначе 
	//	СтруктураРеквизитов.Вставить("DMS_Автомобиль", Справочники.Автомобили.ПустаяСсылка());
	//КонецЕсли; 
	
	
	
	Если Метаданные.Перечисления.Найти("ТипыДоговоров") <> Неопределено Тогда
		СтруктураРеквизитов.Вставить("ТипДоговора", Перечисления.ТипыДоговоров.Договор); 
	КонецЕсли;
	
	Если Метаданные.Справочники.ДоговорыВзаиморасчетов.Реквизиты.Найти("ДляАвтосалона") <> Неопределено Тогда
		СтруктураРеквизитов.Вставить("ДляАвтосалона", Истина); 
	КонецЕсли;

	Если НЕ ЗначениеЗаполнено(СтруктураРеквизитов.Подразделение) Тогда
		СтруктураРеквизитов.Вставить("Подразделение", ПараметрыСеанса.Пользователь.Подразделение); 
	КонецЕсли;
	
	Возврат СтруктураРеквизитов;
	
КонецФункции // ПолучитьРеквизитыДоговора()      

Процедура DMS_ОбработкаЗаполненияДокументов(Источник, ДанныеЗаполнения, СтандартнаяОбработка) Экспорт
	
	ТипИсточника = ТипЗнч(Источник);
	
	Если ТипИсточника = Тип("ДокументОбъект.Renault_Договор") Тогда
		Источник.DMS_Подразделение = ПараметрыСеанса.ПодразделениеКомпании;
	КонецЕсли; 
	
КонецПроцедуры

Процедура DMS_ПриКопированииДокументов(Источник, ОбъектКопирования) Экспорт
	
	ТипИсточника = ТипЗнч(Источник);
	
	Если ТипИсточника = Тип("ДокументОбъект.Renault_Договор") Тогда
		Источник.DMS_Подразделение = ПараметрыСеанса.ПодразделениеКомпании;
		Источник.DMS_ДоговорВзаиморасчетов = Неопределено;
	КонецЕсли; 
	
КонецПроцедуры

Процедура ПриОткрытиФормы(Объект,Форма,ПовторноеОткрытие = Ложь) Экспорт 

	Если ТипЗнч(Объект) = Тип("СправочникОбъект.Автомобили") Тогда
		
		Если Объект.ЭтоНовый() Тогда
			Возврат;
		КонецЕсли;
		
		ДилерскийЦентр = ПолучитьДилерскийЦентрПоАвтомобилю(Объект.Ссылка);
		
		Если Не ДилерскийЦентр.DMS_ИспользоватьДоговораВзаиморасчетовСДоговорамиПродаж Тогда
			Возврат;
		КонецЕсли; 
		
		РезультатЗапроса = ПолучитьВыборкуВзаиморасчетовПоАвтомобилю(ДилерскийЦентр,Объект.Ссылка);
		
		Если РезультатЗапроса.Пустой() Тогда
			Возврат;
		КонецЕсли; 
		
		ЭлементыФормы = Форма.ЭлементыФормы;
		
		СтраницыПанельДополнительно = ЭлементыФормы.ПанельДополнительно.Страницы;
		
		Если СтраницыПанельДополнительно.Найти("СтраницаОплата") = Неопределено Тогда
		
			СтраницаОплата = СтраницыПанельДополнительно.Добавить("СтраницаОплата","Оплата",,БиблиотекаКартинок.ВзаиморасчетыСКонтрагентами);		
			
			НачальнаяСтраница = ЭлементыФормы.ПанельДополнительно.ТекущаяСтраница;
			
			ЭлементыФормы.ПанельДополнительно.ТекущаяСтраница = СтраницаОплата;
						
			ТабличныйДокумент = ЭлементыФормы.Добавить(Тип("ПолеТабличногоДокумента"),"ТабличныйДокументОплаты",Истина,ЭлементыФормы.ПанельДополнительно);
			ТабличныйДокумент.ТипЗначения = Новый ОписаниеТипов("ПолеТабличногоДокумента");
			                                          
			ТабличныйДокумент.Высота = ЭлементыФормы.ПанельДополнительно.Высота - 10;
			ТабличныйДокумент.Ширина = ЭлементыФормы.ПанельДополнительно.Ширина - 10;
			
			Отчет = Отчеты.DMS_ВзаиморасчетыПоАвтомобилям.Создать();
			Отчет.СформироватьТабличныйДокумент(ТабличныйДокумент,РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам));
			
			ЭлементыФормы.ПанельДополнительно.ТекущаяСтраница = НачальнаяСтраница;
			
		КонецЕсли; 
	
	КонецЕсли; 	

КонецПроцедуры

Процедура DMS_ОбработкаПроведения(Источник, Отказ, РежимПроведения) Экспорт
	
	ТипИсточника = ТипЗнч(Источник);
	
	Если ТипИсточника = Тип("ДокументОбъект.Renault_Договор") Тогда
		ВыполнитьДвиженияДокументаRenault_Договор(Источник, Отказ, РежимПроведения);	
	КонецЕсли; 
	
КонецПроцедуры

Процедура ВыполнитьДвиженияДокументаRenault_Договор(Источник, Отказ, РежимПроведения)

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ДокументСсылка",Источник.Ссылка);
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	АвтомобилиДоговора.Ссылка.Дата КАК Период,
		|	АвтомобилиДоговора.Ссылка КАК Регистратор,
		|	АвтомобилиДоговора.Ссылка.Организация КАК Организация,
		|	АвтомобилиДоговора.Ссылка.ДилерскийЦентр КАК ДилерскийЦентр,
		|	АвтомобилиДоговора.Ссылка.DMS_ДоговорВзаиморасчетов КАК ДоговорВзаиморасчетов,
		|	АвтомобилиДоговора.Автомобиль КАК Автомобиль
		|ИЗ
		|	Документ.Renault_Договор.СоставДоговора КАК АвтомобилиДоговора
		|ГДЕ
		|	АвтомобилиДоговора.Ссылка = &ДокументСсылка
		|	И АвтомобилиДоговора.Ссылка.ДилерскийЦентр.DMS_ИспользоватьДоговораВзаиморасчетовСДоговорамиПродаж
		|	И АвтомобилиДоговора.Ссылка.DMS_ДоговорВзаиморасчетов <> ЗНАЧЕНИЕ(Справочник.ДоговорыВзаиморасчетов.ПустаяСсылка)
		|	И АвтомобилиДоговора.Ссылка.СтатусДоговора <> ЗНАЧЕНИЕ(Перечисление.CRM_СтатусыДоговоровНаПродажуАвтомобиля.Черновик)";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Источник.Движения.DMS_ДоговораПродажАвтомобиля.Записывать = Истина;
	Источник.Движения.DMS_ДоговораПродажАвтомобиля.Загрузить(РезультатЗапроса.Выгрузить());
		
КонецПроцедуры
 
Функция ПолучитьДилерскийЦентрПоАвтомобилю(Автомобиль)
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Автомобиль", Автомобиль);
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ДоговораПродажАвтомобиля.ДилерскийЦентр
		|ИЗ
		|	РегистрСведений.DMS_ДоговораПродажАвтомобиля.СрезПоследних КАК ДоговораПродажАвтомобиля
		|ГДЕ
		|	ДоговораПродажАвтомобиля.Автомобиль = &Автомобиль";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	ДилерскийЦентр = Справочники.CRM_ДилерскиеЦентры.ПустаяСсылка();
	
	Если ВыборкаДетальныеЗаписи.Следующий() И ВыборкаДетальныеЗаписи.Количество() = 1 Тогда
		ДилерскийЦентр = ВыборкаДетальныеЗаписи.ДилерскийЦентр;	
	КонецЕсли; 
	
	Возврат ДилерскийЦентр;
	
КонецФункции // ПолучитьДилерскийЦентрПоАвтомобилю()
  
Функция ПолучитьВыборкуВзаиморасчетовПоАвтомобилю(ДилерскийЦентр,Автомобиль,Организация = Неопределено) Экспорт 
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Автомобиль", 	Автомобиль);
	Запрос.УстановитьПараметр("ДилерскийЦентр", ДилерскийЦентр);
	Запрос.УстановитьПараметр("Организация", 	?(Организация = Неопределено,Справочники.Организации.ПустаяСсылка(),Организация));
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ДоговораПродажАвтомобиля.Организация,
		|	ДоговораПродажАвтомобиля.ДилерскийЦентр,
		|	ДоговораПродажАвтомобиля.ДоговорВзаиморасчетов,
		|	ДоговораПродажАвтомобиля.Автомобиль
		|ПОМЕСТИТЬ ДоговораВзаиморасчетовПоАвто
		|ИЗ
		|	РегистрСведений.DMS_ДоговораПродажАвтомобиля.СрезПоследних(
		|			,
		|			(Организация = &Организация
		|				ИЛИ &Организация = ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка))
		|				И ДилерскийЦентр = &ДилерскийЦентр) КАК ДоговораПродажАвтомобиля
		|ГДЕ
		|	ДоговораПродажАвтомобиля.Автомобиль = &Автомобиль
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВзаиморасчетыКомпанииОбороты.Период КАК Период,
		|	ВзаиморасчетыКомпанииОбороты.Регистратор КАК Регистратор,
		|	ДоговораВзаиморасчетовПоАвто.Автомобиль КАК Автомобиль,
		|	ВзаиморасчетыКомпанииОбороты.Контрагент КАК Контрагент,
		|	ВзаиморасчетыКомпанииОбороты.ДоговорВзаиморасчетов КАК ДоговорВзаиморасчетов,
		|	ВзаиморасчетыКомпанииОбороты.СуммаПриход КАК СуммаПриход,
		|	ВзаиморасчетыКомпанииОбороты.СуммаРасход КАК СуммаРасход,
		|	-ВзаиморасчетыКомпанииОбороты.СуммаОборот КАК СуммаДолга,
		|	ДоговораВзаиморасчетовПоАвто.ДилерскийЦентр КАК ДилерскийЦентр,
		|	ДоговораВзаиморасчетовПоАвто.Автомобиль.ВалютаУчета КАК Валюта,
		|	ДоговораВзаиморасчетовПоАвто.Организация КАК Организация
		|ИЗ
		|	ДоговораВзаиморасчетовПоАвто КАК ДоговораВзаиморасчетовПоАвто
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.ВзаиморасчетыКомпании.Обороты(, , Регистратор, ) КАК ВзаиморасчетыКомпанииОбороты
		|		ПО ДоговораВзаиморасчетовПоАвто.ДоговорВзаиморасчетов = ВзаиморасчетыКомпанииОбороты.ДоговорВзаиморасчетов
		|ИТОГИ
		|	СУММА(СуммаДолга),
		|	МАКСИМУМ(Валюта)
		|ПО
		|	Автомобиль";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Возврат РезультатЗапроса;
	
КонецФункции // ПолучитьВыборкуВзаиморасчетовПоАвтомобилю()

Процедура DMS_ПередЗаписьюСправочников(Источник, Отказ) Экспорт
	
	Если Источник.ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли; 
	
	ТипИсточника = ТипЗнч(Источник);
	
	Если ТипИсточника = Тип("СправочникОбъект.ДоговорыВзаиморасчетов") Тогда
		
		ДилерскийЦентр = ПолучитьОсновногоДилерскийЦентрПоНастройке(ПараметрыСеанса.Пользователь);
		
		Если Не ЗначениеЗаполнено(ДилерскийЦентр) Тогда
			Возврат;
		КонецЕсли; 
		
		Если Источник.ЭтоНовый() 
			И ПустаяСтрока(Источник.НомерДоговора) 
			И ДилерскийЦентр.DMS_ИспользоватьАвтоЗаполнениеНомеровДоговораВзаиморасчетов Тогда
		
			Источник.НомерДоговора = Источник.Код;
		
		КонецЕсли; 
	
	КонецЕсли; 
	
КонецПроцедуры

Процедура DMS_ПриКопированииСправочников(Источник, ОбъектКопирования) Экспорт
	
	ТипИсточника = ТипЗнч(Источник);
	
	Если ТипИсточника = Тип("СправочникОбъект.ДоговорыВзаиморасчетов") Тогда
		Источник.НомерДоговора = "";
	КонецЕсли; 
	
КонецПроцедуры

Функция ПолучитьОсновногоДилерскийЦентрПоНастройке(Пользователь,ДилерскийЦентр = Неопределено) Экспорт 
	
	ЗначениеДилерскийЦентр = Справочники.CRM_ДилерскиеЦентры.ПустаяСсылка();
	
	Если ЗначениеЗаполнено(ДилерскийЦентр) Тогда
		
		Возврат ДилерскийЦентр;
		
	ИначеЕсли Не ЗначениеЗаполнено(Пользователь) Тогда 
		
		ЗначениеДилерскийЦентр = Справочники.CRM_ДилерскиеЦентры.ПолучитьПредставителяПоУмолчанию();	
		Возврат ЗначениеДилерскийЦентр;
		
	Иначе 
		
		 ЗначениеДилерскийЦентр = ПолучитьНастройкуПользователя(Пользователь,"ДилерскийЦентр");
		 
		 Если Не ЗначениеЗаполнено(ЗначениеДилерскийЦентр) Тогда
		 	ЗначениеДилерскийЦентр = ПолучитьДилерскийЦентрПоУмолчанию();	
		 КонецЕсли; 
		 
		 Возврат ЗначениеДилерскийЦентр;
		 
	КонецЕсли; 

КонецФункции // ПолучитьОсновногоПредставителяПоНастройке()

Функция ПолучитьНастройкуПользователя(Пользователь,ИмяНастройки)
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Пользователь", Пользователь);
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ПользовательскиеНастройки.ПраваИНастройки
		|ПОМЕСТИТЬ ТаблицаНастроек
		|ИЗ
		|	РегистрСведений.Renault_ПользователиИШаблоныПравИНастроек КАК ПользовательскиеНастройки
		|ГДЕ
		|	ПользовательскиеНастройки.Пользователь = &Пользователь
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ТаблицаНастроек.ПраваИНастройки.[ИмяНастройки] КАК [ИмяНастройки]
		|ИЗ
		|	ТаблицаНастроек КАК ТаблицаНастроек";
		
	Запрос.Текст = СтрЗаменить(Запрос.Текст,"[ИмяНастройки]",ИмяНастройки);	
		
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаНастроек = РезультатЗапроса.Выбрать();
	
	Если ВыборкаНастроек.Следующий() Тогда
		Возврат ВыборкаНастроек[ИмяНастройки];	
	КонецЕсли; 
	
	Возврат Неопределено;
	
КонецФункции // ПолучитьНастройкуПользователя()

Функция ПолучитьДилерскийЦентрПоУмолчанию() Экспорт 
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ ПЕРВЫЕ 2
		|	ДилерскиеЦентры.Ссылка
		|ИЗ
		|	Справочник.CRM_ДилерскиеЦентры КАК ДилерскиеЦентры
		|ГДЕ
		|	НЕ ДилерскиеЦентры.ПометкаУдаления";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	ДилерскийЦентр = Справочники.CRM_ДилерскиеЦентры .ПустаяСсылка();
	
	Если ВыборкаДетальныеЗаписи.Следующий() И ВыборкаДетальныеЗаписи.Количество() = 1 Тогда
		ДилерскийЦентр = ВыборкаДетальныеЗаписи.Ссылка;
	КонецЕсли; 
	
	Возврат ДилерскийЦентр;
	
КонецФункции // ПолучитьДилерскийЦентрПоУмолчанию()
  			 
Функция ПолучитьПрефикс(Организация = Неопределено) Экспорт
	
	Настройки = Справочники.Renault_СлужебныеНастройкиБазыДанных[ПараметрыСеанса.DMS_Бренд.Наименование];	
	Если Не Настройки.ИспользоватьПрефиксациюДокументовИСправочниковDMS Тогда
		Возврат "";
	КонецЕсли;	
	
	Если ЗначениеЗаполнено(Организация) Тогда
		Возврат Организация.Префикс;
	Иначе
		Возврат ПараметрыСеанса.Пользователь.Организация.Префикс;
	КонецЕсли;
	
КонецФункции //DMS_ОбщегоНазначенияСервер.ПолучитьПрефикс();	

// Возвращает менеджер объекта по ссылке на объект.
// Ограничение: не обрабатываются точки маршрутов бизнес-процессов.
// См. также ОбщегоНазначения.МенеджерОбъектаПоПолномуИмени.
//
// Параметры:
//  Ссылка - ЛюбаяСсылка - объект, менеджер которого требуется получить.
//
// Возвращаемое значение:
//  СправочникМенеджер, ДокументМенеджер, ОбработкаМенеджер, РегистрСведенийМенеджер - менеджер объекта.
//
// Пример:
//  МенеджерСправочника = ОбщегоНазначения.МенеджерОбъектаПоСсылке(СсылкаНаОрганизацию);
//  ПустаяСсылка = МенеджерСправочника.ПустаяСсылка();
//
Функция МенеджерОбъектаПоСсылке(Ссылка) Экспорт
	
	ИмяОбъекта = Ссылка.Метаданные().Имя;
	ТипСсылки = ТипЗнч(Ссылка);
	
	Если Справочники.ТипВсеСсылки().СодержитТип(ТипСсылки) Тогда
		Возврат Справочники[ИмяОбъекта];
		
	ИначеЕсли Документы.ТипВсеСсылки().СодержитТип(ТипСсылки) Тогда
		Возврат Документы[ИмяОбъекта];
		
	ИначеЕсли БизнесПроцессы.ТипВсеСсылки().СодержитТип(ТипСсылки) Тогда
		Возврат БизнесПроцессы[ИмяОбъекта];
		
	ИначеЕсли ПланыВидовХарактеристик.ТипВсеСсылки().СодержитТип(ТипСсылки) Тогда
		Возврат ПланыВидовХарактеристик[ИмяОбъекта];
		
	ИначеЕсли ПланыСчетов.ТипВсеСсылки().СодержитТип(ТипСсылки) Тогда
		Возврат ПланыСчетов[ИмяОбъекта];
		
	ИначеЕсли ПланыВидовРасчета.ТипВсеСсылки().СодержитТип(ТипСсылки) Тогда
		Возврат ПланыВидовРасчета[ИмяОбъекта];
		
	ИначеЕсли Задачи.ТипВсеСсылки().СодержитТип(ТипСсылки) Тогда
		Возврат Задачи[ИмяОбъекта];
		
	ИначеЕсли ПланыОбмена.ТипВсеСсылки().СодержитТип(ТипСсылки) Тогда
		Возврат ПланыОбмена[ИмяОбъекта];
		
	ИначеЕсли Перечисления.ТипВсеСсылки().СодержитТип(ТипСсылки) Тогда
		Возврат Перечисления[ИмяОбъекта];
	Иначе
		Возврат Неопределено;
	КонецЕсли;
	
КонецФункции

//ОПД
// Возвращаемое значение:
//  Массив соответствий с шифрованием Base64 или соответсвтие.
Функция ПолучитьДанныеОПД(СтруктураСогласия,Клиент) Экспорт 
	Дилер = Renault_CRM.ПолучитьДилерскийЦентрПользователя();
	СтруктураДилера = Новый Структура;
	СтруктураДилера.Вставить("Наименование",Дилер.НаименованиеДляПечати);
	СтруктураДилера.Вставить("Индекс","");
	СтруктураДилера.Вставить("Город",Дилер.Город);
	СтруктураДилера.Вставить("Адрес",Дилер.ОсновнойАдрес);
	СтруктураДилера.Вставить("BIR",Дилер.Бир_ЛМТ);
	СтруктураСогласия.Вставить("dealer",СтруктураДилера);
	
	
	ssl1 = Новый ЗащищенноеСоединениеOpenSSL(
			Новый СертификатКлиентаWindows(),
			Новый СертификатыУдостоверяющихЦентровWindows());
	
	Настройки = Справочники.Renault_СлужебныеНастройкиБазыДанных[ПараметрыСеанса.DMS_Бренд.Наименование];
	Соединение = Новый HTTPСоединение(Настройки.URL_ОПД, Настройки.Порт_ОПД,Настройки.ЛогинОПД,Настройки.ПарольОПД,,,ssl1); 
	Запрос = Новый HTTPЗапрос(Настройки.Сервер_ОПД+"?ID="+Клиент.УникальныйИдентификатор());
	Запрос.УстановитьТелоИзСтроки(СериализоватьJSON(СтруктураСогласия));
    Результат = Соединение.ОтправитьДляОбработки(Запрос);
	Если Результат.КодСостояния <> 200 Тогда 
		Возврат Неопределено;
	КонецЕсли;
	
	JSON = Результат.ПолучитьТелоКакСтроку();
	Возврат ДесериализоватьJSON(JSON);
КонецФункции

Функция СериализоватьJSON(Данные)
	
	Запись = Новый ЗаписьJSON;
	Запись.УстановитьСтроку();
	ЗаписатьJSON(Запись, Данные);
	Возврат Запись.Закрыть();
	
КонецФункции

функция ДесериализоватьJSON(СтрокаJSON)
	
	Чтение = новый ЧтениеJSON;
	Чтение.УстановитьСтроку(СтрокаJSON);
	Результат = ПрочитатьJSON(Чтение,true);
	Возврат Результат;
	
КонецФункции

Функция ПолучитьПечатныеФормуССервера(Клиент,Паспорт="",Автомобиль="",ДатаПокупки="",ВидСогласия,Согласие) Экспорт
	ТелоЗапроса = ПодготовитьТелоЗапроса(Клиент,Паспорт,Автомобиль,ДатаПокупки,ВидСогласия,Согласие);
	Настройки = Справочники.Renault_СлужебныеНастройкиБазыДанных[ПараметрыСеанса.DMS_Бренд.Наименование];

	
	Соединение = Новый HTTPСоединение(Настройки.URL_ОПД, Настройки.Порт_ОПД,"Администратор",""); 
    Запрос = Новый HTTPЗапрос(Настройки.Сервер_ОПД+"?ID="+Клиент.УникальныйИдентификатор());
	//Запрос.пара
	
    Результат = Соединение.Получить(Запрос);
	JSON = Результат.ПолучитьТелоКакСтроку();

КонецФункции

Функция ПодготовитьТелоЗапроса(Клиент,Паспорт,Автомобиль,ДатаПокупки,ВидСогласия,Согласие)
		
	СтруктураКлиента = Новый Структура;
	СтруктураДокумента = Новый Структура;
	СтруктураАвтомобиля = Новый Структура;
	
	СтруктураДокумента.Вставить("passportnumber",?(Паспорт.Свойство("Номер"),Паспорт.Номер,""));
	СтруктураДокумента.Вставить("passportseries",?(Паспорт.Свойство("Серия"),Паспорт.Серия,""));
	СтруктураДокумента.Вставить("passportissued",?(Паспорт.Свойство("Выдан"),Паспорт.Выдан,""));
	СтруктураДокумента.Вставить("passportday",?(Паспорт.Свойство("День"),Паспорт.День,""));
	СтруктураДокумента.Вставить("passportmonth",?(Паспорт.Свойство("Месяц"),Паспорт.Месяц,""));
	СтруктураДокумента.Вставить("passportyear",?(Паспорт.Свойство("Год"),Паспорт.Год,""));
	
	СтруктураКлиента.Вставить("lastname",Клиент.Фамилия);
	СтруктураКлиента.Вставить("firstname",Клиент.Имя);
	СтруктураКлиента.Вставить("middlename",Клиент.Отчество);
	СтруктураКлиента.Вставить("birthday",Клиент.ДатаРождения);
	СтруктураКлиента.Вставить("gender",?(Клиент.Пол=Перечисления.ПолФизическихЛиц.НеУказан,"",Клиент.Пол));
	СтруктураКлиента.Вставить("address","Сюда подставим адрес");
	СтруктураКлиента.Вставить("tel","сюда телефон");
	СтруктураКлиента.Вставить("email","сюда почта");
	СтруктураКлиента.Вставить("document",СтруктураДокумента);
	
	Автомобиль = ?(ЗначениеЗаполнено(Автомобиль),Автомобиль,Справочники.Автомобили.СоздатьЭлемент());
	СтруктураАвтомобиля.Вставить("mark",Автомобиль.Модель);
	СтруктураАвтомобиля.Вставить("vin",Автомобиль.VIN);
	СтруктураАвтомобиля.Вставить("daybuycar",ДатаПокупки);
	
	
КонецФункции

Процедура DMS_ОбработкаБотов(Параметр = Неопределено) Экспорт
	
	Если НЕ СистемаВзаимодействия.ИспользованиеДоступно() Тогда
		Возврат;
	КонецЕсли;
	
	СистемаВзаимодействия.ВыполнитьОбработкуБотов();
	
	Константы.Renault_ДатаОбновленияКЦ.Установить(ТекущаяДата());
	
КонецПроцедуры

Процедура УдалитьБотовСистемыВзаимодействия() Экспорт    
	
	Боты = СистемаВзаимодействия.ПолучитьБотов();
	Для Каждого Бот Из Боты Цикл 
		Если не Бот.Предопределенный Тогда
			Бот.Удалить();
		КонецЕсли;
	КонецЦикла;
	
	Выборка = Справочники.CRM_ДилерскиеЦентры.Выбрать();
	Пока Выборка.Следующий() Цикл 
		Если Выборка.ПометкаУдаления = Истина или не ЗначениеЗаполнено(Выборка.Бир_ЛМТ) Тогда
			Продолжить;
		КонецЕсли;	
	КонецЦикла;
	
КонецПроцедуры  

Процедура СоздатьБотовСистемыВзаимодействия() Экспорт   

	Если НЕ СистемаВзаимодействия.ИспользованиеДоступно() Тогда
		Возврат;
	КонецЕсли;
	
	Выборка = Справочники.CRM_ДилерскиеЦентры.Выбрать();
	Индекс = 0;
	Пока Выборка.Следующий() Цикл                        
		Если Выборка.ПометкаУдаления = Истина или не ЗначениеЗаполнено(Выборка.Бир_ЛМТ) Тогда
			Продолжить;
		КонецЕсли;
		Индекс = Индекс+1;
		ИмяПользователя = СтрШаблон("LeadsReceiver_%1", Выборка.Бир_ЛМТ);
		ПользовательСВ = ПолучитьПользователяСистемыВзаимодействияПоИмени(ИмяПользователя);
		Если ПользовательСВ = Неопределено Тогда
			ПользовательСВ = СоздатьПользователяСистемыВзаимодействияПоИмени(ИмяПользователя);
		КонецЕсли;
		Бот = СистемаВзаимодействия.СоздатьБота();
		Бот.Метаданные = Метаданные.Боты["ПолучениеЛидовДЦ"+Строка(Индекс)];
		Бот.Пользователь = ПользовательСВ.Идентификатор;
		Бот.ДополнительныеПараметры = Новый Структура("BIR", Выборка.Бир_ЛМТ);
		Бот.Записать();
	КонецЦикла;
	
КонецПроцедуры

// Получает пользователей системы взаимодействия по имени пользователя.
// 	Параметры:
// 		ИмяПользователя - Строка
// 	Возвращаемое значение:
// 		- ПользовательСистемыВзаимодействия,
// 		- Неопределено - при отсутствии пользователя на сервере системы взаимодействия
// 		
Функция ПолучитьПользователяСистемыВзаимодействияПоИмени(ИмяПользователя) Экспорт
	
НайденныеПользователи= СистемаВзаимодействия.ПолучитьПользователей();
	
	НайденныеПользователи= СистемаВзаимодействия.ПолучитьПользователей();
	
	Для Каждого ПользовательСВ Из НайденныеПользователи Цикл
		Если ПользовательСВ.Имя = ИмяПользователя Тогда
			Возврат ПользовательСВ;
		КонецЕсли;
	КонецЦикла;

	Возврат Неопределено;
	
КонецФункции               

Функция СоздатьПользователяСистемыВзаимодействияПоИмени(ИмяПользователя) Экспорт

	ПользовательСВ = СистемаВзаимодействия.СоздатьПользователя();
	ПользовательСВ.Имя = ИмяПользователя;
	ПользовательСВ.КлючСопоставления = ИмяПользователя;
	ПользовательСВ.Записать();
	Возврат ПользовательСВ; 

КонецФункции    

Процедура ОбработкаСообщенияЛид(Сообщение, ДополнительныеПараметры) Экспорт    
	
	УстановитьПривилегированныйРежим(Истина);
	
	Вложения = Сообщение.Вложения;
	Для Каждого Вложение Из Вложения Цикл
		ПотокЧтения = Вложение.ОткрытьПотокДляЧтения();		
		Чтение = Новый ЧтениеJSon();
		Чтение.ОткрытьПоток(ПотокЧтения);
		ДанныеЛида = ПрочитатьJSON(Чтение);
		Чтение.Закрыть();
		Если Renault_ОнлайнКонсультант.ТрафикЛМТСуществует(ДанныеЛида.ID_UNIQ)
			или Renault_ОнлайнКонсультант.ПочтаВЧерномСписке(ДанныеЛида.CLI_EMAIL_PER) Тогда
			Renault_ОнлайнКонсультант.АктуализироватьДатыКонтактЦентр(Справочники.CRM_ТипТрафика.ЛидRenault, ТекущаяДата());
			СистемаВзаимодействия.УдалитьСообщение(Сообщение.Идентификатор);
			Продолжить;
		КонецЕсли;
		Renault_ОнлайнКонсультант.СоздатьТрафикЛМТ(ДанныеЛида);
		Renault_ОнлайнКонсультант.АктуализироватьДатыКонтактЦентр(Справочники.CRM_ТипТрафика.ЛидRenault, ТекущаяДата()); 
		
		СистемаВзаимодействия.УдалитьСообщение(Сообщение.Идентификатор);
		
		СтруктураОтвет = Новый Структура;
		СтруктураОтвет.Вставить("ТекстДляПоискаСообщений", "DMS1_Leads");
		СтруктураОтвет.Вставить("IDЛид", ДанныеЛида.ID_UNIQ);
		СтруктураОтвет.Вставить("ДатаОбработки", ТекущаяДата());
		СтрокаОтвет = СериализоватьJSON(СтруктураОтвет);
		
		Ответ = СистемаВзаимодействия.СоздатьСообщение(Сообщение.Обсуждение);
		Ответ.Текст = СтрокаОтвет;
		Ответ.Записать();	
	КонецЦикла;
	
КонецПроцедуры


