Перем Покупатель Экспорт; // Ссылка на контрагента
Перем ДоговорВзаиморасчетов Экспорт; // Ссылка на договор взаиморасчетов с контрагентом
Перем СкладКомпании Экспорт; // Ссылка на склад компании
Перем ДокументПродажи Экспорт; // Документ продажи
Перем Комиссия Экспорт; // Булево. Истина - продажи комиссионером, Ложь - продажи наши
Перем Сторно Экспорт; // Булево. Истина - возврат от покупателя
Перем ПодразделениеКомпании Экспорт; // Ссылка на подразделение компании
Перем ДокументОбъект Экспорт; // Документа объект выполняющий движения
Перем РезультатЗапросаПоАвтомобилям Экспорт; // Результат запроса по автомобилям

// получаем то, что продали
//// Продаем - Булево. Истина - продаем товар, Ложь - возвращаем
Функция ПолучитьТаблицуАвтомобилей(Продаем=Истина) Экспорт
	Комиссия=?(Комиссия=Неопределено,Ложь,Комиссия);
	ВидДок=ДокументОбъект.Метаданные().Имя;

	// посмотрим есть в документе сумма скидки
	ЕстьСкидка=(ДокументОбъект.Метаданные().ТабличныеЧасти.Автомобили.Реквизиты.Найти("СуммаСкидки")<>Неопределено);
	ЕстьДокументПродажи=(ДокументОбъект.Метаданные().ТабличныеЧасти.Автомобили.Реквизиты.Найти("ДокументПродажи")<>Неопределено);
	// формируем запрос
	ТекстЗапроса="
	|ВЫБРАТЬ
	|	ДокументАвтомобили.Автомобиль КАК Автомобиль,
	|	"+?(ЕстьДокументПродажи,"ДокументАвтомобили.ДокументПродажи КАК ДокументПродажи,","")+"
	|	ДокументАвтомобили.СтавкаНДС КАК СтавкаНДС,
	|	"+?(СкладКомпании=Неопределено,"ДокументАвтомобили.МестоРазмещения КАК СкладКомпании,","")+"
	|	СУММА(ДокументАвтомобили.Количество) КАК Количество,
	|	СУММА(ДокументАвтомобили.СуммаВсего) КАК Сумма,
	|	СУММА(ДокументАвтомобили.СуммаНДС) КАК СуммаНДС,
	|	СУММА("+?(ЕстьСкидка,"ДокументАвтомобили.СуммаСкидки","0")+") КАК СуммаСкидки,
	|	ОстаткиАвтомобилейОбороты.Партия КАК ДокументПоставки,
	|	ОстаткиАвтомобилейОбороты.Партия.Контрагент КАК Поставщик,
	|	"+?(Комиссия,"&СтатусПартии","ОстаткиАвтомобилейОбороты.СтатусПартии")+" КАК СтатусПартии,
	|	ОстаткиАвтомобилейОбороты.ГТД КАК ГТД,
	|	ЕСТЬNULL(СУММА(ОстаткиАвтомобилейОбороты.КоличествоРасход),0) КАК КоличествоРасход,
	|	ЕСТЬNULL(СУММА(ОстаткиАвтомобилейОбороты.СуммаУпрРасход),0) КАК Себестоимость,
	|	ЕСТЬNULL(СУММА(ОстаткиАвтомобилейОбороты.СуммаРасход),0) КАК СебестоимостьРегл,
	|	ЕСТЬNULL(СУММА(ОстаткиАвтомобилейОбороты.СуммаНДСРасход),0) КАК СуммаНДСВходящий,
	|	ЕСТЬNULL(СУММА(КомплектацияАвтомобилейОбороты.СуммаУпрРасход),0) КАК СебестоимостьКомплектация,
	|	ЕСТЬNULL(СУММА(КомплектацияАвтомобилейОбороты.СуммаРасход),0) КАК СебестоимостьКомплектацияРегл,
	|	ЕСТЬNULL(СУММА(КомплектацияАвтомобилейОбороты.СуммаНДСРасход),0) КАК СуммаНДСВходящийКомплектация
	|ИЗ
	|	Документ."+ВидДок+".Автомобили КАК ДокументАвтомобили";
	Если Комиссия Тогда
		ТекстЗапроса=ТекстЗапроса+"
		|	ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ОстаткиАвтомобилей.Обороты(,,Регистратор,(Автомобиль В (&Автомобили))) КАК ОстаткиАвтомобилейОбороты
		|		ПО ДокументАвтомобили.Автомобиль=ОстаткиАвтомобилейОбороты.Автомобиль
		|	 	И ДокументАвтомобили.ДокументПередачи=ОстаткиАвтомобилейОбороты.Регистратор
		|	ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.КомплектацияАвтомобилей.Обороты(,,Регистратор,(Автомобиль В (&Автомобили)) И Номенклатура ССЫЛКА Справочник.Опции) КАК КомплектацияАвтомобилейОбороты
		|		ПО ДокументАвтомобили.Автомобиль=КомплектацияАвтомобилейОбороты.Автомобиль
		|	 	И ДокументАвтомобили.ДокументПередачи=КомплектацияАвтомобилейОбороты.Регистратор";
	Иначе
		ТекстЗапроса=ТекстЗапроса+"
		|	ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ОстаткиАвтомобилей.Обороты(&Момент,&Момент,Регистратор,(Автомобиль В (&Автомобили))) КАК ОстаткиАвтомобилейОбороты
		|		ПО ДокументАвтомобили.Автомобиль=ОстаткиАвтомобилейОбороты.Автомобиль
		|	 	И ДокументАвтомобили.Ссылка=ОстаткиАвтомобилейОбороты.Регистратор
		|	ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.КомплектацияАвтомобилей.Обороты(&Момент,&Момент,Регистратор,(Автомобиль В (&Автомобили)) И Номенклатура ССЫЛКА Справочник.Опции) КАК КомплектацияАвтомобилейОбороты
		|		ПО ДокументАвтомобили.Автомобиль=КомплектацияАвтомобилейОбороты.Автомобиль
		|	 	И ДокументАвтомобили.Ссылка=КомплектацияАвтомобилейОбороты.Регистратор";
	КонецЕсли; 
	ТекстЗапроса=ТекстЗапроса+"
	|ГДЕ
	|	ДокументАвтомобили.Ссылка = &Ссылка
	|
	|СГРУППИРОВАТЬ ПО
	|	ДокументАвтомобили.Автомобиль,
	|	"+?(ЕстьДокументПродажи,"ДокументАвтомобили.ДокументПродажи,","")+"
	|	ДокументАвтомобили.СтавкаНДС,
	|	"+?(СкладКомпании=Неопределено,"ДокументАвтомобили.МестоРазмещения,","")+"
	|	"+?(Комиссия,"","ОстаткиАвтомобилейОбороты.СтатусПартии,")+"
	|	ОстаткиАвтомобилейОбороты.Партия,
	|	ОстаткиАвтомобилейОбороты.ГТД
	|";
	Запрос=Новый Запрос(ТекстЗапроса);
	Запрос.УстановитьПараметр("Ссылка",ДокументОбъект.Ссылка);
	Запрос.УстановитьПараметр("СтатусПартии",Перечисления.СтатусыПартий.ТоварКупленный);
	Запрос.УстановитьПараметр("Автомобили",ДокументОбъект.Автомобили.ВыгрузитьКолонку("Автомобиль"));
	Запрос.УстановитьПараметр("Момент",ДокументОбъект.Дата);

	Возврат Запрос.Выполнить();
КонецФункции

// фиксируем продажи
Функция Приход() Экспорт
	Результат=Истина;
	
	ВалютаРегл=Константы.ВалютаРегламентированногоУчетаОрганизаций.Получить(); 
	СтруктураКурса = обКурсДляВалюты(ВалютаРегл,ДокументОбъект.Дата);
	КурсРегл	   = СтруктураКурса.Курс / ?(СтруктураКурса.Кратность = 0, 1, СтруктураКурса.Кратность);
	ВалютаУпр=Константы.ВалютаУправленческогоУчетаКомпании.Получить(); 
	Попытка
		КурсУпр=ДокументОбъект.КурсВалютыУпр;
	Исключение
		КурсУпр=Неопределено;
	КонецПопытки; 
	Если КурсУпр=Неопределено ИЛИ обЗначениеНеЗаполнено(КурсУпр) Тогда
		СтруктураКурса = обКурсДляВалюты(ВалютаУпр,ДокументОбъект.Дата);
		КурсУпр		   = СтруктураКурса.Курс / ?(СтруктураКурса.Кратность = 0, 1, СтруктураКурса.Кратность);
	КонецЕсли;
	
	// получаем таблицу автомобилей
	Если (РезультатЗапросаПоАвтомобилям=Неопределено) ИЛИ (ТипЗнч(РезультатЗапросаПоАвтомобилям)<>Тип("РезультатЗапроса") И ТипЗнч(РезультатЗапросаПоАвтомобилям)<>Тип("ТаблицаЗначений")) Тогда
		РезультатЗапросаПоАвтомобилям=ПолучитьТаблицуАвтомобилей();
	КонецЕсли;
	Если ТипЗнч(РезультатЗапросаПоАвтомобилям)=Тип("РезультатЗапроса") Тогда
		ТаблицаАвтомобилей=РезультатЗапросаПоАвтомобилям.Выгрузить();
	Иначе
		ТаблицаАвтомобилей=РезультатЗапросаПоАвтомобилям;
	КонецЕсли;
	ЕстьГТД=(ТаблицаАвтомобилей.Колонки.Найти("ГТД")<>Неопределено);
	ЕстьДокументПродажиТоваров=(ТаблицаАвтомобилей.Колонки.Найти("ДокументПродажи")<>Неопределено); 
	
	//Бондаренко++ 20230105
	Если ТипЗНЧ(ДокументОбъект) = Тип("ДокументОбъект.РеализацияАвтомобилей") Тогда
 		ТаблицаАвтомобилей.Колонки.Добавить("КолКредит");
		ТаблицаАвтомобилей.Колонки.Добавить("КолТрейдИн");	
		ТаблицаАвтомобилей.Колонки.Добавить("КолФизЛица");	
		Для каждого Стр Из ТаблицаАвтомобилей Цикл
			ПарОтбора = Новый Структура;
			ПарОтбора.Вставить("Автомобиль",Стр.Автомобиль);
			МассивСтрок = ДокументОбъект.Автомобили.НайтиСтроки(ПарОтбора);
			Если МассивСтрок.Количество() > 0 Тогда
				Если МассивСтрок[0].ЗаказНаАвтомобиль.ВКредит Тогда
					Стр.КолКредит = 1;
				Иначе
					Стр.КолКредит = 0;
				КонецЕсли;		                                   
				//Бондаренко++ 20230513
 				//Если МассивСтрок[0].ЗаказНаАвтомобиль.TradeIn Тогда
				Если НЕ обЗначениеНеЗаполнено(МассивСтрок[0].ЗаказНаАвтомобиль.ПоступлениеАвтоТрэйдИн) Тогда
				//Бондаренко++ 20230513
					Стр.КолТрейдИн = 1;		
				Иначе
					Стр.КолТрейдИн = 0;
 				КонецЕсли;		
			КонецЕсли;
			//Бондаренко++ 20230517
			Если ДокументОбъект.Контрагент.ФормаСобственности = Перечисления.ФормыСобственности.ЧастноеЛицо Тогда
				Стр.КолФизЛица = 1;
			Иначе	
				Стр.КолФизЛица = 0;
			КонецЕсли;
			//Бондаренко-- 20230517
 		КонецЦикла;
	КонецЕсли;
	//Бондаренко-- 20230105
	
	//Бондаренко++ 20191030
	ЗапретПродажиНижеСебестоимости=обПраво("ЗапретитьПродажуНижеСебестоимостиАвтомобиля",ДокументОбъект.Права,,ДокументОбъект);
	//ЗапретПродажиНижеСебестоимости = Ложь; // Семенихин 18.06.2019
	//Бондаренко-- 20191030
	
	Для Каждого СтрокаАвтомобиля Из ТаблицаАвтомобилей Цикл
		СебестоимостьУпр=СтрокаАвтомобиля.Себестоимость;
		СебестоимостьКомплектацияУпр=СтрокаАвтомобиля.СебестоимостьКомплектация;
		Себестоимость=СтрокаАвтомобиля.СебестоимостьРегл;
		СебестоимостьКомплектация=СтрокаАвтомобиля.СебестоимостьКомплектацияРегл;
		СуммаУпр=?(СтрокаАвтомобиля.Сумма=NULL,0,обПересчет(СтрокаАвтомобиля.Сумма,ДокументОбъект.ВалютаДокумента,ДокументОбъект.КурсДокумента,ВалютаУпр,КурсУпр));
		Если ЗапретПродажиНижеСебестоимости И НЕ Сторно Тогда
			Если (СебестоимостьУпр+СебестоимостьКомплектацияУпр)>СуммаУпр Тогда
				дкСообщитьРезультат("Автомобиль """+СокрЛП(СтрокаАвтомобиля.Автомобиль)
				+". Себестоимость автомобиля "+Формат(СебестоимостьУпр+СебестоимостьКомплектацияУпр,"ЧЦ = 15; ЧДЦ = 2; ЧН = 0.00")+" сумма продажи " + Формат(СуммаУпр,"ЧЦ = 15; ЧДЦ = 2; ЧН = 0.00") + " " + ВалютаУпр
				+". Продажа ниже себестоимости запрещена.","Важное&Продажи автомобилей:",ДокументОбъект,СтрокаАвтомобиля.Автомобиль);
				Результат=Ложь;
			КонецЕсли; 
		КонецЕсли; 
		НоваяЗапись=Добавить();
		НоваяЗапись.Период=ДокументОбъект.Дата;
		НоваяЗапись.Регистратор=ДокументОбъект.Ссылка;
		НоваяЗапись.ПодразделениеКомпании=ПодразделениеКомпании;
		НоваяЗапись.Автомобиль=СтрокаАвтомобиля.Автомобиль;
		Если ДокументПродажи<>Неопределено Тогда
			НоваяЗапись.ДокументПродажи=ДокументПродажи;
		Иначе
			Если ЕстьДокументПродажиТоваров Тогда
				НоваяЗапись.ДокументПродажи=СтрокаАвтомобиля.ДокументПродажи;
			КонецЕсли;
		КонецЕсли;
		НоваяЗапись.Поставщик=СтрокаАвтомобиля.Поставщик;
		НоваяЗапись.Покупатель=Покупатель;
		НоваяЗапись.СтатусПартии=СтрокаАвтомобиля.СтатусПартии;
		НоваяЗапись.ХозОперация=ДокументОбъект.ХозОперация;
		НоваяЗапись.ДоговорВзаиморасчетов=ДоговорВзаиморасчетов;
		Если НЕ Комиссия Тогда
			Если СкладКомпании=Неопределено Тогда
				НоваяЗапись.СкладКомпании=СтрокаАвтомобиля.СкладКомпании;
			Иначе
				НоваяЗапись.СкладКомпании=СкладКомпании;
			КонецЕсли; 
		КонецЕсли;
		НоваяЗапись.СтавкаНДС=СтрокаАвтомобиля.СтавкаНДС;
		НоваяЗапись.Партия=СтрокаАвтомобиля.ДокументПоставки;
		Если ЕстьГТД Тогда
			НоваяЗапись.ГТД=СтрокаАвтомобиля.ГТД;
		Иначе
			НоваяЗапись.ГТД=Справочники.ГТД.ПустаяСсылка();
		КонецЕсли; 
		НоваяЗапись.Количество=СтрокаАвтомобиля.Количество;
		
		//Бондаренко++ 20230105
		Попытка 
			НоваяЗапись.КолКредит=СтрокаАвтомобиля.КолКредит;		
		Исключение
 		КонецПопытки; 
		
		Попытка 
		НоваяЗапись.КолТрейдИн=СтрокаАвтомобиля.КолТрейдИн;
		Исключение
 		КонецПопытки; 
		//Бондаренко-- 20230105
		
		//Бондаренко++ 20230517
 		Попытка 
		НоваяЗапись.КолФизЛица=СтрокаАвтомобиля.КолФизЛица;
		Исключение
 		КонецПопытки; 
		//Бондаренко-- 20230517
  		
		НоваяЗапись.СебестоимостьУпр=Окр(СебестоимостьУпр+СебестоимостьКомплектацияУпр,2);
		НоваяЗапись.Себестоимость=Окр(Себестоимость+СебестоимостьКомплектация,2);
		НоваяЗапись.Сумма=Окр(?(СтрокаАвтомобиля.Сумма=NULL,0,обПересчет(СтрокаАвтомобиля.Сумма,ДокументОбъект.ВалютаДокумента,ДокументОбъект.КурсДокумента,ВалютаРегл,КурсРегл)),2);
		НоваяЗапись.СуммаСкидки=Окр(?(СтрокаАвтомобиля.СуммаСкидки=NULL,0,обПересчет(СтрокаАвтомобиля.СуммаСкидки,ДокументОбъект.ВалютаДокумента,ДокументОбъект.КурсДокумента,ВалютаРегл,КурсРегл)),2);
		НоваяЗапись.СуммаУпр=Окр(СуммаУпр,2);
		НоваяЗапись.СуммаНДС=Окр(?(СтрокаАвтомобиля.СуммаНДС=NULL,0,обПересчет(СтрокаАвтомобиля.СуммаНДС,ДокументОбъект.ВалютаДокумента,ДокументОбъект.КурсДокумента,ВалютаРегл,КурсРегл)),2);
		НоваяЗапись.СуммаНДСВходящий = Окр(СтрокаАвтомобиля.СуммаНДСВходящий+СтрокаАвтомобиля.СуммаНДСВходящийКомплектация,2);
		
		// если возвраты, то сделаем все отрицательным
		Если Сторно Тогда
			НоваяЗапись.Количество=НоваяЗапись.Количество*?(НоваяЗапись.Количество>0,-1,1);
			НоваяЗапись.СебестоимостьУпр=НоваяЗапись.СебестоимостьУпр*?(НоваяЗапись.СебестоимостьУпр>0,-1,1);
			НоваяЗапись.Себестоимость=НоваяЗапись.Себестоимость*?(НоваяЗапись.Себестоимость>0,-1,1);
			НоваяЗапись.Сумма=НоваяЗапись.Сумма*?(НоваяЗапись.Сумма>0,-1,1);
			НоваяЗапись.СуммаСкидки=НоваяЗапись.СуммаСкидки*?(НоваяЗапись.СуммаСкидки>0,-1,1);
			НоваяЗапись.СуммаУпр=НоваяЗапись.СуммаУпр*?(НоваяЗапись.СуммаУпр>0,-1,1);
			НоваяЗапись.СуммаНДС=НоваяЗапись.СуммаНДС*?(НоваяЗапись.СуммаНДС>0,-1,1);
			НоваяЗапись.СуммаНДСВходящий=НоваяЗапись.СуммаНДСВходящий*?(НоваяЗапись.СуммаНДСВходящий>0,-1,1);
		КонецЕсли;
	КонецЦикла;
	
	РезультатЗапросаПоАвтомобилям=Неопределено;
	Покупатель=Неопределено;
	ДоговорВзаиморасчетов=Неопределено;
	СкладКомпании=Неопределено;
	ПодразделениеКомпании=Неопределено;
	// убиваем циклическую ссылку
	ДокументОбъект=Неопределено;
	
	Возврат Результат;
КонецФункции

// Предопределенная процедура
Процедура ПриЗаписи(Отказ, Замещение)
	
	// Зарегистрируем изменения для узлов РБД
	орРегистрацияИзменений(ЭтотОбъект);
	
КонецПроцедуры	//	ПриЗаписи()
