Процедура ЗарегистрироватьДополнительнуюИнформациюПоАвтомобилям()Экспорт
	Узел = Константы.Renault_УзелРегистрацииИзмененийДанныхАФМ.Получить();
	Если ЗначениеЗаполнено(Узел) Тогда
		Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	CRM_ДополнительнаяИнформацияПоАвтомобилям.Автомобиль,
	                      |	CRM_ДополнительнаяИнформацияПоАвтомобилям.Примечание,
	                      |	CRM_ДополнительнаяИнформацияПоАвтомобилям.ПримечаниеРОП,
	                      |	CRM_ДополнительнаяИнформацияПоАвтомобилям.ЦенаПродажиРОП,
	                      |	CRM_ДополнительнаяИнформацияПоАвтомобилям.ПлановаяДатаОплатыАФМ,
	                      |	CRM_ДополнительнаяИнформацияПоАвтомобилям.ОплатаАФМСогласована,
	                      |	CRM_ДополнительнаяИнформацияПоАвтомобилям.АвтоОплаченАФМ,
	                      |	CRM_ДополнительнаяИнформацияПоАвтомобилям.КлиентВнесАванс,
	                      |	CRM_ДополнительнаяИнформацияПоАвтомобилям.КлиентПолностьюОплатилАвто,
	                      |	CRM_ДополнительнаяИнформацияПоАвтомобилям.НеДляПродажи,
	                      |	CRM_ДополнительнаяИнформацияПоАвтомобилям.ЦветВыделенияСтрокиДляВсех,
	                      |	CRM_ДополнительнаяИнформацияПоАвтомобилям.ПТСПолученДилером,
	                      |	CRM_ДополнительнаяИнформацияПоАвтомобилям.ЖелаемаяДатаОтгрузки
	                      |ИЗ
	                      |	РегистрСведений.CRM_ДополнительнаяИнформацияПоАвтомобилям КАК CRM_ДополнительнаяИнформацияПоАвтомобилям");
		Выборка = Запрос.Выполнить().Выбрать();
		Набор = РегистрыСведений.CRM_ДополнительнаяИнформацияПоАвтомобилям.СоздатьНаборЗаписей();
		Пока Выборка.Следующий() Цикл
			Набор.Отбор.Автомобиль.Значение = Выборка.Автомобиль;
			Набор.Отбор.Автомобиль.Использование = Истина;
			ПланыОбмена.ЗарегистрироватьИзменения(Узел, Набор);
		КонецЦикла;

	КонецЕсли;

КонецПроцедуры

Процедура ОтменитьРегистрациюДополнительнойИнформациюПоАвтомобилям(ТаблицаКОтмене = Неопределено)Экспорт
	Узел = Константы.Renault_УзелРегистрацииИзмененийДанныхАФМ.Получить();
	Если ЗначениеЗаполнено(Узел) Тогда
		Если ТаблицаКОтмене = Неопределено Тогда
			ПланыОбмена.УдалитьРегистрациюИзменений(Узел);
		Иначе
			Набор = РегистрыСведений.CRM_ДополнительнаяИнформацияПоАвтомобилям.СоздатьНаборЗаписей();
		    Для Каждого Запись Из ТаблицаКОтмене Цикл 
				Набор.Отбор.Автомобиль.Значение = Запись.Автомобиль;
				Набор.Отбор.Автомобиль.Использование = Истина;
				ПланыОбмена.УдалитьРегистрациюИзменений(Узел, Набор);
			КонецЦикла;
        КонецЕсли;
	КонецЕсли;

КонецПроцедуры

Функция ИспользуетсяФункционалAdvanced() Экспорт
	Запрос=Новый Запрос("Выбрать 1 Из Справочник.Организации ГДЕ ИНН В(&СпИНН)");
	СпИНН=Новый Массив;
	СпИНН.Добавить("7813382729");
	СпИНН.Добавить("7718752313");
	Запрос.УстановитьПараметр("СпИНН",СпИНН);
	Возврат Не Запрос.Выполнить().Пустой()
КонецФункции
