Функция ПоличитьУзелОбмена () Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Renault_ОчередьЗаявокНаСкидку.Ссылка
	|ИЗ
	|	ПланОбмена.Renault_ОчередьЗаявокНаСкидку КАК Renault_ОчередьЗаявокНаСкидку
	|ГДЕ
	|	Renault_ОчередьЗаявокНаСкидку.Ссылка <> &ЭтотУзел";
	Запрос.УстановитьПараметр("ЭтотУзел", ПланыОбмена.Renault_ОчередьЗаявокНаСкидку.ЭтотУзел());
	Результат = Запрос.Выполнить();
	Если Результат.Пустой() Тогда
		УзелОбъект = ПланыОбмена.Renault_ОчередьЗаявокНаСкидку.СоздатьУзел();
		УзелОбъект.УстановитьНовыйКод();
		УзелОбъект.Наименование = "Выгрузка заявков";
		УзелОбъект.Записать();
		Узел = УзелОбъект.Ссылка;
	Иначе
		Выборка = Результат.Выбрать();
		Выборка.Следующий();
		Узел = Выборка.Ссылка;
	КонецЕсли;
	Возврат Узел;
КонецФункции
