
// Возвращает таблицу заказов с истекшим сроком снятия резервов
//
Функция ПолучитьТаблицуЗаказовАвтомобилей() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЗаказыАвтомобилейОстатки.Заказ КАК Заказ,
	               |	ЗаказыАвтомобилейОстатки.Автомобиль КАК Автомобиль,
	               |	МАКСИМУМ(ЗаказыАвтомобилейОстатки.РезервОстаток) КАК РезервОстаток,
	               |	ЗаказыАвтомобилейОстатки.Заказ.СрокСнятияРезерва,
	               |	СУММА(ЗаказыАвтомобилей.СуммаУпр) КАК СуммаУпр
	               |ПОМЕСТИТЬ ЗаказыОстаткиРезервов
	               |ИЗ
	               |	РегистрНакопления.ЗаказыАвтомобилей.Остатки(, Заказ.СрокСнятияРезерва < &ДатаОкончания) КАК ЗаказыАвтомобилейОстатки
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.ЗаказыАвтомобилей КАК ЗаказыАвтомобилей
	               |		ПО ЗаказыАвтомобилейОстатки.Заказ = ЗаказыАвтомобилей.Заказ
	               |			И (ЗаказыАвтомобилей.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход))
	               |ГДЕ
	               |	ЗаказыАвтомобилейОстатки.РезервОстаток > 0
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ЗаказыАвтомобилейОстатки.Автомобиль,
	               |	ЗаказыАвтомобилейОстатки.Заказ,
	               |	ЗаказыАвтомобилейОстатки.Заказ.СрокСнятияРезерва
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ЗаказыОстаткиРезервов.Заказ КАК Заказ,
	               |	ЗаказыОстаткиРезервов.Заказ.Номер КАК Номер,
	               |	ЗаказыОстаткиРезервов.Заказ.Дата КАК Дата,
	               |	ЗаказыОстаткиРезервов.Заказ.Автор КАК Автор,
	               |	ЗаказыОстаткиРезервов.Заказ.Организация КАК Организация,
	               |	ЗаказыОстаткиРезервов.Заказ.ПодразделениеКомпании КАК ПодразделениеКомпании,
	               |	ЗаказыОстаткиРезервов.Заказ.Контрагент КАК Контрагент,
	               |	ЗаказыОстаткиРезервов.Заказ.ХозОперация КАК ХозОперация,
	               |	ЗаказыОстаткиРезервов.Заказ.СрокСнятияРезерва КАК СрокСнятияРезерва,
	               |	ЗаказыОстаткиРезервов.Автомобиль КАК Автомобиль,
	               |	МАКСИМУМ(ЗаказыОстаткиРезервов.РезервОстаток) КАК РезервОстаток,
	               |	НАЧАЛОПЕРИОДА(МАКСИМУМ(ЗаказыАвтомобилей.Период), ДЕНЬ) КАК ДатаРезервирования,
	               |	РАЗНОСТЬДАТ(НАЧАЛОПЕРИОДА(МАКСИМУМ(ЗаказыАвтомобилей.Период), ДЕНЬ), &ДатаОкончания, ДЕНЬ) + 1 КАК СрокРезервирования,
	               |	ИСТИНА КАК Использование,
	               |	ИСТИНА КАК Корректировка,
	               |	МАКСИМУМ(ЕСТЬNULL(-ВзаиморасчетыКомпанииОстатки.СуммаУпрОстаток, 0)) КАК Оплата,
	               |	МАКСИМУМ(ЗаказыОстаткиРезервов.СуммаУпр) КАК Сумма,
	               |	ОстаткиАвтомобилейОстатки.СкладКомпании КАК СкладКомпании
	               |ИЗ
	               |	ЗаказыОстаткиРезервов КАК ЗаказыОстаткиРезервов
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.ЗаказыАвтомобилей КАК ЗаказыАвтомобилей
	               |		ПО (ЗаказыАвтомобилей.Период <= &ДатаОкончания)
	               |			И (ЗаказыАвтомобилей.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход))
	               |			И ЗаказыОстаткиРезервов.Заказ = ЗаказыАвтомобилей.Заказ
	               |			И ЗаказыОстаткиРезервов.Автомобиль = ЗаказыАвтомобилей.Автомобиль
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ВзаиморасчетыКомпании.Остатки(
	               |				,
	               |				Сделка ССЫЛКА Документ.ЗаказНаАвтомобиль
	               |					ИЛИ Сделка ССЫЛКА Документ.СчетНаОплату) КАК ВзаиморасчетыКомпанииОстатки
	               |		ПО (ВЫБОР
	               |				КОГДА ВзаиморасчетыКомпанииОстатки.Сделка ССЫЛКА Документ.ЗаказНаАвтомобиль
	               |					ТОГДА ЗаказыОстаткиРезервов.Заказ = ВзаиморасчетыКомпанииОстатки.Сделка
	               |				КОГДА ВзаиморасчетыКомпанииОстатки.Сделка ССЫЛКА Документ.СчетНаОплату
	               |					ТОГДА ЗаказыОстаткиРезервов.Заказ = ВзаиморасчетыКомпанииОстатки.Сделка.ДокументОснование
	               |				ИНАЧЕ ЛОЖЬ
	               |			КОНЕЦ)
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ОстаткиАвтомобилей.Остатки КАК ОстаткиАвтомобилейОстатки
	               |		ПО ЗаказыОстаткиРезервов.Автомобиль = ОстаткиАвтомобилейОстатки.Автомобиль
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ЗаказыОстаткиРезервов.Заказ,
	               |	ЗаказыОстаткиРезервов.Автомобиль,
	               |	ЗаказыОстаткиРезервов.Заказ.Номер,
	               |	ЗаказыОстаткиРезервов.Заказ.Дата,
	               |	ЗаказыОстаткиРезервов.Заказ.Автор,
	               |	ЗаказыОстаткиРезервов.Заказ.Организация,
	               |	ЗаказыОстаткиРезервов.Заказ.ПодразделениеКомпании,
	               |	ЗаказыОстаткиРезервов.Заказ.Контрагент,
	               |	ЗаказыОстаткиРезервов.Заказ.ХозОперация,
	               |	ЗаказыОстаткиРезервов.Заказ.СрокСнятияРезерва,
	               |	ОстаткиАвтомобилейОстатки.СкладКомпании
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	СрокСнятияРезерва";
	Запрос.УстановитьПараметр("ДатаОкончания",ТекущаяДата());
	Возврат Запрос.Выполнить().Выгрузить();				   
	
КонецФункции

// Создает запись напоминание автору(менеджеру) документа о списании резерва
//
Процедура СоздатьНапоминание(НаборЗаписей, ТаблицаЗаказов,СнятиеРезервов=Неопределено,Корректировка=Неопределено) Экспорт
	
	//Получим пользователей, кому требуется создать напоминание
	Запрос = Новый Запрос;
	
	// вариант запроса, который вернет первого попавшегося пользователя, если для 1 сотрудника заведено несколько пользователей 
	//Запрос.Текст="ВЫБРАТЬ
	//			 |	ВЫРАЗИТЬ(ТаблицаЗаказов.Заказ КАК Документ.ЗаказНаАвтомобиль) КАК Заказ
	//			 |ПОМЕСТИТЬ ТаблицаЗаказов
	//			 |ИЗ
	//			 |	&ТаблицаЗаказов КАК ТаблицаЗаказов
	//			 |;
	//			 |
	//			 |////////////////////////////////////////////////////////////////////////////////
	//			 |ВЫБРАТЬ
	//			 |	ТаблицаПользователей.Заказ КАК Заказ,
	//			 |	ТаблицаПользователей.Пользователь КАК Пользователь
	//			 |ИЗ
	//			 |	(ВЫБРАТЬ
	//			 |		ЗаказНаАвтомобиль.Заказ КАК Заказ,
	//			 |		МАКСИМУМ(ЕСТЬNULL(Пользователи.Ссылка, ЗаказНаАвтомобиль.Заказ.Автор)) КАК Пользователь
	//			 |	ИЗ
	//			 |		ТаблицаЗаказов КАК ЗаказНаАвтомобиль
	//			 |			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Пользователи КАК Пользователи
	//			 |			ПО ЗаказНаАвтомобиль.Заказ.Менеджер = Пользователи.Сотрудник
	//			 |				И (НЕ Пользователи.Сотрудник = ЗНАЧЕНИЕ(Справочник.Сотрудники.ПустаяСсылка))
	//			 |				И (Пользователи.ПометкаУдаления = ЛОЖЬ)
	//			 |	ГДЕ
	//			 |		ЕСТЬNULL(Пользователи.Ссылка, ЗаказНаАвтомобиль.Заказ.Автор) <> ЗНАЧЕНИЕ(Справочник.Пользователи.ПустаяСсылка)
	//			 |	
	//			 |	СГРУППИРОВАТЬ ПО
	//			 |		ЗаказНаАвтомобиль.Заказ) КАК ТаблицаПользователей
	//			 |ИТОГИ ПО
	//			 |	Пользователь";
	
	// вариант запроса, который вернет всех пользователей, если для 1 сотрудника заведено несколько пользователей
	Запрос.Текст="ВЫБРАТЬ
	             |	ВЫРАЗИТЬ(ТаблицаЗаказов.Заказ КАК Документ.ЗаказНаАвтомобиль) КАК Заказ
	             |ПОМЕСТИТЬ ТаблицаЗаказов
	             |ИЗ
	             |	&ТаблицаЗаказов КАК ТаблицаЗаказов
	             |;
	             |
	             |////////////////////////////////////////////////////////////////////////////////
	             |ВЫБРАТЬ
	             |	ЗаказНаАвтомобиль.Заказ КАК Заказ,
	             |	ЕСТЬNULL(Пользователи.Ссылка, ЗаказНаАвтомобиль.Заказ.Автор) КАК Пользователь
	             |ИЗ
	             |	ТаблицаЗаказов КАК ЗаказНаАвтомобиль
	             |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Пользователи КАК Пользователи
	             |		ПО ЗаказНаАвтомобиль.Заказ.Менеджер = Пользователи.Сотрудник
	             |			И (НЕ Пользователи.Сотрудник = ЗНАЧЕНИЕ(Справочник.Сотрудники.ПустаяСсылка))
	             |			И (Пользователи.ПометкаУдаления = ЛОЖЬ)
	             |ГДЕ
	             |	ЕСТЬNULL(Пользователи.Ссылка, ЗаказНаАвтомобиль.Заказ.Автор) <> ЗНАЧЕНИЕ(Справочник.Пользователи.ПустаяСсылка)
	             |ИТОГИ ПО
	             |	Пользователь";
	Запрос.УстановитьПараметр("ТаблицаЗаказов", ТаблицаЗаказов);
	ВыборкаПользователи = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	ДатаОповещений  = ТекущаяДата();
	
	Пока ВыборкаПользователи.Следующий() Цикл
		
		ВыборкаЗаказы = ВыборкаПользователи.Выбрать();
		
		//сформируем СтрЗаказы - список заказов по пользователю через запятую
		СтрЗаказы = "";
		Первый = Истина;
		ПервыйЗаказ = Неопределено;
		Пока ВыборкаЗаказы.Следующий() Цикл;
			Если Первый Тогда
				СтрЗаказы = "<" + Строка(ВыборкаЗаказы.Заказ) + ">";		
				ПервыйЗаказ = ВыборкаЗаказы.Заказ;
				Первый = Ложь;
			Иначе
				СтрЗаказы = СтрЗаказы + ", <" + Строка(ВыборкаЗаказы.Заказ) + ">";  	
			КонецЕсли;
		КонецЦикла;
		СтрЗаказы = ?(ВыборкаЗаказы.Количество()=1, "по заказу " + СтрЗаказы, "по заказам " + СтрЗаказы);
		
		Если СнятиеРезервов<>Неопределено Тогда
			Описание = "Сформирован документ снятия резервов <" + Строка(СнятиеРезервов) + "> " + СтрЗаказы;
		ИначеЕсли Корректировка<>Неопределено Тогда
			Описание = "Сформирован документ отмены <" + Строка(Корректировка) + "> " + СтрЗаказы;
		Иначе
			Описание = "Истек срок снятия резерва " + СтрЗаказы + ".  Необходимо выполнить снятие резерва.";
		КонецЕсли;
		
		НоваяЗапись = НаборЗаписей.Добавить();
		НоваяЗапись.Пользователь            = ВыборкаПользователи.Пользователь;
		НоваяЗапись.Автор                   = ПараметрыСеанса.Пользователь;
		НоваяЗапись.Завершено               = Ложь;
		НоваяЗапись.РеальнаяДатаОповещения  = ДатаОповещений;
		НоваяЗапись.ДатаНачала              = ДатаОповещений;
		НоваяЗапись.ДатаОповещения          = ДатаОповещений;
		НоваяЗапись.Редактирование          = Ложь;
		Если СнятиеРезервов<>Неопределено Тогда
			НоваяЗапись.Объект = СнятиеРезервов;
		ИначеЕсли Корректировка<>Неопределено Тогда
			НоваяЗапись.Объект = Корректировка;
		Иначе
			НоваяЗапись.Объект = ПервыйЗаказ;
		КонецЕсли;
		НоваяЗапись.Описание = Описание;
		НоваяЗапись.Тема = "Автоматическое снятие резервов по заказам автомобилей"; 
		НоваяЗапись.ТипПериода              = "00"; 
		НоваяЗапись.УдалитьПоИстеченииСрока = Истина;
		
	КонецЦикла;
КонецПроцедуры

// Формирует набор напоминаний по просроченным резервам и записывает их
//
Процедура СформироватьНапоминанияПроСнятиеРезервовАвтомобилей() Экспорт
	
	ТаблицаЗаказов = ПолучитьТаблицуЗаказовАвтомобилей();
	Если ТаблицаЗаказов=Неопределено ИЛИ ТаблицаЗаказов.Количество()=0 Тогда
		Возврат;
	КонецЕсли;
	
	НаборЗаписейНапоминания = РегистрыСведений.Напоминания.СоздатьНаборЗаписей();
	НаборЗаписейНапоминания.Отбор.Автор.Установить(ПараметрыСеанса.Пользователь);
	НаборЗаписейНапоминания.Отбор.Завершено.Установить(Ложь);
	НаборЗаписейНапоминания.Прочитать();

	ТаблицаЗаказовИтоговая = Новый ТаблицаЗначений;
	ТаблицаЗаказовИтоговая.Колонки.Добавить("Заказ",Новый ОписаниеТипов("ДокументСсылка.ЗаказНаАвтомобиль"));	
	
	ТекДата = ТекущаяДата();
	Для Каждого ТекЗаказ Из ТаблицаЗаказов Цикл
		Если НЕ обЗначениеНеЗаполнено(ТекЗаказ.СрокСнятияРезерва) И ТекЗаказ.СрокСнятияРезерва < ТекДата Тогда
			СтрокаИтоговая = ТаблицаЗаказовИтоговая.Добавить();
			СтрокаИтоговая.Заказ = ТекЗаказ.Заказ;
		КонецЕсли;
	КонецЦикла;
	
	СоздатьНапоминание(НаборЗаписейНапоминания, ТаблицаЗаказовИтоговая);
	
	//записываем сформированные напоминания
	Попытка  
		НаборЗаписейНапоминания.Записать(Истина); 
	Исключение 	
	КонецПопытки;
	
КонецПроцедуры

// Формирует документы снятие резервов и возвращает результат работы
Функция ВыполнитьСнятиеРезервовАвтомобилей(ТаблицаЗаказовДляСписания,СоздаватьНапоминание=Ложь,ФоновыйРежим=Ложь) Экспорт
	
	КэшСнятиеРезервов = Новый ТаблицаЗначений;
	КэшСнятиеРезервов.Колонки.Добавить("Ссылка");
	КэшСнятиеРезервов.Колонки.Добавить("Автомобиль",Новый ОписаниеТипов("СправочникСсылка.Автомобили"));
	
	#Если Клиент Тогда
		РазрешениеСнятияРезервов = обПраво("РазрешениеСнятияРезервов", глПрава);
	#Иначе
		РазрешениеСнятияРезервов = Перечисления.РезервыСпособыСписания.Разрешено;	
	#КонецЕсли
	
	Если РазрешениеСнятияРезервов = Перечисления.РезервыСпособыСписания.Запрещено Тогда
		Если НЕ ФоновыйРежим Тогда 
			#Если Клиент Тогда
				Предупреждение("Запрещено снимать резервы!");
			#КонецЕсли
		КонецЕсли;
		Возврат КэшСнятиеРезервов;		
	КонецЕсли;
	
	//если ничего не выбрано, прерываем обработку
	Если ТаблицаЗаказовДляСписания.Количество()=0 Тогда
		Если НЕ ФоновыйРежим Тогда 
			#Если Клиент Тогда
				Предупреждение("Не выбрано заявок для формирования снятия резервов");
			#КонецЕсли
		КонецЕсли;
		Возврат КэшСнятиеРезервов;
	КонецЕсли;
	
	ТаблицаЗаказовДляСписания.Сортировать("СкладКомпании,Корректировка");
	
	//для обхода в цикле - если на данной итерации значения станут отличаться от текущих - 
	//выполняется запись предыдущего документа и формирование следующего документа
 	ТекущийДокумент = Документы.СнятиеРезервовАвтомобилей.ПустаяСсылка();
	ТекущийСклад = Справочники.СкладыКомпании.ПустаяСсылка();
	ТекФлагКорректировки = Истина;
	
	//таблица содержит заказы, резервы по которым были сняты данным документом
	ТаблицаЗаказовИтоговая = Новый ТаблицаЗначений;
	ТаблицаЗаказовИтоговая.Колонки.Добавить("Заказ",Новый ОписаниеТипов("ДокументСсылка.ЗаказНаАвтомобиль"));	

	Если СоздаватьНапоминание Тогда
		НаборЗаписейНапоминания = РегистрыСведений.Напоминания.СоздатьНаборЗаписей();
		НаборЗаписейНапоминания.Отбор.Автор.Установить(ПараметрыСеанса.Пользователь);
		НаборЗаписейНапоминания.Отбор.Завершено.Установить(Ложь);
		НаборЗаписейНапоминания.Прочитать();
	КонецЕсли;	
			
	Для Каждого ТекЗаказДляСписания Из ТаблицаЗаказовДляСписания Цикл
		
		Если ТекущийСклад <> ТекЗаказДляСписания.СкладКомпании ИЛИ ТекФлагКорректировки <> ТекЗаказДляСписания.Корректировка Тогда
			
			//изменился склад
			ТекущийСклад = ТекЗаказДляСписания.СкладКомпании;
			ТекФлагКорректировки = ТекЗаказДляСписания.Корректировка;
			
			//записываем документ
			Если НЕ обЗначениеНеЗаполнено(ТекущийДокумент) И ТекущийДокумент.Автомобили.Количество()>0 Тогда
				Попытка
					ТекущийДокумент.Записать(РежимЗаписиДокумента.Проведение,РежимПроведенияДокумента.Неоперативный);	
					Если НЕ ФоновыйРежим Тогда 
						Сообщить("Сформирован и проведен документ <" + Строка(ТекущийДокумент)+ ">");	
					КонецЕсли;
					//формируем данные для страницы "сформированные документы" 	
					Для Каждого СтрокаТоваров Из ТекущийДокумент.Ссылка.Автомобили Цикл
						СтрокаКэша = КэшСнятиеРезервов.Добавить();
						СтрокаКэша.Ссылка = ТекущийДокумент.Ссылка;
						СтрокаКэша.Автомобиль = СтрокаТоваров.Автомобиль;
					КонецЦикла;
					//создаем напоминание автору заказа
					Если СоздаватьНапоминание Тогда
						Обработки.АвтоматическоеСнятиеРезервовАвтомобилей.СоздатьНапоминание(НаборЗаписейНапоминания, ТаблицаЗаказовИтоговая, ТекущийДокумент.Ссылка);
					КонецЕсли;
				Исключение
					Если НЕ ФоновыйРежим Тогда 
						Сообщить("Не удалось записать документ " + Строка(ТекущийДокумент));	
					КонецЕсли;
				КонецПопытки;
 				ТаблицаЗаказовИтоговая.Очистить();
				ТекущийДокумент = Документы.СнятиеРезервовАвтомобилей.ПустаяСсылка();
			КонецЕсли;
			
		КонецЕсли;
		
		Если ТекЗаказДляСписания.Корректировка Тогда
			ОтменаЗаказа = Документы.ЗаказНаАвтомобиль.СоздатьДокумент();
			ОтменаЗаказа.ХозОперация = Справочники.ХозОперации.ЗаказНаАвтомобильОтмена;
			ОтменаЗаказа.ДокументОснование	= ТекЗаказДляСписания.Заказ;
			ОтменаЗаказа.Заполнить(ОтменаЗаказа.ДокументОснование);
			ОтменаЗаказа.Комментарий = "Автоматическое снятие резерва и отмена заказа";
			Попытка
				ОтменаЗаказа.Записать(РежимЗаписиДокумента.Проведение,РежимПроведенияДокумента.Неоперативный);	
				Если НЕ ФоновыйРежим Тогда 
					Сообщить("Сформирован и проведен документ <" + Строка(ОтменаЗаказа)+ ">");	
				КонецЕсли;
				//формируем данные для страницы "сформированные документы" 	
				СтрокаКэша = КэшСнятиеРезервов.Добавить();
				СтрокаКэша.Автомобиль = ТекЗаказДляСписания.Автомобиль;
				СтрокаКэша.Ссылка = ОтменаЗаказа.Ссылка;
				//таблица содержит заказы, резервы по которым были сняты данным документом
				СтрокаИтоговая = ТаблицаЗаказовИтоговая.Добавить();
				СтрокаИтоговая.Заказ = ТекЗаказДляСписания.Заказ;
				//создаем напоминание автору заказа
				Если СоздаватьНапоминание Тогда
					Обработки.АвтоматическоеСнятиеРезервовАвтомобилей.СоздатьНапоминание(НаборЗаписейНапоминания, ТаблицаЗаказовИтоговая,,ОтменаЗаказа.Ссылка);
				КонецЕсли;
			Исключение
				Если НЕ ФоновыйРежим Тогда 
					Сообщить("Не удалось записать документ " + Строка(ТекущийДокумент));	
				КонецЕсли;
			КонецПопытки;
 			ТаблицаЗаказовИтоговая.Очистить();
		Иначе
			Если обЗначениеНеЗаполнено(ТекущийДокумент) Тогда
				// создаем новый документ и заполняем его реквизиты
				ТекущийДокумент = Документы.СнятиеРезервовАвтомобилей.СоздатьДокумент();
				ТекущийДокумент.Заполнить(Неопределено);
				ТекущийДокумент.СкладКомпании = ТекЗаказДляСписания.СкладКомпании;	
				ТекущийДокумент.Комментарий = "Автоматическое снятие резервов автомобилей";
			КонецЕсли;
			НоваяСтрока = ТекущийДокумент.Автомобили.Добавить();
			НоваяСтрока.Автомобиль = ТекЗаказДляСписания.Автомобиль;
			//таблица содержит заказы, резервы по которым были сняты данным документом
 			СтрокаИтоговая = ТаблицаЗаказовИтоговая.Добавить();
			СтрокаИтоговая.Заказ = ТекЗаказДляСписания.Заказ;
		КонецЕсли;

	КонецЦикла;
	
	//записываем последний документ, если он не был записан в цикле
	Если НЕ обЗначениеНеЗаполнено(ТекущийДокумент) И ТекущийДокумент.Автомобили.Количество()>0 Тогда
		Попытка
			ТекущийДокумент.Записать(РежимЗаписиДокумента.Проведение,РежимПроведенияДокумента.Неоперативный);	
			Если НЕ ФоновыйРежим Тогда 
				Сообщить("Сформирован и проведен документ <" + Строка(ТекущийДокумент)+ ">");	
			КонецЕсли;
			//формируем данные для страницы "сформированные документы" 	
			Для Каждого СтрокаТоваров Из ТекущийДокумент.Ссылка.Автомобили Цикл
				СтрокаКэша = КэшСнятиеРезервов.Добавить();
				СтрокаКэша.Ссылка = ТекущийДокумент.Ссылка;
				СтрокаКэша.Автомобиль = СтрокаТоваров.Автомобиль;
			КонецЦикла;
			//создаем напоминание автору заказа
			Если СоздаватьНапоминание Тогда
				Обработки.АвтоматическоеСнятиеРезервовАвтомобилей.СоздатьНапоминание(НаборЗаписейНапоминания, ТаблицаЗаказовИтоговая,ТекущийДокумент.Ссылка);
			КонецЕсли;
		Исключение
			Если НЕ ФоновыйРежим Тогда 
				Сообщить("Не удалось записать документ " + Строка(ТекущийДокумент));	
			КонецЕсли;
		КонецПопытки;
		ТекущийДокумент = Документы.СнятиеРезервовАвтомобилей.ПустаяСсылка();
	КонецЕсли;
	
	//записываем сформированные напоминания
	Если СоздаватьНапоминание Тогда
		Попытка  НаборЗаписейНапоминания.Записать(Истина); 
		Исключение 	
			Если НЕ ФоновыйРежим Тогда 
				Сообщить("Ошибка создания напоминаний о резервировании автомобилей: "+ОписаниеОшибки()); 
			КонецЕсли;
		КонецПопытки;
	КонецЕсли;
	
	Возврат КэшСнятиеРезервов;
	
КонецФункции

// Выполняет регламентное задание по автоматическому снятию резервов
//
Процедура ВыполнитьАвтоматическоеСнятиеРезервовАвтомобилей(СтруктураПараметров) Экспорт
	
	// получим параметры
	КорректировкаЗаказа = Ложь;
	ФормированиеНапоминаний = Ложь;
	СписаниеРезервовСПредоплатой = Ложь;
	Если ТипЗнч(СтруктураПараметров) = Тип("Структура") Тогда
		СтруктураПараметров.Свойство("КорректировкаЗаказа",КорректировкаЗаказа);
		СтруктураПараметров.Свойство("ФормированиеНапоминаний",ФормированиеНапоминаний);
		СтруктураПараметров.Свойство("СписаниеРезервовСПредоплатой",СписаниеРезервовСПредоплатой);
	КонецЕсли;
	
	// формируем таблицу заказов, по которым будут списываться резервы
	ТаблицаЗаказовАвтомобилей = ПолучитьТаблицуЗаказовАвтомобилей();
	ТаблицаЗаказовДляСписания = Новый ТаблицаЗначений;
	ТаблицаЗаказовДляСписания.Колонки.Добавить("Заказ",Новый ОписаниеТипов("ДокументСсылка.ЗаказНаАвтомобиль"));
	ТаблицаЗаказовДляСписания.Колонки.Добавить("СкладКомпании",Новый ОписаниеТипов("СправочникСсылка.СкладыКомпании"));
	ТаблицаЗаказовДляСписания.Колонки.Добавить("Автомобиль",Новый ОписаниеТипов("СправочникСсылка.Автомобили"));	
	ТаблицаЗаказовДляСписания.Колонки.Добавить("Корректировка",Новый ОписаниеТипов("Булево"));	
	
	// заполнение таблиц данными о заказах в соответствии с параметрами
	ТекДата = ТекущаяДата();
	Для Каждого ТекЗаказ Из ТаблицаЗаказовАвтомобилей Цикл
		Если НЕ обЗначениеНеЗаполнено(ТекЗаказ.СрокСнятияРезерва) И ТекЗаказ.СрокСнятияРезерва < ТекДата Тогда
			Если ТекЗаказ.Оплата > 0 И НЕ СписаниеРезервовСПредоплатой Тогда
				Продолжить;
			КонецЕсли;
			Если ТаблицаЗаказовДляСписания.Найти(ТекЗаказ.Заказ, "Заказ") = Неопределено Тогда
				НоваяСтрока = ТаблицаЗаказовДляСписания.Добавить();
				НоваяСтрока.Заказ = ТекЗаказ.Заказ;
				НоваяСтрока.СкладКомпании = ТекЗаказ.СкладКомпании;
				НоваяСтрока.Автомобиль = ТекЗаказ.Автомобиль;
				НоваяСтрока.Корректировка = КорректировкаЗаказа;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	// выполняем функцию, которая формирует документы снятия резервов 
	Результат = ВыполнитьСнятиеРезервовАвтомобилей(ТаблицаЗаказовДляСписания,ФормированиеНапоминаний,Истина);
	
КонецПроцедуры



