
Процедура ОбработкаНаСервере() Экспорт
	СчитатьФайл();
КонецПроцедуры
	
//Продумать вариант хранения данных в системе.
Процедура СчитатьФайл() Экспорт
	
	ТаблицаСчетов.Очистить();
	
	ТекстФайла = Новый ТекстовыйДокумент;
	ТекстФайла.Прочитать(ПутьКфайлу);
	
	КоличествоСтрок = ТекстФайла.КоличествоСтрок();
	Для Сч = 1 по КоличествоСтрок Цикл
		ТекСтрока = ТекстФайла.ПолучитьСтроку(Сч);
		Если Лев(ТекСтрока,3) = "015" тогда
			СтруктураСчета = Новый Структура;
			СтруктураСчета.Вставить("НомерСчета",Сред(ТекСтрока,5,6));
			СтруктураСчета.Вставить("КатегорияСчета",Сред(ТекСтрока,12,1));
			СтруктураСчета.Вставить("Автомобиль",Справочники.Автомобили.НайтиПоРеквизиту("VIN",Сред(ТекСтрока,19,17)));
			СтруктураСчета.Вставить("Валюта", Справочники.Валюты.НайтиПоРеквизиту("КодВалютыПоISO",ВРег(Сред(ТекСтрока,36,3))));
			СтруктураСчета.Вставить("СтавкаНДС", Справочники.СтавкиНДС.НайтиПоРеквизиту("Ставка",Число(Сред(ТекСтрока,119,5))/100));
			СтруктураСчета.Вставить("СуммаНДС", Число(Сред(ТекСтрока,142,15))/100);
			СтруктураСчета.Вставить("СуммаБезНДС", Число(Сред(ТекСтрока,40,15))/100);
			СтруктураСчета.Вставить("СуммаДокумента", Число(Сред(ТекСтрока,126,15))/100);
			СтруктураСчета.Вставить("НомерВДМС", Сред(ТекСтрока,174,20));
			
			ЗаказНаряд = РегистрыСведений.EDR_Invoices.ПолучитьЗаказНарядПоСчету(СтруктураСчета["НомерСчета"]);
			СтруктураСчета.Вставить("ЗаказНаряд",ЗаказНаряд);
			
			НС = ТаблицаСчетов.Добавить();
			ЗаполнитьЗначенияСвойств(НС,СтруктураСчета);
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры