Перем Поток Экспорт;
Перем BIR Экспорт;
Перем ВерсияDMS Экспорт;
Перем Организация Экспорт;

Перем СоответствиеПотоков;

Перем АдресWS;
Перем ЛогинWS;
Перем ПарольWS;

Функция ПолучитьIP()
	Попытка
		
		WinSock = Новый COMОбъект("MSWinsock.Winsock");
		
		Возврат WinSock.LocalIP;
		
	Исключение
		
		//Если через WinSock не получилось получить IP - получим через WMI.
		
		ИмяКомпьютера = ИмяКомпьютера();
		objWMIService = ПолучитьCOMОбъект("winmgmts:\\" + ИмяКомпьютера + "\root\CIMV2");
		IPConfigSet = objWMIService.ExecQuery("SELECT * FROM Win32_NetworkAdapterConfiguration where IPEnabled=TRUE",,48);
		
		//Берем первый, не пустой IP
		Для Каждого IPConfig Из IPConfigSet Цикл 
			
			Для Каждого Стр Из IPConfig.IPAddress Цикл
				
				Если НЕ Стр = "0.0.0.0" тогда
					Возврат Стр;
				КонецЕсли;
				
			КонецЦикла;
			
		КонецЦикла;
		
	КонецПопытки;
	
КонецФункции

Процедура ОтправитьСтатистику() Экспорт
	
	ПроверитьПараметрыПодключения();
	ОтправитьСтатистикуПоWS();
	
КонецПроцедуры

////@+ Процедура ПроверитьПараметрыПодключения()
//<xml version="1.0" encoding="UTF-8">
//<Автодок>
//<Процедура ТипПроцедуры=""
//           ИнструкцииПрепроцессору=""
//           ДатаCоздания="09.07.2013 14:30:52" Автор="Окипний Андрей Евгеньевич">
// <Имя>ПроверитьПараметрыПодключения()</Имя>
//
// <Описание>
//  <!-- Вставить описание -->
// </Описание>
// </Параметры>
//  <!-- Без параметров -->
//</Процедура>
//</Автодок>
//</xml>
//@-
Процедура ПроверитьПараметрыПодключения()
	
	Если НЕ ЗначениеЗаполнено(АдресWS) тогда
		АдресWS = Renault_Открытый.ПолучитьАдресВебСервисовПоУмолчанию();
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(ЛогинWS) тогда
		ЛогинWS = Renault_Открытый.ПолучитьЛогинСервисовПоУмолчанию();
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(ПарольWS) тогда
		ПарольWS = Renault_Открытый.ПолучитьПарольСервисовПоУмолчанию();
	КонецЕсли;
	
КонецПроцедуры // ПроверитьПараметрыПодключения()


Процедура ОтправитьСтатистикуПоWS()
	
	IP = ПолучитьIP();
	
	ВСОпределение = Новый WSОпределения(СокрЛП(АдресWS) + "ws/stat.ws?wsdl",
									СокрЛП(ЛогинWS), СокрЛП(ПарольWS));

	ВебСервис = Новый WSПрокси(ВСОпределение, "http://renault-nissan.com/schema/datatable", 
							   "Статистика","СтатистикаSoap12",600);
	
	ВебСервис.Пользователь	 = СокрЛП(ЛогинWS);
	ВебСервис.Пароль		 = СокрЛП(ПарольWS);
	
	СервисФабрика = ВебСервис.ФабрикаXDTO;
	
	Статистика = СервисФабрика.Создать(СервисФабрика.Тип("http://renault-nissan.com/schema/datatable", "Статистика"));;
	
	Статистика.BIR = BIR;
	Статистика.Поток = СоответствиеПотоков[Поток];
	Статистика.Дата = ТекущаяДата();
	Статистика.IP = IP;
	Статистика.ВерсияDMS = ВерсияDMS;
	
	ВебСервис.setstat(Статистика);
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ОБЩЕГО НАЗНАЧЕНИЯ

СоответствиеПотоков = Новый Соответствие;

Для каждого Значение из Перечисления.Renault_ПотокиОбмена Цикл
	
	СоответствиеПотоков.Вставить(Значение, Метаданные.Перечисления.Renault_ПотокиОбмена.ЗначенияПеречисления[Перечисления.Renault_ПотокиОбмена.Индекс(Значение)].Имя);
	
КонецЦикла;

АдресWS  = Константы.Renault_АдресWebСервисов.Получить();
ЛогинWS  = Константы.Renault_ЛогинВебСервиса.Получить();
ПарольWS = Константы.Renault_ПарольВебСервиса.Получить();