
// Если на входе Массив строк, то на выходе - строка с разделителями.
// Если на входе строка с разделителями, то на выходе - массив строк.
Функция СтрокаМассив(Знач Значение, Разделитель = ",") Экспорт
	Если ТипЗнч(Значение) = Тип("Строка") Тогда
		МнСтр = СтрЗаменить( Значение, Разделитель, Символы.ПС );
		РезультатМассив = Новый Массив;
		Для й = 1 По СтрЧислоСтрок(МнСтр) Цикл
			РезультатМассив.Добавить( СтрПолучитьСтроку( МнСтр, й ) );
		КонецЦикла;
		Возврат РезультатМассив;
	ИначеЕсли ТипЗнч(Значение) = Тип("Массив") Тогда
		РезультатСтрока = "";
		Для Каждого Элемент Из Значение Цикл
			РезультатСтрока = РезультатСтрока + ?( РезультатСтрока = "", "", Разделитель ) + Элемент;
		КонецЦикла;
		Возврат РезультатСтрока;
	Иначе
		Возврат Неопределено;	
	КонецЕсли;
КонецФункции

