
Процедура ОбработкаПроведения(Отказ, Режим)
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!

	// регистр ДТ_Оклады
	Движения.ДТ_Оклады.Записывать = Истина;
	Движения.ДТ_Оклады.Очистить();
	Для Каждого ТекСтрокаСтавки Из Ставки Цикл
		Движение = Движения.ДТ_Оклады.Добавить();
		Движение.Период = Дата;
		Движение.Подразделение = Подразделение;
		Движение.Должность = ТекСтрокаСтавки.Должность;
		Движение.УправленческийОклада = ТекСтрокаСтавки.УправленческийОклада;
		Движение.РегламентированныйОклад = ТекСтрокаСтавки.РегламентированныйОклад;
	КонецЦикла;

	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры
