
&НаКлиенте
Процедура КомандаСохранить(Команда)
	
	ТекстHTML = "";
	СтруктураВложений = Новый Структура;
	ФорматированныйДокумент.ПолучитьHTML(ТекстHTML, СтруктураВложений);
	СтруктураОтвета = Новый Структура;
	СтруктураОтвета.Вставить("ТекстHTML", ТекстHTML);
	СтруктураОтвета.Вставить("СтруктураВложений", СтруктураВложений);
	Закрыть(СтруктураОтвета);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ПриОткрытииНаСервере(ТекстОтвета);
	
КонецПроцедуры

&НаСервере
Процедура ПриОткрытииНаСервере(ТекстОтвета)
	
	Если ЗначениеЗаполнено(ТекстОтвета) Тогда
		СтрукВложения = Новый Структура;
		Для Каждого СтрВлож ИЗ Вложения Цикл
			СтрукВложения.Вставить(СтрВлож.ИмяВложения, СтрВлож.Вложение);
		КонецЦикла;
		ФорматированныйДокумент.УстановитьHTML(ТекстОтвета, СтрукВложения);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, СтандартнаяОбработка)
	
	//ТекстHTML = "";
	//СтруктураВложений = Новый Структура;
	//ФорматированныйДокумент.ПолучитьHTML(ТекстHTML, СтруктураВложений);
	//СтруктураОтвета = Новый Структура;
	//СтруктураОтвета.Вставить("ТекстHTML", ТекстHTML);
	//СтруктураОтвета.Вставить("СтруктураВложений", СтруктураВложений);
	//Закрыть(СтруктураОтвета);
	
КонецПроцедуры
