
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("АвтоТест") Тогда
		Возврат;
	КонецЕсли; 
	
	УстановитьУсловноеОформление();
	
КонецПроцедуры

&НаКлиенте
Процедура ОтправитьНаСогласование(Команда)
	
	ТекущаяСтрока = Элементы.Список.ТекущаяСтрока;
	
	Если ТекущаяСтрока = Неопределено Тогда
		Возврат;
	КонецЕсли; 
		
	СсылкаБизнесПроцесс = ОтправитьНаСогласованиеНаСервере(ТекущаяСтрока);
	
	ПараметрыФормы = Новый Структура("Ключ",СсылкаБизнесПроцесс);	
	ОткрытьФорму("БизнесПроцесс.DMS_СогласованиеОтчетовПоРекламнойКампании.Форма.ФормаБизнесПроцесса",ПараметрыФормы,ЭтаФорма);
	
КонецПроцедуры

&НаСервере
Процедура УстановитьУсловноеОформление()

	УсловноеОформление.Элементы.Очистить();
	
	DMS_РекламныеКампанииСервер.УсловноеОформлениеСпискаОтчетовРекламнойКампании(ЭтаФорма); 
	             
КонецПроцедуры // УстановитьУсловноеОформление()

&НаСервереБезКонтекста
Функция ОтправитьНаСогласованиеНаСервере(Ссылка)
		
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Предмет", Ссылка);
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ ПЕРВЫЕ 2
		|	СогласованиеОтчетов.Ссылка КАК Ссылка
		|ИЗ
		|	БизнесПроцесс.DMS_СогласованиеОтчетовПоРекламнойКампании КАК СогласованиеОтчетов
		|ГДЕ
		|	СогласованиеОтчетов.Предмет = &Предмет
		|	И НЕ СогласованиеОтчетов.ПометкаУдаления
		|	И НЕ СогласованиеОтчетов.Стартован
		|	И НЕ СогласованиеОтчетов.Завершен
		|
		|УПОРЯДОЧИТЬ ПО
		|	Ссылка
		|АВТОУПОРЯДОЧИВАНИЕ";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		Возврат ВыборкаДетальныеЗаписи.Ссылка;
	КонецЕсли; 
	
	БизнесПроцесс = БизнесПроцессы.DMS_СогласованиеОтчетовПоРекламнойКампании.СоздатьБизнесПроцесс();
	БизнесПроцесс.Заполнить(Ссылка);
	
	БизнесПроцессСсылка = БизнесПроцессы.DMS_СогласованиеОтчетовПоРекламнойКампании.ПолучитьСсылку();
	БизнесПроцесс.УстановитьСсылкуНового(БизнесПроцессСсылка);
	БизнесПроцесс.ОбменДанными.Загрузка = Истина;
	БизнесПроцесс.Записать();
	
	Возврат БизнесПроцессСсылка;
	
КонецФункции


