Перем АвтоПечатьПикингЛиста Экспорт;

Процедура ОбновитьДокументыВыдачи() Экспорт

    Запрос = Новый Запрос;
	
	Запрос.УстановитьПараметр("СкладКомпании", СкладКомпании);
	//Запрос.УстановитьПараметр("СкладРеализации", ПараметрыСеанса.Renault_ПраваПользователя.ДилерскийЦентр.Запчасти_СкладРеализации);
	
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЗаказыПокупателейОстатки.Номенклатура,
	               |	ЗаказыПокупателейОстатки.Заказ КАК Заказ,
	               |	ВЫРАЗИТЬ(ЗаказыПокупателейОстатки.Заказ КАК Документ.ЗаказПокупателя).Контрагент КАК Контрагент,
	               |	ВЫРАЗИТЬ(ЗаказыПокупателейОстатки.Заказ КАК Документ.ЗаказПокупателя).ДокументОснование КАК ДокументОснование,
	               |	ЗаказыПокупателейОстатки.РезервОстаток,
	               |	ЗаказыПокупателейОстатки.СкладКомпании КАК СкладКомпании,
	               |	ВЫРАЗИТЬ(ЗаказыПокупателейОстатки.Заказ КАК Документ.ЗаказПокупателя).Renault_Advanced_СкладРеализации КАК СкладРеализации
	               |ПОМЕСТИТЬ ВТ_ЗаказыПокупателейОстаткиДетальноПодготовка
	               |ИЗ
	               |	РегистрНакопления.ЗаказыПокупателей.Остатки(
	               |			,
	               |			СкладКомпании = &СкладКомпании
	               |				И Заказ ССЫЛКА Документ.ЗаказПокупателя) КАК ЗаказыПокупателейОстатки
	               |
	               |ИНДЕКСИРОВАТЬ ПО
	               |	Заказ
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВЫРАЗИТЬ(КорректировкаЗаказаПокупателя.ДокументОснование КАК Документ.ЗаказПокупателя) КАК Заказ,
	               |	КорректировкаЗаказаПокупателя.МоментВремени КАК МоментВремени
	               |ПОМЕСТИТЬ КорректировкиПодготовка
	               |ИЗ
	               |	Документ.КорректировкаЗаказаПокупателя КАК КорректировкаЗаказаПокупателя
	               |ГДЕ
	               |	КорректировкаЗаказаПокупателя.Проведен
	               |	И КорректировкаЗаказаПокупателя.ДокументОснование В
	               |			(ВЫБРАТЬ
	               |				ВТ_ЗаказыПокупателейОстаткиДетальноПодготовка.Заказ
	               |			ИЗ
	               |				ВТ_ЗаказыПокупателейОстаткиДетальноПодготовка КАК ВТ_ЗаказыПокупателейОстаткиДетальноПодготовка)
	               |
	               |ИНДЕКСИРОВАТЬ ПО
	               |	Заказ
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	КорректировкиПодготовка.Заказ,
	               |	КорректировкиПодготовкаПосле.МоментВремени КАК МоментВремениКорректировки
	               |ПОМЕСТИТЬ ПоследниеКорректировки
	               |ИЗ
	               |	КорректировкиПодготовка КАК КорректировкиПодготовка
	               |		ЛЕВОЕ СОЕДИНЕНИЕ КорректировкиПодготовка КАК КорректировкиПодготовкаПосле
	               |		ПО КорректировкиПодготовка.Заказ = КорректировкиПодготовкаПосле.Заказ
	               |			И КорректировкиПодготовка.МоментВремени < КорректировкиПодготовкаПосле.МоментВремени
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	КорректировкиПодготовка.Заказ,
	               |	КорректировкиПодготовкаПосле.МоментВремени
	               |
	               |ИМЕЮЩИЕ
	               |	СУММА(ВЫБОР
	               |			КОГДА КорректировкиПодготовкаПосле.МоментВремени ЕСТЬ NULL
	               |				ТОГДА 0
	               |			ИНАЧЕ 1
	               |		КОНЕЦ) = 0
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВТ_ЗаказыПокупателейОстаткиДетальноПодготовка.Номенклатура,
	               |	ВТ_ЗаказыПокупателейОстаткиДетальноПодготовка.Заказ КАК Заказ,
	               |	ВТ_ЗаказыПокупателейОстаткиДетальноПодготовка.Контрагент,
	               |	ВТ_ЗаказыПокупателейОстаткиДетальноПодготовка.ДокументОснование,
	               |	ВТ_ЗаказыПокупателейОстаткиДетальноПодготовка.РезервОстаток,
	               |	ВТ_ЗаказыПокупателейОстаткиДетальноПодготовка.СкладКомпании,
	               |	ВЫБОР
	               |		КОГДА КорректировкаЗаказаПокупателя.Ссылка ЕСТЬ NULL
	               |			ТОГДА ВТ_ЗаказыПокупателейОстаткиДетальноПодготовка.СкладРеализации
	               |		ИНАЧЕ КорректировкаЗаказаПокупателя.Renault_Advanced_СкладРеализации
	               |	КОНЕЦ КАК СкладРеализации
	               |ПОМЕСТИТЬ ВТ_ЗаказыПокупателейОстаткиДетально
	               |ИЗ
	               |	ВТ_ЗаказыПокупателейОстаткиДетальноПодготовка КАК ВТ_ЗаказыПокупателейОстаткиДетальноПодготовка
	               |		ЛЕВОЕ СОЕДИНЕНИЕ ПоследниеКорректировки КАК ПоследниеКорректировки
	               |		ПО ВТ_ЗаказыПокупателейОстаткиДетальноПодготовка.Заказ = ПоследниеКорректировки.Заказ
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Документ.КорректировкаЗаказаПокупателя КАК КорректировкаЗаказаПокупателя
	               |		ПО (ПоследниеКорректировки.МоментВремениКорректировки = КорректировкаЗаказаПокупателя.МоментВремени)
	               |
	               |ИНДЕКСИРОВАТЬ ПО
	               |	Заказ
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВТ_ЗаказыПокупателейОстаткиДетально.Заказ,
	               |	ВТ_ЗаказыПокупателейОстаткиДетально.ДокументОснование КАК ДокументОснование
	               |ПОМЕСТИТЬ ВТ_Заказы
	               |ИЗ
	               |	ВТ_ЗаказыПокупателейОстаткиДетально КАК ВТ_ЗаказыПокупателейОстаткиДетально
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ВТ_ЗаказыПокупателейОстаткиДетально.Заказ,
	               |	ВТ_ЗаказыПокупателейОстаткиДетально.ДокументОснование
	               |
	               |ИНДЕКСИРОВАТЬ ПО
	               |	ДокументОснование
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВТ_Заказы.Заказ КАК Заказ,
	               |	МАКСИМУМ(ВЫБОР
	               |			КОГДА ВТ_Заказы.ДокументОснование ССЫЛКА Документ.ЗаказНаряд
	               |				ТОГДА ВЫРАЗИТЬ(ВТ_Заказы.ДокументОснование КАК Документ.ЗаказНаряд)
	               |			КОГДА НЕ ЗаказНаряд.Ссылка ЕСТЬ NULL
	               |				ТОГДА ЗаказНаряд.Ссылка
	               |			КОГДА НЕ ЗаказНарядНаОснованииЗаказа.Ссылка ЕСТЬ NULL
	               |				ТОГДА ЗаказНарядНаОснованииЗаказа.Ссылка
	               |			КОГДА НЕ Renault_CRM_ЗаявкаНаСервисСчетаНаОплату.Ссылка.ЗаказНаряд ЕСТЬ NULL
	               |				ТОГДА Renault_CRM_ЗаявкаНаСервисСчетаНаОплату.Ссылка.ЗаказНаряд
	               |			ИНАЧЕ ЗНАЧЕНИЕ(Документ.ЗаказНаряд.ПустаяСсылка)
	               |		КОНЕЦ) КАК ЗаказНаряд
	               |ПОМЕСТИТЬ ВТ_ЗаказНарядыПоЗаказам
	               |ИЗ
	               |	ВТ_Заказы КАК ВТ_Заказы
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Документ.Renault_CRM_ЗаявкаНаСервис.СчетаНаОплату КАК Renault_CRM_ЗаявкаНаСервисСчетаНаОплату
	               |		ПО ВТ_Заказы.ДокументОснование = Renault_CRM_ЗаявкаНаСервисСчетаНаОплату.СчетНаОплату
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ЗаказНаряд КАК ЗаказНарядНаОснованииЗаказа
	               |		ПО ВТ_Заказы.Заказ = ЗаказНарядНаОснованииЗаказа.ДокументОснование
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ЗаказНаряд КАК ЗаказНаряд
	               |		ПО ВТ_Заказы.ДокументОснование = ЗаказНаряд.Ссылка
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ВТ_Заказы.Заказ
	               |
	               |ИНДЕКСИРОВАТЬ ПО
	               |	Заказ
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |	ВТ_ЗаказыПокупателейОстаткиДетально.Номенклатура КАК Номенклатура,
	               |	ВТ_ЗаказНарядыПоЗаказам.ЗаказНаряд КАК ЗаказНаряд
	               |ПОМЕСТИТЬ ВТ_НоменклатураЗаказНаряды
	               |ИЗ
	               |	ВТ_ЗаказыПокупателейОстаткиДетально КАК ВТ_ЗаказыПокупателейОстаткиДетально
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_ЗаказНарядыПоЗаказам КАК ВТ_ЗаказНарядыПоЗаказам
	               |		ПО ВТ_ЗаказыПокупателейОстаткиДетально.Заказ = ВТ_ЗаказНарядыПоЗаказам.Заказ
	               |			И (ВТ_ЗаказНарядыПоЗаказам.ЗаказНаряд <> ЗНАЧЕНИЕ(Документ.ЗаказНаряд.ПустаяСсылка))
	               |
	               |ИНДЕКСИРОВАТЬ ПО
	               |	Номенклатура,
	               |	ЗаказНаряд
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ЕСТЬNULL(ЗаказыПокупателейОстатки.ЗаказаноОстаток, 0) КАК ЗаказаноВРемзону,
	               |	ВТ_НоменклатураЗаказНаряды.ЗаказНаряд КАК ЗаказНаряд,
	               |	ВТ_НоменклатураЗаказНаряды.Номенклатура КАК Номенклатура
	               |ПОМЕСТИТЬ ВТ_ЗаказаноВРемзоны
	               |ИЗ
	               |	ВТ_НоменклатураЗаказНаряды КАК ВТ_НоменклатураЗаказНаряды
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ЗаказыПокупателей.Остатки(
	               |				,
	               |				Заказ ССЫЛКА Документ.ЗаказВнутренний
	               |					И (Номенклатура, Заказ.ДокументОснование) В
	               |						(ВЫБРАТЬ
	               |							ВТ_НоменклатураЗаказНаряды.Номенклатура,
	               |							ВТ_НоменклатураЗаказНаряды.ЗаказНаряд
	               |						ИЗ
	               |							ВТ_НоменклатураЗаказНаряды КАК ВТ_НоменклатураЗаказНаряды)) КАК ЗаказыПокупателейОстатки
	               |		ПО ВТ_НоменклатураЗаказНаряды.Номенклатура = ЗаказыПокупателейОстатки.Номенклатура
	               |			И ВТ_НоменклатураЗаказНаряды.ЗаказНаряд = ЗаказыПокупателейОстатки.Заказ.ДокументОснование
	               |
	               |ИНДЕКСИРОВАТЬ ПО
	               |	ЗаказНаряд,
	               |	Номенклатура
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВТ_ЗаказыПокупателейОстаткиДетально.Номенклатура,
	               |	ВТ_ЗаказыПокупателейОстаткиДетально.Заказ,
	               |	ВТ_ЗаказыПокупателейОстаткиДетально.Контрагент,
	               |	ВТ_ЗаказыПокупателейОстаткиДетально.ДокументОснование,
	               |	ВЫБОР
	               |		КОГДА ВТ_ЗаказНарядыПоЗаказам.ЗаказНаряд <> ЗНАЧЕНИЕ(Документ.ЗаказНаряд.ПустаяСсылка)
	               |			ТОГДА ВЫБОР
	               |					КОГДА ВТ_ЗаказыПокупателейОстаткиДетально.РезервОстаток > ЕСТЬNULL(ВТ_ЗаказаноВРемзоны.ЗаказаноВРемзону, 0)
	               |						ТОГДА ЕСТЬNULL(ВТ_ЗаказаноВРемзоны.ЗаказаноВРемзону, 0)
	               |					ИНАЧЕ ВТ_ЗаказыПокупателейОстаткиДетально.РезервОстаток
	               |				КОНЕЦ
	               |		ИНАЧЕ ВТ_ЗаказыПокупателейОстаткиДетально.РезервОстаток
	               |	КОНЕЦ КАК Количество,
	               |	ВТ_ЗаказыПокупателейОстаткиДетально.СкладКомпании,
	               |	ВТ_ЗаказНарядыПоЗаказам.ЗаказНаряд
	               |ПОМЕСТИТЬ ВТ_ЗаказыПокупателейОстаткиДетальноСЗаказамиВРемзону
	               |ИЗ
	               |	ВТ_ЗаказыПокупателейОстаткиДетально КАК ВТ_ЗаказыПокупателейОстаткиДетально
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_ЗаказНарядыПоЗаказам КАК ВТ_ЗаказНарядыПоЗаказам
	               |		ПО ВТ_ЗаказыПокупателейОстаткиДетально.Заказ = ВТ_ЗаказНарядыПоЗаказам.Заказ
	               |		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ЗаказаноВРемзоны КАК ВТ_ЗаказаноВРемзоны
	               |		ПО ВТ_ЗаказыПокупателейОстаткиДетально.Номенклатура = ВТ_ЗаказаноВРемзоны.Номенклатура
	               |			И (ВТ_ЗаказНарядыПоЗаказам.ЗаказНаряд = ВТ_ЗаказаноВРемзоны.ЗаказНаряд)
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВТ_ЗаказыПокупателейОстаткиДетальноСЗаказамиВРемзону.Номенклатура,
	               |	ВТ_ЗаказыПокупателейОстаткиДетальноСЗаказамиВРемзону.Заказ,
	               |	ВТ_ЗаказыПокупателейОстаткиДетальноСЗаказамиВРемзону.Контрагент,
	               |	ВТ_ЗаказыПокупателейОстаткиДетальноСЗаказамиВРемзону.ДокументОснование,
	               |	ВТ_ЗаказыПокупателейОстаткиДетальноСЗаказамиВРемзону.Количество,
	               |	ВТ_ЗаказыПокупателейОстаткиДетальноСЗаказамиВРемзону.СкладКомпании,
	               |	ВТ_ЗаказыПокупателейОстаткиДетальноСЗаказамиВРемзону.ЗаказНаряд
	               |ПОМЕСТИТЬ ВТ_ЗаказыПокупателейОстаткиСОтором
	               |ИЗ
	               |	ВТ_ЗаказыПокупателейОстаткиДетальноСЗаказамиВРемзону КАК ВТ_ЗаказыПокупателейОстаткиДетальноСЗаказамиВРемзону
	               |ГДЕ
	               |	ВТ_ЗаказыПокупателейОстаткиДетальноСЗаказамиВРемзону.Количество > 0
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВТ_ЗаказыПокупателейОстаткиСОтором.Заказ,
	               |	ВТ_ЗаказыПокупателейОстаткиСОтором.ДокументОснование КАК ДокументОснование,
	               |	СУММА(ВТ_ЗаказыПокупателейОстаткиСОтором.Количество) КАК РезервОстаток,
	               |	ВТ_ЗаказыПокупателейОстаткиСОтором.СкладКомпании,
	               |	ВТ_ЗаказыПокупателейОстаткиСОтором.ЗаказНаряд
	               |ПОМЕСТИТЬ ВТ_ЗаказыПокупателейОстатки
	               |ИЗ
	               |	ВТ_ЗаказыПокупателейОстаткиСОтором КАК ВТ_ЗаказыПокупателейОстаткиСОтором
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ВТ_ЗаказыПокупателейОстаткиСОтором.Заказ,
	               |	ВТ_ЗаказыПокупателейОстаткиСОтором.ДокументОснование,
	               |	ВТ_ЗаказыПокупателейОстаткиСОтором.СкладКомпании,
	               |	ВТ_ЗаказыПокупателейОстаткиСОтором.ЗаказНаряд
	               |
	               |ИНДЕКСИРОВАТЬ ПО
	               |	ДокументОснование
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ИнформацияПоСтрокамЗаказа.Заказ,
	               |	ИнформацияПоСтрокамЗаказа.Номенклатура,
	               |	СУММА(ИнформацияПоСтрокамЗаказа.КоличествоЗаказаноНаСкладРеализации - ИнформацияПоСтрокамЗаказа.КоличествоОтгруженоНаСкладРеализации) КАК Количество
	               |ПОМЕСТИТЬ ВТ_ВозможноОтгрузить
	               |ИЗ
	               |	РегистрСведений.Renault_Advanced_ИнформацияПоСтрокамЗаказа КАК ИнформацияПоСтрокамЗаказа
	               |ГДЕ
	               |	(ИнформацияПоСтрокамЗаказа.Заказ, ИнформацияПоСтрокамЗаказа.Номенклатура) В
	               |			(ВЫБРАТЬ
	               |				ВТ_ЗаказыПокупателейОстатки.Заказ,
	               |				ВТ_ЗаказыПокупателейОстатки.Номенклатура
	               |			ИЗ
	               |				ВТ_ЗаказыПокупателейОстаткиДетально КАК ВТ_ЗаказыПокупателейОстатки)
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ИнформацияПоСтрокамЗаказа.Заказ,
	               |	ИнформацияПоСтрокамЗаказа.Номенклатура
	               |
	               |ИМЕЮЩИЕ
	               |	СУММА(ИнформацияПоСтрокамЗаказа.КоличествоЗаказаноНаСкладРеализации - ИнформацияПоСтрокамЗаказа.КоличествоОтгруженоНаСкладРеализации) > 0
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ЗаказыПокупателейОстатки.Заказ КАК Документ,
	               |	ЗаказыПокупателейОстатки.ЗаказНаряд КАК ЗаказНаряд,
	               |	МАКСИМУМ(ЗаказыПокупателейОстатки.РезервОстаток) КАК РезервОстаток,
	               |	ЗаказыПокупателейОстатки.ЗаказНаряд.ВидРемонта
	               |ПОМЕСТИТЬ ВТ_Подготовка
	               |ИЗ
	               |	ВТ_ЗаказыПокупателейОстатки КАК ЗаказыПокупателейОстатки
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ЗаказыПокупателейОстатки.Заказ,
	               |	ЗаказыПокупателейОстатки.ЗаказНаряд,
	               |	ЗаказыПокупателейОстатки.ЗаказНаряд.ВидРемонта
	               |
	               |ИНДЕКСИРОВАТЬ ПО
	               |	ЗаказНаряд
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВТИтоговая.Документ КАК Документ,
	               |	ВТИтоговая.ЗаказНаряд,
	               |	ВТИтоговая.ЗаказНаряд.Номер КАК НомерЗаказаНаряда,
	               |	ВТИтоговая.Документ.Номер КАК Номер,
	               |	ВЫБОР
	               |		КОГДА Renault_ВидыРемонтаДопРеквизиты.ВидРемонта ЕСТЬ NULL
	               |			ТОГДА ЛОЖЬ
	               |		ИНАЧЕ Renault_ВидыРемонтаДопРеквизиты.ГарантияЗавода
	               |	КОНЕЦ КАК ТипЗН,
	               |	ВТИтоговая.Документ.Контрагент КАК Контрагент
	               |ИЗ
	               |	ВТ_Подготовка КАК ВТИтоговая
	               |		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	               |			ВТ_ВозможноОтгрузить.Заказ КАК Заказ,
	               |			СУММА(ВТ_ВозможноОтгрузить.Количество) КАК Количество
	               |		ИЗ
	               |			ВТ_ВозможноОтгрузить КАК ВТ_ВозможноОтгрузить
	               |		
	               |		СГРУППИРОВАТЬ ПО
	               |			ВТ_ВозможноОтгрузить.Заказ) КАК ВозможноОтгрузить
	               |		ПО ВТИтоговая.Документ = ВозможноОтгрузить.Заказ
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.Renault_ВидыРемонтаДопРеквизиты КАК Renault_ВидыРемонтаДопРеквизиты
	               |		ПО ВТИтоговая.ЗаказНарядВидРемонта = Renault_ВидыРемонтаДопРеквизиты.ВидРемонта
	               |ГДЕ
	               |	ВЫБОР
	               |			КОГДА ВТИтоговая.ЗаказНаряд = ЗНАЧЕНИЕ(Документ.ЗаказНаряд.ПустаяСсылка)
	               |					И ВозможноОтгрузить.Количество ЕСТЬ NULL
	               |				ТОГДА ЛОЖЬ
	               |			ИНАЧЕ ИСТИНА
	               |		КОНЕЦ
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	Документ УБЫВ
	               |АВТОУПОРЯДОЧИВАНИЕ";

    СписокДокументов.Загрузить(Запрос.Выполнить().Выгрузить());

КонецПроцедуры

Процедура ОбновитьТоварыНаВыдачу(ЗаказПокупателя, ЗаказНаряд) Экспорт

	Товары.Очистить();
	
    Запрос = Новый Запрос;
	
    Запрос.УстановитьПараметр("СкладКомпании", ЭтотОбъект.СкладКомпании);
	Запрос.УстановитьПараметр("СкладРеализации", Обработки.Renault_Advanced_АРМ_Реализации.ПолучитьРеквизит(ЗаказПокупателя,"Renault_Advanced_СкладРеализации"));
    Запрос.УстановитьПараметр("Заказ", ЗаказПокупателя);
	Запрос.УстановитьПараметр("Контрагент", ЗаказПокупателя.Контрагент);
	Запрос.УстановитьПараметр("ЗаказНаряд", ЗаказНаряд);
	
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЗаказыПокупателейОстатки.Заказ КАК Документ,
	               |	&ЗаказНаряд,
	               |	ЗаказыПокупателейОстатки.Номенклатура КАК Номенклатура,
	               |	ВЫБОР
	               |		КОГДА ЗаказыПокупателейОстатки.Номенклатура.ОсновнаяЕдиницаИзмерения.Коэффициент ЕСТЬ NULL 
	               |				ИЛИ ЗаказыПокупателейОстатки.Номенклатура.ОсновнаяЕдиницаИзмерения.Коэффициент = 0
	               |			ТОГДА 1
	               |		ИНАЧЕ ЗаказыПокупателейОстатки.Номенклатура.ОсновнаяЕдиницаИзмерения.Коэффициент
	               |	КОНЕЦ КАК Коэффициент,
	               |	МАКСИМУМ(ЗаказыПокупателейОстатки.РезервОстаток) КАК КоличествоБазовое,
	               |	ЗаказыПокупателейОстатки.Номенклатура.Артикул КАК Артикул,
	               |	ИСТИНА КАК Выбран
	               |ПОМЕСТИТЬ ВТ_ЗаказыОстатки
	               |ИЗ
	               |	РегистрНакопления.ЗаказыПокупателей.Остатки(
	               |			,
	               |			СкладКомпании = &СкладКомпании
	               |				И Заказ = &Заказ
	               |				И Контрагент = &Контрагент) КАК ЗаказыПокупателейОстатки
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ЗаказыПокупателейОстатки.Номенклатура,
	               |	ЗаказыПокупателейОстатки.Заказ,
	               |	ЗаказыПокупателейОстатки.Номенклатура.Артикул,
	               |	ВЫБОР
	               |		КОГДА ЗаказыПокупателейОстатки.Номенклатура.ОсновнаяЕдиницаИзмерения.Коэффициент ЕСТЬ NULL 
	               |				ИЛИ ЗаказыПокупателейОстатки.Номенклатура.ОсновнаяЕдиницаИзмерения.Коэффициент = 0
	               |			ТОГДА 1
	               |		ИНАЧЕ ЗаказыПокупателейОстатки.Номенклатура.ОсновнаяЕдиницаИзмерения.Коэффициент
	               |	КОНЕЦ
	               |
	               |ИНДЕКСИРОВАТЬ ПО
	               |	Номенклатура
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |	ВТ_ЗаказыОстатки.Номенклатура КАК Номенклатура,
	               |	ВТ_ЗаказыОстатки.ЗаказНаряд КАК ЗаказНаряд
	               |ПОМЕСТИТЬ ВТ_НоменклатураЗаказНаряды
	               |ИЗ
	               |	ВТ_ЗаказыОстатки КАК ВТ_ЗаказыОстатки
	               |ГДЕ
	               |	ВТ_ЗаказыОстатки.ЗаказНаряд ССЫЛКА Документ.ЗаказНаряд
	               |	И ВТ_ЗаказыОстатки.ЗаказНаряд <> ЗНАЧЕНИЕ(Документ.ЗаказНаряд.ПустаяСсылка)
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ЕСТЬNULL(ЗаказыПокупателейОстатки.ЗаказаноОстаток, 0) КАК ЗаказаноВРемзону,
	               |	ВТ_НоменклатураЗаказНаряды.ЗаказНаряд КАК ЗаказНаряд,
	               |	ВТ_НоменклатураЗаказНаряды.Номенклатура КАК Номенклатура
	               |ПОМЕСТИТЬ ВТ_ЗаказаноВРемзоны
	               |ИЗ
	               |	ВТ_НоменклатураЗаказНаряды КАК ВТ_НоменклатураЗаказНаряды
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ЗаказыПокупателей.Остатки(
	               |				,
	               |				Заказ ССЫЛКА Документ.ЗаказВнутренний
	               |					И (Номенклатура, ВЫБОР
	               |						КОГДА Заказ ССЫЛКА Документ.ЗаказВнутренний
	               |							ТОГДА ВЫРАЗИТЬ(Заказ КАК Документ.ЗаказВнутренний).ДокументОснование
	               |					КОНЕЦ) В
	               |						(ВЫБРАТЬ
	               |							ВТ_НоменклатураЗаказНаряды.Номенклатура,
	               |							ВТ_НоменклатураЗаказНаряды.ЗаказНаряд
	               |						ИЗ
	               |							ВТ_НоменклатураЗаказНаряды КАК ВТ_НоменклатураЗаказНаряды)) КАК ЗаказыПокупателейОстатки
	               |		ПО ВТ_НоменклатураЗаказНаряды.Номенклатура = ЗаказыПокупателейОстатки.Номенклатура
	               |			И (ВТ_НоменклатураЗаказНаряды.ЗаказНаряд = ВЫБОР
	               |				КОГДА ЗаказыПокупателейОстатки.Заказ ССЫЛКА Документ.ЗаказВнутренний
	               |					ТОГДА ВЫРАЗИТЬ(ЗаказыПокупателейОстатки.Заказ КАК Документ.ЗаказВнутренний).ДокументОснование
	               |			КОНЕЦ)
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВТ_ЗаказыОстатки.Документ,
	               |	ВТ_ЗаказыОстатки.ЗаказНаряд,
	               |	ВТ_ЗаказыОстатки.Номенклатура,
	               |	ВТ_ЗаказыОстатки.Коэффициент,
	               |	ВЫБОР
	               |		КОГДА ВТ_ЗаказыОстатки.ЗаказНаряд ССЫЛКА Документ.ЗаказНаряд
	               |				И ВТ_ЗаказыОстатки.ЗаказНаряд <> ЗНАЧЕНИЕ(Документ.ЗаказНаряд.ПустаяССылка)
	               |			ТОГДА ВЫБОР
	               |					КОГДА ВТ_ЗаказыОстатки.КоличествоБазовое > ЕСТЬNULL(ВТ_ЗаказаноВРемзоны.ЗаказаноВРемзону, 0)
	               |						ТОГДА ЕСТЬNULL(ВТ_ЗаказаноВРемзоны.ЗаказаноВРемзону, 0)
	               |					ИНАЧЕ ВТ_ЗаказыОстатки.КоличествоБазовое
	               |				КОНЕЦ
	               |		ИНАЧЕ ВТ_ЗаказыОстатки.КоличествоБазовое
	               |	КОНЕЦ КАК КоличествоБазовое,
	               |	ВТ_ЗаказыОстатки.Артикул,
	               |	ВТ_ЗаказыОстатки.Выбран
	               |ПОМЕСТИТЬ ВТ_ЗаказыОстаткиЗаказаноВРемзону
	               |ИЗ
	               |	ВТ_ЗаказыОстатки КАК ВТ_ЗаказыОстатки
	               |		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ЗаказаноВРемзоны КАК ВТ_ЗаказаноВРемзоны
	               |		ПО ВТ_ЗаказыОстатки.ЗаказНаряд = ВТ_ЗаказаноВРемзоны.ЗаказНаряд
	               |			И ВТ_ЗаказыОстатки.Номенклатура = ВТ_ЗаказаноВРемзоны.Номенклатура
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ИнформацияПоСтрокамЗаказа.Номенклатура КАК Номенклатура,
	               |	СУММА(ИнформацияПоСтрокамЗаказа.КоличествоЗаказаноНаСкладРеализации - ИнформацияПоСтрокамЗаказа.КоличествоОтгруженоНаСкладРеализации) КАК Количество
	               |ПОМЕСТИТЬ ВТ_ЗаказаноМагазин
	               |ИЗ
	               |	РегистрСведений.Renault_Advanced_ИнформацияПоСтрокамЗаказа КАК ИнформацияПоСтрокамЗаказа
	               |ГДЕ
	               |	ИнформацияПоСтрокамЗаказа.Заказ = &Заказ
	               |	И ИнформацияПоСтрокамЗаказа.Номенклатура В
	               |			(ВЫБРАТЬ
	               |				ВТ_ЗаказыОстатки.Номенклатура
	               |			ИЗ
	               |				ВТ_ЗаказыОстатки КАК ВТ_ЗаказыОстатки)
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ИнформацияПоСтрокамЗаказа.Номенклатура
	               |
	               |ИМЕЮЩИЕ
	               |	СУММА(ИнформацияПоСтрокамЗаказа.КоличествоЗаказаноНаСкладРеализации - ИнформацияПоСтрокамЗаказа.КоличествоОтгруженоНаСкладРеализации) > 0
	               |
	               |ИНДЕКСИРОВАТЬ ПО
	               |	Номенклатура
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВТ_ЗаказыОстаткиЗаказаноВРемзону.Выбран,
	               |	ВТ_ЗаказыОстаткиЗаказаноВРемзону.Документ,
	               |	ВТ_ЗаказыОстаткиЗаказаноВРемзону.ЗаказНаряд,
	               |	ВТ_ЗаказыОстаткиЗаказаноВРемзону.Артикул,
	               |	ВТ_ЗаказыОстаткиЗаказаноВРемзону.Номенклатура,
	               |	ВТ_ЗаказыОстаткиЗаказаноВРемзону.Коэффициент,
	               |	ВЫБОР
	               |		КОГДА ВТ_ЗаказыОстаткиЗаказаноВРемзону.ЗаказНаряд <> ЗНАЧЕНИЕ(Документ.ЗаказНаряд.ПустаяСсылка)
	               |			ТОГДА ВТ_ЗаказыОстаткиЗаказаноВРемзону.КоличествоБазовое
	               |		ИНАЧЕ ЕСТЬNULL(ВТ_ЗаказаноМагазин.Количество, 0)
	               |	КОНЕЦ КАК КоличествоБазовое,
	               |	ВЫБОР
	               |		КОГДА ВТ_ЗаказыОстаткиЗаказаноВРемзону.ЗаказНаряд <> ЗНАЧЕНИЕ(Документ.ЗаказНаряд.ПустаяСсылка)
	               |			ТОГДА ВТ_ЗаказыОстаткиЗаказаноВРемзону.КоличествоБазовое / ВТ_ЗаказыОстаткиЗаказаноВРемзону.Коэффициент
	               |		ИНАЧЕ ЕСТЬNULL(ВТ_ЗаказаноМагазин.Количество, 0) / ВТ_ЗаказыОстаткиЗаказаноВРемзону.Коэффициент
	               |	КОНЕЦ КАК Количество,
	               |	ВЫБОР
	               |		КОГДА ВТ_ЗаказыОстаткиЗаказаноВРемзону.ЗаказНаряд <> ЗНАЧЕНИЕ(Документ.ЗаказНаряд.ПустаяСсылка)
	               |			ТОГДА ВТ_ЗаказыОстаткиЗаказаноВРемзону.КоличествоБазовое / ВТ_ЗаказыОстаткиЗаказаноВРемзону.Коэффициент
	               |		ИНАЧЕ ЕСТЬNULL(ВТ_ЗаказаноМагазин.Количество, 0) / ВТ_ЗаказыОстаткиЗаказаноВРемзону.Коэффициент
	               |	КОНЕЦ КАК КоличествоОбщ
	               |ИЗ
	               |	ВТ_ЗаказыОстаткиЗаказаноВРемзону КАК ВТ_ЗаказыОстаткиЗаказаноВРемзону
	               |		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ЗаказаноМагазин КАК ВТ_ЗаказаноМагазин
	               |		ПО ВТ_ЗаказыОстаткиЗаказаноВРемзону.Номенклатура = ВТ_ЗаказаноМагазин.Номенклатура
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК спрНоменклатура
	               |			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ЕдиницыИзмерения КАК ЕдиницыИзмерения
	               |			ПО спрНоменклатура.ОсновнаяЕдиницаИзмерения = ЕдиницыИзмерения.Ссылка
	               |		ПО ВТ_ЗаказыОстаткиЗаказаноВРемзону.Номенклатура = спрНоменклатура.Ссылка
	               |ГДЕ
	               |	ВЫБОР
	               |			КОГДА ВТ_ЗаказыОстаткиЗаказаноВРемзону.ЗаказНаряд <> ЗНАЧЕНИЕ(Документ.ЗаказНаряд.ПустаяСсылка)
	               |				ТОГДА ВТ_ЗаказыОстаткиЗаказаноВРемзону.КоличествоБазовое
	               |			ИНАЧЕ ЕСТЬNULL(ВТ_ЗаказаноМагазин.Количество, 0)
	               |		КОНЕЦ > 0";
	
    Товары.Загрузить(Запрос.Выполнить().Выгрузить());
	
КонецПроцедуры

Процедура ОбновитьДокументыВозврата() Экспорт

    Запрос = Новый Запрос;
	
	Запрос.УстановитьПараметр("СкладКомпании", СкладКомпании);
	
	Запрос.Текст = "ВЫБРАТЬ
	               |	ТоварыВПроизводствеОстатки.ЗаказНаряд КАК Документ,
	               |	ТоварыВПроизводствеОстатки.ЗаказНаряд КАК ЗаказНаряд,
	               |	ТоварыВПроизводствеОстатки.Номенклатура КАК Номенклатура,
	               |	ТоварыВПроизводствеОстатки.КоличествоОстаток КАК КоличествоОстаток
	               |ПОМЕСТИТЬ ВТ_ОстаткиПроизводствоПодготовка
	               |ИЗ
	               |	РегистрНакопления.ТоварыВПроизводстве.Остатки КАК ТоварыВПроизводствеОстатки
	               |
	               |ИНДЕКСИРОВАТЬ ПО
	               |	ЗаказНаряд
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВТ_ОстаткиПроизводство.ЗаказНаряд КАК ЗаказНаряд,
	               |	ВТ_ОстаткиПроизводство.ЗаказНаряд.ДокументОснование КАК ЗаказНарядДокументОснование
	               |ПОМЕСТИТЬ ЗаказНаряды
	               |ИЗ
	               |	ВТ_ОстаткиПроизводствоПодготовка КАК ВТ_ОстаткиПроизводство
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ВТ_ОстаткиПроизводство.ЗаказНаряд,
	               |	ВТ_ОстаткиПроизводство.ЗаказНаряд.ДокументОснование
	               |
	               |ИНДЕКСИРОВАТЬ ПО
	               |	ЗаказНаряд
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ЗаказНаряды.ЗаказНаряд КАК ЗаказНаряд,
	               |	ВЫБОР
	               |		КОГДА ЗаказНаряды.ЗаказНарядДокументОснование ССЫЛКА Документ.ЗаказПокупателя
	               |			ТОГДА ВЫРАЗИТЬ(ЗаказНаряды.ЗаказНарядДокументОснование КАК Документ.ЗаказПокупателя)
	               |		КОГДА НЕ ЗаказПокупателя.Ссылка ЕСТЬ NULL
	               |			ТОГДА ЗаказПокупателя.Ссылка
	               |		ИНАЧЕ ЗНАЧЕНИЕ(Документ.ЗаказПокупателя.ПустаяСсылка)
	               |	КОНЕЦ КАК ЗаказПокупателя
	               |ПОМЕСТИТЬ ЗаказыПокупателейПоЗН
	               |ИЗ
	               |	ЗаказНаряды КАК ЗаказНаряды
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ЗаказПокупателя КАК ЗаказПокупателя
	               |		ПО ЗаказНаряды.ЗаказНаряд = ЗаказПокупателя.ДокументОснование
	               |
	               |ИНДЕКСИРОВАТЬ ПО
	               |	ЗаказНаряд
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВТ_ОстаткиПроизводствоПодготовка.Документ КАК Документ,
	               |	ВТ_ОстаткиПроизводствоПодготовка.ЗаказНаряд КАК ЗаказНаряд,
	               |	ВТ_ОстаткиПроизводствоПодготовка.Номенклатура КАК Номенклатура,
	               |	ВТ_ОстаткиПроизводствоПодготовка.КоличествоОстаток КАК КоличествоОстаток,
	               |	ВТ_ОстаткиПроизводствоПодготовка.Документ.Дата КАК ДокументДата
	               |ПОМЕСТИТЬ ВТ_ОстаткиПроизводство
	               |ИЗ
	               |	ВТ_ОстаткиПроизводствоПодготовка КАК ВТ_ОстаткиПроизводствоПодготовка
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ЗаказыПокупателейПоЗН КАК ЗаказыПокупателейПоЗН
	               |		ПО ВТ_ОстаткиПроизводствоПодготовка.ЗаказНаряд = ЗаказыПокупателейПоЗН.ЗаказНаряд
	               |			И (ЗаказыПокупателейПоЗН.ЗаказПокупателя.СкладКомпании = &СкладКомпании)
	               |
	               |ИНДЕКСИРОВАТЬ ПО
	               |	ЗаказНаряд
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ИнформацияПоСтрокамЗаказа.Заказ КАК Заказ,
	               |	ИнформацияПоСтрокамЗаказа.Заказ.Контрагент КАК Контрагент,
	               |	ИнформацияПоСтрокамЗаказа.Заказ.Renault_Advanced_СкладРеализации КАК СкладРеализации,
	               |	ИнформацияПоСтрокамЗаказа.Номенклатура КАК Номенклатура,
	               |	ИнформацияПоСтрокамЗаказа.Характеристика КАК Характеристика,
	               |	ВЫБОР
	               |		КОГДА ИнформацияПоСтрокамЗаказа.КоличествоОтгруженоНаСкладРеализации > ИнформацияПоСтрокамЗаказа.КоличествоЗаказаноНаСкладРеализации
	               |			ТОГДА ИнформацияПоСтрокамЗаказа.КоличествоЗаказаноНаСкладРеализации
	               |		ИНАЧЕ ИнформацияПоСтрокамЗаказа.КоличествоОтгруженоНаСкладРеализации
	               |	КОНЕЦ КАК Отгружено,
	               |	ИнформацияПоСтрокамЗаказа.Заказ.Дата КАК ЗаказДата
	               |ПОМЕСТИТЬ ВТ_ОтгруженоВМагазинПодготовка1
	               |ИЗ
	               |	РегистрСведений.Renault_Advanced_ИнформацияПоСтрокамЗаказа КАК ИнформацияПоСтрокамЗаказа
	               |ГДЕ
	               |	ИнформацияПоСтрокамЗаказа.Заказ ССЫЛКА Документ.ЗаказПокупателя
	               |	И ИнформацияПоСтрокамЗаказа.Заказ.СкладКомпании = &СкладКомпании
	               |	И ВЫБОР
	               |			КОГДА ИнформацияПоСтрокамЗаказа.КоличествоОтгруженоНаСкладРеализации > ИнформацияПоСтрокамЗаказа.КоличествоЗаказаноНаСкладРеализации
	               |				ТОГДА ИнформацияПоСтрокамЗаказа.КоличествоЗаказаноНаСкладРеализации
	               |			ИНАЧЕ ИнформацияПоСтрокамЗаказа.КоличествоОтгруженоНаСкладРеализации
	               |		КОНЕЦ > 0
	               |
	               |ИНДЕКСИРОВАТЬ ПО
	               |	Заказ
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВЫРАЗИТЬ(КорректировкаЗаказаПокупателя.ДокументОснование КАК Документ.ЗаказПокупателя) КАК Заказ,
	               |	КорректировкаЗаказаПокупателя.МоментВремени КАК МоментВремениКорректировка
	               |ПОМЕСТИТЬ КорректировкиПодготовка
	               |ИЗ
	               |	Документ.КорректировкаЗаказаПокупателя КАК КорректировкаЗаказаПокупателя
	               |ГДЕ
	               |	КорректировкаЗаказаПокупателя.Проведен
	               |	И КорректировкаЗаказаПокупателя.ДокументОснование В
	               |			(ВЫБРАТЬ
	               |				ВТ_ОтгруженоВМагазинПодготовка.Заказ
	               |			ИЗ
	               |				ВТ_ОтгруженоВМагазинПодготовка1 КАК ВТ_ОтгруженоВМагазинПодготовка)
	               |
	               |ИНДЕКСИРОВАТЬ ПО
	               |	Заказ
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	КорректировкиПодготовка.Заказ КАК Заказ,
	               |	КорректировкиПодготовка.МоментВремениКорректировка КАК МоментВремениКорректировка
	               |ПОМЕСТИТЬ ПоследнийКорректировки
	               |ИЗ
	               |	КорректировкиПодготовка КАК КорректировкиПодготовка
	               |		ЛЕВОЕ СОЕДИНЕНИЕ КорректировкиПодготовка КАК КорректировкиПодготовкаПосле
	               |		ПО КорректировкиПодготовка.Заказ = КорректировкиПодготовкаПосле.Заказ
	               |			И КорректировкиПодготовка.МоментВремениКорректировка < КорректировкиПодготовкаПосле.МоментВремениКорректировка
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	КорректировкиПодготовка.Заказ,
	               |	КорректировкиПодготовка.МоментВремениКорректировка
	               |
	               |ИМЕЮЩИЕ
	               |	СУММА(ВЫБОР
	               |			КОГДА КорректировкиПодготовкаПосле.МоментВремениКорректировка ЕСТЬ NULL
	               |				ТОГДА 0
	               |			ИНАЧЕ 1
	               |		КОНЕЦ) = 0
	               |
	               |ИНДЕКСИРОВАТЬ ПО
	               |	Заказ
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВТ_ОтгруженоВМагазинПодготовка1.Заказ КАК Заказ,
	               |	ВТ_ОтгруженоВМагазинПодготовка1.Контрагент КАК Контрагент,
	               |	ВЫБОР
	               |		КОГДА КорректировкаЗаказаПокупателя.Ссылка ЕСТЬ NULL
	               |			ТОГДА ВТ_ОтгруженоВМагазинПодготовка1.СкладРеализации
	               |		ИНАЧЕ КорректировкаЗаказаПокупателя.Renault_Advanced_СкладРеализации
	               |	КОНЕЦ КАК СкладРеализации,
	               |	ВТ_ОтгруженоВМагазинПодготовка1.Номенклатура КАК Номенклатура,
	               |	ВТ_ОтгруженоВМагазинПодготовка1.Характеристика КАК Характеристика,
	               |	ВТ_ОтгруженоВМагазинПодготовка1.Отгружено КАК Отгружено,
	               |	ВТ_ОтгруженоВМагазинПодготовка1.ЗаказДата КАК ЗаказДата
	               |ПОМЕСТИТЬ ВТ_ОтгруженоВМагазинПодготовка
	               |ИЗ
	               |	ВТ_ОтгруженоВМагазинПодготовка1 КАК ВТ_ОтгруженоВМагазинПодготовка1
	               |		ЛЕВОЕ СОЕДИНЕНИЕ ПоследнийКорректировки КАК ПоследнийКорректировки
	               |		ПО ВТ_ОтгруженоВМагазинПодготовка1.Заказ = ПоследнийКорректировки.Заказ
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Документ.КорректировкаЗаказаПокупателя КАК КорректировкаЗаказаПокупателя
	               |		ПО (ПоследнийКорректировки.МоментВремениКорректировка = КорректировкаЗаказаПокупателя.МоментВремени)
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВТ_ОтгруженоВМагазинПодготовка.Заказ КАК Документ,
	               |	ВТ_ОтгруженоВМагазинПодготовка.ЗаказДата КАК ДокументДата,
	               |	ЗНАЧЕНИЕ(Документ.ЗаказНаряд.ПустаяСсылка) КАК ЗаказНаряд,
	               |	ЛОЖЬ КАК ТипЗН,
	               |	ВТ_ОтгруженоВМагазинПодготовка.Номенклатура КАК Номенклатура,
	               |	ВТ_ОтгруженоВМагазинПодготовка.Характеристика КАК Характеристика,
	               |	ВЫБОР
	               |		КОГДА ЗаказыПокупателейОстатки.РезервОстаток > ВТ_ОтгруженоВМагазинПодготовка.Отгружено
	               |			ТОГДА ВТ_ОтгруженоВМагазинПодготовка.Отгружено
	               |		ИНАЧЕ ЗаказыПокупателейОстатки.РезервОстаток
	               |	КОНЕЦ КАК Отгружено
	               |ПОМЕСТИТЬ ВТ_ОтгруженоВМагазин
	               |ИЗ
	               |	РегистрНакопления.ЗаказыПокупателей.Остатки(
	               |			,
	               |			(Заказ, Контрагент, СкладКомпании, Номенклатура, ХарактеристикаНоменклатуры) В
	               |				(ВЫБРАТЬ
	               |					ВТ_ОтгруженоВМагазинПодготовка.Заказ,
	               |					ВТ_ОтгруженоВМагазинПодготовка.Контрагент,
	               |					ВТ_ОтгруженоВМагазинПодготовка.СкладРеализации,
	               |					ВТ_ОтгруженоВМагазинПодготовка.Номенклатура,
	               |					ВТ_ОтгруженоВМагазинПодготовка.Характеристика
	               |				ИЗ
	               |					ВТ_ОтгруженоВМагазинПодготовка КАК ВТ_ОтгруженоВМагазинПодготовка)) КАК ЗаказыПокупателейОстатки
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_ОтгруженоВМагазинПодготовка КАК ВТ_ОтгруженоВМагазинПодготовка
	               |		ПО ЗаказыПокупателейОстатки.Заказ = ВТ_ОтгруженоВМагазинПодготовка.Заказ
	               |			И ЗаказыПокупателейОстатки.СкладКомпании = ВТ_ОтгруженоВМагазинПодготовка.СкладРеализации
	               |			И ЗаказыПокупателейОстатки.ХарактеристикаНоменклатуры = ВТ_ОтгруженоВМагазинПодготовка.Характеристика
	               |			И ЗаказыПокупателейОстатки.Номенклатура = ВТ_ОтгруженоВМагазинПодготовка.Номенклатура
	               |			И ЗаказыПокупателейОстатки.Контрагент = ВТ_ОтгруженоВМагазинПодготовка.Контрагент
	               |
	               |ИНДЕКСИРОВАТЬ ПО
	               |	Документ
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВТ_ОстаткиПроизводство.Документ КАК Документ,
	               |	ВТ_ОстаткиПроизводство.ЗаказНаряд КАК ЗаказНаряд,
	               |	ВТ_ОстаткиПроизводство.ЗаказНаряд.Номер КАК НомерЗаказаНаряда,
	               |	ВТ_ОстаткиПроизводство.Документ.Номер КАК Номер,
	               |	ВЫБОР
	               |		КОГДА Renault_ВидыРемонтаДопРеквизиты.ВидРемонта ЕСТЬ NULL
	               |			ТОГДА ЛОЖЬ
	               |		ИНАЧЕ Renault_ВидыРемонтаДопРеквизиты.ГарантияЗавода
	               |	КОНЕЦ КАК ТипЗН,
	               |	ВТ_ОстаткиПроизводство.ДокументДата КАК ДокументДата,
	               |	ВТ_ОстаткиПроизводство.Документ.Контрагент КАК Контрагент
	               |ИЗ
	               |	ВТ_ОстаткиПроизводство КАК ВТ_ОстаткиПроизводство
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.Renault_ВидыРемонтаДопРеквизиты КАК Renault_ВидыРемонтаДопРеквизиты
	               |		ПО ВТ_ОстаткиПроизводство.ЗаказНаряд.ВидРемонта = Renault_ВидыРемонтаДопРеквизиты.ВидРемонта
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ВТ_ОстаткиПроизводство.Документ,
	               |	ВТ_ОстаткиПроизводство.ЗаказНаряд,
	               |	ВЫБОР
	               |		КОГДА Renault_ВидыРемонтаДопРеквизиты.ВидРемонта ЕСТЬ NULL
	               |			ТОГДА ЛОЖЬ
	               |		ИНАЧЕ Renault_ВидыРемонтаДопРеквизиты.ГарантияЗавода
	               |	КОНЕЦ,
	               |	ВТ_ОстаткиПроизводство.ДокументДата,
	               |	ВТ_ОстаткиПроизводство.ЗаказНаряд.Номер,
	               |	ВТ_ОстаткиПроизводство.Документ.Номер
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	ВТ_ОтгруженоВМагазин.Документ,
	               |	ВТ_ОтгруженоВМагазин.ЗаказНаряд,
	               |	ВТ_ОтгруженоВМагазин.ЗаказНаряд.Номер,
	               |	ВТ_ОтгруженоВМагазин.Документ.Номер,
	               |	ВТ_ОтгруженоВМагазин.ТипЗН,
	               |	ВТ_ОтгруженоВМагазин.ДокументДата,
	               |	ВТ_ОтгруженоВМагазин.Документ.Контрагент
	               |ИЗ
	               |	ВТ_ОтгруженоВМагазин КАК ВТ_ОтгруженоВМагазин
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ВТ_ОтгруженоВМагазин.Документ,
	               |	ВТ_ОтгруженоВМагазин.ЗаказНаряд,
	               |	ВТ_ОтгруженоВМагазин.ТипЗН,
	               |	ВТ_ОтгруженоВМагазин.ДокументДата,
	               |	ВТ_ОтгруженоВМагазин.ЗаказНаряд.Номер,
	               |	ВТ_ОтгруженоВМагазин.Документ.Номер
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	ДокументДата УБЫВ";

	Результат = Запрос.Выполнить().Выгрузить();			   
	Результат.Колонки.Удалить("ДокументДата");
	СписокДокументов.Загрузить(Результат);

КонецПроцедуры

Процедура ОбновитьТоварыНаВозврат(ЗаказНаряд, ЗаказПокупателя) Экспорт
	
	Запрос = Новый Запрос;
	
	Запрос.УстановитьПараметр("СкладКомпании", СкладКомпании);
	Запрос.УстановитьПараметр("ЗаказНаряд", ЗаказНаряд);
	Запрос.УстановитьПараметр("ЗаказПокупателя", ЗаказПокупателя);
	Запрос.УстановитьПараметр("СкладРеализации", Обработки.Renault_Advanced_АРМ_Реализации.ПолучитьРеквизит(ЗаказПокупателя,"Renault_Advanced_СкладРеализации"));
	
	Запрос.Текст = "ВЫБРАТЬ
	               |	ТоварыВПроизводствеОстатки.ЗаказНаряд КАК Документ,
	               |	ТоварыВПроизводствеОстатки.ЗаказНаряд КАК ЗаказНаряд,
	               |	ТоварыВПроизводствеОстатки.Номенклатура,
	               |	ТоварыВПроизводствеОстатки.КоличествоОстаток КАК Остаток
	               |ПОМЕСТИТЬ ВТ_ОстаткиПроизводство
	               |ИЗ
	               |	РегистрНакопления.ТоварыВПроизводстве.Остатки(, ЗаказНаряд = &ЗаказНаряд) КАК ТоварыВПроизводствеОстатки
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ИнформацияПоСтрокамЗаказа.Заказ КАК Заказ,
	               |	ИнформацияПоСтрокамЗаказа.Заказ.Контрагент КАК Контрагент,
	               |	&СкладРеализации КАК СкладРеализации,
	               |	ИнформацияПоСтрокамЗаказа.Номенклатура,
	               |	ИнформацияПоСтрокамЗаказа.Характеристика,
	               |	ВЫБОР
	               |		КОГДА ИнформацияПоСтрокамЗаказа.КоличествоОтгруженоНаСкладРеализации > ИнформацияПоСтрокамЗаказа.КоличествоЗаказаноНаСкладРеализации
	               |			ТОГДА ИнформацияПоСтрокамЗаказа.КоличествоЗаказаноНаСкладРеализации
	               |		ИНАЧЕ ИнформацияПоСтрокамЗаказа.КоличествоОтгруженоНаСкладРеализации
	               |	КОНЕЦ КАК Отгружено
	               |ПОМЕСТИТЬ ВТ_ОтгруженоВМагазинПодготовка
	               |ИЗ
	               |	РегистрСведений.Renault_Advanced_ИнформацияПоСтрокамЗаказа КАК ИнформацияПоСтрокамЗаказа
	               |ГДЕ
	               |	ИнформацияПоСтрокамЗаказа.Заказ = &ЗаказПокупателя
	               |	И ВЫБОР
	               |			КОГДА ИнформацияПоСтрокамЗаказа.КоличествоОтгруженоНаСкладРеализации > ИнформацияПоСтрокамЗаказа.КоличествоЗаказаноНаСкладРеализации
	               |				ТОГДА ИнформацияПоСтрокамЗаказа.КоличествоЗаказаноНаСкладРеализации
	               |			ИНАЧЕ ИнформацияПоСтрокамЗаказа.КоличествоОтгруженоНаСкладРеализации
	               |		КОНЕЦ > 0
	               |
	               |ИНДЕКСИРОВАТЬ ПО
	               |	Заказ
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВТ_ОтгруженоВМагазинПодготовка.Заказ КАК Документ,
	               |	ЗНАЧЕНИЕ(Документ.ЗаказНаряд.ПустаяСсылка) КАК ЗаказНаряд,
	               |	ВТ_ОтгруженоВМагазинПодготовка.Номенклатура,
	               |	СУММА(ВЫБОР
	               |			КОГДА ЗаказыПокупателейОстатки.РезервОстаток > ВТ_ОтгруженоВМагазинПодготовка.Отгружено
	               |				ТОГДА ВТ_ОтгруженоВМагазинПодготовка.Отгружено
	               |			ИНАЧЕ ЗаказыПокупателейОстатки.РезервОстаток
	               |		КОНЕЦ) КАК Остаток
	               |ПОМЕСТИТЬ ВТ_ОтгруженоВМагазин
	               |ИЗ
	               |	РегистрНакопления.ЗаказыПокупателей.Остатки(
	               |			,
	               |			(Заказ, Контрагент, СкладКомпании, Номенклатура, ХарактеристикаНоменклатуры) В
	               |				(ВЫБРАТЬ
	               |					ВТ_ОтгруженоВМагазинПодготовка.Заказ,
	               |					ВТ_ОтгруженоВМагазинПодготовка.Контрагент,
	               |					ВТ_ОтгруженоВМагазинПодготовка.СкладРеализации,
	               |					ВТ_ОтгруженоВМагазинПодготовка.Номенклатура,
	               |					ВТ_ОтгруженоВМагазинПодготовка.Характеристика
	               |				ИЗ
	               |					ВТ_ОтгруженоВМагазинПодготовка КАК ВТ_ОтгруженоВМагазинПодготовка)) КАК ЗаказыПокупателейОстатки
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_ОтгруженоВМагазинПодготовка КАК ВТ_ОтгруженоВМагазинПодготовка
	               |		ПО ЗаказыПокупателейОстатки.Заказ = ВТ_ОтгруженоВМагазинПодготовка.Заказ
	               |			И ЗаказыПокупателейОстатки.СкладКомпании = ВТ_ОтгруженоВМагазинПодготовка.СкладРеализации
	               |			И ЗаказыПокупателейОстатки.ХарактеристикаНоменклатуры = ВТ_ОтгруженоВМагазинПодготовка.Характеристика
	               |			И ЗаказыПокупателейОстатки.Номенклатура = ВТ_ОтгруженоВМагазинПодготовка.Номенклатура
	               |			И ЗаказыПокупателейОстатки.Контрагент = ВТ_ОтгруженоВМагазинПодготовка.Контрагент
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ВТ_ОтгруженоВМагазинПодготовка.Заказ,
	               |	ВТ_ОтгруженоВМагазинПодготовка.Номенклатура
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВТ_ОстаткиПроизводство.Документ,
	               |	ВТ_ОстаткиПроизводство.ЗаказНаряд,
	               |	ВТ_ОстаткиПроизводство.Номенклатура КАК Номенклатура,
	               |	ВТ_ОстаткиПроизводство.Остаток
	               |ПОМЕСТИТЬ Итоговая
	               |ИЗ
	               |	ВТ_ОстаткиПроизводство КАК ВТ_ОстаткиПроизводство
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	ВТ_ОтгруженоВМагазин.Документ,
	               |	ВТ_ОтгруженоВМагазин.ЗаказНаряд,
	               |	ВТ_ОтгруженоВМагазин.Номенклатура,
	               |	ВТ_ОтгруженоВМагазин.Остаток
	               |ИЗ
	               |	ВТ_ОтгруженоВМагазин КАК ВТ_ОтгруженоВМагазин
	               |
	               |ИНДЕКСИРОВАТЬ ПО
	               |	Номенклатура
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	Итоговая.Документ,
	               |	Итоговая.ЗаказНаряд,
	               |	Итоговая.Номенклатура КАК Номенклатура,
	               |	Итоговая.Остаток,
	               |	спрНоменклатура.Артикул,
	               |	ЕСТЬNULL(ЕдиницыИзмерения.Коэффициент, 1) КАК Коэффициент,
	               |	Итоговая.Остаток КАК КоличествоБазовое,
	               |	Итоговая.Остаток / ЕСТЬNULL(ЕдиницыИзмерения.Коэффициент, 1) КАК Количество,
	               |	Итоговая.Остаток / ЕСТЬNULL(ЕдиницыИзмерения.Коэффициент, 1) КАК КоличествоОбщ,
	               |	ИСТИНА КАК Выбран
	               |ИЗ
	               |	Итоговая КАК Итоговая
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК спрНоменклатура
	               |			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ЕдиницыИзмерения КАК ЕдиницыИзмерения
	               |			ПО спрНоменклатура.ОсновнаяЕдиницаИзмерения = ЕдиницыИзмерения.Ссылка
	               |		ПО Итоговая.Номенклатура = спрНоменклатура.Ссылка
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	Номенклатура
	               |АВТОУПОРЯДОЧИВАНИЕ";
				   
	Товары.Загрузить(Запрос.Выполнить().Выгрузить());
	
КонецПроцедуры

Процедура ОбновитьВнутреннееПеремещение() Экспорт

	Запрос = Новый Запрос;
			
	Запрос.УстановитьПараметр("СкладКомпании", СкладКомпании); 
			
	Запрос.Текст = "ВЫБРАТЬ
	               |	ОстаткиТоваровОрдерныйСкладОстатки.Ячейка КАК ЯчейкаХранения,
	               |	ОстаткиТоваровОрдерныйСкладОстатки.КоличествоОстаток
	               |ИЗ
	               |	РегистрНакопления.ОстаткиТоваровОрдерныйСклад.Остатки(, СкладКомпании = &СкладКомпании) КАК ОстаткиТоваровОрдерныйСкладОстатки";
	
	СписокДокументов.Загрузить(Запрос.Выполнить().Выгрузить());

КонецПроцедуры

Процедура ОбновитьТоварыВнутреннееПеремещение(Ячейка) Экспорт

	Запрос = Новый Запрос;
			
	Запрос.УстановитьПараметр("СкладКомпании", СкладКомпании);
	Запрос.УстановитьПараметр("Ячейка", Ячейка);
			
	Запрос.Текст = "ВЫБРАТЬ
	               |	ОстаткиТоваровОрдерныйСкладОстатки.Номенклатура,
	               |	ОстаткиТоваровОрдерныйСкладОстатки.КоличествоОстаток КАК КоличествоБазовое,
	               |	ОстаткиТоваровОрдерныйСкладОстатки.Номенклатура.Артикул КАК Артикул,
	               |	ОстаткиТоваровОрдерныйСкладОстатки.Номенклатура.ОсновнаяЕдиницаИзмерения.Коэффициент КАК Коэффициент,
	               |	ВЫБОР
	               |		КОГДА ОстаткиТоваровОрдерныйСкладОстатки.Номенклатура.ОсновнаяЕдиницаИзмерения.Коэффициент ЕСТЬ NULL 
	               |			ТОГДА 0
	               |		ИНАЧЕ ОстаткиТоваровОрдерныйСкладОстатки.КоличествоОстаток / ОстаткиТоваровОрдерныйСкладОстатки.Номенклатура.ОсновнаяЕдиницаИзмерения.Коэффициент
	               |	КОНЕЦ КАК Остаток,
	               |	ИСТИНА КАК Выбран
	               |ИЗ
	               |	РегистрНакопления.ОстаткиТоваровОрдерныйСклад.Остатки(
	               |			,
	               |			СкладКомпании = &СкладКомпании
	               |				И Ячейка = &Ячейка) КАК ОстаткиТоваровОрдерныйСкладОстатки";
	
	Товары.Загрузить(Запрос.Выполнить().Выгрузить());

КонецПроцедуры

Процедура ОбновитьДокументыПеремещений() Экспорт

    Запрос = Новый Запрос;
	
	Запрос.УстановитьПараметр("СкладКомпании", СкладКомпании);
	
	// Определение заказ-наряда для внутреннего заказа:
	// Заказ внутренний может быть введен на основании заказ-наряда, но не может быть основанием для заказ-наряда
	// и не может быть введен на основании счета на оплату
	
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЗаказыПокупателейОстатки.Номенклатура КАК Номенклатура,
	               |	ВЫРАЗИТЬ(ЗаказыПокупателейОстатки.Заказ КАК Документ.ЗаказВнутренний) КАК Документ,
	               |	ВЫБОР
	               |		КОГДА ЗаказыПокупателейОстатки.Заказ.ДокументОснование ССЫЛКА Документ.ЗаказНаряд
	               |			ТОГДА ВЫРАЗИТЬ(ЗаказыПокупателейОстатки.Заказ.ДокументОснование КАК Документ.ЗаказНаряд)
	               |		ИНАЧЕ ЗНАЧЕНИЕ(Документ.ЗаказНаряд.ПустаяСсылка)
	               |	КОНЕЦ КАК ЗаказНаряд,
	               |	ЗаказыПокупателейОстатки.Заказ.Номер КАК Номер,
	               |	ВЫБОР
	               |		КОГДА ЗаказыПокупателейОстатки.Заказ.ДокументОснование ССЫЛКА Документ.ЗаказНаряд
	               |			ТОГДА ЗаказыПокупателейОстатки.Заказ.ДокументОснование.Номер
	               |		ИНАЧЕ """"
	               |	КОНЕЦ КАК НомерЗаказаНаряда,
	               |	МАКСИМУМ(ЗаказыПокупателейОстатки.РезервОстаток) КАК Количество,
	               |	ЗаказыПокупателейОстатки.СкладКомпании КАК СкладКомпании,
	               |	ВЫРАЗИТЬ(ЗаказыПокупателейОстатки.Заказ КАК Документ.ЗаказВнутренний).Дата КАК Дата
	               |ПОМЕСТИТЬ Вт_ПредИтог
	               |ИЗ
	               |	РегистрНакопления.ЗаказыПокупателей.Остатки(
	               |			,
	               |			СкладКомпании = &СкладКомпании
	               |				И Контрагент ССЫЛКА Справочник.ПодразделенияКомпании
	               |				И Заказ ССЫЛКА Документ.ЗаказВнутренний
	               |				И ВЫРАЗИТЬ(Заказ КАК Документ.ЗаказВнутренний).СкладКомпании = &СкладКомпании) КАК ЗаказыПокупателейОстатки
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ЗаказыПокупателейОстатки.Номенклатура,
	               |	ЗаказыПокупателейОстатки.СкладКомпании,
	               |	ВЫРАЗИТЬ(ЗаказыПокупателейОстатки.Заказ КАК Документ.ЗаказВнутренний),
	               |	ЗаказыПокупателейОстатки.Заказ.Номер,
	               |	ВЫБОР
	               |		КОГДА ЗаказыПокупателейОстатки.Заказ.ДокументОснование ССЫЛКА Документ.ЗаказНаряд
	               |			ТОГДА ЗаказыПокупателейОстатки.Заказ.ДокументОснование.Номер
	               |		ИНАЧЕ """"
	               |	КОНЕЦ,
	               |	ВЫБОР
	               |		КОГДА ЗаказыПокупателейОстатки.Заказ.ДокументОснование ССЫЛКА Документ.ЗаказНаряд
	               |			ТОГДА ВЫРАЗИТЬ(ЗаказыПокупателейОстатки.Заказ.ДокументОснование КАК Документ.ЗаказНаряд)
	               |		ИНАЧЕ ЗНАЧЕНИЕ(Документ.ЗаказНаряд.ПустаяСсылка)
	               |	КОНЕЦ,
	               |	ВЫРАЗИТЬ(ЗаказыПокупателейОстатки.Заказ КАК Документ.ЗаказВнутренний).Дата
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	Renault_ТоварыВПутиОбороты.Номенклатура,
	               |	Renault_ТоварыВПутиОбороты.Перемещение,
	               |	ЗНАЧЕНИЕ(Документ.ЗаказНаряд.ПустаяСсылка),
	               |	Renault_ТоварыВПутиОбороты.Перемещение.Номер,
	               |	"""",
	               |	Renault_ТоварыВПутиОбороты.КоличествоОборот,
	               |	Renault_ТоварыВПутиОбороты.СкладКомпании,
	               |	Renault_ТоварыВПутиОбороты.Перемещение.Дата
	               |ИЗ
	               |	РегистрНакопления.Renault_ТоварыВПути.Обороты(, , , СкладКомпании = &СкладКомпании) КАК Renault_ТоварыВПутиОбороты
	               |ГДЕ
	               |	Renault_ТоварыВПутиОбороты.КоличествоОборот > 0
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	Вт_ПредИтог.Номенклатура,
	               |	Вт_ПредИтог.Документ,
	               |	Вт_ПредИтог.ЗаказНаряд,
	               |	Вт_ПредИтог.Номер,
	               |	Вт_ПредИтог.НомерЗаказаНаряда,
	               |	Вт_ПредИтог.Количество,
	               |	Вт_ПредИтог.СкладКомпании,
	               |	Вт_ПредИтог.Дата,
	               |	Вт_ПредИтог.ЗаказНаряд.Контрагент КАК Контрагент
	               |ИЗ
	               |	Вт_ПредИтог КАК Вт_ПредИтог";
			   
	Результат = Запрос.Выполнить().Выгрузить();			   
	Результат.Свернуть("Документ, ЗаказНаряд");
	
	СписокДокументов.Загрузить(Результат);

КонецПроцедуры

// Процедура - Обновить товары к перемещению
//
// Параметры:
//  Документ - ДокументСсылка	 - Заказ внутренний или Перемещение товаров
//
Процедура ОбновитьТоварыКПеремещению(Документ) Экспорт

    Запрос = Новый Запрос;
	
	Запрос.УстановитьПараметр("СкладКомпании", СкладКомпании);
	Запрос.УстановитьПараметр("Документ", Документ);
	Если ТипЗнч(Документ)=Тип("ДокументСсылка.ЗаказВнутренний") Тогда
		Запрос.УстановитьПараметр("ПодразделениеЗаказа", Документ.ПодразделениеПолучатель);
	Иначе
		Запрос.УстановитьПараметр("ПодразделениеЗаказа", Справочники.ПодразделенияКомпании.ПустаяСсылка());
	КонецЕсли;
	
	// Определение заказ-наряда для внутреннего заказа:
	// Заказ внутренний может быть введен на основании заказ-наряда, но не может быть основанием для заказ-наряда
	// и не может быть введен на основании счета на оплату
	
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЗаказыПокупателейОстатки.Номенклатура,
	               |	ВЫРАЗИТЬ(ЗаказыПокупателейОстатки.Заказ КАК Документ.ЗаказВнутренний) КАК Документ,
	               |	ВЫБОР
	               |		КОГДА ЗаказыПокупателейОстатки.Заказ.ДокументОснование ССЫЛКА Документ.ЗаказНаряд
	               |			ТОГДА ВЫРАЗИТЬ(ЗаказыПокупателейОстатки.Заказ.ДокументОснование КАК Документ.ЗаказНаряд)
	               |		ИНАЧЕ ЗНАЧЕНИЕ(Документ.ЗаказНаряд.ПустаяСсылка)
	               |	КОНЕЦ КАК ЗаказНаряд,
	               |	ЗаказыПокупателейОстатки.СкладКомпании КАК СкладКомпании,
	               |	ЗаказыПокупателейОстатки.Номенклатура.Артикул КАК Артикул,
	               |	ВЫБОР
	               |		КОГДА ЗаказыПокупателейОстатки.Номенклатура.ОсновнаяЕдиницаИзмерения.Коэффициент ЕСТЬ NULL 
	               |			ТОГДА 0
	               |		ИНАЧЕ ЗаказыПокупателейОстатки.РезервОстаток / ЗаказыПокупателейОстатки.Номенклатура.ОсновнаяЕдиницаИзмерения.Коэффициент
	               |	КОНЕЦ КАК Количество,
	               |	ВЫБОР
	               |		КОГДА ЗаказыПокупателейОстатки.Номенклатура.ОсновнаяЕдиницаИзмерения.Коэффициент ЕСТЬ NULL 
	               |			ТОГДА 0
	               |		ИНАЧЕ ЗаказыПокупателейОстатки.РезервОстаток / ЗаказыПокупателейОстатки.Номенклатура.ОсновнаяЕдиницаИзмерения.Коэффициент
	               |	КОНЕЦ КАК КоличествоОбщ,
	               |	МАКСИМУМ(ЗаказыПокупателейОстатки.РезервОстаток) КАК КоличествоБазовое,
	               |	ЗаказыПокупателейОстатки.Номенклатура.ОсновнаяЕдиницаИзмерения.Коэффициент КАК Коэффициент,
	               |	ИСТИНА КАК Выбран
	               |ИЗ
	               |	РегистрНакопления.ЗаказыПокупателей.Остатки(
	               |			,
	               |			СкладКомпании = &СкладКомпании
	               |				И Контрагент = &ПодразделениеЗаказа
	               |				И Заказ = &Документ
	               |				И ВЫРАЗИТЬ(Заказ КАК Документ.ЗаказВнутренний).СкладКомпании = &СкладКомпании) КАК ЗаказыПокупателейОстатки
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ЗаказыПокупателейОстатки.Номенклатура,
	               |	ЗаказыПокупателейОстатки.СкладКомпании,
	               |	ВЫРАЗИТЬ(ЗаказыПокупателейОстатки.Заказ КАК Документ.ЗаказВнутренний),
	               |	ВЫБОР
	               |		КОГДА ЗаказыПокупателейОстатки.Заказ.ДокументОснование ССЫЛКА Документ.ЗаказНаряд
	               |			ТОГДА ВЫРАЗИТЬ(ЗаказыПокупателейОстатки.Заказ.ДокументОснование КАК Документ.ЗаказНаряд)
	               |		ИНАЧЕ ЗНАЧЕНИЕ(Документ.ЗаказНаряд.ПустаяСсылка)
	               |	КОНЕЦ,
	               |	ЗаказыПокупателейОстатки.Номенклатура.Артикул,
	               |	ЗаказыПокупателейОстатки.Номенклатура.ОсновнаяЕдиницаИзмерения.Коэффициент,
	               |	ВЫБОР
	               |		КОГДА ЗаказыПокупателейОстатки.Номенклатура.ОсновнаяЕдиницаИзмерения.Коэффициент ЕСТЬ NULL 
	               |			ТОГДА 0
	               |		ИНАЧЕ ЗаказыПокупателейОстатки.РезервОстаток / ЗаказыПокупателейОстатки.Номенклатура.ОсновнаяЕдиницаИзмерения.Коэффициент
	               |	КОНЕЦ
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	Renault_ТоварыВПутиОбороты.Номенклатура,
	               |	Renault_ТоварыВПутиОбороты.Перемещение,
	               |	ЗНАЧЕНИЕ(Документ.ЗаказНаряд.ПустаяСсылка),
	               |	Renault_ТоварыВПутиОбороты.СкладКомпании,
	               |	СпрНоменклатура.Артикул,
	               |	ВЫБОР
	               |		КОГДА ЕдиницыИзмерения.Ссылка ЕСТЬ NULL 
	               |			ТОГДА 0
	               |		ИНАЧЕ Renault_ТоварыВПутиОбороты.КоличествоОборот / ЕдиницыИзмерения.Коэффициент
	               |	КОНЕЦ,
	               |	ВЫБОР
	               |		КОГДА ЕдиницыИзмерения.Ссылка ЕСТЬ NULL 
	               |			ТОГДА 0
	               |		ИНАЧЕ Renault_ТоварыВПутиОбороты.КоличествоОборот / ЕдиницыИзмерения.Коэффициент
	               |	КОНЕЦ,
	               |	Renault_ТоварыВПутиОбороты.КоличествоОборот,
	               |	ЕдиницыИзмерения.Коэффициент,
	               |	ИСТИНА
	               |ИЗ
	               |	РегистрНакопления.Renault_ТоварыВПути.Обороты(
	               |			,
	               |			,
	               |			,
	               |			Перемещение = &Документ
	               |				И СкладКомпании = &СкладКомпании) КАК Renault_ТоварыВПутиОбороты
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК СпрНоменклатура
	               |			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ЕдиницыИзмерения КАК ЕдиницыИзмерения
	               |			ПО СпрНоменклатура.ОсновнаяЕдиницаИзмерения = ЕдиницыИзмерения.Ссылка
	               |		ПО Renault_ТоварыВПутиОбороты.Номенклатура = СпрНоменклатура.Ссылка
	               |ГДЕ
	               |	Renault_ТоварыВПутиОбороты.КоличествоОборот > 0";

				   
	Результат = Запрос.Выполнить().Выгрузить();			   
	
	Товары.Загрузить(Результат);
	
КонецПроцедуры

Процедура ОбновитьДокументыРазмещение() Экспорт

	Запрос = Новый Запрос;
			
	Запрос.УстановитьПараметр("СкладКомпании", СкладКомпании); 
			
	Запрос.Текст = "ВЫБРАТЬ
	               |	ПоступлениеТоваров.Ссылка КАК Документ,
	               |	ОстаткиТоваровОрдерныйСклад.Номенклатура,
	               |	СУММА(ОстаткиТоваровОрдерныйСклад.Количество) КАК Размещено
	               |ПОМЕСТИТЬ ВТ_Размещено
	               |ИЗ
	               |	РегистрНакопления.ОстаткиТоваровОрдерныйСклад КАК ОстаткиТоваровОрдерныйСклад
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Документ.Корректировка КАК Корректировка
	               |		ПО ОстаткиТоваровОрдерныйСклад.Регистратор = Корректировка.ДокументОснование
	               |			И (Корректировка.Проведен)
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ПоступлениеТоваров КАК ПоступлениеТоваров
	               |		ПО ОстаткиТоваровОрдерныйСклад.Регистратор.ДокументОснование = ПоступлениеТоваров.Ссылка
	               |			И (ОстаткиТоваровОрдерныйСклад.Регистратор ССЫЛКА Документ.ПриходныйСкладскойОрдер)
	               |			И (ОстаткиТоваровОрдерныйСклад.СкладКомпании = &СкладКомпании)
	               |ГДЕ
	               |	Корректировка.Ссылка ЕСТЬ NULL 
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ПоступлениеТоваров.Ссылка,
	               |	ОстаткиТоваровОрдерныйСклад.Номенклатура,
	               |	ВЫРАЗИТЬ(ВЫРАЗИТЬ(ОстаткиТоваровОрдерныйСклад.Регистратор КАК Документ.ПриходныйСкладскойОрдер).ДокументОснование КАК Документ.ПоступлениеТоваров)
	               |
	               |ИНДЕКСИРОВАТЬ ПО
	               |	Документ
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ПоступленияПодготовка.Документ,
	               |	ПоступленияПодготовка.Номенклатура,
	               |	СУММА(ПоступленияПодготовка.Поступило) КАК Поступило
	               |ПОМЕСТИТЬ ВТ_Поступления
	               |ИЗ
	               |	(ВЫБРАТЬ
	               |		ВЫРАЗИТЬ(ОстаткиТоваровКомпании.Регистратор КАК Документ.ПоступлениеТоваров) КАК Документ,
	               |		ОстаткиТоваровКомпании.Номенклатура КАК Номенклатура,
	               |		ОстаткиТоваровКомпании.Количество КАК Поступило
	               |	ИЗ
	               |		РегистрНакопления.ОстаткиТоваровКомпании КАК ОстаткиТоваровКомпании
	               |			ЛЕВОЕ СОЕДИНЕНИЕ Документ.Корректировка КАК Корректировка
	               |			ПО ОстаткиТоваровКомпании.Регистратор = Корректировка.ДокументОснование
	               |				И (Корректировка.Проведен)
	               |	ГДЕ
	               |		ОстаткиТоваровКомпании.СкладКомпании = &СкладКомпании
	               |		И ОстаткиТоваровКомпании.Регистратор ССЫЛКА Документ.ПоступлениеТоваров
	               |		И Корректировка.Ссылка ЕСТЬ NULL 
	               |	
	               |	ОБЪЕДИНИТЬ ВСЕ
	               |	
	               |	ВЫБРАТЬ
	               |		ВЫРАЗИТЬ(ОстаткиТоваровКомпании.Регистратор КАК Документ.КорректировкаПоступления).ДокументОснование,
	               |		ОстаткиТоваровКомпании.Номенклатура,
	               |		ОстаткиТоваровКомпании.Количество
	               |	ИЗ
	               |		РегистрНакопления.ОстаткиТоваровКомпании КАК ОстаткиТоваровКомпании
	               |			ЛЕВОЕ СОЕДИНЕНИЕ Документ.Корректировка КАК Корректировка
	               |			ПО ОстаткиТоваровКомпании.Регистратор = Корректировка.ДокументОснование
	               |				И (Корректировка.Проведен)
	               |	ГДЕ
	               |		ОстаткиТоваровКомпании.СкладКомпании = &СкладКомпании
	               |		И Корректировка.Ссылка ЕСТЬ NULL 
	               |		И ОстаткиТоваровКомпании.Регистратор ССЫЛКА Документ.КорректировкаПоступления) КАК ПоступленияПодготовка
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ПоступленияПодготовка.Документ,
	               |	ПоступленияПодготовка.Номенклатура
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ЕСТЬNULL(ВТ_Поступления.Документ, ВТ_Размещено.Документ) КАК Документ,
				   |	ЕСТЬNULL(ВТ_Поступления.Документ.Номер, ВТ_Размещено.Документ.Номер) КАК Номер,
	               |	СУММА(ЕСТЬNULL(ВТ_Поступления.Поступило, 0) - ЕСТЬNULL(ВТ_Размещено.Размещено, 0)) КАК Количество
	               |ИЗ
	               |	ВТ_Поступления КАК ВТ_Поступления
	               |		ПОЛНОЕ СОЕДИНЕНИЕ ВТ_Размещено КАК ВТ_Размещено
	               |		ПО ВТ_Поступления.Документ = ВТ_Размещено.Документ
	               |			И ВТ_Поступления.Номенклатура = ВТ_Размещено.Номенклатура
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ЕСТЬNULL(ВТ_Поступления.Документ, ВТ_Размещено.Документ),
				   |    ЕСТЬNULL(ВТ_Поступления.Документ.Номер, ВТ_Размещено.Документ.Номер)";
	
	СписокДокументовТЗ = Запрос.Выполнить().Выгрузить();	
	
	ДокументыМасс = СписокДокументовТЗ.ВыгрузитьКолонку("Документ");
	
	// Подменяем док. корректировок на поступления
	
	ПоступленияКорректировки = Новый Соответствие;
	
	Для каждого Док Из ДокументыМасс Цикл
	
		Если ТипЗнч(Док) <> Тип("ДокументСсылка.КорректировкаПоступления") Тогда
			Продолжить;
		КонецЕсли;
		
		тДок = Док;
		Сч = 0;
		Пока ТипЗнч(тДок) <> Тип("ДокументСсылка.ПоступлениеТоваров") Цикл
			тДок = тДок.ДокументОснование;
			
			Сч = Сч + 1;
			Если Сч > 50 Тогда // Предполагаем, что больше 50ти корректировок не может быть
				Прервать;
			КонецЕсли;
		КонецЦикла;
		
		ПоступленияКорректировки.Вставить(Док, тДок);
		
	КонецЦикла;
	
	Для каждого КлючЗначение Из ПоступленияКорректировки Цикл
		
		Отбор = Новый Структура("Документ", КлючЗначение.Ключ);
		
		Для каждого стр Из СписокДокументовТЗ.НайтиСтроки(Отбор) Цикл
			стр.Документ = КлючЗначение.Значение;
		КонецЦикла;	
		
	КонецЦикла;
	
	СписокДокументовТЗ.Свернуть("Документ", "Количество");
	
	// В результате свертки могут появится строки с нулевым или отрицательным количеством
	
	Запрос = Новый Запрос;
	
	Запрос.УстановитьПараметр("СписокДокументовТЗ", СписокДокументовТЗ);

    Запрос.Текст = "ВЫБРАТЬ * ПОМЕСТИТЬ ВТ_СписокДокументов ИЗ &СписокДокументовТЗ КАК СписокДокументовТЗ ГДЕ СписокДокументовТЗ.Количество > 0;
					|ВЫБРАТЬ * ИЗ ВТ_СписокДокументов Упорядочить ПО Документ УБЫВ АВТОУПОРЯДОЧИВАНИЕ";

    СписокДокументов.Загрузить(Запрос.Выполнить().Выгрузить());

КонецПроцедуры

Процедура ОбновитьТоварыРазмещение(ДокПоступление) Экспорт

	Корректировки = ПолучитьКорректировкиПоПоступлению(ДокПоступление);
	
	Запрос = Новый Запрос;
			
	Запрос.УстановитьПараметр("СкладКомпании", СкладКомпании);
	Запрос.УстановитьПараметр("ДокПоступление", ДокПоступление);
	Запрос.УстановитьПараметр("Корректировки", Корректировки);
			
	Запрос.Текст = "ВЫБРАТЬ
	               |	ПоступлениеТоваров.Ссылка КАК Документ,
	               |	ОстаткиТоваровОрдерныйСклад.Номенклатура,
	               |	СУММА(ОстаткиТоваровОрдерныйСклад.Количество) КАК Размещено
	               |ПОМЕСТИТЬ ВТ_Размещено
	               |ИЗ
	               |	РегистрНакопления.ОстаткиТоваровОрдерныйСклад КАК ОстаткиТоваровОрдерныйСклад
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Документ.Корректировка КАК Корректировка
	               |		ПО ОстаткиТоваровОрдерныйСклад.Регистратор = Корректировка.ДокументОснование
	               |			И (Корректировка.Проведен)
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ПоступлениеТоваров КАК ПоступлениеТоваров
	               |		ПО ОстаткиТоваровОрдерныйСклад.Регистратор.ДокументОснование = ПоступлениеТоваров.Ссылка
	               |			И (ОстаткиТоваровОрдерныйСклад.Регистратор ССЫЛКА Документ.ПриходныйСкладскойОрдер)
	               |			И (ОстаткиТоваровОрдерныйСклад.СкладКомпании = &СкладКомпании)
	               |			И (ПоступлениеТоваров.Ссылка = &ДокПоступление)
	               |ГДЕ
	               |	Корректировка.Ссылка ЕСТЬ NULL 
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ОстаткиТоваровОрдерныйСклад.Номенклатура,
	               |	ПоступлениеТоваров.Ссылка
	               |
	               |ИНДЕКСИРОВАТЬ ПО
	               |	Документ
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ПоступленияПодготовка.Документ,
	               |	ПоступленияПодготовка.Номенклатура,
	               |	СУММА(ПоступленияПодготовка.Поступило) КАК Поступило
	               |ПОМЕСТИТЬ ВТ_Поступления
	               |ИЗ
	               |	(ВЫБРАТЬ
	               |		ВЫРАЗИТЬ(&ДокПоступление КАК Документ.ПоступлениеТоваров) КАК Документ,
	               |		ОстаткиТоваровКомпании.Номенклатура КАК Номенклатура,
	               |		ОстаткиТоваровКомпании.Количество КАК Поступило
	               |	ИЗ
	               |		РегистрНакопления.ОстаткиТоваровКомпании КАК ОстаткиТоваровКомпании
	               |			ЛЕВОЕ СОЕДИНЕНИЕ Документ.Корректировка КАК Корректировка
	               |			ПО ОстаткиТоваровКомпании.Регистратор = Корректировка.ДокументОснование
	               |				И (Корректировка.Проведен)
	               |	ГДЕ
	               |		ОстаткиТоваровКомпании.СкладКомпании = &СкладКомпании
	               |		И Корректировка.Ссылка ЕСТЬ NULL 
	               |		И ОстаткиТоваровКомпании.Регистратор = &ДокПоступление
	               |	
	               |	ОБЪЕДИНИТЬ ВСЕ
	               |	
	               |	ВЫБРАТЬ
	               |		ВЫРАЗИТЬ(&ДокПоступление КАК Документ.ПоступлениеТоваров),
	               |		ОстаткиТоваровКомпании.Номенклатура,
	               |		ОстаткиТоваровКомпании.Количество
	               |	ИЗ
	               |		РегистрНакопления.ОстаткиТоваровКомпании КАК ОстаткиТоваровКомпании
	               |			ЛЕВОЕ СОЕДИНЕНИЕ Документ.Корректировка КАК Корректировка
	               |			ПО ОстаткиТоваровКомпании.Регистратор = Корректировка.ДокументОснование
	               |				И (Корректировка.Проведен)
	               |	ГДЕ
	               |		ОстаткиТоваровКомпании.СкладКомпании = &СкладКомпании
	               |		И Корректировка.Ссылка ЕСТЬ NULL 
	               |		И ОстаткиТоваровКомпании.Регистратор В(&Корректировки)) КАК ПоступленияПодготовка
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ПоступленияПодготовка.Документ,
	               |	ПоступленияПодготовка.Номенклатура
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВТ_Поступления.Документ КАК Документ,
	               |	ВТ_Поступления.Номенклатура КАК Номенклатура,
	               |	ВТ_Поступления.Номенклатура.ОсновнаяЕдиницаИзмерения.Коэффициент КАК Коэффициент,
	               |	ВТ_Поступления.Поступило - ЕСТЬNULL(ВТ_Размещено.Размещено, 0) КАК КоличествоБазовое,
	               |	ВЫБОР
	               |		КОГДА ВТ_Поступления.Номенклатура.ОсновнаяЕдиницаИзмерения.Коэффициент ЕСТЬ NULL 
	               |			ТОГДА 0
	               |		ИНАЧЕ (ВТ_Поступления.Поступило - ЕСТЬNULL(ВТ_Размещено.Размещено, 0)) / ВТ_Поступления.Номенклатура.ОсновнаяЕдиницаИзмерения.Коэффициент
	               |	КОНЕЦ КАК Количество,
	               |	ВЫБОР
	               |		КОГДА ВТ_Поступления.Номенклатура.ОсновнаяЕдиницаИзмерения.Коэффициент ЕСТЬ NULL 
	               |			ТОГДА 0
	               |		ИНАЧЕ (ВТ_Поступления.Поступило - ЕСТЬNULL(ВТ_Размещено.Размещено, 0)) / ВТ_Поступления.Номенклатура.ОсновнаяЕдиницаИзмерения.Коэффициент
	               |	КОНЕЦ КАК КоличествоОбщ,
	               |	ВТ_Поступления.Номенклатура.Артикул КАК Артикул,
	               |	ИСТИНА КАК Выбран
	               |ИЗ
	               |	ВТ_Поступления КАК ВТ_Поступления
	               |		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Размещено КАК ВТ_Размещено
	               |		ПО ВТ_Поступления.Документ = ВТ_Размещено.Документ
	               |			И ВТ_Поступления.Номенклатура = ВТ_Размещено.Номенклатура
	               |ГДЕ
	               |	ЕСТЬNULL(ВТ_Поступления.Поступило, 0) > ЕСТЬNULL(ВТ_Размещено.Размещено, 0)
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	Номенклатура
	               |АВТОУПОРЯДОЧИВАНИЕ";
	
	Товары.Загрузить(Запрос.Выполнить().Выгрузить());
	
КонецПроцедуры

Процедура РаспределитьПоЯчейкамРасход() Экспорт

	Запрос = Новый Запрос;
	
	Товары.Свернуть("Артикул, Коэффициент, Номенклатура, Документ, ЗаказНаряд, Статус, Выбран, КоличествоОбщ", "Количество, КоличествоБазовое");
	
	Запрос.УстановитьПараметр("СписокНоменклатуры", Товары.ВыгрузитьКолонку("Номенклатура"));
	Запрос.УстановитьПараметр("СкладКомпании", СкладКомпании);
			
	Запрос.Текст = "ВЫБРАТЬ
	               |	ОстаткиТоваровОрдерныйСкладОбороты.Номенклатура КАК Номенклатура,
	               |	ВЫРАЗИТЬ(ОстаткиТоваровОрдерныйСкладОбороты.Регистратор КАК Документ.РасходныйСкладскойОрдер) КАК Регистратор
	               |ПОМЕСТИТЬ ВТ_РасходЯчейкаПодготовка
	               |ИЗ
	               |	РегистрНакопления.ОстаткиТоваровОрдерныйСклад.Обороты(
	               |			,
	               |			,
	               |			Регистратор,
	               |			СкладКомпании = &СкладКомпании
	               |				И Номенклатура В (&СписокНоменклатуры)) КАК ОстаткиТоваровОрдерныйСкладОбороты
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Документ.Корректировка КАК Корректировка
	               |		ПО ОстаткиТоваровОрдерныйСкладОбороты.Регистратор = Корректировка.ДокументОснование
	               |			И (Корректировка.Проведен)
	               |ГДЕ
	               |	ОстаткиТоваровОрдерныйСкладОбороты.КоличествоРасход > 0
	               |	И ОстаткиТоваровОрдерныйСкладОбороты.Регистратор ССЫЛКА Документ.РасходныйСкладскойОрдер
	               |	И Корректировка.Ссылка ЕСТЬ NULL 
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ОстаткиТоваровОрдерныйСкладОбороты.Номенклатура,
	               |	ОстаткиТоваровОрдерныйСкладОбороты.Регистратор
	               |
	               |ИНДЕКСИРОВАТЬ ПО
	               |	Номенклатура
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВТ_РасходЯчейкаПодготовка.Номенклатура,
	               |	ВТ_РасходЯчейкаПодготовка.Регистратор,
	               |	СУММА(ВЫБОР
	               |			КОГДА ВТ_РасходЯчейкаПодготовкаДО.Номенклатура ЕСТЬ NULL 
	               |				ТОГДА 0
	               |			ИНАЧЕ 1
	               |		КОНЕЦ) КАК КолвоДО
	               |ПОМЕСТИТЬ ВТ_РасходЯчейкаПодготовка2
	               |ИЗ
	               |	ВТ_РасходЯчейкаПодготовка КАК ВТ_РасходЯчейкаПодготовка
	               |		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_РасходЯчейкаПодготовка КАК ВТ_РасходЯчейкаПодготовкаДО
	               |		ПО ВТ_РасходЯчейкаПодготовка.Номенклатура = ВТ_РасходЯчейкаПодготовкаДО.Номенклатура
	               |			И ВТ_РасходЯчейкаПодготовка.Регистратор.МоментВремени > ВТ_РасходЯчейкаПодготовкаДО.Регистратор.МоментВремени
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ВТ_РасходЯчейкаПодготовка.Номенклатура,
	               |	ВТ_РасходЯчейкаПодготовка.Регистратор
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВТ_РасходЯчейкаПодготовка2.Номенклатура КАК Номенклатура,
	               |	ОстаткиТоваровОрдерныйСклад.Ячейка КАК Ячейка
	               |ИЗ
	               |	ВТ_РасходЯчейкаПодготовка2 КАК ВТ_РасходЯчейкаПодготовка2
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	               |			ВТ_РасходЯчейкаПодготовка2.Номенклатура КАК Номенклатура,
	               |			МАКСИМУМ(ВТ_РасходЯчейкаПодготовка2.КолвоДО) КАК КолвоДО
	               |		ИЗ
	               |			ВТ_РасходЯчейкаПодготовка2 КАК ВТ_РасходЯчейкаПодготовка2
	               |		
	               |		СГРУППИРОВАТЬ ПО
	               |			ВТ_РасходЯчейкаПодготовка2.Номенклатура) КАК ВложенныйЗапрос
	               |		ПО ВТ_РасходЯчейкаПодготовка2.Номенклатура = ВложенныйЗапрос.Номенклатура
	               |			И ВТ_РасходЯчейкаПодготовка2.КолвоДО = ВложенныйЗапрос.КолвоДО
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.ОстаткиТоваровОрдерныйСклад КАК ОстаткиТоваровОрдерныйСклад
	               |		ПО ВТ_РасходЯчейкаПодготовка2.Регистратор = ОстаткиТоваровОрдерныйСклад.Регистратор
	               |			И ВТ_РасходЯчейкаПодготовка2.Номенклатура = ОстаткиТоваровОрдерныйСклад.Номенклатура
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ВТ_РасходЯчейкаПодготовка2.Номенклатура,
	               |	ОстаткиТоваровОрдерныйСклад.Ячейка
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ОстаткиТоваровОрдерныйСкладОстатки.Номенклатура,
	               |	ОстаткиТоваровОрдерныйСкладОстатки.Ячейка,
	               |	ОстаткиТоваровОрдерныйСкладОстатки.КоличествоОстаток КАК Остаток
	               |ИЗ
	               |	РегистрНакопления.ОстаткиТоваровОрдерныйСклад.Остатки(
	               |			,
	               |			СкладКомпании = &СкладКомпании
	               |				И Номенклатура В (&СписокНоменклатуры)) КАК ОстаткиТоваровОрдерныйСкладОстатки
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	Остаток УБЫВ";
	
	Результат = Запрос.ВыполнитьПакет();
	
	ПриоритетныеЯчейки = Результат[2].Выгрузить();
	ТаблицаЯчейки = Результат[3].Выгрузить();
	
	Для Сч=0 По Товары.Количество()-1 Цикл
		
		СтрокаТовары = Товары[Сч];
		
		ОтборНоменклатура = Новый Структура("Номенклатура", СтрокаТовары.Номенклатура);
		
		Если ТаблицаЯчейки.НайтиСтроки(ОтборНоменклатура).Количество() > 0 Тогда
			
			РедактируемаяСтрока = СтрокаТовары;
			
			ОсталосьРаспределить = РедактируемаяСтрока.КоличествоБазовое;
			
			// Сначала распределяем по приоритетным ячейкам
			
			Найдено = ПриоритетныеЯчейки.НайтиСтроки(ОтборНоменклатура);
			
			Для каждого стрПрЯчейка Из Найдено Цикл
				
				Если ОсталосьРаспределить <= 0 Тогда
					Прервать;
				КонецЕсли;
				
				стрОст = ТаблицаЯчейки.НайтиСтроки(Новый Структура("Номенклатура, Ячейка", СтрокаТовары.Номенклатура, стрПрЯчейка.Ячейка));
				
				Если стрОст.Количество() > 0 Тогда
					Если стрОст[0].Остаток >= ОсталосьРаспределить Тогда
						// ОК
						ОсталосьРаспределить = 0;
						РедактируемаяСтрока.ЯчейкаХранения = стрОст[0].Ячейка;
					Иначе
						// Разбиваем строку
						
						ОсталосьРаспределить = ОсталосьРаспределить - стрОст[0].Остаток;
						
						РедактируемаяСтрока.ЯчейкаХранения = стрОст[0].Ячейка;
						РедактируемаяСтрока.КоличествоБазовое = стрОст[0].Остаток;
						
						НС = Товары.Добавить();
						ЗаполнитьЗначенияСвойств(НС, РедактируемаяСтрока,, "Количество, КоличествоБазовое, ЯчейкаХранения");
						
						НС.КоличествоБазовое = ОсталосьРаспределить;
						
						РедактируемаяСтрока = НС;
					КонецЕсли;
				КонецЕсли;
			КонецЦикла;
			
			Если ОсталосьРаспределить <= 0 Тогда
				Продолжить;
			КонецЕсли;
			
			// Распределение по остальным ячейкам
			
			Для каждого стрОстаткиЯчейка Из ТаблицаЯчейки.НайтиСтроки(ОтборНоменклатура) Цикл
				
				Если ОсталосьРаспределить <= 0 Тогда
					Прервать;
				КонецЕсли;
				
				Отбор = Новый Структура("Номенклатура, Ячейка", РедактируемаяСтрока.Номенклатура, стрОстаткиЯчейка.Ячейка);
				Если ПриоритетныеЯчейки.НайтиСтроки(Отбор).Количество() > 0 Тогда
					Продолжить; // распределено выше
				КонецЕсли;
				
				Если стрОстаткиЯчейка.Остаток >= ОсталосьРаспределить Тогда
					// ОК
					ОсталосьРаспределить = 0;
					РедактируемаяСтрока.ЯчейкаХранения = стрОстаткиЯчейка.Ячейка;
				Иначе
					// Разбиваем строку
					
					ОсталосьРаспределить = ОсталосьРаспределить - стрОстаткиЯчейка.Остаток;
					
					РедактируемаяСтрока.ЯчейкаХранения = стрОстаткиЯчейка.Ячейка;
					РедактируемаяСтрока.КоличествоБазовое = стрОстаткиЯчейка.Остаток;
					
					НС = Товары.Добавить();
					ЗаполнитьЗначенияСвойств(НС, РедактируемаяСтрока,, "Количество, КоличествоБазовое, ЯчейкаХранения");
					
					НС.КоличествоБазовое = ОсталосьРаспределить;
					
					РедактируемаяСтрока = НС;
				КонецЕсли;
			
			КонецЦикла;
			
		КонецЕсли;	
	КонецЦикла;
	
	Товары.Сортировать("Номенклатура");
	
	// Заполняем количество
	Для каждого СтрокаТовары Из Товары Цикл
		СтрокаТовары.Количество = ?(СтрокаТовары.Коэффициент = 0, 0, СтрокаТовары.КоличествоБазовое / СтрокаТовары.Коэффициент);
	КонецЦикла;

КонецПроцедуры

Процедура РаспределитьПоЯчейкамПриход() Экспорт

	// Заполняем ячейками, в которые последний раз ложили
	
	Запрос = Новый Запрос;

	Запрос.УстановитьПараметр("Товары", Товары.Выгрузить());
	Запрос.УстановитьПараметр("СкладКомпании", СкладКомпании);

	Запрос.Текст = "ВЫБРАТЬ
	               |	*
	               |ПОМЕСТИТЬ ВТ_Товары
	               |ИЗ
	               |	&Товары КАК Товары
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ОстаткиТоваровОрдерныйСкладОбороты.Номенклатура КАК Номенклатура,
	               |	ВЫРАЗИТЬ(ОстаткиТоваровОрдерныйСкладОбороты.Регистратор КАК Документ.ПриходныйСкладскойОрдер) КАК Регистратор
	               |ПОМЕСТИТЬ ВТ_РасходЯчейкаПодготовка
	               |ИЗ
	               |	РегистрНакопления.ОстаткиТоваровОрдерныйСклад.Обороты(
	               |			,
	               |			,
	               |			Регистратор,
	               |			СкладКомпании = &СкладКомпании
	               |				И Номенклатура В
	               |					(ВЫБРАТЬ
	               |						ВТ_Товары.Номенклатура
	               |					ИЗ
	               |						ВТ_Товары КАК ВТ_Товары)) КАК ОстаткиТоваровОрдерныйСкладОбороты
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Документ.Корректировка КАК Корректировка
	               |		ПО ОстаткиТоваровОрдерныйСкладОбороты.Регистратор = Корректировка.ДокументОснование
	               |			И (Корректировка.Проведен)
	               |ГДЕ
	               |	ОстаткиТоваровОрдерныйСкладОбороты.КоличествоПриход > 0
	               |	И ОстаткиТоваровОрдерныйСкладОбороты.Регистратор ССЫЛКА Документ.ПриходныйСкладскойОрдер
	               |	И Корректировка.Ссылка ЕСТЬ NULL 
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ОстаткиТоваровОрдерныйСкладОбороты.Номенклатура,
	               |	ОстаткиТоваровОрдерныйСкладОбороты.Регистратор
	               |
	               |ИНДЕКСИРОВАТЬ ПО
	               |	Номенклатура
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВТ_РасходЯчейкаПодготовка.Номенклатура,
	               |	ВТ_РасходЯчейкаПодготовка.Регистратор,
	               |	СУММА(ВЫБОР
	               |			КОГДА ВТ_РасходЯчейкаПодготовкаДО.Номенклатура ЕСТЬ NULL 
	               |				ТОГДА 0
	               |			ИНАЧЕ 1
	               |		КОНЕЦ) КАК КолвоДО
	               |ПОМЕСТИТЬ ВТ_РасходЯчейкаПодготовка2
	               |ИЗ
	               |	ВТ_РасходЯчейкаПодготовка КАК ВТ_РасходЯчейкаПодготовка
	               |		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_РасходЯчейкаПодготовка КАК ВТ_РасходЯчейкаПодготовкаДО
	               |		ПО ВТ_РасходЯчейкаПодготовка.Номенклатура = ВТ_РасходЯчейкаПодготовкаДО.Номенклатура
	               |			И ВТ_РасходЯчейкаПодготовка.Регистратор.МоментВремени > ВТ_РасходЯчейкаПодготовкаДО.Регистратор.МоментВремени
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ВТ_РасходЯчейкаПодготовка.Номенклатура,
	               |	ВТ_РасходЯчейкаПодготовка.Регистратор
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВТ_РасходЯчейкаПодготовка2.Номенклатура КАК Номенклатура,
	               |	МАКСИМУМ(ОстаткиТоваровОрдерныйСклад.Ячейка) КАК ЯчейкаРазмещение
	               |ПОМЕСТИТЬ ВТ_ЯчейкиРазмещение
	               |ИЗ
	               |	ВТ_РасходЯчейкаПодготовка2 КАК ВТ_РасходЯчейкаПодготовка2
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	               |			ВТ_РасходЯчейкаПодготовка2.Номенклатура КАК Номенклатура,
	               |			МАКСИМУМ(ВТ_РасходЯчейкаПодготовка2.КолвоДО) КАК КолвоДО
	               |		ИЗ
	               |			ВТ_РасходЯчейкаПодготовка2 КАК ВТ_РасходЯчейкаПодготовка2
	               |		
	               |		СГРУППИРОВАТЬ ПО
	               |			ВТ_РасходЯчейкаПодготовка2.Номенклатура) КАК ВложенныйЗапрос
	               |		ПО ВТ_РасходЯчейкаПодготовка2.Номенклатура = ВложенныйЗапрос.Номенклатура
	               |			И ВТ_РасходЯчейкаПодготовка2.КолвоДО = ВложенныйЗапрос.КолвоДО
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.ОстаткиТоваровОрдерныйСклад КАК ОстаткиТоваровОрдерныйСклад
	               |		ПО ВТ_РасходЯчейкаПодготовка2.Регистратор = ОстаткиТоваровОрдерныйСклад.Регистратор
	               |			И ВТ_РасходЯчейкаПодготовка2.Номенклатура = ОстаткиТоваровОрдерныйСклад.Номенклатура
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ВТ_РасходЯчейкаПодготовка2.Номенклатура
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	*
	               |ИЗ
	               |	ВТ_Товары КАК ВТ_Товары
	               |		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ЯчейкиРазмещение КАК ВТ_ЯчейкиРазмещение
	               |		ПО ВТ_Товары.Номенклатура = ВТ_ЯчейкиРазмещение.Номенклатура";
	
	ТоварыНовый = Запрос.Выполнить().Выгрузить();	
	
	ТоварыНовый.Колонки.Удалить("ЯчейкаХранения");
	
	КолЯч = ТоварыНовый.Колонки.Найти("ЯчейкаРазмещение");
	КолЯч.Имя = "ЯчейкаХранения";
	
	Товары.Загрузить(ТоварыНовый);
	
КонецПроцедуры

Функция ПолучитьКорректировкиПоПоступлению(ДокПоступление) Экспорт

	ВозвращаемоеЗначение = Новый Массив;
	
	тДок = ДокПоступление;
	Пока Истина Цикл
	
		ДокКорр = Документы.КорректировкаПоступления.НайтиПоРеквизиту("ДокументОснование", тДок);
		
		Если ДокКорр.Пустая() Тогда
			Прервать;
		Иначе	
			ВозвращаемоеЗначение.Добавить(ДокКорр);
		КонецЕсли;
		
		тДок = ДокКорр;
		
	КонецЦикла;

	Возврат ВозвращаемоеЗначение;
	
КонецФункции // ПолучитьКорректировкиПоПоступлению()


////////////////////////////////////////////////////////////////////////////////
// ИСПОЛНЯЕМАЯ ЧАСТЬ МОДУЛЯ

АвтоПечатьПикингЛиста =  Не ПараметрыСеанса.Renault_ПраваПользователя.АРМ_Кладовщика_НеПечатьПЛАвтоматически;
