////////////////////////////////////////////////////////////////////////////////
// ПЕРЕМЕННЫЕ ОБЪЕКТА

Перем Права Экспорт;				// Переменная объекта - ссылка на коллекцию прав, настроек и переменных окружения
Перем РезультатОбработки Экспорт;	// Переменная для накопления результатов проведения по модулям наборов записей
Перем Режим;						// режим

////////////////////////////////////////////////////////////////////////////////
// ЭКСПОРТНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ ДОПОЛНИТЕЛЬНЫХ МЕТОДОВ ОБЪЕКТА

// Возвращает структуру обязательных / уникальных реквизитов документа
// Возвращаемая структура содержит строковые идентификаторы реквизитов или вложенные структуры для табличных частей
// Для реквизита значение структуры содержит число 1-Обязательный, 2-Уникальный, 3-Уникальный и обязательный
Функция ПолучитьОбязательныеРеквизиты() Экспорт
	// Обязательные реквизиты документа
	// Обязательные поля таблицы товаров
	ОбязательныеСотрудники=Новый Структура();
	ОбязательныеСотрудники.Вставить("Сотрудник",3);
	ОбязательныеСотрудники.Вставить("Дата",3);
	
	
	ОбязательныеРеквизиты=Новый Структура();
	ОбязательныеРеквизиты.Вставить("Организация",1);
	ОбязательныеРеквизиты.Вставить("ПодразделениеКомпании",1);
	ОбязательныеРеквизиты.Вставить("Автор",1);
	ОбязательныеРеквизиты.Вставить("ДатаТабеля",1);
	ОбязательныеРеквизиты.Вставить("Сотрудники",ОбязательныеСотрудники);
	
	Возврат ОбязательныеРеквизиты;
КонецФункции

// Проверяет корректность заполнения объекта.
// Возвращает Истина если все заполнено корректно и Ложь иначе.
// В случае некорректного заполнения формирует строку описанием возникших ошибок "Ошибки"
// На вход может быть передана структура ДопРеквизиты с дополнительными реквизитами для проверки
// может управляться булевыми флагами выполняемых проверок Заполнение, Уникальность
// (могут быть и другие необязательные)
// Обычно выполняется универсальным обработчиком, но могут быть добавлены доп. проверки
Функция ПроверитьКорректность(Ошибки="", ДопРеквизиты=Неопределено, Заполнение=Истина, Уникальность=Истина) Экспорт
	// Здесь могут быть определены дополнительные к стандартным обязательным реквизитам условия проверки
	Результат = Истина;
	Результат = дкПроверитьКорректность(ЭтотОбъект, Ошибки, ДопРеквизиты, Заполнение, Уникальность);
	// Запретим наличие более одного документа в разрезе Период-Подразделение
	Запрос = Новый Запрос("ВЫБРАТЬ
	|	Табель.Ссылка
	|ИЗ
	|	(ВЫБРАТЬ
	|		ТабельПоУРВ.Ссылка КАК Ссылка,
	|		НАЧАЛОПЕРИОДА(ТабельПоУРВ.ДатаТабеля, ДЕНЬ) КАК ДатаТабеля
	|	ИЗ
	|		Документ.ТабельПоУРВ КАК ТабельПоУРВ
	|	ГДЕ
	|		ТабельПоУРВ.ПодразделениеКомпании = &Подразделение
	|		И ТабельПоУРВ.Ссылка <> &ЭтотДокумент) КАК Табель
	|ГДЕ
	|	Табель.ДатаТабеля = НАЧАЛОПЕРИОДА(&ДатаТабеля, ДЕНЬ)");
	Запрос.УстановитьПараметр("ДатаТабеля", ДатаТабеля);
	Запрос.УстановитьПараметр("Подразделение", ПодразделениеКомпании);
	Запрос.УстановитьПараметр("ЭтотДокумент", ЭтотОбъект.Ссылка);
	ВыборкаДокументов = Запрос.Выполнить().Выбрать();
	
	Если ВыборкаДокументов.Следующий() Тогда
		дкДобавитьОшибку(Ошибки,"Дублирование документов по Периоду и Подразделению!. Существует документ <" + ВыборкаДокументов.Ссылка+ ">!");
		Результат = Ложь;
	КонецЕсли;           
	Возврат Результат;
КонецФункции
 
// Функция проверяет, допустимо ли изменение объекта
// Возвращает Истина, если изменения возможны, ложь иначе
// Если изменения доступны частично, возвращает ложь и структуру блокируемых на изменение реквизитов,
Функция ДоступностьИзменения(БлокироватьРеквизиты=Неопределено) Экспорт
    // Здесь может быть прописано определение наличия ссылок, блокирующих изменение объекта
	Возврат Истина;
КонецФункции

// Возвращает список возможных хозяйственных операций документа
// Возвращаемое значение: СписокЗначений. 
// Строка списка: Значение - имя предопределенного элемента; 
//				  Представление - красивое его представление
// 				  "Помеченная" строка - ХО по умолчанию.
Функция ПолучитьСписокХозОпераций() Экспорт
	СписокХозОпераций = Новый СписокЗначений;
	СписокХозОпераций.Добавить("ТабельПоУРВ","Табель по УРВ", Истина);
	Возврат СписокХозОпераций;
КонецФункции

// Обработка изменения реквизитов документа
// Параметры
//  Имя			– Строка – Имя реквизита документа с полным путем (например Товары.Номенклатура).
//  ЭтаФорма	– Форма	 – Ссылка на форму документа. Если значение неопределено,
//                         производится программная обработка реквизитов.
//  ТекСтрока	– СтрокаТабличнойЧасти – Ссылка на строку табличной части документа, реквизит которой обрабатывается.
//										 Имеет смысл только для табличных частей документов.
//  ДопПараметры– Структура			– Структура, содержащая дополнительные параметры обработки реквизита.
// Возвращаемое значение:
//   Булево   – Результат выполнения обработки.
Функция ОбработкаРеквизита(Имя,ТекСтрока=Неопределено,ЭтаФорма=Неопределено,ДопПараметры=Неопределено) Экспорт
	// ОБРАБОТКА РЕКВИЗИТОВ ОБЪЕКТА
	//Если Имя = "Сотрудник" Тогда
	//	Если НЕ ТекСтрока.Сотрудник.Пустая() Тогда
	//		ТекСтрока.ПродолжительностьСмены = 0;				
	//		ТекСтрока.ПричинаОтсутствия = Перечисления.УРВ_ПричиныОтсутствияНаРабочемМесте.ПустаяСсылка();
	//		ТекСтрока.НочнаяСмена = Ложь;
	//	КонецЕсли;
	//	Рез = Истина;
	//	Возврат Рез;
	//ИначеЕсли Имя = "ПродолжительностьСмены" Тогда
	//	Если ТекСтрока.ПродолжительностьСмены <> 0 Тогда
	//		ТекСтрока.ПричинаОтсутствия = Перечисления.УРВ_ПричиныОтсутствияНаРабочемМесте.ПустаяСсылка();	
	//	Иначе
	//		ТекСтрока.НочнаяСмена = Ложь;	
	//	КонецЕсли;
	//	Рез = Истина;
	//	Возврат Рез;
	//ИначеЕсли Имя = "ПричинаОтсутствия" Тогда
	//	Если НЕ ТекСтрока.ПричинаОтсутствия.Пустая() Тогда
	//		ТекСтрока.ПродолжительностьСмены = 0;				
	//	Иначе
	//		ТекСтрока.НочнаяСмена = Ложь;	
	//	КонецЕсли;
	//	Рез = Истина;
	//	Возврат Рез;
	//Иначе Возврат дкОбработкаРеквизита(ЭтотОбъект,Имя,ТекСтрока,ЭтаФорма,ДопПараметры);	
	//КонецЕсли;
	
КонецФункции // ОбработкаРеквизита()

//Выполняет проверку налиция табеля на дату
//
// Параметры:
// ВыдаватьПредупреждение	– Булево – Флаг разрешения выдачи предупреждений.
//
// Возвращаемое значение:
// Булево – Результат проверки.
//
Функция НаличиеТабеляЗаЭтотМесяц(ВыдаватьПредупреждение=Истина) Экспорт
	Запрос = Новый Запрос("ВЫБРАТЬ
	|	Табель.Ссылка
	|ИЗ
	|	(ВЫБРАТЬ
	|		ТабельПоУРВ.Ссылка КАК Ссылка,
	|		НАЧАЛОПЕРИОДА(ТабельПоУРВ.ДатаТабеля, ДЕНЬ) КАК ДатаТабеля
	|	ИЗ
	|		Документ.ТабельПоУРВ КАК ТабельПоУРВ
	|	ГДЕ
	|		ТабельПоУРВ.ПодразделениеКомпании = &Подразделение
	|		И ТабельПоУРВ.Ссылка <> &ЭтотДокумент) КАК Табель
	|ГДЕ
	|	Табель.ДатаТабеля = НАЧАЛОПЕРИОДА(&ДатаТабеля, ДЕНЬ)");
	Запрос.УстановитьПараметр("ДатаТабеля", ДатаТабеля);
	Запрос.УстановитьПараметр("Подразделение", ПодразделениеКомпании);
	Запрос.УстановитьПараметр("ЭтотДокумент", ЭтотОбъект.Ссылка);
	ВыборкаДокументов = Запрос.Выполнить().Выбрать();
	
	Если ВыборкаДокументов.Следующий() Тогда
		Если ВыдаватьПредупреждение Тогда
			#Если Клиент Тогда
				Предупреждение("За " + ПолучитьПредставлениеДаты(ДатаТабеля) + " уже введен табель """ + Строка(ВыборкаДокументов.Ссылка) + """!", 15);
			#КонецЕсли
		Иначе
			дкСообщитьРезультат("За " + ПолучитьПредставлениеДаты(ДатаТабеля) + " уже введен табель """ + Строка(ВыборкаДокументов.Ссылка) + """!",,ЭтотОбъект);
		КонецЕсли;
		Возврат Истина;
	КонецЕсли;
	
	Возврат Ложь;
КонецФункции

//Преобразует переданную дату в формат представления
//
// Параметры:
// ДатаДляПреобразования	– Дата – Дата до преобразования.
//
// Возвращаемое значение:
// Строка – Строка, полученная в результате форматирования.
//
Функция ПолучитьПредставлениеДаты(ДатаДляПреобразования) Экспорт
	Возврат Формат(ДатаДляПреобразования, "ДФ='ММММ гггг'");
КонецФункции

#Если Клиент Тогда
////////////////////////////////////////////////////////////////////////////////
// ЭКСПОРТНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ ПЕЧАТИ ДОКУМЕНТА

// Функция проверяет попадание текущей области и области подвала на страницу
//
// Параметры:
// ТабДокумент 			 - табличный документ, в который выводится информация, подготовленная к печати
// Область 				 - текущая или массив текущих областей, предназначенных для вывода в данный момент
// ОбластьШапка 			 - область или массив областей, выступающих в качестве шапки и
// которые будут выводиться на каждой странице
// ОбластьПодвал 			 - область, которая будет выводиться в качестве подвала на каждой странице
// НомерСтраницы 			 - номер печатаемой страницы
// ТекстЗаголовка 			 - текст, выводимый как подпись к шапке очередного листа
// СтруктураИтоговПоСтранице - структура содержащая, накопленные итоги по текущей странице
//					 	 	 значение ключа структуры должно совпадать с идентификатором реквизита табличной части документа
// мсвДопОбластиПодвала  - подвальная часть макета. Проверка попадания последней строки таблицы на страницу
//							общего подвала Если = Неопределено, то проверка не осуществляется
// ВсегоСтраниц 			 - количество страниц выводимой
//
//Возвращаемое значение:
// Число - текущий номер страницы
//
Функция ВывестиГоризонтальнуюОбласть(ТабДокумент, Область, ОбластьШапка = Неопределено, ОбластьПодвал = Неопределено, НомерСтраницы = 1,
	СтруктураИтоговПоСтранице = Неопределено, Права = Неопределено, мсвДопОбластиПодвала = Неопределено)
	
	//Попытка
	//	ПраваПользователя = Права.Права;
	//	ЭтотОбъект = Права;
	//Исключение
	//	ПраваПользователя=Права;
	//	//ЭтотОбъект=Неопределено;
	//КонецПопытки; 
	
	//ИспользоватьРазбиениеНаСтраницы = обПраво("ИспользоватьРазбиениеНаСтраницы", ПраваПользователя,, ЭтотОбъект);	
	////если не разбиваем, выводим и все
	//Если Не ИспользоватьРазбиениеНаСтраницы Тогда
	//	ТабДокумент.Вывести(Область);
	//	Возврат НомерСтраницы;
	//КонецЕсли;
	
	//запишем их в один массив
	МассивОбластейДляПроверки = Новый Массив;
	МассивОбластейДляПроверки.Добавить(Область);
	Если ОбластьПодвал <> Неопределено Тогда
		МассивОбластейДляПроверки.Добавить(ОбластьПодвал);
	КонецЕсли;
	Если мсвДопОбластиПодвала <> Неопределено Тогда
		Для Каждого ТекОбласть Из мсвДопОбластиПодвала Цикл
			МассивОбластейДляПроверки.Добавить(ТекОбласть);
		КонецЦикла;
	КонецЕсли;
	
	Попытка
		//проверим, помещаются ли на странице
		РезультатПроверки = ТабДокумент.ПроверитьВывод(МассивОбластейДляПроверки);		
		//если не помещаются, то ...
		Если НЕ РезультатПроверки Тогда
			// здесь ОбластьПодвал - это подвал с итогами по странице!!!!
			//дкВывестиИтогиПоСтранице(ТабДокумент, ОбластьПодвал, СтруктураИтоговПоСтранице, Права); //выводим итог по странице!!!
			ТабДокумент.ВывестиГоризонтальныйРазделительСтраниц(); //переходим на следующую страницу
			НомерСтраницы = НомерСтраницы + 1;
			Если ОбластьШапка <> Неопределено Тогда
				ТабДокумент.Вывести(ОбластьШапка); //выводим шапку таблицы
			КонецЕсли;
		КонецЕсли;
	Исключение
		Сообщить("Ошибка при проверке вывода документа!", СтатусСообщения.Внимание);
	КонецПопытки;
	
	//выводим текущую область
	ТабДокумент.Вывести(Область);
	
	Возврат НомерСтраницы;
КонецФункции // дкВывестиГоризонтальнуюОбласть()

// Возвращает сформированный табличный документ:
Функция ПечатьВедомостьУРВ(ТабДокумент) Экспорт
	ТаблицаСотрудников = Сотрудники.Выгрузить();
	
	//Бондаренко++ 20251106
	//ТаблицаСотрудников.Свернуть("Сотрудник", "Отработан, ПоПлану, ПродолжительностьГрафик, Продолжительность, Прогул, Опоздал, РаньшеУшел, НеОтметился");
	//ТаблицаСотрудников.Свернуть("Сотрудник", "Отработан, ПоПлану, ПродолжительностьГрафик, Продолжительность, Прогул, Опоздал, РаньшеУшел, НеОтметился,ОтработалПосле19часов");
	ТаблицаСотрудников.Свернуть("Сотрудник", "Отработан, ПоПлану, ПродолжительностьГрафик, Продолжительность, Прогул, Опоздал, РаньшеУшел, НеОтметился,ОтработалПосле19часов,ОтработалПосле20часов");
	//Бондаренко-- 20251106
 	
	Если ТаблицаСотрудников.Количество() = 0 Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	//зададим параметры макета
	ТабДокумент.ПолеСверху = 0;
	ТабДокумент.ПолеСлева  = 0;
	ТабДокумент.ПолеСнизу  = 0;
	ТабДокумент.ПолеСправа = 0;
	ТабДокумент.ТолькоПросмотр = Истина;
	ТабДокумент.ОриентацияСтраницы = ОриентацияСтраницы.Портрет;
	
	Макет = ПолучитьМакет("ВедомостьУРВ");
	
	//Вывод области Договор
	ОбластьШапка = Макет.ПолучитьОбласть("Шапка");
	ЗаМесяц = ПолучитьПредставлениеДаты(ДатаТабеля);
	ОбластьШапка.Параметры.Дата = ЗаМесяц;
	ОбластьШапка.Параметры.Подразделение = "Подразделение компании: " + ПодразделениеКомпании.Наименование;
	ТекстЗаголовка = "Ведомость УРВ по подразделению " + ПодразделениеКомпании.Наименование + " за " + ЗаМесяц;

	ТабДокумент.Вывести(ОбластьШапка);
	ШапкаТаблицы = Макет.ПолучитьОбласть("ШапкаТаблицы");
	ТабДокумент.Вывести(ШапкаТаблицы);	
	
	//заполним параметры шапки таблицы для следующего листа
	НомерСтраницы = 2;
	НомерСтраницыПред = 2;
	ШапкаТаблицы.Параметры.ТекстЗаголовка = ТекстЗаголовка;
	ШапкаТаблицы.Параметры.НомерСтраницы = "Страница: " + НомерСтраницы; 			
		
	СтрокаТаблицы = Макет.ПолучитьОбласть("СтрокаТаблицы");
	Ном	= 0;
	Для каждого СтрокаСотрудник Из ТаблицаСотрудников Цикл
		Ном = Ном + 1;
		СтрокаТаблицы.Параметры.Ном = Ном;
		СтрокаТаблицы.Параметры.Сотрудник = СтрокаСотрудник.Сотрудник.Наименование;
		СтрокаТаблицы.Параметры.ДнейПоГрафику = СтрокаСотрудник.ПоПлану;
		СтрокаТаблицы.Параметры.ДнейФакт = СтрокаСотрудник.Отработан;
		СтрокаТаблицы.Параметры.ЧасовПоГрафику = СтрокаСотрудник.ПродолжительностьГрафик;
		СтрокаТаблицы.Параметры.ЧасовФакт = СтрокаСотрудник.Продолжительность;
		СтрокаТаблицы.Параметры.Прогулов = СтрокаСотрудник.Прогул;
		СтрокаТаблицы.Параметры.Опозданий = СтрокаСотрудник.Опоздал;
		СтрокаТаблицы.Параметры.УходовРаньше = СтрокаСотрудник.РаньшеУшел;
		СтрокаТаблицы.Параметры.БезОтметки = СтрокаСотрудник.НеОтметился;			
		СтрокаТаблицы.Параметры.ОтработалПосле19 = СтрокаСотрудник.ОтработалПосле19часов;
		//Бондаренко++ 20251106
		СтрокаТаблицы.Параметры.ОтработалПосле20 = СтрокаСотрудник.ОтработалПосле20часов;
		//Бондаренко-- 20251106
			
		НомерСтраницы = ВывестиГоризонтальнуюОбласть(ТабДокумент, СтрокаТаблицы, ШапкаТаблицы,, НомерСтраницы,, Права);
		//инициализация итогов по странице
		Если НомерСтраницы <> НомерСтраницыПред Тогда
			НомерСтраницыПред = НомерСтраницы;
			ШапкаТаблицы.Параметры.НомерСтраницы = "Страница: " + НомерСтраницы; 
		КонецЕсли;
	КонецЦикла;
	
	//ТабДокумент.Защита = Истина; // с Защитой не выгружает в Excel и т.д.
	Возврат ТабДокумент;
КонецФункции

// Процедура осуществляет печать документа. Можно направить печать на 
// экран или принтер, а также распечатать необходимое количество копий.
// Параметры: НазваниеМакета - строка, название макета, если пусто - то по умолчанию,
//   Документ - сюда можно передать уже созданный табличный документ для заполнения
Функция Печать(НазваниеПечатнойФормы="", КоличествоЭкземпляров=0, НаПринтер=Ложь, Документ=Неопределено) Экспорт
	// Вызов конкретно печатной формы и печать результата прописано в общем модуле
	// здесь могут быть вставлены дополнительные механизмы
	Возврат дкПечать(ЭтотОбъект, НазваниеПечатнойФормы, КоличествоЭкземпляров, НаПринтер, Документ);
КонецФункции

// Возвращает доступные варианты печати документа
// Возвращаемое значение: Структура, каждая строка которой
// соответствует одному из вариантов печати
// Первый элемент структуры - форма по умолчанию
// вызывается из дкФормаПриОткрытии(ЭтаФорма)!
Функция ПолучитьСписокПечатныхФорм() Экспорт
	СтруктураМакетов=Новый Структура();
	СтруктураМакетов.Вставить("ВедомостьУРВ", "Итоговая ведомость УРВ");
	//Бондаренко++ 20240620
	СтруктураМакетов.Вставить("ВедомостьУчетаПереработокПосле19часов", "Ведомость учета переработок после 19 и после 20 часов");
	//Бондаренко-- 20240620
	Возврат СтруктураМакетов;
КонецФункции

/////////////////////////////////////////////////////////////////////////////////
#КонецЕсли
// Если Клиент Тогда - завершена клиентская часть

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ

Процедура ПриУстановкеНовогоНомера(СтандартнаяОбработка, Префикс)
	Если НЕ дкПриУстановкеНовогоНомера(ЭтотОбъект, СтандартнаяОбработка, Префикс) Тогда Возврат; КонецЕсли;
КонецПроцедуры

// Процедура - обработчик ввода на основании
Процедура ОбработкаЗаполнения(Основание) Экспорт
	Если НЕ дкОбработкаЗаполнения(ЭтотОбъект, Основание) Тогда Возврат; КонецЕсли;
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	Если НЕ дкПриКопировании(ЭтотОбъект, ОбъектКопирования) Тогда Возврат; КонецЕсли;
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	Если НЕ дкПередЗаписью(ЭтотОбъект, Отказ, РежимЗаписи, РежимПроведения) Тогда Возврат; КонецЕсли;
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	Если НЕ дкПриЗаписи(ЭтотОбъект, Отказ) Тогда Возврат; КонецЕсли;
КонецПроцедуры

Процедура ПередУдалением(Отказ)
	Если НЕ дкПередУдалением(ЭтотОбъект, Отказ) Тогда Возврат; КонецЕсли;
КонецПроцедуры

Процедура ОбработкаУдаленияПроведения(Отказ)
	Если НЕ дкОбработкаУдаленияПроведения(ЭтотОбъект, Отказ) Тогда Возврат; КонецЕсли;
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, Режим)
	Если НЕ дкОбработкаПроведения(ЭтотОбъект, Отказ, Режим) Тогда Возврат; КонецЕсли;
		
	НаборТабельноеВремя = Движения.УРВ_ТабельноеВремя;
	Для Каждого стрСотрудники Из Сотрудники Цикл
		НоваяЗапись              = НаборТабельноеВремя.Добавить();
		НоваяЗапись.Регистратор  = Ссылка;
		НоваяЗапись.Период       = стрСотрудники.Дата;
		НоваяЗапись.Сотрудник    = стрСотрудники.Сотрудник;
		Цех = стрСотрудники.Сотрудник.Цех;
		Если Цех.ЦехДляАнализаЭффиктивности = Справочники.Цеха.ПустаяСсылка() Тогда
			НоваяЗапись.Цех = Цех;
		Иначе
			НоваяЗапись.Цех = Цех.ЦехДляАнализаЭффиктивности;
		КонецЕсли;
		НоваяЗапись.ПодразделениеКомпании = ПодразделениеКомпании;
		НоваяЗапись.ВидИнтервала = Справочники.ВидыИнтервалов.Работа;
		НоваяЗапись.Часы         = стрСотрудники.Продолжительность;
	КонецЦикла;
		
	дкВыводРезультатовОбработки(ЭтотОбъект,Отказ);	
КонецПроцедуры // ОбработкаПроведения

// Возвращает сформированный табличный документ:
Функция ПечатьВедомостьУчетаПереработокПосле19часов(ТабДокумент) Экспорт
	
	ТаблицаСотрудников = Сотрудники.Выгрузить();
  	
	//зададим параметры макета
	ТабДокумент.ПолеСверху = 0;
	ТабДокумент.ПолеСлева  = 0;
	ТабДокумент.ПолеСнизу  = 0;
	ТабДокумент.ПолеСправа = 0;
	ТабДокумент.ТолькоПросмотр = Истина;
	ТабДокумент.ОриентацияСтраницы = ОриентацияСтраницы.Портрет;
	
	Макет = ПолучитьМакет("Макет19");
	
	//Вывод области Договор
	ОбластьШапка = Макет.ПолучитьОбласть("Шапка");
	ЗаМесяц = ""+Месяц(ДатаТабеля)+" / "+СтрЗаменить(Год(ДатаТабеля),Символы.НПП,"");
	ОбластьШапка.Параметры.Дата = ЗаМесяц;
	ОбластьШапка.Параметры.Подразделение = "Подразделение компании: " +  ПодразделениеКомпании.Наименование;
	ТекстЗаголовка = "Ведомость переработок после 19 часов по подразделению " + ПодразделениеКомпании.Наименование + " за " + ЗаМесяц;

	ТабДокумент.Вывести(ОбластьШапка);
	ШапкаТаблицы = Макет.ПолучитьОбласть("ШапкаТаблицы");
	ТабДокумент.Вывести(ШапкаТаблицы);	
	
	//заполним параметры шапки таблицы для следующего листа
 	ШапкаТаблицы.Параметры.ТекстЗаголовка = ТекстЗаголовка;
	
	ИтоговаяСтрокаТаблицы = Макет.ПолучитьОбласть("ИтогСотр");
	
	СтрокаТаблицы = Макет.ПолучитьОбласть("СтрокаТаблицы");
	ИтогОтработалПосле19 = 0;
	//Бондаренко++ 20251107
	ИтогОтработалПосле20 = 0;
	//Бондаренко-- 20251107
	Ном	= 0;
	Эталон = "";
	Для каждого СтрокаСотрудник Из ТаблицаСотрудников Цикл
		Если СтрокаСотрудник.КонецРаботы = Дата(1,1,1) Тогда
			Продолжить;
		КонецЕсли;
	  //  Если Не обЗначениеНеЗаполнено(Сотрудник) Тогда
	  //     Если СтрокаСотрудник.Сотрудник <> Сотрудник Тогда
	  //      	Продолжить;
	  //   КонецЕсли;
	  //КонецЕсли;
		Если СтрокаСотрудник.Сотрудник <> Эталон Тогда
			Если Эталон <> "" Тогда
				ИтоговаяСтрокаТаблицы.Параметры.Сотрудник = Эталон.Наименование; 
				ИтоговаяСтрокаТаблицы.Параметры.ИтогОтработалПосле19 = Формат(ИтогОтработалПосле19,"ЧЦ=15; ЧДЦ=2");
				//Бондаренко++ 20251107
				ИтоговаяСтрокаТаблицы.Параметры.ИтогОтработалПосле20 = Формат(ИтогОтработалПосле20,"ЧЦ=15; ЧДЦ=2"); 
				//Бондаренко-- 20251107
				ТабДокумент.Вывести(ИтоговаяСтрокаТаблицы);
				ИтогОтработалПосле19 = 0;
				//Бондаренко++ 20251107
				ИтогОтработалПосле20 = 0;
				//Бондаренко-- 20251107
				Ном = 0;
   			КонецЕсли;
 		КонецЕсли;
		Ном = Ном + 1;
		СтрокаТаблицы.Параметры.Ном = Ном;
		СтрокаТаблицы.Параметры.Сотрудник = СтрокаСотрудник.Сотрудник.Наименование;
		СтрокаТаблицы.Параметры.НачалоРаботы = Формат(СтрокаСотрудник.НачалоРаботы,"ДЛФ=T");
		СтрокаТаблицы.Параметры.КонецРаботы  = Формат(СтрокаСотрудник.КонецРаботы,"ДЛФ=T");
		СтрокаТаблицы.Параметры.ДатаДня = Формат(СтрокаСотрудник.Дата,"ДЛФ=D");
		СтрокаТаблицы.Параметры.ВидДня = СтрокаСотрудник.ВидДня;
 		СтрокаТаблицы.Параметры.ОтработалПосле19 = Формат(СтрокаСотрудник.ОтработалПосле19часов,"ЧЦ=15; ЧДЦ=2");
		
		ИтогОтработалПосле19 = ИтогОтработалПосле19 + СтрокаСотрудник.ОтработалПосле19часов;
		
		//Бондаренко++ 20251107
 		СтрокаТаблицы.Параметры.ОтработалПосле20 = Формат(СтрокаСотрудник.ОтработалПосле20часов,"ЧЦ=15; ЧДЦ=2");

		ИтогОтработалПосле20 = ИтогОтработалПосле20 + СтрокаСотрудник.ОтработалПосле20часов;
 		//Бондаренко-- 20251107
		
		ТабДокумент.Вывести(СтрокаТаблицы);
		
		Эталон = СтрокаСотрудник.Сотрудник;
			
	КонецЦикла; 
	
 	ИтоговаяСтрокаТаблицы.Параметры.Сотрудник = Эталон.Наименование; 
	ИтоговаяСтрокаТаблицы.Параметры.ИтогОтработалПосле19 = Формат(ИтогОтработалПосле19,"ЧЦ=15; ЧДЦ=2"); 
	
	//Бондаренко++ 20251107
	ИтоговаяСтрокаТаблицы.Параметры.ИтогОтработалПосле20 = Формат(ИтогОтработалПосле20,"ЧЦ=15; ЧДЦ=2"); 
	//Бондаренко-- 20251107
	
	ТабДокумент.Вывести(ИтоговаяСтрокаТаблицы); 
	
	ТабДокумент.ТолькоПросмотр=Истина;
	ТабДокумент.ФиксацияСверху = 8;
	ТабДокумент.ФиксацияСлева = 1;
  	
	//ТабДокумент.Защита = Истина; // с Защитой не выгружает в Excel и т.д.
	Возврат ТабДокумент;
КонецФункции



////////////////////////////////////////////////////////////////////////////////
// ИСПОЛНЯЕМАЯ ЧАСТЬ МОДУЛЯ

// сохранение ссылки на коллекцию прав, настроек и окружения
Права = Неопределено;
#Если Клиент Тогда
Права = глПрава;
#КонецЕсли
