
Функция ОтправитьSMS(НомераПолучателей, Текст, ИмяОтправителя, Логин, Пароль) Экспорт
	
	Результат = Новый Структура("ОтправленныеСообщения,ОписаниеОшибки", Новый Массив, "");
	
	ПараметрыЗапроса = Новый Структура;
	ПараметрыЗапроса.Вставить("Login", Логин);
	ПараметрыЗапроса.Вставить("Password", Пароль);
	ПараметрыЗапроса.Вставить("Source", ИмяОтправителя);
	ПараметрыЗапроса.Вставить("Text", Текст);
	
	ВременныйФайл = ПолучитьИмяВременногоФайла();
    
    Запись = Новый ЗаписьТекста(ВременныйФайл);
    Запись.Записать(Логин+ Пароль);
    Запись.Закрыть();
    
    ДвДанные = Новый ДвоичныеДанные(ВременныйФайл);
	
	ЛогинИПарольЗашифрованныйBase64  = Base64Строка(ДвДанные);
	Для Каждого НомерПолучателя Из НомераПолучателей Цикл
		


Заголовоки = Новый Соответствие;
Заголовоки.Вставить("Authorization", "Basic " + ЛогинИПарольЗашифрованныйBase64);
Заголовоки.Вставить("Content-Type", "application/json; charset=utf-8");

НТТРЗапрос = Новый HTTPЗапрос("/sms/v1/sms", Заголовоки);


ЗаписьJSON = Новый ЗаписьJSON;
	
ЗаписьJSON.ПроверятьСтруктуру = Ложь;

ПараметрыЗаписиJSON = Новый ПараметрыЗаписиJSON;
	
//ИмяФайлаОтвета = ПутьКФайлуОтвета;
	
ЗаписьJSON.УстановитьСтроку(ПараметрыЗаписиJSON);
	
ЗаписьJSON.ЗаписатьНачалоОбъекта();
	
ЗаписьJSON.ЗаписатьИмяСвойства("from");	
ЗаписьJSON.ЗаписатьЗначение("LANT");
	
ЗаписьJSON.ЗаписатьИмяСвойства("to");
//ЗаписьJSON.ЗаписатьЗначение(НомерПолучателя);
ЗаписьJSON.ЗаписатьЗначение("79276100311");	
ЗаписьJSON.ЗаписатьИмяСвойства("message");
ЗаписьJSON.ЗаписатьЗначение(Текст);
	
//ЗаписьJSON.ЗаписатьИмяСвойства("callback_url");
//ЗаписьJSON.ЗаписатьЗначение("http://www.sombodyserver.ru/sms_callback");
	
//УИДСообщения = СтрЗаменить(Прав(Строка(Новый УникальныйИдентификатор), 17), "-", "");
//	
//ЗаписьJSON.ЗаписатьИмяСвойства("msg_id");
//ЗаписьJSON.ЗаписатьЗначение(УИДСообщения);

ЗаписьJSON.ЗаписатьКонецОбъекта();
ТелоЗапроса = ЗаписьJSON.Закрыть();




НТТРЗапрос.УстановитьТелоИзСтроки(ТелоЗапроса);

Попытка
   Соединение = Новый HTTPСоединение("a2p-api.megalabs.ru", , , , DMS_ПолучениеФайловИзИнтернетаКлиентСервер.ПолучитьПрокси("http"), 60, Новый ЗащищенноеСоединениеOpenSSL);
   Соединение.ОтправитьДляОбработки(НТТРЗапрос);
Исключение
   //ОписаниеОшибки();
   
КонецПопытки;

КонецЦикла;
	
	//Результат.ОписаниеОшибки = СокрП(Результат.ОписаниеОшибки);
	//Если Не ПустаяСтрока(Результат.ОписаниеОшибки) Тогда
	//	ЗаписьЖурналаРегистрации(НСтр("ru = 'Отправка SMS'", Renault_ОбщегоНазначенияКлиентСервер.КодОсновногоЯзыка()),
	//		УровеньЖурналаРегистрации.Ошибка, , , Результат.ОписаниеОшибки);
	//КонецЕсли;
	//
	
	//Возврат Результат;
	
КонецФункции


Процедура ПриОпределенииНастроек(Настройки) Экспорт
	
	Настройки.АдресОписанияУслугиВИнтернете = "a2p-api.megalabs.ru";
	
КонецПроцедуры
