
////////////////////////////////////////////////////////////////////////////////
// ЭКСПОРТНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ ДОПОЛНИТЕЛЬНЫХ МЕТОДОВ ОБЪЕКТА

Функция ПолучитьОсновныеПараметры() Экспорт 
	
	СтруктураОсновныхПараметров = Новый Структура;
	СтруктураОсновныхПараметров.Вставить("ТиповаяАнкета");
	СтруктураОсновныхПараметров.Вставить("Период");
		
	Возврат СтруктураОсновныхПараметров;
	
КонецФункции

Функция ПолучитьСвойства() Экспорт
			
КонецФункции

// Стандартная процедура настройки схемы компоновщика данных
//
Процедура ЗаполнитьНачальныеНастройки() Экспорт
	
	ОтчетыСервер.ЗаполнитьНачальныеОстатки(ЭтотОбъект);
			
КонецПроцедуры // ЗаполнитьНачальныеНастройки()

// проверка заполнения
Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	ПараметрТиповаяАнкета = Новый ПараметрКомпоновкиДанных("ТиповаяАнкета");
	ТиповаяАнкета         = КомпоновщикНастроек.Настройки.ПараметрыДанных.НайтиЗначениеПараметра(ПараметрТиповаяАнкета).Значение;
	
	Если обЗначениеНеЗаполнено(ТиповаяАнкета) Тогда
		Сообщение = Новый СообщениеПользователю();
		Сообщение.Текст = "Не указана анкета!";
		Сообщение.Сообщить();
		Отказ = Истина;
	КонецЕсли;
	
КонецПроцедуры

// Устанавливает основные параметры
//
Процедура УстановитьПараметры()
	
	
КонецПроцедуры

Процедура ПолучитьОтборСКД(ПолеКомпоновки, Отбор, НайденныеОтборы)
	
	Для Каждого ТекОтбор Из Отбор Цикл
		Если ТекОтбор.Использование Тогда
			Если ТипЗнч(ТекОтбор) = Тип("ГруппаЭлементовОтбораКомпоновкиДанных") Тогда
				ПолучитьОтборСКД(ПолеКомпоновки, ТекОтбор.Элементы, НайденныеОтборы);
			ИначеЕсли ТипЗнч(ТекОтбор) = Тип("ЭлементОтбораКомпоновкиДанных") И ТекОтбор.ЛевоеЗначение = ПолеКомпоновки Тогда
				НайденныеОтборы.Добавить(ТекОтбор);
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка) Экспорт
	
	УстановитьПараметры();
	
	//ФорматПредставления = обПраво("ФорматПредставленияГодаВыпускаАвтомобиля");
	//
	//Если ФорматПредставления = Перечисления.ФорматПредставленияГодаВыпускаАвтомобиля.MMyyyy ИЛИ 
	//	ФорматПредставления = Перечисления.ФорматПредставленияГодаВыпускаАвтомобиля.yyyy Тогда
	//	
	//	ПолеПоиска      = Новый ПолеКомпоновкиДанных("ГодВыпуска");
	//	НайденныеОтборы = Новый Массив;
	//	ПолучитьОтборСКД(ПолеПоиска, КомпоновщикНастроек.Настройки.Отбор.Элементы, НайденныеОтборы);
	//	Для Каждого ТекОтбор Из НайденныеОтборы Цикл
	//		Если ФорматПредставления = Перечисления.ФорматПредставленияГодаВыпускаАвтомобиля.MMyyyy Тогда
	//			ТекОтбор.ПравоеЗначение = НачалоМесяца(ТекОтбор.ПравоеЗначение);
	//		ИначеЕсли ФорматПредставления = Перечисления.ФорматПредставленияГодаВыпускаАвтомобиля.yyyy Тогда
	//			ТекОтбор.ПравоеЗначение = НачалоГода(ТекОтбор.ПравоеЗначение);
	//		КонецЕсли;
	//	КонецЦикла;
	//	
	//КонецЕсли;
	
	ОтчетыСервер.ВывестиОтчет(ЭтотОбъект, СхемаКомпоновкиДанных, КомпоновщикНастроек.Настройки, ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка);
	
КонецПроцедуры

