
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	КоличествоСвязанных   = 0;
	КоличествоИсключенных = 0;
	
	Элементы.СтраницаСвязанныеРаботы.Заголовок = "Связанные работы[" + Формат(КоличествоСвязанных,"ЧЦ=10; ЧН=0; ЧГ=") + "]";
	Элементы.СтраницаИсключенныеРаботы.Заголовок = "Исключенные работы[" + Формат(КоличествоИсключенных,"ЧЦ=10; ЧН=0; ЧГ=") + "]";
	
	Элементы.СвязанныеАвтоработы.ОтборСтрок = Неопределено;
	Элементы.ИсключаемыеАвтоработы.ОтборСтрок = Неопределено;
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	МаксимальныйКлючСвязи = ТекущийОбъект.МаксимальныйКлючСвязи;
	
КонецПроцедуры

&НаКлиенте
Процедура СоставАвтоработПриАктивизацииСтроки(Элемент)
	
	ТекущаяСтрока = Элементы.СоставАвторабот.ТекущиеДанные;
	
	Если ТекущаяСтрока = Неопределено Тогда
		
		КоличествоСвязанных   = 0;
		КоличествоИсключенных = 0;
		
		Элементы.СтраницаСвязанныеРаботы.Заголовок = "Связанные работы[" + Формат(КоличествоСвязанных,"ЧЦ=10; ЧН=0; ЧГ=") + "]";
		Элементы.СтраницаИсключенныеРаботы.Заголовок = "Исключенные работы[" + Формат(КоличествоИсключенных,"ЧЦ=10; ЧН=0; ЧГ=") + "]";
		
		Возврат;
	КонецЕсли; 
	
	СтруктураПоискаОтбор = Новый Структура("КлючСвязи",ТекущаяСтрока.КлючСвязи);
	
	Элементы.СвязанныеАвтоработы.ОтборСтрок = Новый ФиксированнаяСтруктура(СтруктураПоискаОтбор);
	Элементы.ИсключаемыеАвтоработы.ОтборСтрок = Новый ФиксированнаяСтруктура(СтруктураПоискаОтбор);
	
	КоличествоСвязанных   = Объект.СвязанныеАвтоработы.НайтиСтроки(СтруктураПоискаОтбор).Количество();
	КоличествоИсключенных = Объект.ИсключаемыеАвтоработы.НайтиСтроки(СтруктураПоискаОтбор).Количество();
	
	Элементы.СтраницаСвязанныеРаботы.Заголовок = "Связанные работы[" + Формат(КоличествоСвязанных,"ЧЦ=10; ЧН=0; ЧГ=") + "]";
	Элементы.СтраницаИсключенныеРаботы.Заголовок = "Исключенные работы[" + Формат(КоличествоИсключенных,"ЧЦ=10; ЧН=0; ЧГ=") + "]";
	
КонецПроцедуры

&НаКлиенте
Процедура СоставАвтоработПередУдалением(Элемент, Отказ)
	
	ТекущаяСтрока = Элементы.СоставАвторабот.ТекущиеДанные;
	
	Если ТекущаяСтрока = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	СтруктураПоиска = Новый Структура("КлючСвязи", ТекущаяСтрока.КлючСвязи);
	
	СтрокиДляУдаления = Объект.СвязанныеАвтоработы.НайтиСтроки(СтруктураПоиска);
	
	Для каждого СтрокаУдаления Из СтрокиДляУдаления Цикл
		Объект.СвязанныеАвтоработы.Удалить(СтрокаУдаления);
	КонецЦикла;
	
	СтрокиДляУдаления = Объект.ИсключаемыеАвтоработы.НайтиСтроки(СтруктураПоиска);
	
	Для каждого СтрокаУдаления Из СтрокиДляУдаления Цикл
		Объект.ИсключаемыеАвтоработы.Удалить(СтрокаУдаления);
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура СоставАвтоработПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	
	Если НоваяСтрока Тогда
	
		ТекущаяСтрока = Элементы.СоставАвторабот.ТекущиеДанные;
		ТекущаяСтрока.КлючСвязи = МаксимальныйКлючСвязи + 1;
		МаксимальныйКлючСвязи = МаксимальныйКлючСвязи + 1;
	
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СвязанныеАвтоработыПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	
	ТекущаяСтрока = Элементы.СоставАвторабот.ТекущиеДанные;
	
	Если ТекущаяСтрока = Неопределено Тогда
		
		Отказ = Истина;
		
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = НСтр("ru='Не выбрана строка основной табличной части!';en='Do not select the main line of the table!'");
		Сообщение.Сообщить();
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СвязанныеАвтоработыПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	
	Если НоваяСтрока Тогда
	
		ТекущаяСтрокаСоставаРабот = Элементы.СоставАвторабот.ТекущиеДанные;
		
		ТекущаяСтрока = Элементы.СвязанныеАвтоработы.ТекущиеДанные;
		ТекущаяСтрока.КлючСвязи = ТекущаяСтрокаСоставаРабот.КлючСвязи;
	
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ИсключаемыеАвтоработыПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	
	ТекущаяСтрока = Элементы.СоставАвторабот.ТекущиеДанные;
	
	Если ТекущаяСтрока = Неопределено Тогда
		
		Отказ = Истина;
		
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = НСтр("ru='Не выбрана строка основной табличной части!';en='Do not select the main line of the table!'");
		Сообщение.Сообщить();
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ИсключаемыеАвтоработыПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	
	Если НоваяСтрока Тогда
		
		ТекущаяСтрокаСоставаРабот = Элементы.СоставАвторабот.ТекущиеДанные;
		
		ТекущаяСтрока = Элементы.ИсключаемыеАвтоработы.ТекущиеДанные;
		ТекущаяСтрока.КлючСвязи = ТекущаяСтрокаСоставаРабот.КлючСвязи;
		
	КонецЕсли;
	
КонецПроцедуры
