
Перем BIR;
Перем СервисФабрика;

// Точка входа
Процедура ОбработкаНаСервере() Экспорт
	
	Выборка = Справочники.CRM_ДилерскиеЦентры.Выбрать();
	Пока Выборка.Следующий() Цикл
		Если ЗначениеЗаполнено(Выборка.BIR) Тогда
			BIR = Выборка.BIR;
			ПолучитьДанныеИзЦентраль();
		КонецЕсли;
	КонецЦикла;
		
КонецПроцедуры

Процедура ПолучитьДанныеИзЦентраль() Экспорт
	
	ВебСервис = Renault_РаботаСНовостямиДилеров.ПолучитьПрокси();
	
	Если ВебСервис = Неопределено Тогда
		
		ЗаписьЖурналаРегистрации("Загрузка новостей. Не удалось подключиться к вебсервису.", УровеньЖурналаРегистрации.Ошибка);
		Возврат;
		
	КонецЕсли;
	
	Новости = ВебСервис.GetDealerNews(Дата(Формат(ТекущаяДата(), "ДФ=yyyyMMdd")));
	
	Сериал = новый СериализаторXDTO(ВебСервис.ФабрикаXDTO);
	Таблица = Сериал.ПрочитатьXDTO(Новости);
	
	Для Каждого Строка Из Таблица Цикл
		
		Если НовостьУжеЕсть(Новый УникальныйИдентификатор(Строка.Идентификатор)) = Истина Тогда
			
			Продолжить;
			
		КонецЕсли;
		
		Запись = РегистрыСведений.CRM_НовостиДилеров.СоздатьМенеджерЗаписи();
		ЗаполнитьЗначенияСвойств(Запись, Строка);
		Запись.ИдентификаторНовости = Новый УникальныйИдентификатор(Строка.Идентификатор);
		Запись.ДилерскийЦентр = Справочники.CRM_ДилерскиеЦентры.НайтиПоРеквизиту("BIR", BIR);
		Запись.Записать();
	КонецЦикла;

КонецПроцедуры

Функция НовостьУжеЕсть(Идентификатор)
	
	Запрос = Новый Запрос;
	
	Запрос.Текст = "ВЫБРАТЬ
	               |	CRM_НовостиДилеров.ИдентификаторНовости
	               |ИЗ
	               |	РегистрСведений.CRM_НовостиДилеров КАК CRM_НовостиДилеров
	               |ГДЕ
	               |	CRM_НовостиДилеров.ИдентификаторНовости = &ИдентификаторНовости";
				   
	Запрос.УстановитьПараметр("ИдентификаторНовости", Идентификатор);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		
		Возврат Истина;
		
	Иначе
		
		Возврат Ложь;
		
	КонецЕсли;	
	
КонецФункции;
 
АдресWS	 =Константы.Renault_АдресWebСервисов.Получить();
ЛогинWS	 = Константы.Renault_ЛогинВебСервиса.Получить();
ПарольWS = Константы.Renault_ПарольВебСервиса.Получить();
