
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("СписокСчетов") Тогда
				
		Для каждого ЭлементСписка Из Параметры.СписокСчетов Цикл
			
			Если Элементы.СписокСчетов.СписокВыбора.НайтиПоЗначению(ЭлементСписка.Значение) <> Неопределено Тогда
				Продолжить;
			КонецЕсли; 
			
			Элементы.СписокСчетов.СписокВыбора.Добавить(ЭлементСписка.Значение,ЭлементСписка.Представление);
			
		КонецЦикла; 
		
		ИдентификаторСчета = Параметры.ИдентификаторСчета;
		
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура ВыбратьСчет(Команда)
	
	СтруктураВозврата = Новый Структура("Счет,ИдентификаторСчета",СписокСчетов,ИдентификаторСчета);
	
	ОповеститьОВыборе(СтруктураВозврата);
	
КонецПроцедуры

