&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Параметры.Свойство("Заполнять") Тогда Заполнять=Истина КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ИмяФайлаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	Диалог=Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	Диалог.Фильтр="(*.xls),(*.xlsx)|*.xls;*.xlsx";
	Диалог.Показать(Новый ОписаниеОповещения("ВыборФайла",ЭтаФорма));
КонецПроцедуры

&НаКлиенте
Процедура ВыборФайла(Парам1,Парам2) Экспорт ИмяФайла=Парам1[0] КонецПроцедуры	

&НаКлиенте
Процедура кнЗагрузить()
    Попытка
        EXCELApplication = Новый COMОбъект("Excel.Application");
        EXCELApplication.Visible=Ложь;
        EXCELApplication.DisplayAlerts=Ложь;
    Исключение
        Попытка EXCELApplication.Application.Quit() Исключение КонецПопытки;
        EXCELApplication=Неопределено;
        Сообщить("Не удалось подключиться к Excel. "+ОписаниеОшибки(),СтатусСообщения.Внимание);
        Возврат
	КонецПопытки;
	
	//ФайлИзХранилища=ПолучитьИзВременногоХранилища(АдресФайла);
	//ВременныйФайл=ПолучитьИмяВременногоФайла();
	//ФайлИзХранилища.Записать(ВременныйФайл);	

    Версия=Лев(EXCELApplication.Version,Найти(EXCELApplication.Version,".")-1); // Определение версии EXCEL.

	//Book=EXCELApplication.WorkBooks.Open(ВременныйФайл);
    Book=EXCELApplication.WorkBooks.Open(ИмяФайла);
	Для НомерЛиста=1 По Book.Sheets.Count Цикл
		Sheet=Book.WorkSheets(НомерЛиста);
		ИмяЛиста=Sheet.Name;
		
		Если НЕ Заполнять Тогда Спр=Справочники.Renault_СервисныеАкции.СоздатьЭлемент() КонецЕсли;	
		
	    // Определение диапазона данных таблицы EXCEL.
		//НачальнаяКолонка=1;
	    НачальнаяСтрока=1;
	    Если Версия="8" Тогда
			//КонечнаяКолонка=Sheet.Cells.CurrentRegion.Columns.Count;
	        КонечнаяСтрока=Sheet.Cells.CurrentRegion.Rows.Count;
	    Иначе
			//КонечнаяКолонка=Sheet.Cells.SpecialCells(11).Column;
	        КонечнаяСтрока=Sheet.Cells.SpecialCells(11).Row;
	    Конецесли;	
		
		Для НСтр=НомерПервойСтроки По КонечнаяСтрока Цикл
			
			Артикул=Sheet.Cells(НСтр,КолонкаАртикул).Value;
			СкидкаВПроцентах=Sheet.Cells(НСтр,КолонкаСкидкаВПроцентах).Value;
			СкидкаВРублях=Sheet.Cells(НСтр,КолонкаСкидкаВРублях).Value;
			КомпенсацияВРублях=Sheet.Cells(НСтр,КолонкаКомпенсацияВРублях).Value;
			
			Элемент=Справочники.Номенклатура.НайтиПоРеквизиту("Артикул",Артикул);
			Если Элемент.Пустая() Тогда
				Сообщить("Не найден артикул "+Артикул,СтатусСообщения.Внимание);
				Продолжить
			КонецЕсли;
			
			Если Заполнять Тогда
				ВладелецФормы.ДобавитьЗапчасть(Новый Структура("Элемент,КомпенсацияВРублях,СкидкаВПроцентах,СкидкаВРублях",Элемент,КомпенсацияВРублях,СкидкаВПроцентах,СкидкаВРублях))
			Иначе
				Стр=Спр.Запчасти.Добавить();
				Стр.Элемент=Элемент;
				Стр.КомпенсацияВРублях=КомпенсацияВРублях;
				Стр.СкидкаВПроцентах=СкидкаВПроцентах;
				Стр.СкидкаВРублях=СкидкаВРублях;
			КонецЕсли;
		КонецЦикла;	
		
		Если Заполнять Тогда
			Прервать //заполнять только по первой странице
		Иначе	
			Спр.Код=ИмяЛиста;
			Спр.Наименование=ИмяЛиста;
			Попытка Спр.Записать() Исключение Сообщить("Не удалось записать Сервисную Акцию "+ИмяЛиста+": "+ОписаниеОшибки(),СтатусСообщения.Внимание) КонецПопытки;
		КонецЕсли;	
		
	КонецЦикла;	
	
	//Файл=Новый Файл(ВременныйФайл);
	//УдалитьФайлы(Файл.Путь,Файл.Имя);
	
	Попытка Book.Close() Исключение КонецПопытки;
	Попытка EXCELApplication.Application.Quit() Исключение КонецПопытки;
	EXCELApplication=Неопределено;
	
КонецПроцедуры	

НомерПервойСтроки=2;
КолонкаАртикул=1;
КолонкаСкидкаВПроцентах=2;
КолонкаСкидкаВРублях=3;
КолонкаКомпенсацияВРублях=4;
