
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)	
	
	УстановитьОформлениеПолейФормы();
	
	УстановитьВидимостьЗаголовкиКоманд();	
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	ПолучитьКоличествоМакетовИОтчетов();
	
	Если Объект.ВидОперации = Перечисления.DMS_ВидыОперацийРекламнойКампании.СозданиеШаблона Тогда
		ТолькоПросмотр = Истина;
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	Если Объект.ВидОперации = Перечисления.DMS_ВидыОперацийРекламнойКампании.СозданиеШаблона Тогда
		Отказ = Истина;
		
		Сообщение = Новый СообщениеПользователю();
		Сообщение.Текст = "Создание/изменение шаблонов разрешено только в системе дилерского медиапланирования";
		Сообщение.Сообщить();
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура Макеты(Команда)
	
	Отбор = Новый Структура("РекламнаяКампания",Объект.Ссылка);	
	ПараметрыФормы = Новый Структура("Отбор", Отбор);
	ОткрытьФорму("Справочник.DMS_МакетыРекламнойКампании.Форма.ФормаСпискаМакетов", ПараметрыФормы, ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура Отчеты(Команда)
	
	Отбор = Новый Структура("РекламнаяКампания",Объект.Ссылка);	
	ПараметрыФормы = Новый Структура("Отбор", Отбор);
	ОткрытьФорму("Документ.DMS_ОтчетПоРекламнойКампании.ФормаСписка", ПараметрыФормы, ЭтаФорма);
	
КонецПроцедуры
 
&НаСервере
Процедура УстановитьВидимостьЗаголовкиКоманд()
	
	Элементы.ФормаМакеты.Доступность = ЗначениеЗаполнено(Объект.Ссылка);
	Элементы.ФормаОтчеты.Доступность = ЗначениеЗаполнено(Объект.Ссылка);
	
	Элементы.ФормаМакеты.Заголовок = "Макеты("+Формат(КоличествоМакетов,"ЧЦ=10; ЧН=0; ЧГ=")+")";	
	Элементы.ФормаОтчеты.Заголовок = "Отчеты("+Формат(КоличествоОтчетов,"ЧЦ=10; ЧН=0; ЧГ=")+")";	

КонецПроцедуры // УстановитьВидимостьЗаголовкиКоманд()

&НаСервере
Процедура ПолучитьКоличествоМакетовИОтчетов()
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("РекламнаяКампания",Объект.Ссылка);
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ МакетыРекламнойКампании.Ссылка) КАК КоличествоМакетов,
		|	МАКСИМУМ(0) КАК КоличествоОтчетов,
		|	МАКСИМУМ(МакетыРекламнойКампании.Согласован) КАК МакетСогласован,
		|	МАКСИМУМ(ЛОЖЬ) КАК ОтчетСогласован
		|ПОМЕСТИТЬ МакетыОтчеты
		|ИЗ
		|	Справочник.DMS_МакетыРекламнойКампании КАК МакетыРекламнойКампании
		|ГДЕ
		|	МакетыРекламнойКампании.РекламнаяКампания = &РекламнаяКампания
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	МАКСИМУМ(0),
		|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ОтчетПоРекламнойКампании.Ссылка),
		|	МАКСИМУМ(ЛОЖЬ),
		|	МАКСИМУМ(ОтчетПоРекламнойКампании.Согласован)
		|ИЗ
		|	Документ.DMS_ОтчетПоРекламнойКампании КАК ОтчетПоРекламнойКампании
		|ГДЕ
		|	ОтчетПоРекламнойКампании.РекламнаяКампания = &РекламнаяКампания
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	СУММА(ЕСТЬNULL(МакетыОтчеты.КоличествоМакетов, 0)) КАК КоличествоМакетов,
		|	СУММА(ЕСТЬNULL(МакетыОтчеты.КоличествоОтчетов, 0)) КАК КоличествоОтчетов,
		|	МАКСИМУМ(ЕСТЬNULL(МакетыОтчеты.МакетСогласован, ЛОЖЬ)) КАК МакетСогласован,
		|	МАКСИМУМ(ЕСТЬNULL(МакетыОтчеты.ОтчетСогласован, ЛОЖЬ)) КАК ОтчетСогласован
		|ИЗ
		|	МакетыОтчеты КАК МакетыОтчеты";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		
		Если ВыборкаДетальныеЗаписи.МакетСогласован Или ВыборкаДетальныеЗаписи.ОтчетСогласован Тогда
			ТолькоПросмотр = Истина;
			//Элементы.СамостоятельнаяКампания.Доступность = Ложь;
		КонецЕсли; 
		
		КоличествоОтчетов = ВыборкаДетальныеЗаписи.КоличествоОтчетов;
		КоличествоМакетов = ВыборкаДетальныеЗаписи.КоличествоМакетов;
	
	КонецЕсли; 

КонецПроцедуры // ПолучитьКоличествоМакетовИОтчетов()

&НаСервере
Процедура УстановитьОформлениеПолейФормы()

	Если Объект.ВидОперации = Перечисления.DMS_ВидыОперацийРекламнойКампании.СозданиеШаблона Тогда
	
		Элемент = Элементы.ДилерскийЦентр;
		
		Элемент.ТолькоПросмотр 			  = Истина;
		Элемент.ПодсказкаВвода		 	  = "<Для всех>";
		Элемент.ЦветТекста 			      = ЦветаСтиля.DMS_ТекстЗапрещеннойЯчейкиЦвет;
		Элемент.АвтоОтметкаНезаполненного = Ложь;

	ИначеЕсли Объект.ВидОперации = Перечисления.DMS_ВидыОперацийРекламнойКампании.РазмещениеКампании Тогда
	
		Элемент = Элементы.ДилерскийЦентр;
		
		Элемент.ТолькоПросмотр 			  = Ложь;
		Элемент.ПодсказкаВвода		 	  = "Выберите дилера";
		Элемент.ЦветТекста 				  = ЦветаСтиля.ЦветТекстаПоля;
		Элемент.АвтоОтметкаНезаполненного = Истина;
	
	КонецЕсли; 

КонецПроцедуры // УстановитьОформлениеПолейФормы()

