
#Область ПрограммныйИнтерфейс

Процедура СформироватьДанныеОтправки(Форма, Документ, Действие, ФайлСформирован = Ложь) Экспорт
	
	Если НЕ ЗначениеЗаполнено(Документ.Ссылка)
		ИЛИ Форма.Модифицированность Тогда
		Сообщить("Перед выполнением необходимо записать документ!");
		Возврат;
	КонецЕсли;
	
	Если Действие = "ОтправкаЗапросаНаПолучениеКодовМаркировки" Тогда
		ОтправкаЗапросаНаПолучениеКодовМаркировки(Документ, ФайлСформирован);
	ИначеЕсли Действие = "ОтправкаОписанияОстатков" Тогда
		ОтправкаЗапросаНаОписаниеОстатковНоменклатуры(Документ);
	ИначеЕсли Действие = "ОтправкаЗапросаВводаВОборотКодовМаркировки" Тогда
		ОтправкаЗапросаВводаВОборотКодовМаркировки(Документ,  ФайлСформирован);
	ИначеЕсли Действие = "ОтправкаЗапросаПеремаркировки" Тогда
		ОтправкаЗапросаПеремаркировки(Документ, ФайлСформирован);
	ИначеЕсли Действие = "ОтправкаЗапросаВыводаИзОборота" Тогда
		ОтправкаЗапросаВыводаИзОборота(Документ, ФайлСформирован);
	ИначеЕсли Действие = "ОтправкаЗапросаСписанияКодаМаркировки" Тогда
		ОтправкаЗапросаСписанияКодаМаркировки(Документ, ФайлСформирован);
	ИначеЕсли Действие = "ОтправкаЗапросаВозвратаВОборот" Тогда
		ОтправкаЗапросаВозвратаВОборот(Документ, ФайлСформирован);
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗагрузитьКодыМаркировки(Форма, Документ, ДанныеЗагружены = Ложь) Экспорт
	
	Если НЕ ЗначениеЗаполнено(Документ.Ссылка)
		ИЛИ Форма.Модифицированность Тогда
		Сообщить("Перед выполнением необходимо записать документ!");
		Возврат;
	КонецЕсли;
	
	МассивКодовМаркировки = Новый Массив;
	
	ЗагрузитьКодыМаркировкиЧерезФайл(Документ, МассивКодовМаркировки);
	
	ДанныеЗагружены = (МассивКодовМаркировки.Количество() > 0);
	
	Если ДанныеЗагружены Тогда
		Если Вопрос("Коды маркировок загружены. Перейти к печати?", РежимДиалогаВопрос.ДаНет) <> КодВозвратаДиалога.Да Тогда
			Возврат;
		КонецЕсли;
		
		СписокКодов = Новый СписокЗначений;
		СписокКодов.ЗагрузитьЗначения(МассивКодовМаркировки);
		ФормаПечати = ПолучитьФорму("Обработка.ПечатьКодовМаркировки.Форма", , Форма);
		ФормаПечати.ЗаказНаЭмиссию = Документ.Ссылка;
		ФормаПечати.СписокКодовМаркировки = СписокКодов;
		ФормаПечати.ОткрытьМодально();
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ОтправкаЗапросаНаПолучениеКодовМаркировки(Документ, ФайлСформирован)
	
	// Проверим, что в ТЧ у всех указан GTIN
	СтрокиБезGTIN = Новый Массив;
	Для Каждого ТекущаяСтрока Из Документ.Товары Цикл
		Если НЕ ЗначениеЗаполнено(ТекущаяСтрока.GTIN) Тогда
			СтрокиБезGTIN.Добавить(ТекущаяСтрока.НомерСтроки);
		КонецЕсли;
	КонецЦикла;
	
	Если СтрокиБезGTIN.Количество() > 0 Тогда
		Сообщить("Таблица <Товары>. Не заполнен GTIN в строках: " + СтрСоединить(СтрокиБезGTIN, ", "));
		Возврат;
	КонецЕсли;
	
	СформироватьФайлЗаказовКодовМаркировки(Документ, ФайлСформирован);
	
КонецПроцедуры

Процедура ОтправкаЗапросаНаОписаниеОстатковНоменклатуры(Документ)
	
	СформироватьФайлОстатковНоменклатуры(Документ);
	
КонецПроцедуры

Процедура ОтправкаЗапросаВводаВОборотКодовМаркировки(Документ, ФайлСформирован)
	
	Если Документ.СпособВводаВОборот = Перечисления.СпособыВводаВОборот.МаркировкаОстатков Тогда
		СформироватьФайлВводаВОборотМаркировкаОстатков(Документ, ФайлСформирован);
	КонецЕсли;
	
КонецПроцедуры

Функция ПолучениеКаталогаФайлов(ИмяФайла, Расширение = "xml", Фильтр = "(*.xml)|*.xml")
	
	Результат = Ложь;
	
	ДиалогВыбора = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Сохранение);
	ДиалогВыбора.Заголовок = "Сохранить файл ...";
	ДиалогВыбора.ПолноеИмяФайла = ИмяФайла;
	ДиалогВыбора.Расширение = Расширение;
	ДиалогВыбора.Фильтр = Фильтр;
	
	Если ДиалогВыбора.Выбрать()
		И НЕ ПустаяСтрока(ДиалогВыбора.ПолноеИмяФайла) Тогда
		ИмяФайла =  ДиалогВыбора.ПолноеИмяФайла;
		Результат = Истина;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Процедура СформироватьКодМаркировкиДляXML(КодМаркировки)
	
	КодМаркировки = СтрЗаменить(КодМаркировки, "&", "&amp");
	КодМаркировки = СтрЗаменить(КодМаркировки, Символ(34), "&quot"); // кавычки
	КодМаркировки = СтрЗаменить(КодМаркировки, "'", "&apos"); // апостроф
	КодМаркировки = СтрЗаменить(КодМаркировки, ">", "&gt");
	КодМаркировки = СтрЗаменить(КодМаркировки, "<", "&lt");
	
КонецПроцедуры

Процедура ЗаписьТекстаВФайл(ЗаписьXML, ИмяЭлемента, Текст)
	
	ЗаписьXML.ЗаписатьНачалоЭлемента(ИмяЭлемента);
	ЗаписьXML.ЗаписатьТекст(Текст);
	ЗаписьXML.ЗаписатьКонецЭлемента();
	
КонецПроцедуры

Процедура СформироватьФайлЗаказовКодовМаркировки(Документ, ФайлСформирован)
	
	ВидПродукции = УправлениеКодамиМаркировкиКлиентСервер.ВидПродуции();
	ШаблонЭтикетки = УправлениеКодамиМаркировкиКлиентСервер.ИдентификаторШаблонаЭтикетки();
	СпособВыпуска = УправлениеКодамиМаркировкиКлиентСервер.СпособВыпускаВОборот(Документ.СпособВыпускаВОборот);
	
	Если ВидПродукции = Неопределено
		ИЛИ СпособВыпуска = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	// Получим путь для записи файла
	ИмяФайла = 
		"Заказ_кодов_маркировки_" + Документ.Номер
		+ "_" + СтрЗаменить(Формат(ТекущаяДатаСеанса(), "ДФ=yyyy.MM.dd"), ".", "_");
	Если НЕ ПолучениеКаталогаФайлов(ИмяФайла) Тогда
		Возврат;
	КонецЕсли;
	
	ЗаписьXML = Новый ЗаписьXML();
	ЗаписьXML.ОткрытьФайл(ИмяФайла, "UTF-8");
	ЗаписьXML.ЗаписатьОбъявлениеXML();
	
	ЗаписьXML.ЗаписатьНачалоЭлемента("order");
	ЗаписьXML.ЗаписатьАтрибут("xmlns:xsi", "http://www.w3.org/2001/XMLSchema-instance");
	ЗаписьXML.ЗаписатьАтрибут("xmlns", "urn:oms.order");
	ЗаписьXML.ЗаписатьАтрибут("xsi:schemaLocation", "urn:oms.order order-v5.5.xsd");
	
	// Заполним данными документа 
	ЗаписьXML.ЗаписатьНачалоЭлемента(ВидПродукции);
	
	ЗаписьТекстаВФайл(ЗаписьXML, "productGroupe", ВидПродукции);
	ЗаписьТекстаВФайл(ЗаписьXML, "contactPerson", Документ.Ответственный.Наименование);
	ЗаписьТекстаВФайл(ЗаписьXML, "releaseMethodType", СпособВыпуска);
	ЗаписьТекстаВФайл(ЗаписьXML, "createMethodType", "SELF_MADE");  // SELF_MADE или CEM
	
	Если ЗначениеЗаполнено(Документ.ИдентификаторПроизводственногоЗаказа) Тогда
		ЗаписьТекстаВФайл(ЗаписьXML, "productionOrderId", Документ.ИдентификаторПроизводственногоЗаказа);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Документ.НомерДоговораСОператором)
		И ЗначениеЗаполнено(Документ.ДатаДоговораСОператором) Тогда
		ЗаписьТекстаВФайл(ЗаписьXML, "contractNumber", Документ.НомерДоговораСОператором);
		ЗаписьТекстаВФайл(ЗаписьXML, "contractDate", Формат(Документ.ДатаДоговораСОператором, "ДФ=yyyy-MM-dd"));
	КонецЕсли;
	
	// Заполнение ТЧ Товары
	ЗаписьXML.ЗаписатьНачалоЭлемента("products");
	
	СтруктураПоиска = Новый Структура("ИдентификаторСтроки");
	Для Каждого ТекущаяСтрока Из Документ.Товары Цикл
		
		ЗаполнениеСерийныхНомеров =
			УправлениеКодамиМаркировкиКлиентСервер.СпособЗаполненияСерийныхНомеров(
				ТекущаяСтрока.СпособЗаполненияСерийногоНомера);
		
		ЗаписьXML.ЗаписатьНачалоЭлемента("product");
		
		ЗаписьТекстаВФайл(ЗаписьXML, "gtin", ТекущаяСтрока.GTIN);
		ЗаписьТекстаВФайл(ЗаписьXML, "quantity", Строка(ТекущаяСтрока.Количество));
		ЗаписьТекстаВФайл(ЗаписьXML, "serialNumberType", ЗаполнениеСерийныхНомеров);
		
		Если ЗаполнениеСерийныхНомеров = "SELF_MADE" Тогда
			
			ЗаписьXML.ЗаписатьНачалоЭлемента("serialNumbers");
			
			// Заполняем список созданных серийных номеров
			СтруктураПоиска.ИдентификаторСтроки = ТекущаяСтрока.ИдентификаторСтроки;
			НайденныеСтроки = Документ.СерийныеНомераКодовМаркировки.НайтиСтроки(СтруктураПоиска);
			
			Для Каждого ТекущийНомер Из НайденныеСтроки Цикл
				ЗаписьТекстаВФайл(ЗаписьXML, "serialNumber", ТекущийНомер.СерийныйНомерМаркировки);
			КонецЦикла;
			
			ЗаписьXML.ЗаписатьКонецЭлемента();
			
		КонецЕсли;
		
		ЗаписьТекстаВФайл(ЗаписьXML, "templateId", ШаблонЭтикетки);
		
		ЗаписьXML.ЗаписатьКонецЭлемента();
		
	КонецЦикла;
	
	ЗаписьXML.ЗаписатьКонецЭлемента();
	ЗаписьXML.ЗаписатьКонецЭлемента();
	ЗаписьXML.ЗаписатьКонецЭлемента();
	
	ЗаписьXML.Закрыть();
	Сообщить("Сформирован файл: " + ИмяФайла);
	
	ФайлСформирован = Истина;
	
КонецПроцедуры

Процедура СформироватьФайлОстатковНоменклатуры(Документ)
	
	// Проверить, что есть товар, для которого необходимо сформировать описание
	ТаблицаТоваров = УправлениеКодамиМаркировкиКлиентСервер.ПолучитьТаблицуУпращенногоВводаМаркировок(Документ);
	
	Если ТаблицаТоваров.Количество() = 0 Тогда
		Сообщить("У всех строк указан GTIN или у некоторых строк не заполнена модель и/или код ТНВЭД");
		Возврат;
	КонецЕсли;
	
	// Получим путь для записи файла
	ИмяФайла = 
		"Описание_остатков_" + Документ.Номер
		+ "_" + СтрЗаменить(Формат(ТекущаяДатаСеанса(), "ДФ=yyyy.MM.dd"), ".", "_");
	Если НЕ ПолучениеКаталогаФайлов(ИмяФайла, "csv", "(*.csv)|*.csv") Тогда
		Возврат;
	КонецЕсли;
	
	Разделитель = ",";
	
	ТекстовыйФайл = Новый ТекстовыйДокумент();
	
	ТекстовыйФайл.ДобавитьСтроку(СтрШаблон("ИНН участника оборота%1Версия", Разделитель));
	ТекстовыйФайл.ДобавитьСтроку(СтрШаблон("%1%2%3", СокрЛП(Документ.Организация.ИНН), Разделитель, "2"));
	ТекстовыйФайл.ДобавитьСтроку(
		СтрШаблон("Список товаров%1%2%3%4%5%6", Разделитель, Разделитель, Разделитель, Разделитель, Разделитель, Разделитель));
	ТекстовыйФайл.ДобавитьСтроку(
		СтрШаблон("Код товарной номенклатуры (2 знака)%1Торговая Марка Бренд%2Наименование товара%3Целевой пол%4"
		+ "Способ ввода товара в оборот%5Возраст потребителя%6Модель / артикул производителя",
		Разделитель, Разделитель, Разделитель, Разделитель, Разделитель, Разделитель));
		
	Для Каждого ТекущаяСтрока Из ТаблицаТоваров Цикл
		
		ТекстовыйФайл.ДобавитьСтроку(
			ТекущаяСтрока.Код + Разделитель + Разделитель + Разделитель
			+ Разделитель + Разделитель + Разделитель + ТекущаяСтрока.model);
		
	КонецЦикла;
	
	ТекстовыйФайл.УстановитьТекст(СтрЗаменить(ТекстовыйФайл.ПолучитьТекст() + Символы.ПС, Символы.ПС + Символы.ПС, ""));
	ТекстовыйФайл.Записать(ИмяФайла, КодировкаТекста.UTF8);
	
	Сообщить("Сформирован файл: " + ИмяФайла);
	
КонецПроцедуры

Процедура СформироватьФайлВводаВОборотМаркировкаОстатков(Документ, ФайлСформирован)
	
	// Получим путь для записи файла
	ИмяФайла = 
		"Маркировка_остатков_" + Документ.Номер
		+ "_" + СтрЗаменить(Формат(ТекущаяДатаСеанса(), "ДФ=yyyy.MM.dd"), ".", "_");
	Если НЕ ПолучениеКаталогаФайлов(ИмяФайла) Тогда
		Возврат;
	КонецЕсли;
	
	ЗаписьXML = Новый ЗаписьXML();
	ЗаписьXML.ОткрытьФайл(ИмяФайла, "UTF-8");
	ЗаписьXML.ЗаписатьОбъявлениеXML();
	
	// Заполним данными документа 
	ЗаписьXML.ЗаписатьНачалоЭлемента("vvod_ostatky");
	ЗаписьXML.ЗаписатьАтрибут("version", "2");
	ЗаписьXML.ЗаписатьАтрибут("action_id", "5.4");
	
	ЗаписьТекстаВФайл(ЗаписьXML, "trade_participant_inn",  СокрЛП(Документ.Организация.ИНН));
	
	ЗаписьXML.ЗаписатьНачалоЭлемента("products_list");
	
	ОбъектШК = Обработки.ШтрихКоды.Создать();
	Для Каждого ТекущаяСтрока Из Документ.КодыМаркировки Цикл
		
		СтруктураМаркировки = ОбъектШК.РазобратьСтрокуШтрихкодаGS1(ТекущаяСтрока.КодМаркировки);
		
		Если НЕ СтруктураМаркировки.Разобран Тогда
			Продолжить;
		КонецЕсли;
		
		// Заполнение ТЧ Товары
		ЗаписьXML.ЗаписатьНачалоЭлемента("product");
		
		Идентификатор01 = "01" + СтруктураМаркировки.ДанныеШтрихкода["01"].Значение;
		// Замена по специфике csv
		Идентификатор21 = "21" + СтруктураМаркировки.ДанныеШтрихкода["21"].Значение;
		
		КИ = Идентификатор01 + Идентификатор21;
		
		ЗаписьXML.ЗаписатьНачалоЭлемента("ki");
		ЗаписьXML.ЗаписатьСекциюCDATA(КИ);
		ЗаписьXML.ЗаписатьКонецЭлемента();
		
		// Параметры по ТЧ Товары
		НайденнаяСтрока = Документ.Товары.Найти(ТекущаяСтрока.ИдентификаторТовара, "ИдентификаторТовара");
		
		Если ЗначениеЗаполнено(НайденнаяСтрока.СтранаПроизводства) Тогда
			СтранаПроизводства = НайденнаяСтрока.СтранаПроизводства.Код;
			ЗаписьТекстаВФайл(ЗаписьXML, "country", СтранаПроизводства);
		КонецЕсли;
		
		ДатаРегистрации = "";
		Если ЗначениеЗаполнено(НайденнаяСтрока.ДатаРегистрацииДТ) Тогда
			ДатаРегистрации = Формат(НайденнаяСтрока.ДатаРегистрацииДТ, "ДФ=dd.MM.yyyy");
			ЗаписьТекстаВФайл(ЗаписьXML, "declaration_date", ДатаРегистрации);
		КонецЕсли;
		
		Если ЗначениеЗаполнено(НайденнаяСтрока.РегистрационныйНомерДТ) Тогда
			РегистрацинныйНомер = НайденнаяСтрока.РегистрационныйНомерДТ;
			ЗаписьТекстаВФайл(ЗаписьXML, "declaration_number", РегистрацинныйНомер);
		КонецЕсли;
		
		ВидДокумента = УправлениеКодамиМаркировкиКлиентСервер.ВидДокументаСоответствия(
			НайденнаяСтрока.ВидДокументаРегистрации);
			
		Если ЗначениеЗаполнено(ВидДокумента) Тогда
			ЗаписьТекстаВФайл(ЗаписьXML, "certificate_type", ВидДокумента);
		КонецЕсли;
		
		Если ЗначениеЗаполнено(НайденнаяСтрока.НомерДокументаСоответствия) Тогда
			НомерДокументаСоответствия = НайденнаяСтрока.НомерДокументаСоответствия;
			ЗаписьТекстаВФайл(ЗаписьXML, "certificate_number", НомерДокументаСоответствия);
		КонецЕсли;
		
		Если ЗначениеЗаполнено(НайденнаяСтрока.ДатаДокументаСоответсвия) Тогда
			ДатаДокументаСоответсвия = Формат(НайденнаяСтрока.ДатаДокументаСоответсвия, "ДФ=dd.MM.yyyy");
			ЗаписьТекстаВФайл(ЗаписьXML, "certificate_date", ДатаДокументаСоответсвия);
		КонецЕсли;
		
		ЗаписьXML.ЗаписатьКонецЭлемента();
		
	КонецЦикла;
	
	ЗаписьXML.ЗаписатьКонецЭлемента();
	ЗаписьXML.ЗаписатьКонецЭлемента();
	
	ЗаписьXML.Закрыть();
	
	// Из-за специфики работы записи нужно удалить лишнее
	ТекстовыйДокумент = Новый ТекстовыйДокумент;
	ТекстовыйДокумент.Прочитать(ИмяФайла);
	ТекстФайла = ТекстовыйДокумент.ПолучитьТекст();
	ТекстФайла = СтрЗаменить(ТекстФайла, "<ki>" + Символы.ПС, "<ki>");
	
	Пока СтрНайти(ТекстФайла, "	<![CDATA") > 0 Цикл
		ТекстФайла = СтрЗаменить(ТекстФайла, "	<![CDATA", "<![CDATA");
	КонецЦикла;
	
	ТекстовыйДокумент.УстановитьТекст(ТекстФайла);
	ТекстовыйДокумент.Записать(ИмяФайла);
	
	Сообщить("Сформирован файл: " + ИмяФайла);
	
	ФайлСформирован = Истина;
	
КонецПроцедуры

Процедура ОтправкаЗапросаПеремаркировки(Документ, ФайлСформирован)
	
	// Если не запонен новый код, то не создаем файл
	Для Каждого ТекущаяСтрока Из Документ.Товары Цикл
		Если НЕ ЗначениеЗаполнено(ТекущаяСтрока.КодМаркировкиНовый) Тогда
			Сообщить("Имеются строки, в которых не указан новый код маркировки. Выгрузка файла отменена.");
			Возврат;
		КонецЕсли;
	КонецЦикла;
	
	// Получим путь для записи файла
	ИмяФайла = 
		"Перемаркировка_" + Документ.Номер
		+ "_" + СтрЗаменить(Формат(ТекущаяДатаСеанса(), "ДФ=yyyy.MM.dd"), ".", "_");
	Если НЕ ПолучениеКаталогаФайлов(ИмяФайла) Тогда
		Возврат;
	КонецЕсли;
	
	ЭтоВозвратРозница = (Документ.ПричинаПеремаркировки = Перечисления.ПричиныПеремаркировки.ВозвратБезМаркировкиРозничнаяПродажа);
	ЭтоВозвратДистанционный = (Документ.ПричинаПеремаркировки = Перечисления.ПричиныПеремаркировки.ВозвратБезМаркировкиДистанционнаяПродажа);
	ПричинаПеремаркировки = УправлениеКодамиМаркировкиКлиентСервер.ПричинаПеремаркировки(Документ.ПричинаПеремаркировки);
	
	ЗаписьXML = Новый ЗаписьXML();
	ЗаписьXML.ОткрытьФайл(ИмяФайла, "UTF-8");
	ЗаписьXML.ЗаписатьОбъявлениеXML();
	
	// Заполним данными документа 
	ЗаписьXML.ЗаписатьНачалоЭлемента("remark");
	ЗаписьXML.ЗаписатьАтрибут("version", "5");
	
	ЗаписьТекстаВФайл(ЗаписьXML, "trade_participant_inn",  СокрЛП(Документ.Организация.ИНН));
	ЗаписьТекстаВФайл(ЗаписьXML, "remark_date", Формат(Документ.Дата, "ДФ=dd.MM.yyyy"));
	ЗаписьТекстаВФайл(ЗаписьXML, "remark_cause", ПричинаПеремаркировки);
	
	ЗаписьXML.ЗаписатьНачалоЭлемента("products_list");
	
	ОбъектШК = Обработки.ШтрихКоды.Создать();
	
	Для Каждого ТекущаяСтрока Из Документ.Товары Цикл
		
		// Заполнение ТЧ Товары
		ЗаписьXML.ЗаписатьНачалоЭлемента("product");
		
		Если НЕ (ЭтоВозвратДистанционный ИЛИ ЭтоВозвратРозница) Тогда
			СтруктураМаркировки = ОбъектШК.РазобратьСтрокуШтрихкодаGS1(ТекущаяСтрока.КодМаркировки);
			
			Если НЕ СтруктураМаркировки.Разобран Тогда
				Продолжить;
			КонецЕсли;
			
			Идентификатор01 = "01" + СтруктураМаркировки.ДанныеШтрихкода["01"].Значение;
			// Замена по специфике csv
			Идентификатор21 = "21" + СтруктураМаркировки.ДанныеШтрихкода["21"].Значение;
			
			КИ = Идентификатор01 + Идентификатор21;
			
			ЗаписьXML.ЗаписатьНачалоЭлемента("last_ki");
			ЗаписьXML.ЗаписатьСекциюCDATA(КИ);
			ЗаписьXML.ЗаписатьКонецЭлемента();
			
		КонецЕсли;
		
		// Код ТНВЭД
		Если ЭтоВозвратДистанционный ИЛИ ЭтоВозвратРозница Тогда
			ЗаписьТекстаВФайл(ЗаписьXML, "tnved_code_10", ТекущаяСтрока.КодТНВЭД.Код);
		КонецЕсли;
		
		СтруктураМаркировки = ОбъектШК.РазобратьСтрокуШтрихкодаGS1(ТекущаяСтрока.КодМаркировкиНовый);
		
		Если НЕ СтруктураМаркировки.Разобран Тогда
			Продолжить;
		КонецЕсли;
		
		Идентификатор01 = "01" + СтруктураМаркировки.ДанныеШтрихкода["01"].Значение;
		// Замена по специфике csv
		Идентификатор21 = "21" + СтруктураМаркировки.ДанныеШтрихкода["21"].Значение;
		
		КИ = Идентификатор01 + Идентификатор21;
		
		ЗаписьXML.ЗаписатьНачалоЭлемента("new_ki");
		ЗаписьXML.ЗаписатьСекциюCDATA(КИ);
		ЗаписьXML.ЗаписатьКонецЭлемента();
		
		ЗаписьТекстаВФайл(ЗаписьXML, "remark_date", Формат(Документ.Дата, "ДФ=dd.MM.yyyy"));
		
		Если ЭтоВозвратДистанционный ИЛИ ЭтоВозвратРозница Тогда
			
			Оплачен = "";
			Если ТекущаяСтрока.Оплачен = "Да" Тогда
				Оплачен = "true";
			Иначе
				Оплачен = "false";
			КонецЕсли;
			
			ЗаписьТекстаВФайл(ЗаписьXML, "paid", Оплачен);
			
			Если ТекущаяСтрока.Оплачен = "Да" ИЛИ ЭтоВозвратРозница Тогда
				ВидДокумента = УправлениеКодамиМаркировкиКлиентСервер.ВидПервичногоДокумента(ТекущаяСтрока.ВидПервичногоДокумента);
				
				ЗаписьТекстаВФайл(ЗаписьXML, "primary_document_type", ВидДокумента);
				ЗаписьТекстаВФайл(ЗаписьXML, "primary_document_custom_name", ТекущаяСтрока.НаименованиеПервичногоДокумента);
				ЗаписьТекстаВФайл(ЗаписьXML, "primary_document_number", ТекущаяСтрока.НомерПервичногоДокумента);
				ЗаписьТекстаВФайл(ЗаписьXML, "primary_document_date", Формат(ТекущаяСтрока.ДатаПервичногоДокумента, "ДФ=dd.MM.yyyy"));
			КонецЕсли;
		КонецЕсли;
		
		ВидДокумента = УправлениеКодамиМаркировкиКлиентСервер.ВидДокументаСоответствия(
			ТекущаяСтрока.ВидДокументаРегистрации);
			
		Если ЗначениеЗаполнено(ВидДокумента) Тогда
			ЗаписьТекстаВФайл(ЗаписьXML, "certificate_type", ВидДокумента);
		КонецЕсли;
		
		Если ЗначениеЗаполнено(ТекущаяСтрока.НомерДокументаСоответствия) Тогда
			ЗаписьТекстаВФайл(ЗаписьXML, "certificate_number", ТекущаяСтрока.НомерДокументаСоответствия);
		КонецЕсли;
		
		Если ЗначениеЗаполнено(ТекущаяСтрока.ДатаДокументаСоответствия) Тогда
			ЗаписьТекстаВФайл(ЗаписьXML, "certificate_date", Формат(ТекущаяСтрока.ДатаДокументаСоответствия, "ДФ=dd.MM.yyyy"));
		КонецЕсли;
		
	КонецЦикла;
	
	ЗаписьXML.ЗаписатьКонецЭлемента();
	ЗаписьXML.ЗаписатьКонецЭлемента();
	ЗаписьXML.ЗаписатьКонецЭлемента();
	
	ЗаписьXML.Закрыть();
	
	// Из-за специфики работы записи нужно удалить лишнее
	ТекстовыйДокумент = Новый ТекстовыйДокумент;
	ТекстовыйДокумент.Прочитать(ИмяФайла);
	ТекстФайла = ТекстовыйДокумент.ПолучитьТекст();
	ТекстФайла = СтрЗаменить(ТекстФайла, "<last_ki>" + Символы.ПС, "<last_ki>");
	ТекстФайла = СтрЗаменить(ТекстФайла, "<new_ki>" + Символы.ПС, "<new_ki>");
	
	Пока СтрНайти(ТекстФайла, "	<![CDATA") > 0 Цикл
		ТекстФайла = СтрЗаменить(ТекстФайла, "	<![CDATA", "<![CDATA");
	КонецЦикла;
	
	ТекстовыйДокумент.УстановитьТекст(ТекстФайла);
	ТекстовыйДокумент.Записать(ИмяФайла);
	
	Сообщить("Сформирован файл: " + ИмяФайла);
	
	ФайлСформирован = Истина;
	
КонецПроцедуры // ОтправкаЗапросаПеремаркировки()

Процедура ОтправкаЗапросаВыводаИзОборота(Документ, ФайлСформирован)
	
	ПричинаВывода = УправлениеКодамиМаркировкиКлиентСервер.ПричинаВыводаИзОборотаCSV(Документ.ПричинаВывода);
	
	Если НЕ ЗначениеЗаполнено(ПричинаВывода) Тогда
		Возврат;
	КонецЕсли;
	
	// Получим путь для записи файла
	ИмяФайла = 
		"Вывод_из_оборота_" + Документ.Номер
		+ "_" + СтрЗаменить(Формат(ТекущаяДатаСеанса(), "ДФ=yyyy.MM.dd"), ".", "_");
	
	Если НЕ ПолучениеКаталогаФайлов(ИмяФайла, "csv", "(*.csv)|*.csv") Тогда
		Возврат;
	КонецЕсли;
	
	ВидПервичногоДокумента = УправлениеКодамиМаркировкиКлиентСервер.ВидПервичногоДокументаCSV(Документ.ВидПервичногоДокумента);
	
	НаименованиеПервичногоДокумента = "";
	Если Документ.ВидПервичногоДокумента = Перечисления.ВидыПервичныхДокументов.Прочее Тогда
		НаименованиеПервичногоДокумента = Документ.НаименованиеПервичногоДокумента;
	КонецЕсли;
	
	ТекстовыйФайл = Новый ТекстовыйДокумент();
	
	ТекстовыйФайл.ДобавитьСтроку(
		"ИНН участника оборота,Причина вывода из оборота,Дата вывода из оборота,Тип первичного документа,"
		+ "Номер первичного документа,Дата первичного документа,Наименование первичного документа,"
		+ "Регистрационный номер ККТ,Версия");
	ТекстовыйФайл.ДобавитьСтроку(
		СтрШаблон("%1,%2,%3,%4,%5,%6,%7,%8,%9",
			СокрЛП(Документ.Организация.ИНН),
			ПричинаВывода,
			Формат(Документ.ДатаВыводаИзОборота, "ДФ=dd.MM.yyyy"),
			ВидПервичногоДокумента,
			Документ.НомерПервичногоДокумента,
			Формат(Документ.ДатаПервичногоДокумента, "ДФ=dd.MM.yyyy"),
			НаименованиеПервичногоДокумента,
			"",
			"4"));
	ТекстовыйФайл.ДобавитьСтроку("Параметры товаров,,,,,");
	ТекстовыйФайл.ДобавитьСтроку("КИ,Цена за единицу,Тип первичного документа,Номер первичного документа,"
		+ "Дата первичного документа,Наименование первичного документа");
	
	ОбъектШК = Обработки.ШтрихКоды.Создать();
	Для Каждого ТекущаяСтрока Из Документ.КодыМаркировки Цикл
		
		СтруктураМаркировки = ОбъектШК.РазобратьСтрокуШтрихкодаGS1(ТекущаяСтрока.КодМаркировки);
		
		Если НЕ СтруктураМаркировки.Разобран Тогда
			Продолжить;
		КонецЕсли;
		
		Идентификатор01 = "01" + СтруктураМаркировки.ДанныеШтрихкода["01"].Значение;
		// Замена по специфике csv
		Идентификатор21 = "21" + СтруктураМаркировки.ДанныеШтрихкода["21"].Значение;
		
		КИ = Идентификатор01 + Идентификатор21;
		КИ = СтрЗаменить(КИ, """", """""");
		
		// Параметры по ТЧ Товары
		НайденнаяСтрока = Документ.Товары.Найти(ТекущаяСтрока.ИдентификаторТовара, "ИдентификаторТовара");
		
		Цена = СтрЗаменить(Строка(НайденнаяСтрока.Цена * 100), Символы.НПП, "");
		
		ВидПервичногоДокумента = "";
		НомерПервичногоДокумента = "";
		ДатаПервичногоДокумента = "";
		НаименованиеПервичногоДокумента = "";
		Если ЗначениеЗаполнено(НайденнаяСтрока.ВидПервичногоДокумента) Тогда
			ВидПервичногоДокумента = УправлениеКодамиМаркировкиКлиентСервер.ВидПервичногоДокументаCSV(НайденнаяСтрока.ВидПервичногоДокумента);
			НомерПервичногоДокумента = НайденнаяСтрока.НомерПервичногоДокумента;
			ДатаПервичногоДокумента = Формат(НайденнаяСтрока.ДатаПервичногоДокумента, "ДФ=dd.MM.yyyy");
			Если НайденнаяСтрока.ВидПервичногоДокумента = Перечисления.ВидыПервичныхДокументов.Прочее Тогда
				НаименованиеПервичногоДокумента = НайденнаяСтрока.НаименованиеПервичногоДокумента;
			КонецЕсли;
		КонецЕсли;
		
		ТекстовыйФайл.ДобавитьСтроку(
			СтрШаблон(
				"%1,%2,%3,%4,%5,%6",
				"""" + КИ + """",
				Цена,
				ВидПервичногоДокумента,
				НомерПервичногоДокумента,
				ДатаПервичногоДокумента,
				НаименованиеПервичногоДокумента));
		
	КонецЦикла;
	
	ТекстовыйФайл.УстановитьТекст(СтрЗаменить(ТекстовыйФайл.ПолучитьТекст() + Символы.ПС, Символы.ПС + Символы.ПС, ""));
	ТекстовыйФайл.Записать(ИмяФайла, КодировкаТекста.UTF8);
	
	Сообщить("Сформирован файл: " + ИмяФайла);
	
	ФайлСформирован = Истина;
	
КонецПроцедуры // ОтправкаЗапросаВыводаИзОборота()

Процедура ОтправкаЗапросаСписанияКодаМаркировки(Документ, ФайлСформирован)
	
	ПричинаСписания = УправлениеКодамиМаркировкиКлиентСервер.ПричинаСписанияКодаМаркировки(Документ.ПричинаСписания);
	
	Если НЕ ЗначениеЗаполнено(ПричинаСписания) Тогда
		Возврат;
	КонецЕсли;
	
	// Получим путь для записи файла
	ИмяФайла = 
		"Списание_кодов_маркировки_" + Документ.Номер
		+ "_" + СтрЗаменить(Формат(ТекущаяДатаСеанса(), "ДФ=yyyy.MM.dd"), ".", "_");
	Если НЕ ПолучениеКаталогаФайлов(ИмяФайла) Тогда
		Возврат;
	КонецЕсли;
	
	// Сформируем файл
	ЗаписьXML = Новый ЗаписьXML();
	ЗаписьXML.ОткрытьФайл(ИмяФайла, "UTF-8");
	ЗаписьXML.ЗаписатьОбъявлениеXML();
	
	// Заполним данными документа 
	ЗаписьXML.ЗаписатьНачалоЭлемента("km_cancellation");
	ЗаписьXML.ЗаписатьАтрибут("action_id", "14");
	ЗаписьXML.ЗаписатьАтрибут("version", "2");
	
	ЗаписьТекстаВФайл(ЗаписьXML, "trade_participant_inn",  СокрЛП(Документ.Организация.ИНН));
	ЗаписьТекстаВФайл(ЗаписьXML, "cancellation_reason", ПричинаСписания);
	ЗаписьТекстаВФайл(ЗаписьXML, "cancellation_document_date", Формат(Документ.Дата, "ДФ=dd.MM.yyyy"));
	ЗаписьТекстаВФайл(ЗаписьXML, "cancellation_document_number", Документ.Номер);
	
	ЗаписьXML.ЗаписатьНачалоЭлемента("km_list");
	
	ОбъектШК = Обработки.ШтрихКоды.Создать();
	
	Для Каждого ТекущаяСтрока Из Документ.Товары Цикл
		
		СтруктураМаркировки = ОбъектШК.РазобратьСтрокуШтрихкодаGS1(ТекущаяСтрока.КодМаркировки);
		
		Если НЕ СтруктураМаркировки.Разобран Тогда
			Продолжить;
		КонецЕсли;
		
		// Заполнение ТЧ Товары
		ЗаписьXML.ЗаписатьНачалоЭлемента("km");
		
		Идентификатор01 = "01" + СтруктураМаркировки.ДанныеШтрихкода["01"].Значение;
		// Замена по специфике csv
		Идентификатор21 = "21" + СтруктураМаркировки.ДанныеШтрихкода["21"].Значение;
		
		КИ = Идентификатор01 + Идентификатор21;
		
		ЗаписьXML.ЗаписатьНачалоЭлемента("kit");
		ЗаписьXML.ЗаписатьСекциюCDATA(КИ);
		ЗаписьXML.ЗаписатьКонецЭлемента();
		
		ПричинаСписания = УправлениеКодамиМаркировкиКлиентСервер.ПричинаСписанияКодаМаркировки(ТекущаяСтрока.ПричинаСписания);
		
		Если НЕ ЗначениеЗаполнено(ПричинаСписания) Тогда
			Возврат;
		КонецЕсли;
		
		ЗаписьТекстаВФайл(ЗаписьXML, "cancellation_reason", ПричинаСписания);
		
		ЗаписьXML.ЗаписатьКонецЭлемента();
		
	КонецЦикла;
	
	ЗаписьXML.ЗаписатьКонецЭлемента();
	ЗаписьXML.ЗаписатьКонецЭлемента();
	
	ЗаписьXML.Закрыть();
	
	// Из-за специфики работы записи нужно удалить лишнее
	ТекстовыйДокумент = Новый ТекстовыйДокумент;
	ТекстовыйДокумент.Прочитать(ИмяФайла);
	ТекстФайла = ТекстовыйДокумент.ПолучитьТекст();
	ТекстФайла = СтрЗаменить(ТекстФайла, "<kit>" + Символы.ПС, "<kit>");
	
	Пока СтрНайти(ТекстФайла, "	<![CDATA") > 0 Цикл
		ТекстФайла = СтрЗаменить(ТекстФайла, "	<![CDATA", "<![CDATA");
	КонецЦикла;
	
	ТекстовыйДокумент.УстановитьТекст(ТекстФайла);
	ТекстовыйДокумент.Записать(ИмяФайла);
	
	Сообщить("Сформирован файл: " + ИмяФайла);
	
	ФайлСформирован = Истина;
	
КонецПроцедуры

Процедура ОтправкаЗапросаВозвратаВОборот(Документ, ФайлСформирован)
	
	ВидВозврата = УправлениеКодамиМаркировкиКлиентСервер.ВидВозвратаВОборотCSV(Документ.ВидВозврата);
	
	Если НЕ ЗначениеЗаполнено(ВидВозврата) Тогда
		Возврат;
	КонецЕсли;
	
	// Получим путь для записи файла
	ИмяФайла = 
		"Возврат_в_оборот_кодов_маркировки_" + Документ.Номер
		+ "_" + СтрЗаменить(Формат(ТекущаяДатаСеанса(), "ДФ=yyyy.MM.dd"), ".", "_");
	
	Если НЕ ПолучениеКаталогаФайлов(ИмяФайла, "csv", "(*.csv)|*.csv") Тогда
		Возврат;
	КонецЕсли;
	
	ВидПервичногоДокумента = УправлениеКодамиМаркировкиКлиентСервер.ВидПервичногоДокументаCSV(Документ.ВидПервичногоДокумента);
	ВидДокументаРегистрации = УправлениеКодамиМаркировкиКлиентСервер.ВидДокументаСоответствияCSV(Документ.ВидДокументаРегистрации);
	
	ТекстовыйФайл = Новый ТекстовыйДокумент();
	
	ТекстовыйФайл.ДобавитьСтроку(
		"ИНН участника оборота,Вид возврата,Оплачен покупателем,Тип первичного "
		+ "документа,Наименование первичного документа,Номер первичного "
		+ "документа,Дата первичного документа,Вид документа подтверждающего "
		+ "соответствие,Номер документа подтверждающего соответствие,Дата документа "
		+ "подтверждающего соответствие,Версия");
	
	СтрокаДокумента = СтрШаблон(
		"%1,%2,%3,%4,%5,%6,%7,%8,%9,",
		СокрЛП(Документ.Организация.ИНН),
		ВидВозврата,
		?(ЗначениеЗаполнено(Документ.ТоварОплачен), ?(Документ.ТоварОплачен = "Да", "Да", "Нет"), ""),
		ВидПервичногоДокумента,
		?(Документ.ВидПервичногоДокумента = Перечисления.ВидыПервичныхДокументов.Прочее, Документ.НаименованиеПервичногоДокумента, ""),
		Документ.НомерПервичногоДокумента,
		Формат(Документ.ДатаПервичногоДокумента, "ДФ=dd.MM.yyyy"),
		ВидДокументаРегистрации,
		?(ЗначениеЗаполнено(ВидДокументаРегистрации) И ЗначениеЗаполнено(Документ.НомерДокументаСоответствия), Документ.НомерДокументаСоответствия, ""));
		
	СтрокаДокументаПродолжение = СтрШаблон(
		"%1,%2",
		?(ЗначениеЗаполнено(ВидДокументаРегистрации) И ЗначениеЗаполнено(Документ.ДатаПервичногоДокумента), Формат(Документ.ДатаПервичногоДокумента, "ДФ=dd.MM.yyyy"), ""),
		1);
	
	ТекстовыйФайл.ДобавитьСтроку(СтрокаДокумента + СтрокаДокументаПродолжение);
	
	ТекстовыйФайл.ДобавитьСтроку("Параметры товаров,,,,,,,,,,");
	
	ТекстовыйФайл.ДобавитьСтроку(
		"КИ,Оплачен покупателем,Тип первичного документа,Наименование первичного "
		+ "документа,Номер первичного документа,Дата первичного документа,Вид "
		+ "документа подтверждающего соответствие,Номер документа подтверждающего "
		+ "соответствие,Дата документа подтверждающего соответствие,,");
		
	ОбъектШК = Обработки.ШтрихКоды.Создать();
	Для Каждого ТекущаяСтрока Из Документ.Товары Цикл
		
		СтруктураМаркировки = ОбъектШК.РазобратьСтрокуШтрихкодаGS1(ТекущаяСтрока.КодМаркировки);
		
		Если НЕ СтруктураМаркировки.Разобран Тогда
			Продолжить;
		КонецЕсли;
		
		Идентификатор01 = "01" + СтруктураМаркировки.ДанныеШтрихкода["01"].Значение;
		// Замена по специфике csv
		Идентификатор21 = "21" + СтруктураМаркировки.ДанныеШтрихкода["21"].Значение;
		
		КИ = Идентификатор01 + Идентификатор21;
		КИ = СтрЗаменить(КИ, """", """""");
		
		ВидДокументаТовара = "";
		Если ЗначениеЗаполнено(ТекущаяСтрока.ВидПервичногоДокумента) Тогда
			ВидДокументаТовара = УправлениеКодамиМаркировкиКлиентСервер.ВидПервичногоДокументаCSV(ТекущаяСтрока.ВидПервичногоДокумента);
		КонецЕсли;
		
		ВидДокументаРегистрации = УправлениеКодамиМаркировкиКлиентСервер.ВидДокументаСоответствия(ТекущаяСтрока.ВидДокументаРегистрации);
		
		ТекстовыйФайл.ДобавитьСтроку(
			СтрШаблон("%1,%2,%3,%4,%5,%6,%7,%8,%9,,",
				"""" + КИ + """",
				?(ЗначениеЗаполнено(ТекущаяСтрока.ТоварОплачен), ?(ТекущаяСтрока.ТоварОплачен = "Да", "Да", "Нет"), ""),
				ВидДокументаТовара,
				?(ТекущаяСтрока.ВидПервичногоДокумента = Перечисления.ВидыПервичныхДокументов.Прочее, ТекущаяСтрока.НаименованиеПервичногоДокумента, ""),
				?(ЗначениеЗаполнено(ТекущаяСтрока.НомерПервичногоДокумента), ТекущаяСтрока.НомерПервичногоДокумента, ""),
				?(ЗначениеЗаполнено(ТекущаяСтрока.ДатаПервичногоДокумента), Формат(ТекущаяСтрока.ДатаПервичногоДокумента, "ДФ=dd.MM.yyyy"), ""),
				ВидДокументаРегистрации,
				?(ЗначениеЗаполнено(ВидДокументаРегистрации), ТекущаяСтрока.НомерДокументаСоответствия, ""),
				?(ЗначениеЗаполнено(ВидДокументаРегистрации), Формат(ТекущаяСтрока.ДатаДокументаСоответсвия, "ДФ=dd.MM.yyyy"), "")));
		
	КонецЦикла;
	
	ТекстовыйФайл.УстановитьТекст(СтрЗаменить(ТекстовыйФайл.ПолучитьТекст() + Символы.ПС, Символы.ПС + Символы.ПС, ""));
	ТекстовыйФайл.Записать(ИмяФайла, КодировкаТекста.UTF8);
	
	Сообщить("Сформирован файл: " + ИмяФайла);
	
	ФайлСформирован = Истина;
	
КонецПроцедуры

Процедура ЗагрузитьКодыМаркировкиЧерезФайл(Документ, МассивКодовМаркировки)
	
	ДиалогВыбора = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	ДиалогВыбора.Заголовок = "Выберите файл с кодами маркировки";
	ДиалогВыбора.Фильтр = "Все файлы (*.csv)|*.csv";
	
	Если НЕ ДиалогВыбора.Выбрать() Тогда
		Возврат;
	КонецЕсли;
	
	ТекстовыйФайл = Новый ТекстовыйДокумент();
	ТекстовыйФайл.Прочитать(ДиалогВыбора.ПолноеИмяФайла, КодировкаТекста.UTF8);
	СписокКодовМаркировок = ТекстовыйФайл.ПолучитьТекст();
	
	МассивКодовМаркировки = СтрРазделить(СписокКодовМаркировок, Символы.ПС, Ложь);
	
	ОписаниеОшибки = "";
	УправлениеКодамиМаркировкиВызовСервера.ЗаписатьКодыМаркировкиВРегистр(
		Документ.Ссылка,
		Документ.Товары,
		МассивКодовМаркировки,
		Перечисления.СостоянияКодовМаркировки.Эмитирован,
		ОписаниеОшибки,
		Истина);
	
	Если ОписаниеОшибки <> "" Тогда
		ОписаниеОшибки = "Ошибки при загрузке кодов маркировки:" + ОписаниеОшибки;
		Сообщить(ОписаниеОшибки);
	КонецЕсли;
	
	Сообщить("Загрузка кодов маркировки завершена.");
	
КонецПроцедуры

#КонецОбласти
