
Функция PartGet(PartGetRequest)
	// Вставить содержимое обработчика.
	PartGetType = ФабрикаXDTO.Тип("http://wa.dms.webservice/PartsGetRequest", "PartsGetResponse");
	PartGet = ФабрикаXDTO.Создать(PartGetType);   
	
	ТаблицаОщибок = Новый ТаблицаЗначений;
	ТаблицаОщибок.Колонки.Добавить("Код",	 Новый ОписаниеТипов("Строка"));
	ТаблицаОщибок.Колонки.Добавить("ТекстОшибки",		 Новый ОписаниеТипов("Строка"));     	

    Попытка
		НомерЗаказНаряда = PartGetRequest.PartsGet.DMSRONo;
	Исключение
		НомерЗаказНаряда = "";	    
	КонецПопытки;   	
	Попытка
		IDЗаказНаряда = PartGetRequest.PartsGet.DMSROID;
	Исключение
		IDЗаказНаряда = "";
	КонецПопытки;  
    Попытка
		Артикул = PartGetRequest.PartsGet.PartNumber;
	Исключение
		Артикул = "";
	КонецПопытки;       
	Попытка
		Описание = PartGetRequest.PartsGet.PartDescription;
	Исключение
		Описание = "";
	КонецПопытки;     
    Попытка
		МодельКод = PartGetRequest.PartsGet.Model;
	Исключение
		МодельКод = "";
	КонецПопытки;     
	
	Если ЗначениеЗаполнено(IDЗаказНаряда) Тогда
		Попытка
			ID = Новый УникальныйИдентификатор(IDЗаказНаряда);
		Исключение
			НоваяСтрока = ТаблицаОщибок.Добавить();
			НоваяСтрока.Код = "PG01";
			НоваяСтрока.ТекстОшибки = "Некорректный ID Заказ-наряда";
			PartGet = обПолучитьВозвратWAError("http://wa.dms.webservice/PartsGetRequest", PartGetRequest, PartGet, "-1", ТаблицаОщибок);
			Возврат PartGet;   
		КонецПопытки;
		ЗаказНарядСсылка = Документы.ЗаказНаряд.ПолучитьСсылку(ID);
	ИначеЕсли ЗначениеЗаполнено(НомерЗаказНаряда) Тогда
		ЗаказНарядСсылка = Документы.ЗаказНаряд.НайтиПоНомеру(НомерЗаказНаряда, ТекущаяДата());
    	Если обЗначениеНеЗаполнено(ЗаказНарядСсылка) Тогда		
			НоваяСтрока = ТаблицаОщибок.Добавить();
			НоваяСтрока.Код = "PG01";
			НоваяСтрока.ТекстОшибки = "Заказ-наряд с указанным номером не найден";
			PartGet = обПолучитьВозвратWAError("http://wa.dms.webservice/PartsGetRequest", PartGetRequest, PartGet, "-1", ТаблицаОщибок);
			Возврат PartGet;   
		КонецЕсли;		
	Иначе
		НоваяСтрока = ТаблицаОщибок.Добавить();
		НоваяСтрока.Код = "PG01";
		НоваяСтрока.ТекстОшибки = "Не указаны номер и ID Заказ-наряда";
		PartGet = обПолучитьВозвратWAError("http://wa.dms.webservice/PartsGetRequest", PartGetRequest, PartGet, "-1", ТаблицаОщибок);
		Возврат PartGet;   
	КонецЕсли;		
	Если ЗаказНарядСсылка.ПолучитьОбъект() = Неопределено Тогда
		НоваяСтрока = ТаблицаОщибок.Добавить();
		НоваяСтрока.Код = "PG01";
		НоваяСтрока.ТекстОшибки = "Заказ-наряд с указанным идентификатором не найден";
		PartGet = обПолучитьВозвратWAError("http://wa.dms.webservice/PartsGetRequest", PartGetRequest, PartGet, "-1", ТаблицаОщибок);
		Возврат PartGet;   
	КонецЕсли;	
	
	Если обЗначениеНеЗаполнено(Артикул) И обЗначениеНеЗаполнено(Описание) Тогда
		НоваяСтрока = ТаблицаОщибок.Добавить();
		НоваяСтрока.Код = "WA03";
		НоваяСтрока.ТекстОшибки = "Не задано ни одного параметра для поиска";
		PartGet = обПолучитьВозвратWAError("http://wa.dms.webservice/PartsGetRequest", PartGetRequest, PartGet, "-1", ТаблицаОщибок);
		Возврат PartGet;   
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Артикул) Тогда
		Если СтрДлина(Артикул) < 3 Тогда
			НоваяСтрока = ТаблицаОщибок.Добавить();
			НоваяСтрока.Код = "PG01";
			НоваяСтрока.ТекстОшибки = "Для поиска по артикулу должно быть не менее 3 символов";
			PartGet = обПолучитьВозвратWAError("http://wa.dms.webservice/PartsGetRequest", PartGetRequest, PartGet, "-1", ТаблицаОщибок);
			Возврат PartGet;   
		КонецЕсли;    
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Описание) Тогда
		Если СтрДлина(Описание) < 3 Тогда
			НоваяСтрока = ТаблицаОщибок.Добавить();
			НоваяСтрока.Код = "PG02";
			НоваяСтрока.ТекстОшибки = "Для поиска по наименованию должно быть не менее 3 символов";
			PartGet = обПолучитьВозвратWAError("http://wa.dms.webservice/PartsGetRequest", PartGetRequest, PartGet, "-1", ТаблицаОщибок);
			Возврат PartGet;   
		КонецЕсли;    
	КонецЕсли;
	
	МодельСсылка = Справочники.Модели.ПустаяСсылка();
	Если ЗначениеЗаполнено(МодельКод) Тогда
		//МодельСсылка = Справочники.Модели.НайтиПоКоду("ЦБ00003644/" + МодельКод, Истина);
		ГруппаХендэ = Справочники.Модели.НайтиПоКоду("ЦБ00003644");
		Если ЗначениеЗаполнено(ГруппаХендэ) Тогда
			МодельСсылка = Справочники.Модели.НайтиПоРеквизиту("КодМодели", МодельКод, ГруппаХендэ);
		Иначе
			МодельСсылка = Справочники.Модели.НайтиПоРеквизиту("КодМодели", МодельКод);
		КонецЕсли;
		//Если обЗначениеНеЗаполнено(МодельСсылка) Тогда
		//	НоваяСтрока = ТаблицаОщибок.Добавить();
		//	НоваяСтрока.Код = "WA03";
		//	НоваяСтрока.ТекстОшибки = "Модель автомобиля с указанным кодом не найдена";
		//	PartGet = обПолучитьВозвратWAError("http://wa.dms.webservice/PartsGetRequest", PartGetRequest,PartGet, "-1", ТаблицаОщибок);
		//	Возврат PartGet;    
		//КонецЕсли;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Параметры.Вставить("Подразделение", ЗаказНарядСсылка.ПодразделениеКомпании);
	Запрос.Параметры.Вставить("ТипЦен", Справочники.ТипыЦен.ОсновнойТипЦенПродажи);
	Если ЗначениеЗаполнено(МодельСсылка) Тогда
    	Запрос.Параметры.Вставить("МодельСсылка", МодельСсылка);
	КонецЕсли;
	Если ЗначениеЗаполнено(Артикул) Тогда
		Запрос.Параметры.Вставить("Артикул", "%" + Артикул + "%");
	КонецЕсли;   
	Если ЗначениеЗаполнено(Описание) Тогда
		Запрос.Параметры.Вставить("Фрагмент", "%" + Описание + "%");
	КонецЕсли;
	
	// выборка по применяемости
	Если ЗначениеЗаполнено(МодельСсылка) Тогда
		Запрос.Текст = "ВЫБРАТЬ
		               |	НоменклатураПрименяемость.Номенклатура КАК Ссылка,
		               |	НоменклатураПрименяемость.Номенклатура.Код КАК Код,
		               |	НоменклатураПрименяемость.Номенклатура.Наименование КАК Наименование,
		               |	НоменклатураПрименяемость.Номенклатура.Артикул КАК Артикул,
		               |	ЦеныСрезПоследних.Цена КАК Цена,
		               |	ВЫБОР
		               |		КОГДА ОстаткиТоваровКомпанииОстатки.КоличествоОстаток ЕСТЬ NULL
		               |			ТОГДА 0
		               |		ИНАЧЕ ОстаткиТоваровКомпанииОстатки.КоличествоОстаток - ЕСТЬNULL(ОстаткиТоваровКомпанииОстатки.РезервОстаток, 0)
		               |	КОНЕЦ КАК СвободныйОстаток
		               |ИЗ
		               |	РегистрСведений.НоменклатураПрименяемость КАК НоменклатураПрименяемость
		               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.Цены.СрезПоследних(
		               |				,
		               |				ПодразделениеКомпании = &Подразделение
		               |					И ТипЦен = &ТипЦен) КАК ЦеныСрезПоследних
		               |		ПО НоменклатураПрименяемость.Номенклатура = ЦеныСрезПоследних.Номенклатура
		               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ОстаткиТоваровКомпании.Остатки(, СкладКомпании.Подразделение = &Подразделение) КАК ОстаткиТоваровКомпанииОстатки
		               |		ПО НоменклатураПрименяемость.Номенклатура = ОстаткиТоваровКомпанииОстатки.Номенклатура
		               |ГДЕ
		               |	НоменклатураПрименяемость.Модель = &МодельСсылка
					   |    " + ?(ЗначениеЗаполнено(Артикул), "И НоменклатураПрименяемость.Номенклатура.Артикул ПОДОБНО &Артикул", "") + "
		               |	" + ?(ЗначениеЗаполнено(Описание), "И НоменклатураПрименяемость.Номенклатура.Наименование ПОДОБНО &Фрагмент", "") + "
		               |
		               |УПОРЯДОЧИТЬ ПО
		               |	НоменклатураПрименяемость.Номенклатура.Наименование";
				
	Иначе
		Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 200
		               |	Ном.Ссылка КАК Ссылка,
		               |	Ном.Код КАК Код,
		               |	Ном.Наименование КАК Наименование,
		               |	Ном.Артикул КАК Артикул,
		               |	ЦеныСрезПоследних.Цена КАК Цена,
		               |	ВЫБОР
		               |		КОГДА ОстаткиТоваровКомпанииОстатки.КоличествоОстаток ЕСТЬ NULL
		               |			ТОГДА 0
		               |		ИНАЧЕ ОстаткиТоваровКомпанииОстатки.КоличествоОстаток - ЕСТЬNULL(ОстаткиТоваровКомпанииОстатки.РезервОстаток, 0)
		               |	КОНЕЦ КАК СвободныйОстаток
		               |ИЗ
		               |	Справочник.Номенклатура КАК Ном
		               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.Цены.СрезПоследних(
		               |				,
		               |				ПодразделениеКомпании = &Подразделение
		               |					И ТипЦен = &ТипЦен) КАК ЦеныСрезПоследних
		               |		ПО Ном.Ссылка = ЦеныСрезПоследних.Номенклатура
		               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ОстаткиТоваровКомпании.Остатки(, СкладКомпании.Подразделение = &Подразделение) КАК ОстаткиТоваровКомпанииОстатки
		               |		ПО Ном.Ссылка = ОстаткиТоваровКомпанииОстатки.Номенклатура
		               |ГДЕ
		               |	НЕ Ном.ЭтоГруппа
					   |    " + ?(ЗначениеЗаполнено(Артикул),"И Ном.Артикул ПОДОБНО &Артикул", "") + "
		               |	" + ?(ЗначениеЗаполнено(Описание),"И Ном.Наименование ПОДОБНО &Фрагмент", "") + " 
		               |
		               |УПОРЯДОЧИТЬ ПО
		               |	Ном.Наименование";
		
	КонецЕсли;
	Выборка = Запрос.Выполнить().Выбрать();
	
	// по применяемости ничего не найдено
    Если Выборка.Количество() = 0 Тогда                         		
		Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 200
		               |	Ном.Ссылка КАК Ссылка,
		               |	Ном.Код КАК Код,
		               |	Ном.Наименование КАК Наименование,
		               |	Ном.Артикул КАК Артикул,
		               |	ЦеныСрезПоследних.Цена КАК Цена,
		               |	ВЫБОР
		               |		КОГДА ОстаткиТоваровКомпанииОстатки.КоличествоОстаток ЕСТЬ NULL
		               |			ТОГДА 0
		               |		ИНАЧЕ ОстаткиТоваровКомпанииОстатки.КоличествоОстаток - ЕСТЬNULL(ОстаткиТоваровКомпанииОстатки.РезервОстаток, 0)
		               |	КОНЕЦ КАК СвободныйОстаток
		               |ИЗ
		               |	Справочник.Номенклатура КАК Ном
		               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.Цены.СрезПоследних(
		               |				,
		               |				ПодразделениеКомпании = &Подразделение
		               |					И ТипЦен = &ТипЦен) КАК ЦеныСрезПоследних
		               |		ПО Ном.Ссылка = ЦеныСрезПоследних.Номенклатура
		               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ОстаткиТоваровКомпании.Остатки(, СкладКомпании.Подразделение = &Подразделение) КАК ОстаткиТоваровКомпанииОстатки
		               |		ПО Ном.Ссылка = ОстаткиТоваровКомпанииОстатки.Номенклатура
		               |ГДЕ
		               |	НЕ Ном.ЭтоГруппа
					   |    " + ?(ЗначениеЗаполнено(Артикул),"И Ном.Артикул ПОДОБНО &Артикул", "") + "
		               |	" + ?(ЗначениеЗаполнено(Описание),"И Ном.Наименование ПОДОБНО &Фрагмент", "") + " 
		               |
		               |УПОРЯДОЧИТЬ ПО
		               |	Ном.Наименование";

 		Выборка = Запрос.Выполнить().Выбрать();
	КонецЕсли;

    Если Выборка.Количество() = 0 Тогда                         		
		PartGet = обПолучитьВозвратWAError("http://wa.dms.webservice/PartsGetRequest", PartGetRequest, PartGet, "0", ТаблицаОщибок);
		Возврат PartGet;    	
	Иначе		
		PartsType = ФабрикаXDTO.Тип("http://wa.dms.webservice/PartsGetRequest", "ArrayOfPart");
		Parts = ФабрикаXDTO.Создать(PartsType); 	
		PartType = ФабрикаXDTO.Тип("http://wa.dms.webservice/PartsGetRequest", "Part");
        		
		Пока Выборка.Следующий() Цикл
			Номенклатура = Выборка.Ссылка;
			PartType = ФабрикаXDTO.Тип("http://wa.dms.webservice/PartsGetRequest", "Part");
			Part = ФабрикаXDTO.Создать(PartType);
			Part.Manufacturer = "";
			Part.PartNumber = Выборка.Артикул; 
			Part.PartDescription = Выборка.Наименование; 
			Part.Make = "";
			Part.PartStatus = ""; 
			Part.PartType = ?(Выборка.Код = Выборка.Артикул, "2", "1");
			
			Если Выборка.СвободныйОстаток = 0 Тогда
				Part.QuantityOnHand = "0";
				Part.StockQuantity = "N";
				Part.StockStatus = "";
			Иначе        		
				Part.QuantityOnHand = Формат(Выборка.СвободныйОстаток, "ЧЦ=7; ЧДЦ=2; ЧРД=.; ЧГ=0");
				Part.StockQuantity = ?(Выборка.СвободныйОстаток > 0, "Y", "N");
				//Part.StockStatus = Формат(Выбор.СвободныйОстаток - Выбор.МинимальныйОстаток, "ЧЦ=7; ЧДЦ=2; ЧРД=.; ЧГ=0");
				Part.StockStatus = Формат(Выборка.СвободныйОстаток, "ЧЦ=7; ЧДЦ=2; ЧРД=.; ЧГ=0");
			КонецЕсли;  					

			Part.DisplayPartNumber = Выборка.Артикул; 
			Part.Remarks = "";    					
			Part.UnitOfMeasure = Номенклатура.ОсновнаяЕдиницаИзмерения.Наименование;
			Part.Quantity = "0";
			Part.ServiceType = ""; 
			Part.DisplayRemarks = "";
			Part.MandatoryYN = "";
			
			PriceType = ФабрикаXDTO.Тип("http://wa.dms.webservice/PartsGetRequest", "PriceType");
			Price = ФабрикаXDTO.Создать(PriceType);
			//// Продажа Без НДС
			//UnitPrice = обПолучитьЦену(Справочники.ТипыЦен.НайтиПоКоду("ЦБ000005"), Номенклатура,,, ЗаказНарядСсылка.ВалютаДокумента,,,, ЗаказНарядСсылка.ПодразделениеКомпании);
			//Если обЗначениеНеЗаполнено(UnitPrice) Тогда
			//	UnitPrice = обПолучитьЦену(Справочники.ТипыЦен.ОсновнойТипЦенПродажи, Номенклатура,,, ЗаказНарядСсылка.ВалютаДокумента,,,, ЗаказНарядСсылка.ПодразделениеКомпании);
			//КонецЕсли;   						
			Price.UnitPrice = Формат(Выборка.Цена, "ЧЦ=15; ЧДЦ=2; ЧРД=.; ЧГ=0");
			Price.TotalPrice = Формат(Выборка.Цена, "ЧЦ=15; ЧДЦ=2; ЧРД=.; ЧГ=0");
			Price.TotalPriceIncludeTax = Формат(Выборка.Цена, "ЧЦ=15; ЧДЦ=2; ЧРД=.; ЧГ=0");
			Price.DiscountRate = "0";
			Price.DiscountPrice = "0";  
			         
			Part.PriceType = Price;   			 			
			Parts.Part.Добавить(Part);
		КонецЦикла;
    КонецЕсли;    		

    PartGet.Parts = Parts;
	PartGet = обПолучитьВозвратWAError("http://wa.dms.webservice/PartsGetRequest",PartGetRequest,PartGet,"1",ТаблицаОщибок);
	Возврат PartGet;                                
КонецФункции
