// Процедура получения дерева документов
// ДеревоДокументов - ДеревоЗначений ,  результат выполнения процедуры
// Использует Реквизит Отчета - ВыбранныйДокумент - ссылка на выбранный документ
//
// Параметр:
// ДеревоДокументов		- ДеревоЗначений	- Дерево документов
//
Процедура ПолучитьДеревоДокументов(ДеревоДокументов, ВыбДокумент) Экспорт
	
	ТаблицаКонтроляПовтора = Новый Массив;
	ДеревоДокументов.Строки.Очистить();
	ДеревоДокументов.Колонки.Очистить();
	Если ВыбДокумент  =  Неопределено Тогда
		Возврат;			
	КонецЕсли; 
	МассивТипов  =  Новый Массив;
	Для Каждого Документ Из Метаданные.Документы Цикл
		МассивТипов.Добавить(Тип("ДокументСсылка."+Документ.Имя));    	
	КонецЦикла;
	ОписаниеТиповДок  =  Новый ОписаниеТипов(МассивТипов ,  ,  , );
	ОписаниеТиповДата = Новый ОписаниеТипов("Дата");
	ДеревоДокументов.Колонки.Добавить("ВидДокумента" ,  , "Операция" , 40);
	ДеревоДокументов.Колонки.Добавить("Номер" ,  , "Номер" , 11);
	ДеревоДокументов.Колонки.Добавить("Дата" , ОписаниеТиповДата , "Дата" , 10);
	ДеревоДокументов.Колонки.Добавить("Организация" ,  , "Организация" , 15);
	ДеревоДокументов.Колонки.Добавить("Подразделение" ,  , "Подразделение" , 15);
	ДеревоДокументов.Колонки.Добавить("Автор" ,  , "Автор" , 15);	
	ДеревоДокументов.Колонки.Добавить("СуммаДокумента" ,  , "Сумма" , );	
	ДеревоДокументов.Колонки.Добавить("Документ" , ОписаниеТиповДок , "Документ" , 1);	
	ТаблицаКонтроляПовтора.Добавить(ВыбДокумент);
	
	// Трояновский К.Е. 30.07.2019 13:16:36 {
	//ДокКорень = ?(ТипЗнч(ВыбДокумент) = Тип("ДокументСсылка.Renault_Договор"), ВыбДокумент, ПолучитьКореньДокумента(ВыбДокумент, ТаблицаКонтроляПовтора, ОписаниеТиповДок));
	Если ТипЗнч(ВыбДокумент) = Тип("ДокументСсылка.Renault_Договор") 
			И ТипЗнч(ВыбДокумент.РабочийЛист) = Тип("ДокументСсылка.Renault_РабочийЛист") 
			И ВыбДокумент.РабочийЛист <> Документы.Renault_РабочийЛист.ПустаяСсылка() Тогда 
		ДокКорень = ВыбДокумент.РабочийЛист;	
	ИначеЕсли ТипЗнч(ВыбДокумент) = Тип("ДокументСсылка.Renault_Договор") Тогда		
		ДокКорень = ВыбДокумент;		
	Иначе
		ДокКорень = ПолучитьКореньДокумента(ВыбДокумент, ТаблицаКонтроляПовтора, ОписаниеТиповДок);
	КонецЕсли;	
	// Трояновский К.Е. 30.07.2019 13:16:36 }
	
	СтрокаДерева = ДеревоДокументов.Строки.Добавить();
	СтрокаДерева.Документ		= ДокКорень;
	СтрокаДерева.ВидДокумента	= ДокКорень.Метаданные().Синоним;
	СтрокаДерева.Дата			= ДокКорень.Дата;
	СтрокаДерева.Номер			= ДокКорень.Номер;
	Если Метаданные.Документы[ДокКорень.Метаданные().Имя].Реквизиты.Найти("Организация") <> Неопределено Тогда
		СтрокаДерева.Организация = ДокКорень.Организация;
	КонецЕсли;
	Если Метаданные.Документы[ДокКорень.Метаданные().Имя].Реквизиты.Найти("ПодразделениеКомпании") <> Неопределено Тогда
		СтрокаДерева.Подразделение = ДокКорень.ПодразделениеКомпании;
	КонецЕсли;
	Если Метаданные.Документы[ДокКорень.Метаданные().Имя].Реквизиты.Найти("Автор") <> Неопределено Тогда
		СтрокаДерева.Автор = ДокКорень.Автор;
	КонецЕсли;		
	Если Метаданные.Документы[ДокКорень.Метаданные().Имя].Реквизиты.Найти("СуммаДокумента") <> Неопределено Тогда
		СтрокаДерева.СуммаДокумента = ДокКорень.СуммаДокумента;
	КонецЕсли;
	ТаблицаКонтроляПовтора = Новый Массив;
	Если ТипЗнч(ДокКорень)<>Тип("ДокументСсылка.Renault_Договор") Тогда
		ТаблицаКонтроляПовтора.Добавить(ДокКорень);
	КонецЕсли;
	ДобавитьВДерево(СтрокаДерева , ТаблицаКонтроляПовтора, ДокКорень);
	
КонецПроцедуры // ПолучитьДеревоДокументов()

//функция, получения ссылки на корень дерева документов
//
// Параметр:
//	Док		- ДокументСсылка	- Переданный документ
//
// Возвращаемое значение:
//	ДокументСсылка		- Корень документа
//
Функция ПолучитьКореньДокумента(Док, ТаблицаКонтроляПовтора, ОписаниеТиповДок)
	Перем ЗнРеквизит; // Значение реквизита
	
	Если ТипЗнч(Док) = Тип("ДокументСсылка.ЗаказНаАвтомобиль") Тогда
		
		 Запрос = Новый Запрос;
		 Запрос.Текст = "ВЫБРАТЬ
		 |	Renault_ДоговорСоставДоговора.Ссылка
		 |ИЗ
		 |	Документ.Renault_Договор.СоставДоговора КАК Renault_ДоговорСоставДоговора
		 |ГДЕ
		 |	Renault_ДоговорСоставДоговора.ЗаказНаАвтомобиль = &ЗаказНаАвтомобиль";
		 
		 Запрос.УстановитьПараметр("ЗаказНаАвтомобиль", Док);
		 
		 Результат = Запрос.Выполнить();
		 Выборка = Результат.Выбрать();
		 
		 Пока Выборка.Следующий() Цикл
		 
		 	  Возврат  Выборка.Ссылка;
		 
		 КонецЦикла;
		
	 КонецЕсли;
	 
	 Если ТипЗнч(Док) = Тип("ДокументСсылка.ЗаказНаряд") Тогда
		
		 Запрос = Новый Запрос;
		 Запрос.Текст = "ВЫБРАТЬ
		                |	Renault_CRM_ЗаявкаНаСервис.Ссылка
		                |ИЗ
		                |	Документ.Renault_CRM_ЗаявкаНаСервис КАК Renault_CRM_ЗаявкаНаСервис
		                |ГДЕ
		                |	Renault_CRM_ЗаявкаНаСервис.ЗаказНаряд = &ЗаказНаряд";
		 
		 Запрос.УстановитьПараметр("ЗаказНаряд", Док);
		 
		 Результат = Запрос.Выполнить();
		 Выборка = Результат.Выбрать();
		 
		 Пока Выборка.Следующий() Цикл
		 
		 	  Возврат  Выборка.Ссылка;
		 
		 КонецЦикла;
		
	КонецЕсли;

	ЗнРеквизит  =  Неопределено;
	ВидДок  =  Док.Метаданные().Имя;
	
	//обходим реквизиты в поисках подходящего корня
	Для Каждого Реквизит Из Метаданные.Документы[ВидДок].Реквизиты Цикл
		ЗнРеквизит  =  Док[Реквизит.Имя];
		Если ПроверкаПодчиненияРеквизиту(Док,ЗнРеквизит,ТаблицаКонтроляПовтора, ОписаниеТиповДок) Тогда
			Возврат ПолучитьКореньДокумента(ЗнРеквизит, ТаблицаКонтроляПовтора, ОписаниеТиповДок);		
		КонецЕсли;
	КонецЦикла; 
	
	//если в реквизитах ничего не было найдено, обходим реквизиты табличных частей
	//перебираем все ТЧ
	Для Каждого ТЧ Из Метаданные.Документы[ВидДок].ТабличныеЧасти Цикл
		//перебираем все строки ТЧ
		Для ИндексСтроки = 0 По Док[ТЧ.Имя].Количество()-1 Цикл
			//перебираем все реквизиты строки
			Для Каждого РеквизитТЧ Из ТЧ.Реквизиты Цикл
				ИмяРеквизитТЧ  =  Метаданные.Документы[ВидДок].ТабличныеЧасти[ТЧ.Имя].Реквизиты[РеквизитТЧ.Имя];
				ЗнРеквизит =  Док[ТЧ.Имя][ИндексСтроки][ИмяРеквизитТЧ.Имя];
				Если ПроверкаПодчиненияРеквизиту(Док,ЗнРеквизит,ТаблицаКонтроляПовтора, ОписаниеТиповДок) Тогда
					Возврат ПолучитьКореньДокумента(ЗнРеквизит, ТаблицаКонтроляПовтора, ОписаниеТиповДок);		
				КонецЕсли;
			КонецЦикла;
		КонецЦикла;
	КонецЦикла; 
	
	Возврат Док;
	
КонецФункции // ПолучитьКореньДокумента()

//обход дерева документов и добавление в дерево
//
// Параметр:
//	Строка			- Массив			- Массив строк			
//	ДокументКорень	- ДокументСсылка	- Документ корень
//
Процедура ДобавитьВДерево(Строка, ТаблицаКонтроляПовтора, ДокументКорень)
	
	ТекстЗапроса = ПолучитьТекстЗапроса(ДокументКорень);
	
	Запрос = Новый Запрос(ТекстЗапроса);
		
	Запрос.УстановитьПараметр("Основание", ДокументКорень);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Если НЕ (ТаблицаКонтроляПовтора.Найти(Выборка.Документ) = Неопределено) Тогда
			Продолжить;
		КонецЕсли;
		СтрокаДерева = Строка.Строки.Добавить();
		ТаблицаКонтроляПовтора.Добавить(Выборка.Документ);
		текДок = Выборка.Документ;
		СтрокаДерева.Документ = текДок;
		СтрокаДерева.ВидДокумента = текДок.Метаданные().Синоним;
		СтрокаДерева.Дата = текДок.Дата;
		СтрокаДерева.Номер = текДок.Номер;
		Если Метаданные.Документы[текДок.Метаданные().Имя].Реквизиты.Найти("Организация") <> Неопределено Тогда
			СтрокаДерева.Организация = текДок.Организация;
		КонецЕсли;
		Если Метаданные.Документы[текДок.Метаданные().Имя].Реквизиты.Найти("ПодразделениеКомпании") <> Неопределено Тогда
			СтрокаДерева.Подразделение = текДок.ПодразделениеКомпании;
		КонецЕсли;
		Если Метаданные.Документы[текДок.Метаданные().Имя].Реквизиты.Найти("Менеджер") <> Неопределено Тогда
			СтрокаДерева.Автор = текДок.Менеджер;
		КонецЕсли;	
		Если Метаданные.Документы[текДок.Метаданные().Имя].Реквизиты.Найти("Автор") <> Неопределено Тогда
			СтрокаДерева.Автор = текДок.Автор;
		КонецЕсли;		
		Если Метаданные.Документы[текДок.Метаданные().Имя].Реквизиты.Найти("СуммаДоговора") <> Неопределено Тогда
			СтрокаДерева.СуммаДокумента = текДок.СуммаДоговора;
		КонецЕсли;
		Если Метаданные.Документы[текДок.Метаданные().Имя].Реквизиты.Найти("СуммаДокумента") <> Неопределено Тогда
			СтрокаДерева.СуммаДокумента = текДок.СуммаДокумента;
		КонецЕсли;	
		
		ДобавитьВДерево(СтрокаДерева, ТаблицаКонтроляПовтора, текДок);

	КонецЦикла;
КонецПроцедуры // ДобавитьВДерево()

//функция проверяет, может ли документ являться подчиненным реквизиту
//
// Параметр:
//	Док		- ДокументСсылка	- Переданный документ
//	Док		- Реквизит			- Переданный реквизит
//
// Возвращаемое значение:
//	Булево						- Результат проверки
//
Функция ПроверкаПодчиненияРеквизиту(ДокументСсылка,ЗнРеквизит, ТаблицаКонтроляПовтора, ОписаниеТиповДок)
		
	Если (ЗнРеквизит <> Неопределено) И  (ОписаниеТиповДок.СодержитТип(ТипЗнч(ЗнРеквизит))) Тогда
		Если (ЗнРеквизит<>Документы[ЗнРеквизит.Метаданные().Имя].ПустаяСсылка()) И (ЗнРеквизит<>ДокументСсылка) Тогда
			
			//проверка на дубль
			Если НЕ (ТаблицаКонтроляПовтора.Найти(ЗнРеквизит) = Неопределено) Тогда
				Возврат Ложь;
			КонецЕсли;
			
			//проверка, что текущий документ может быть подчиненным для предполагаемого корня 
			ТекстЗапроса = "ВЫБРАТЬ
			               |	ПодчиненныеДокументы.Ссылка КАК Документ
			               |ИЗ
			               |	КритерийОтбора.Renault_ПодчиненныеДокументы(&Основание) КАК ПодчиненныеДокументы
			               |ГДЕ
			               |	ПодчиненныеДокументы.Ссылка = &ДокументСсылка";
			Запрос = Новый Запрос(ТекстЗапроса);
			Запрос.УстановитьПараметр("Основание",ЗнРеквизит);
			Запрос.УстановитьПараметр("ДокументСсылка",ДокументСсылка);
			Выборка = Запрос.Выполнить().Выбрать();
			Если Выборка.Количество() > 0 Тогда
				Возврат Истина;	
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	Возврат Ложь;
КонецФункции // ПолучитьКореньДокумента()

Функция ПолучитьТекстЗапроса(ДокументКорень)
	
	ТекстЗапроса = "";
	
	Для Каждого Элемент Из Метаданные.КритерииОтбора.Renault_ПодчиненныеДокументы.Состав Цикл
		Если Элемент.Тип.СодержитТип(ТипЗнч(ДокументКорень)) Тогда
			ПолноеИмя = Элемент.ПолноеИмя();
			Позиция = Найти(ПолноеИмя, ".Реквизит.");
			ТаблицаОбъекта = Лев(ПолноеИмя, Позиция-1);
			ИмяРеквизита   = Сред(ПолноеИмя, Позиция+10);
			
			ПутьКДате = "";
			Если Найти(ТаблицаОбъекта, ".ТабличнаяЧасть.")>0 Тогда
				ПутьКДате = "Ссылка.Дата";
				ТаблицаОбъекта = СтрЗаменить(ТаблицаОбъекта, ".ТабличнаяЧасть.", ".");
			Иначе
				ПутьКДате = "Дата";
			КонецЕсли;
			
			ТекстЗапроса = ТекстЗапроса + ?(ТекстЗапроса = "", "" , "
			|	ОБЪЕДИНИТЬ ВСЕ
			|") + "
			|	ВЫБРАТЬ
			|		ТаблицаОбъекта.Ссылка КАК Документ,
			|		ТаблицаОбъекта."+ПутьКДате+" КАК Дата
			|	ИЗ
			|		"+ТаблицаОбъекта+" КАК ТаблицаОбъекта
			|	ГДЕ
			|		ТаблицаОбъекта."+ИмяРеквизита+" = &Основание
			|";
		//
		КонецЕсли;
	КонецЦикла;
		
	Если Типзнч(ДокументКорень) = Тип("ДокументСсылка.Renault_Договор") Тогда
		
		ТекстЗапроса = ТекстЗапроса + ?(ТекстЗапроса = "", "" , "
			|	ОБЪЕДИНИТЬ ВСЕ
			|") + "
			|ВЫБРАТЬ
			|	ВЫБОР КОГДА Renault_ДоговорСоставДоговора.ЗаказНаАвтомобиль = Значение(Документ.ЗаказНаАвтомобиль.ПустаяСсылка) ТОГДА
			|        Renault_ДоговорСоставДоговора.РеализацияАвтомобиля
			|        ИНАЧЕ Renault_ДоговорСоставДоговора.ЗаказНаАвтомобиль КОНЕЦ КАК Документ,
			|	ВЫБОР КОГДА Renault_ДоговорСоставДоговора.ЗаказНаАвтомобиль = Значение(Документ.ЗаказНаАвтомобиль.ПустаяСсылка) ТОГДА
			|        Renault_ДоговорСоставДоговора.РеализацияАвтомобиля.Дата
			|        ИНАЧЕ Renault_ДоговорСоставДоговора.ЗаказНаАвтомобиль.Дата КОНЕЦ КАК Дата
			|ИЗ
			|	Документ.Renault_Договор.СоставДоговора КАК Renault_ДоговорСоставДоговора
			|ГДЕ
			|	Renault_ДоговорСоставДоговора.Ссылка = &Основание
			|    И (ВЫБОР КОГДА Renault_ДоговорСоставДоговора.ЗаказНаАвтомобиль = Значение(Документ.ЗаказНаАвтомобиль.ПустаяСсылка) ТОГДА
			|        Renault_ДоговорСоставДоговора.РеализацияАвтомобиля
			|        ИНАЧЕ Renault_ДоговорСоставДоговора.ЗаказНаАвтомобиль КОНЕЦ) <> Значение(Документ.РеализацияАвтомобилей.ПустаяСсылка)
			|";
			
	ИначеЕсли Типзнч(ДокументКорень) = Тип("ДокументСсылка.Renault_CRM_ЗаявкаНаСервис") Тогда

			ТекстЗапроса = ТекстЗапроса + ?(ТекстЗапроса = "", "" , "
			|	ОБЪЕДИНИТЬ ВСЕ
			|") + "
			|ВЫБРАТЬ
			|	Renault_CRM_ЗаявкаНаСервис.ЗаказНаряд КАК Документ,
			|	Renault_CRM_ЗаявкаНаСервис.ЗаказНаряд.Дата КАК Дата
			|ИЗ
			|	Документ.Renault_CRM_ЗаявкаНаСервис КАК Renault_CRM_ЗаявкаНаСервис
			|ГДЕ
			|	Renault_CRM_ЗаявкаНаСервис.Ссылка = &Основание
			|   И Renault_CRM_ЗаявкаНаСервис.ЗаказНаряд <> ЗНАЧЕНИЕ(Документ.ЗаказНаряд.ПустаяСсылка)
			|";

	ИначеЕсли Типзнч(ДокументКорень) = Тип("ДокументСсылка.ЗаказНаАвтомобиль") Тогда
		
		ТекстЗапроса = ТекстЗапроса + ?(ТекстЗапроса = "", "" , "
			|	ОБЪЕДИНИТЬ ВСЕ
			|") + "
			|ВЫБРАТЬ
			|     Renault_ДоговорСоставДоговора.РеализацияАвтомобиля КАК Документ,
			|     Renault_ДоговорСоставДоговора.РеализацияАвтомобиля.Дата КАК Дата
			|ИЗ
			|	Документ.Renault_Договор.СоставДоговора КАК Renault_ДоговорСоставДоговора
			|ГДЕ
			|	Renault_ДоговорСоставДоговора.ЗаказНаАвтомобиль = &Основание
			|   И Renault_ДоговорСоставДоговора.РеализацияАвтомобиля <> Значение(Документ.РеализацияАвтомобилей.ПустаяСсылка)
			|";
		
	// Трояновский К.Е. 30.07.2019 15:21:12 {
	
	ИначеЕсли Типзнч(ДокументКорень) = Тип("ДокументСсылка.Renault_РабочийЛист") Тогда
		
		ТекстЗапроса = ТекстЗапроса + ?(ТекстЗапроса = "", "" , "
			|	ОБЪЕДИНИТЬ ВСЕ
			|") + "
			|ВЫБРАТЬ
			|	Renault_Договор.Ссылка КАК Документ,
			|	Renault_Договор.Дата КАК Дата
			|ИЗ
			|	Документ.Renault_Договор КАК Renault_Договор
			|ГДЕ
			|	Renault_Договор.РабочийЛист = &Основание
			|";
	// Трояновский К.Е. 30.07.2019 15:21:12 }
	
	Иначе					
	КонецЕсли;
	
	Если НЕ ТекстЗапроса = "" Тогда
		ТекстЗапроса = "
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ПодчиненныеДокументы.Документ КАК Документ,
		|	ПодчиненныеДокументы.Дата КАК ДатаДокумента
		|ИЗ
		|	("+ТекстЗапроса+") КАК ПодчиненныеДокументы
		|УПОРЯДОЧИТЬ ПО
		|	ПодчиненныеДокументы.Дата";
	КонецЕсли;
	
	Возврат ТекстЗапроса;
	
КонецФункции
