#Если Клиент Тогда
Перем ОписаниеТиповДок; // Описание типов документов
Перем ТаблицаКонтроляПовтора;

// Выводит дерево документов на форму
// Параметры:
//	дзДок - дерево для вывода
//
Процедура ВывестиДеревоДокументов(дзДок) Экспорт
	ФормаОтчета = ЭтотОбъект.ПолучитьФорму("Форма");
	Таб = ФормаОтчета.ЭлементыФормы["ПолеТабличногоДокументаДерево"];
	Таб.Очистить();
	Макет = ЭтотОбъект.ПолучитьМакет("ДеревоДокументов");
	Область = Макет.ПолучитьОбласть("Кнопки");
	Таб.Вывести(Область);
	ГлубинаДерева = 0;
	ПолучитьГлубинуДерева(ДеревоДокументов,0,ГлубинаДерева);
	спУровни = Новый Массив();
	Для К = 1 По ГлубинаДерева Цикл
		спУровни.Вставить(К,0);
	КонецЦикла; 
	Корень = дзДок.Строки[0];
	Если ГлубинаДерева > 1 Тогда
		спУровни[1] = 1;	
	КонецЕсли;
	Если Корень.Документ = ВыбДокумент Тогда
		Область = Макет.ПолучитьОбласть("КореньТекДок");
	Иначе
		Область = Макет.ПолучитьОбласть("Заголовок");
	КонецЕсли;
	Документ = Корень.Документ;
	Область.Параметры.Расшифровка	= Новый Структура("Документ" , Документ);
	Попытка
		Если ТипЗнч(Документ) = Тип("ДокументСсылка.Renault_Договор") Тогда
			СтрокаСумма = ?(Документ.СуммаДоговора = 0,"",Символы.ПС + "Сумма: " + Документ.СуммаДоговора + " Руб");
		Иначе
			СтрокаСумма = ?(Документ.СуммаДокумента = 0,"",Символы.ПС + "Сумма: " + Документ.СуммаДокумента + " " + Документ.ВалютаДокумента);
		КонецЕсли;	
	Исключение
		СтрокаСумма = "";
	КонецПопытки; 
	Область.Параметры.ПечДок		= Корень.ВидДокумента + " № "+СокрЛП(Документ.Номер) + " от "+Формат(Документ.Дата,"ДФ=dd.MM.yyyy hh:mm:ss") + СтрокаСумма;
	Область.Параметры.Док			= Документ;
	Область.Рисунки[0].Картинка		= ?(Документ.ПометкаУдаления, БиблиотекаКартинок.ДокументПомеченНаУдаление, ?(Документ.Проведен, БиблиотекаКартинок.ДокументПроведен, БиблиотекаКартинок.ДокументНеПроведен));
	Таб.Вывести(Область);
	
	Для Каждого Строка Из Корень.Строки Цикл
		ВывестиСтрокуДерева(дзДок,Строка,Макет,Таб,1,спУровни);
	КонецЦикла;
	
	Таб.ТолькоПросмотр		= ИСТИНА;
	Таб.ОтображатьСетку		= ЛОЖЬ;
	Таб.ОтображатьЗаголовки	= Ложь;
	Если НЕ ФормаОтчета.Открыта() Тогда
		ФормаОтчета.Открыть();
	КонецЕсли;
КонецПроцедуры // ВывестиДеревоДокументов()

// Процедура форматирования дерева значений
// ПолеДеревоЗначений - ПолеДеревоЗначений ,  объект в который выводятся данные
//
// Параметр:
//	ПолеДеревоЗначений	- ДеревоЗначений	- Объект вывода данных
//
Процедура НастроитьПолеДеревоДокументов(ПолеДеревоЗначений = Неопределено) Экспорт
	Если ПолеДеревоЗначений = Неопределено Тогда
		ПолеДеревоЗначений = ЭтотОбъект.ПолучитьФорму().ЭлементыФормы["ПолеДеревоДокументов"];		
	КонецЕсли;
	ПолеДеревоЗначений.СоздатьКолонки();
	ПолеДеревоЗначений.Колонки.ВидДокумента.КартинкиСтрок = БиблиотекаКартинок.ккМаркеры;
	ПолеДеревоЗначений.Колонки.Дата.Формат = "ДЛФ=Д";
	ПолеДеревоЗначений.НачальноеОтображениеДерева = НачальноеОтображениеДерева.РаскрыватьВсеУровни;
	ПолеДеревоЗначений.Колонки.Дата.ИзменениеРазмера = ИзменениеРазмераКолонки.НеИзменять;
	ПолеДеревоЗначений.Колонки.Номер.ИзменениеРазмера = ИзменениеРазмераКолонки.НеИзменять;
	Если ПолеДеревоЗначений.Колонки.Найти("Документ")<>Неопределено Тогда
		ПолеДеревоЗначений.Колонки.Документ.Видимость = Ложь;
		ПолеДеревоЗначений.Колонки.Номер.ГоризонтальноеПоложениеВКолонке = ГоризонтальноеПоложение.Лево;
	КонецЕсли;
	СтрокаВыбранногоДокумента = ДеревоДокументов.Строки.Найти(ВыбДокумент, "Документ", Истина);
	ПолеДеревоЗначений.ТекущаяСтрока = СтрокаВыбранногоДокумента;
КонецПроцедуры // НастроитьПолеДеревоДокументов()


//функция, получает максимальную глубину дерева документов
//
// Параметр:
//	Дерево			- ДеревоЗначений	- Дерево
//	ТекГлубина		- Число				- Текущая глубина
//	ГлубинаДерева	- Число				- Глубина дерева
//
// Возвращаемое значение:
// Число			- Максимальная глубина дерева
//
Функция ПолучитьГлубинуДерева(Дерево, ТекГлубина, ГлубинаДерева)
	ПредГлубина  =  ТекГлубина;
	Для Каждого Строка Из Дерево.Строки Цикл
		ТекГлубина  =  ПолучитьГлубинуДерева(Строка , ТекГлубина+1 , ГлубинаДерева);
	КонецЦикла;
	Если ПредГлубина < ТекГлубина Тогда
		ГлубинаДерева  =  ГлубинаДерева + 1;
	КонецЕсли;
	Возврат ТекГлубина;    	
КонецФункции // ПолучитьГлубинуДерева()

//обход дерева и печать элементов                     
//
// Параметр:
//	Дерево			- ДеревоЗначений	- Дерево
//	СтрокаДерева	- Структура			- Строка дерева
//	Макет           - ТабличныйДокумент - Макет
//	Таб             - ТабличныйДокумент - Табличный документ
//	Уровень         - Число				- Уровень
//	спУровни        - Число				- Уровни
//
Процедура ВывестиСтрокуДерева(Дерево, СтрокаДерева, Макет, Таб, Уровень, спУровни)
	Документ= СтрокаДерева.Документ;
	Область	= Макет.ПолучитьОбласть("ГрУгол|В");
	Таб.Вывести(Область);
	Для к = 1 По Уровень-1 Цикл
		Область	= Макет.ПолучитьОбласть(?(спУровни[к]=1,"ГрЛиния|Линии","ГрПуст|Линии"));
		Таб.Присоединить(Область);
	КонецЦикла;
	
	Если СтрокаДерева.Родитель.Строки.Индекс(СтрокаДерева)+1 = СтрокаДерева.Родитель.Строки.Количество() Тогда
		Область = Макет.ПолучитьОбласть("ГрУгол|Линии");
		спУровни[Уровень] = 0;
	Иначе
		Область = Макет.ПолучитьОбласть("ГрДвСекция|Линии");
		спУровни[Уровень] = 1;
	КонецЕсли;
	Таб.Присоединить(Область);
	
	Если Документ = ВыбДокумент Тогда
		Область = Макет.ПолучитьОбласть("ТекДок|Тело");
	Иначе
		Область = Макет.ПолучитьОбласть("Док|Тело");
	КонецЕсли;
	Область.Параметры.Расшифровка	= Новый Структура("Документ" , Документ);
	Попытка
		Если ТипЗнч(Документ) = Тип("ДокументСсылка.Renault_Договор") Тогда
			СтрокаСумма = ?(Документ.СуммаДоговора = 0,"",Символы.ПС + "Сумма: " + Документ.СуммаДоговора + " Руб");
		Иначе
			СтрокаСумма = ?(Документ.СуммаДокумента = 0,"",Символы.ПС + "Сумма: " + Документ.СуммаДокумента + " " + Документ.ВалютаДокумента);
		КонецЕсли;	
	Исключение
		СтрокаСумма = "";
	КонецПопытки; 
	Область.Параметры.ПечДок		= СтрокаДерева.ВидДокумента + " № "+СокрЛП(Документ.Номер) + " от "+Формат(Документ.Дата,"ДФ=dd.MM.yyyy hh:mm:ss") + СтрокаСумма;
	Область.Параметры.Док			= Документ;
	Область.Рисунки[0].Картинка		= ?(Документ.ПометкаУдаления, БиблиотекаКартинок.ДокументПомеченНаУдаление, ?(Документ.Проведен, БиблиотекаКартинок.ДокументПроведен, БиблиотекаКартинок.ДокументНеПроведен));
	Таб.Присоединить(Область);
	
	Для Каждого Строка Из СтрокаДерева.Строки Цикл
		ВывестиСтрокуДерева(Дерево, Строка, Макет, Таб, Уровень+1, спУровни);
	КонецЦикла;
КонецПроцедуры // ВывестиСтрокуДерева()

#КонецЕсли

ТаблицаКонтроляПовтора = Новый Массив;