
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Объект.Заголовок="Пример графика";
	Объект.Подзаголовок="Текст подзаголовка";
	Обработки.Renault_AmCharts.ТипыГрафика(Элементы.Тип.СписокВыбора);
	Объект.Тип="pie";
	ЗаполнитьСерии();
	ОбновитьГрафик();
КонецПроцедуры

Процедура ОбновитьГрафик() html=РеквизитФормыВЗначение("Объект").ПолучитьHTML() КонецПроцедуры	

&НаКлиенте
Процедура ТипПриИзменении(Элемент) ОбновитьГрафик() КонецПроцедуры

Процедура ЗаполнитьСерии()
	Менеджер=Обработки.Renault_AmCharts;
	ИмяСерии="country";
	АктивнаяТочка=Менеджер.НоваяТочка(ИмяСерии,"Ireland",201);
	Менеджер.УстановитьАктивнуюТочку(Объект,АктивнаяТочка);
	
	Точки=Новый Массив;
	Точки.Добавить(Менеджер.НоваяТочка(ИмяСерии,"Lithuania",260));
	Точки.Добавить(АктивнаяТочка);
	Точки.Добавить(Менеджер.НоваяТочка(ИмяСерии,"Germany",65));
	Точки.Добавить(Менеджер.НоваяТочка(ИмяСерии,"Australia",39));
	Точки.Добавить(Менеджер.НоваяТочка(ИмяСерии,"UK",19));
	Точки.Добавить(Менеджер.НоваяТочка(ИмяСерии,"Latviae",10));

	Серия=Новый Структура("ИмяСерии,Точки",ИмяСерии,Точки);
	
	Серии=Новый Массив;
	Серии.Добавить(Серия);
	
	Объект.Серии=ЗначениеВСтрокуВнутр(Серии);
КонецПроцедуры