Перем МассивДанныхJSON;

Процедура СформироватьФайлДжейСонНаСервере() Экспорт
	
	ТаблицаСостав = Новый ТаблицаЗначений;
	ТаблицаСостав.Колонки.Добавить("ИмяТаблицы");
	ТаблицаСостав.Колонки.Добавить("ИмяТаблицыХранения");
	ТаблицаСостав.Колонки.Добавить("Метаданные");
	ТаблицаСостав.Колонки.Добавить("ИмяПоля");
	ТаблицаСостав.Колонки.Добавить("ИмяПоляХранения");
	ТаблицаСостав.Колонки.Добавить("ИмяПоляМетаданные");
	
	Сч = 0;
	
	СтруктураБД = ПолучитьСтруктуруХраненияБазыДанных();
 	
	Для каждого Стр Из СтруктураБД Цикл
		
		Сч = Сч + 1;
		
		//СМГ_Сообщить(СокрЛП(Сч)+"). ИмяТаблицыХранения = "+Стр.ИмяТаблицыХранения);
		
		ИмяПоля = "";
		ИмяПоляХранения = "";
		ИмяПоляМетаданные = "";
		
		ПоляКоличество = Стр.Поля.Количество();
		
		Для Счетчик = 0 По ПоляКоличество - 1 Цикл
			
			ИмяПоля = Стр.Поля[Счетчик].ИмяПоля;
			ИмяПоляХранения = Стр.Поля[Счетчик].ИмяПоляХранения;
			ИмяПоляМетаданные = Стр.Поля[Счетчик].Метаданные;
			
			НовСтрока                    = ТаблицаСостав.Добавить();

			НовСтрока.ИмяТаблицы         = Стр.ИмяТаблицы;
			НовСтрока.ИмяТаблицыХранения = Стр.ИмяТаблицыХранения;
            НовСтрока.Метаданные         = Стр.Метаданные;
			НовСтрока.ИмяПоля            = ИмяПоля;
			НовСтрока.ИмяПоляХранения    = ИмяПоляХранения;
            НовСтрока.ИмяПоляМетаданные  = ИмяПоляМетаданные;
			
 		КонецЦикла;
 		
	КонецЦикла;
	
	Для каждого Стр Из ТаблицаСостав Цикл
		
		СтруктураБазы = Новый Структура;
		
		СтруктураБазы.Вставить("TableName",СокрЛП(Стр.ИмяТаблицы)); 
		СтруктураБазы.Вставить("TableNameStock",СокрЛП(Стр.ИмяТаблицыХранения)); 
		СтруктураБазы.Вставить("TableMD",СокрЛП(Стр.Метаданные)); 
		СтруктураБазы.Вставить("FieldName",СокрЛП(Стр.ИмяПоля)); 
		СтруктураБазы.Вставить("FieldNameStock",СокрЛП(Стр.ИмяПоляХранения)); 
		СтруктураБазы.Вставить("FieldNameMD",СокрЛП(Стр.ИмяПоляМетаданные)); 
 		
 		МассивДанныхJSON.Добавить(СтруктураБазы);
 	
	КонецЦикла;
	
	ЗаписьJSON = Новый ЗаписьJSON;
	Попытка
 		ИФ = "L:\PowerBI";
		ЗаписьJSON.ОткрытьФайл(ИФ,,,Новый ПараметрыЗаписиJSON( ,Символы.Таб));
		ЗаписатьJSON(ЗаписьJSON,МассивДанныхJSON);
	Исключение
		Попытка
 			ИФ = "\\1C01\PowerBI\StructureBaseSokolMotors.json";
  			ЗаписьJSON.ОткрытьФайл(ИФ,,,Новый ПараметрыЗаписиJSON( ,Символы.Таб));
			ЗаписатьJSON(ЗаписьJSON,МассивДанныхJSON);
		Исключение
			СМГ_Сообщить("ОШИБКА! Не удалось записать файл : "+ИФ,СтатусСообщения.ОченьВажное);		
		КонецПопытки;
 	КонецПопытки;
	
 	СМГ_Сообщить("Выгрузка в файл <<"+ИФ+">> завершена: "+Формат(ТекущаяДата(),"ДЛФ=DDT"));
  	
КонецПроцедуры

МассивДанныхJSON = Новый Массив;