// процедура заполнения предопределенных элементов
//
// Параметры:
// ЗаполнятьВсе - Булево - Признак заполнение всей информации
//
Процедура ЗаполнитьПредопределенныеЭлементы(ЗаполнятьВсе=Ложь) Экспорт
	
	СписокРабот = Новый СписокЗначений;
	СписокРабот.Добавить(Справочники.Автоработы.Приемка);
	СписокРабот.Добавить(Справочники.Автоработы.Выдача);
	
	Для Каждого ТекЭлемент Из СписокРабот Цикл
		ТекРабота = ТекЭлемент.Значение;
		СвойствоВидИспользования = ПланыВидовХарактеристик.СвойстваОбъектов.ВидИспользованияАвтоработы;
		ВидИспользованияЗначениеСвойства = обПолучитьЗначениеСвойства(ТекРабота,СвойствоВидИспользования);
		Если НЕ ЗначениеЗаполнено(ВидИспользованияЗначениеСвойства) Тогда
			НаборЗаписейЗначенияСвойствОбъектов	= РегистрыСведений.ЗначенияСвойствОбъектов.СоздатьНаборЗаписей();
			НаборЗаписейЗначенияСвойствОбъектов.Отбор.Объект.Значение = ТекРабота;
			НаборЗаписейЗначенияСвойствОбъектов.Отбор.Объект.Использование = Истина;
			НаборЗаписейЗначенияСвойствОбъектов.Отбор.Свойство.Значение = СвойствоВидИспользования;
			НаборЗаписейЗначенияСвойствОбъектов.Отбор.Свойство.Использование = Истина;
			НаборЗаписейЗначенияСвойствОбъектов.Прочитать();
			НаборЗаписейЗначенияСвойствОбъектов.Очистить();
			НоваяЗапись = НаборЗаписейЗначенияСвойствОбъектов.Добавить();
			НоваяЗапись.Объект = ТекРабота;
			НоваяЗапись.Свойство = СвойствоВидИспользования;
			НоваяЗапись.Значение = Перечисления.ВидыИспользованияАвторабот.ПланированиеИПроизводство;
			Попытка
				НаборЗаписейЗначенияСвойствОбъектов.Записать();	
			Исключение
				Сообщить("Не удалось записать значение свойства  " + Строка(СвойствоВидИспользования) + " для " + Строка(ТекРабота), СтатусСообщения.Важное);	
			КонецПопытки;
		КонецЕсли;
		
		Объект = ТекРабота.ПолучитьОбъект();
		Объект.НаименованиеПолное = Объект.Наименование;
		Объект.Номенклатура = Справочники.Номенклатура.Авторабота;
		Объект.ОбменДанными.Загрузка = Истина;
		Попытка
			Объект.Записать();
		Исключение
			Сообщить("Ошибка обновления автоработы <"+Объект+">: "+ОписаниеОшибки());
		КонецПопытки; 
		
	КонецЦикла
	
КонецПроцедуры // ЗаполнитьПредопределенныеЭлементы()

//Бондаренко++ 20220403
Процедура СМГ_УстановитьФильтрРабот(ФормаВыбора,Владелец) Экспорт
  	СимволВолгодонск = Справочники.Организации.НайтиПоКоду("ЦБ000022");
	Если Владелец.Организация = СимволВолгодонск И Владелец.Дата > '2021.06.23' Тогда
		ГруппаRenault = Справочники.Автоработы.НайтиПоКоду("ЦБ0008937");
		ТекущийОтбор = ФормаВыбора.СправочникСписок.Отбор;
		ТекущийОтбор.Ссылка.ВидСравнения  = ВидСравнения.ВИерархии;
		ТекущийОтбор.Ссылка.Значение = ГруппаRenault;
		ТекущийОтбор.Ссылка.Использование = Истина;
		ФормаВыбора.ЭлементыФормы.Список.НастройкаОтбора.Ссылка.Доступность = Ложь;
	Иначе
		СписокПодключенныхПодразделений = Новый СписокЗначений();
 		ШахтыХендэ = Справочники.ПодразделенияКомпании.НайтиПоКоду("ЦБ001221");
		СписокПодключенныхПодразделений.Добавить(ШахтыХендэ);

		//Бондаренко++ 20220524
		ДельтаМоторс = Справочники.ПодразделенияКомпании.НайтиПоКоду("ЦБ001166");
		СписокПодключенныхПодразделений.Добавить(ДельтаМоторс);
  		//Бондаренко++ 20220524
		
		//Здесь будут добавляться другие подразделения
 		
 		СписокКузовныхВидовРемонта = Новый СписокЗначений();
		СписокКузовныхВидовРемонта.Добавить(Справочники.ВидыРемонта.КузовнойРемонт);
		СписокКузовныхВидовРемонта.Добавить(Справочники.ВидыРемонта.КузовнойКоммерческий);		
		Если СписокКузовныхВидовРемонта.НайтиПоЗначению(Владелец.ВидРемонта) = Неопределено Тогда
			 Если Владелец.Дата > '2022.05.01' Тогда
				Если СМГ_ПодразделениеВИерархии(Владелец.ПодразделениеКомпании,СписокПодключенныхПодразделений) Тогда
	        		ТекущийОтбор = ФормаВыбора.СправочникСписок.Отбор;
					ТекущийОтбор.Ссылка.ВидСравнения  = ВидСравнения.ВСписке;
					ТекущийОтбор.Ссылка.Значение = СМГ_ПолучитьСписокРабот(Владелец.Автомобиль.Модель);
					ТекущийОтбор.Ссылка.Использование = Истина;
					ФормаВыбора.ЭлементыФормы.Список.НастройкаОтбора.Ссылка.Доступность = Ложь;
 				КонецЕсли;
			 КонецЕсли; 
 		КонецЕсли;
 	КонецЕсли;
КонецПроцедуры 

Функция СМГ_ПодразделениеВИерархии(ТекущееПодразделение,СписокПодразделений) Экспорт
	
	фл_ПодразделениеВИерархии = Ложь;
 	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПодразделенияКомпании.Ссылка,
		|	ПодразделенияКомпании.Родитель
		|ИЗ
		|	Справочник.ПодразделенияКомпании КАК ПодразделенияКомпании
		|ГДЕ
		|	ПодразделенияКомпании.Родитель В (&СписокПодразделений)
		|	И ПодразделенияКомпании.Ссылка = &ТекущееПодразделение";
	
	Запрос.УстановитьПараметр("СписокПодразделений", СписокПодразделений);
	Запрос.УстановитьПараметр("ТекущееПодразделение", ТекущееПодразделение);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		фл_ПодразделениеВИерархии = Истина;
	КонецЦикла;
	
	Возврат фл_ПодразделениеВИерархии; 
 
КонецФункции // СМГ_ПодразделениеВИерархии(ТекущееПодразделение,СписокПодразделений)

Функция СМГ_ПолучитьСписокРабот(Модель) Экспорт
	
	   СЗ = Новый СписокЗначений();
	
	   Запрос = Новый Запрос();
	
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	АвтоработыНормыВремени.Модель,
		|	АвтоработыНормыВремени.Ссылка КАК Авторабота 
		|ИЗ
		|	Справочник.Автоработы.НормыВремени КАК АвтоработыНормыВремени
		|ГДЕ
		|	АвтоработыНормыВремени.Модель = &Модель";
		
		Запрос.УстановитьПараметр("Модель", Модель);
		
		СЗ.ЗагрузитьЗначения(Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Авторабота"));
		
		Возврат СЗ;

КонецФункции // СМГ_ПолучитьСписокРабот(Модель)
//Бондаренко-- 20220403