// Модуль справочника Автоработы

////////////////////////////////////////////////////////////////////////////////
// ПЕРЕМЕННЫЕ ОБЪЕКТА

Перем Права Экспорт;	// Переменная объекта - ссылка на коллекцию прав, настроек и переменных окружения
Перем ОбработкаЗначенияСвойствОбъектов Экспорт; // Переменная для хранения значения свойств основания/объекта копирования

////////////////////////////////////////////////////////////////////////////////
// ЭКСПОРТНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ ДОПОЛНИТЕЛЬНЫХ МЕТОДОВ ОБЪЕКТА

// Возвращает структуру обязательных / уникальных реквизитов элемента
// Если ДляЭлемента = Истина, возвращаемая структура содержит реквизиты для проверки элемента
// Если ДляГруппы = Истина, аналогично для группы
// Возвращаемая структура содержит строковые идентификаторы реквизитов или вложенные структуры для табличных частей
// Для реквизита значение структуры содержит число 1-Обязательный, 3-Уникальный
Функция ПолучитьОбязательныеРеквизиты(ДляЭлемента=Истина, ДляГруппы=Ложь) Экспорт
	ОбязательныеРеквизиты=Новый Структура();
	ОбязательныеРеквизиты.Вставить("Код",1);
	ОбязательныеРеквизиты.Вставить("Наименование",1);
	
	Если ДляЭлемента Тогда
		ОбязательныеРеквизиты.Вставить("Номенклатура", 1);
		ОбязательныеНормыВремени=Новый Структура();
		ОбязательныеНормыВремени.Вставить("Модель", 1);
		//ОбязательныеНормыВремени.Вставить("ВариантКомплектации", 2);
		ОбязательныеНормыВремени.Вставить("ВремяВыполнения", 1);
		ОбязательныеРеквизиты.Вставить("НормыВремени", ОбязательныеНормыВремени);
	КонецЕсли;
	
	Возврат ОбязательныеРеквизиты;
КонецФункции

// Проверяет корректность заполнения объекта.
// Возвращает Истина если все заполнено корректно и Ложь иначе.
// В случае некорректного заполнения формирует строку описанием возникших ошибок "Ошибки"
// На вход может быть передана структура ДопРеквизиты с дополнительными реквизитами для проверки
// может управляться булевыми флагами выполняемых проверок Заполнение, Уникальность
// (могут быть и другие необязательные)
// Обычно выполняется универсальным обработчиком, но могут быть добавлены доп. проверки
Функция ПроверитьКорректность(Ошибки="", ДопРеквизиты=Неопределено, Заполнение=Истина, Уникальность=Истина) Экспорт
	Возврат спПроверитьКорректность(ЭтотОбъект, Ошибки, ДопРеквизиты, Заполнение, Уникальность);
КонецФункции
 
// Функция проверяет, допустимо ли изменение объекта
// Возвращает Истина, если изменения возможны, ложь иначе
// Если изменения доступны частично, возвращает ложь и структуру блокируемых на изменение реквизитов,
Функция ДоступностьИзменения(БлокироватьРеквизиты=Неопределено) Экспорт
	Возврат Истина;
КонецФункции

// Обработка изменения реквизитов справочников
// Параметры
//  Имя			– Строка			– Имя реквизита справочника с полным путем.
//  ЭтаФорма	– Форма				– Ссылка на форму справочника. Если значение неопределено,
//									  производится программная обработка реквизитов.
//  ТекСтрока	– СтрокаТабличнойЧасти – Ссылка на строку табличной части справочника,
//									     реквизит которой обрабатывается.
//										 Имеет смысл только для табличных частей справочников.
//  ДопПараметры– Структура			– Структура, содержащая дополнительные параметры обработки реквизита.
// Возвращаемое значение:
//   Булево   – Результат выполнения обработки.
Функция ОбработкаРеквизита(Имя, ТекСтрока = Неопределено, ЭтаФорма = Неопределено, ДопПараметры = Неопределено) Экспорт
	// ОБРАБОТКА РЕКВИЗИТОВ СПРАВОЧНИКОВ
	Если Имя = "НормыВремени.Модель" Тогда
		Если ЗначениеЗаполнено(ТекСтрока.ВариантКомплектации) Тогда
			Если НЕ ТекСтрока.ВариантКомплектации.Владелец = ТекСтрока.Модель Тогда
				ТекСтрока.ВариантКомплектации = Справочники.Модели.ПустаяСсылка();
			КонецЕсли;
		КонецЕсли;
		Возврат Истина;
	ИначеЕсли Имя = "НормыВремени.ВариантКомплектации" Тогда
		Если ЗначениеЗаполнено(ТекСтрока.ВариантКомплектации) Тогда
			НоваяМодель = ТекСтрока.ВариантКомплектации.Владелец;
			Если НЕ НоваяМодель = ТекСтрока.Модель Тогда
				ТекСтрока.Модель = НоваяМодель;
			КонецЕсли;
		КонецЕсли;
		Возврат Истина;
	Иначе
		Возврат спОбработкаРеквизита(ЭтотОбъект,Имя,ТекСтрока,ЭтаФорма,ДопПараметры);
	КонецЕсли;
	
КонецФункции // ОбработкаРеквизита()

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ОБРАБОТЧИКИ СТАНДАРТНЫХ СОБЫТИЙ ОБЪЕКТА

// Стандартный обработчик заполнения при вводе нового на основании
Процедура ОбработкаЗаполнения(Основание) Экспорт
	Если НЕ спОбработкаЗаполнения(ЭтотОбъект, Основание) Тогда Возврат; КонецЕсли;
	
	Если ЭтоНовый() Тогда
		Номенклатура=ЭтотОбъект.Родитель.Номенклатура;
		Если (НЕ ЭтоГруппа) И (обЗначениеНеЗаполнено(Номенклатура)) Тогда
			Номенклатура=обПраво("АвтоработаПоУмолчанию",Права);
		КонецЕсли; 
	КонецЕсли; 
КонецПроцедуры

// Стандартный обработчик копирования объекта
Процедура ПриКопировании(ОбъектКопирования)
	Если НЕ спПриКопировании(ЭтотОбъект, ОбъектКопирования) Тогда Возврат; КонецЕсли;
КонецПроцедуры

// Стандартный обработчик ПередЗаписью элемента справочника
Процедура ПередЗаписью(Отказ)
	
 	Если НЕ спПередЗаписью(ЭтотОбъект, Отказ) Тогда Возврат; КонецЕсли;
	
	//Гэндальф+++
	Если ЭтоНовый() тогда
		Номенклатура = Справочники.Номенклатура.Авторабота;
	КонецЕсли;	
	//Гэндальф---
	
	//Бондаренко++ 20220414
	Отказ = СМГ_ПередЗаписью();
	//Бондаренко-- 20220414
	
КонецПроцедуры

// Стандартный обработчик ПриЗаписи элемента справочника
Процедура ПриЗаписи(Отказ)
	Если НЕ спПриЗаписи(ЭтотОбъект, Отказ) Тогда Возврат; КонецЕсли;
КонецПроцедуры

// Стандартный обработчик ПередУдалением элемента
Процедура ПередУдалением(Отказ)
	Если НЕ спПередУдалением(ЭтотОбъект, Отказ) Тогда Возврат; КонецЕсли;
КонецПроцедуры

// Стандартный обработчик ПриУстановкеНовогоКода элемента
Процедура ПриУстановкеНовогоКода(СтандартнаяОбработка, Префикс)
	Если НЕ спПриУстановкеНовогоКода(ЭтотОбъект, СтандартнаяОбработка, Префикс) Тогда Возврат; КонецЕсли;
КонецПроцедуры

//Бондаренко++ 20221117
Функция СМГ_ПередЗаписью()                 
	
	//Бондаренко++ 20240803
	Если Не ЭтоНовый() Тогда
		Если СокрЛП(НаименованиеПолное) <> СокрЛП(Ссылка.НаименованиеПолное) Тогда
			Протокол = СокрЛП(Протокол)+Символы.ПС+"Наименование полное заменено с '"+СокрЛП(Ссылка.НаименованиеПолное)+"' на '"+СокрЛП(НаименованиеПолное)+
			"' Пользователем "+ПараметрыСеанса.Пользователь+" "+Формат(ТекущаяДата(), "ДЛФ=DDT");
		КонецЕсли;
		
		Если СокрЛП(Артикул) <> СокрЛП(Ссылка.Артикул) Тогда
			Протокол = СокрЛП(Протокол)+Символы.ПС+"Артикул заменен с '"+СокрЛП(Ссылка.Артикул)+"' на '"+СокрЛП(Артикул)+
			"' Пользователем "+ПараметрыСеанса.Пользователь+" "+Формат(ТекущаяДата(), "ДЛФ=DDT")+Символы.ПС;
		КонецЕсли;
		
		Если СокрЛП(Наименование) <> СокрЛП(Ссылка.Наименование) Тогда
			Протокол = СокрЛП(Протокол)+Символы.ПС+"Наименование заменено с '"+СокрЛП(Ссылка.Наименование)+"' на '"+СокрЛП(Наименование)+
			"' Пользователем "+ПараметрыСеанса.Пользователь+" "+Формат(ТекущаяДата(), "ДЛФ=DDT")+Символы.ПС;
		КонецЕсли;
	КонецЕсли;
	//Бондаренко-- 20240803
	
	//Бондаренко++ 20221126 
	Попытка
		ЭтотОбъект.Наименование       = СокрЛП ( ЭтотОбъект.Наименование);
		ЭтотОбъект.Наименование       = СокрЛП ( Врег ( Сред (ЭтотОбъект.Наименование,      1,1) ) + Сред ( ЭтотОбъект.Наименование      ,2) );
		ЭтотОбъект.НаименованиеПолное = СокрЛП ( ЭтотОбъект.НаименованиеПолное);
		ЭтотОбъект.НаименованиеПолное = СокрЛП ( Врег ( Сред (ЭтотОбъект.НаименованиеПолное,1,1) ) + Сред ( ЭтотОбъект.НаименованиеПолное,2) );	
	Исключение
	КонецПопытки;          
	//Бондаренко-- 20240803
	
 	флОтказ = Ложь;
 	Если ЭтотОбъект.ПринадлежитЭлементу(Справочники.Автоработы.НайтиПоКоду("ЦБ0164620")) Тогда
		Если НЕ (РольДоступна("ПолныеПрава") ИЛИ РольДоступна("СМ_РуководительОтделаСервиса") ИЛИ обПраво("РедактированиеАвторабот")) Тогда
			#Если Клиент Тогда
  			Сообщить("ОШИБКА! Вам запрещено изменять работы в этой группе.",СтатусСообщения.ОченьВажное);
			#КонецЕсли
			флОтказ = Истина;	
			Возврат флОтказ;
 		КонецЕсли;
	КонецЕсли;
	
	//Бондаренко++ 20250715
	Если ЭтотОбъект.ВремяВыполнения = 0 Тогда
		ЭтотОбъект.ВремяВыполнения = 1;
	КонецЕсли;
	//Бондаренко-- 20250715
	
 	Возврат флОтказ;
КонецФункции         
//Бондаренко-- 20221117

//////////////////////////////////////////////////////////////////////////////
// ИСПОЛНЯЕМАЯ ЧАСТЬ МОДУЛЯ

// сохранение ссылки на коллекцию прав, настроек и окружения
Права = Неопределено;
#Если Клиент Тогда
Права = глПрава;
#КонецЕсли