
//&НаСервере
Функция ЗанятьМестоАвтомобилем(Склад, ПарковочноеМесто, Автомобиль) Экспорт
	
	ОсвободитьПарковочноеМесто(Автомобиль);
	
	Отказ = Ложь;
	
	Запрос = Новый Запрос;
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Renault_РазмещениеАвтомобилей.Склад КАК Территория,
	|	Renault_РазмещениеАвтомобилей.Место КАК ПарковочноеМесто
	|ИЗ
	|	РегистрСведений.Renault_РазмещениеАвтомобилей КАК Renault_РазмещениеАвтомобилей
	|ГДЕ
	|	Renault_РазмещениеАвтомобилей.Склад = &Склад
	|	И Renault_РазмещениеАвтомобилей.Место = &ПарковочноеМесто
	|	И Renault_РазмещениеАвтомобилей.Автомобиль = ЗНАЧЕНИЕ(Справочник.Автомобили.ПустаяСсылка)";
	
	Запрос.УстановитьПараметр("Склад",				Склад);
	Запрос.УстановитьПараметр("ПарковочноеМесто",	ПарковочноеМесто);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		
		МенеджерЗаписи = РегистрыСведений.Renault_РазмещениеАвтомобилей.СоздатьМенеджерЗаписи();
		
		МенеджерЗаписи.Склад		= Склад;
		МенеджерЗаписи.Место	= ПарковочноеМесто;
		МенеджерЗаписи.Автомобиль		= Автомобиль;
		
		МенеджерЗаписи.Записать(Истина);
		
	Иначе
		
		Renault_ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Место:"" " + ПарковочноеМесто + " "" на складе: "" " + Склад+ " "" занято/отсутствует", Неопределено, "", Отказ);
		
	КонецЕсли;
	
	Возврат НЕ Отказ;
	
КонецФункции

//&НаСервере
Функция ПолучитьПарковочноеМестоАвтомобиля(Автомобиль, Склад = Неопределено) Экспорт
	
	Результат = Новый Структура("Территория,ПарковочноеМесто", Справочники.Renault_Территории.ПустаяСсылка(), 0);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Renault_РазмещениеАвтомобилей.Склад КАК Территория,
	|	Renault_РазмещениеАвтомобилей.Место КАК ПарковочноеМесто
	|ИЗ
	|	РегистрСведений.Renault_РазмещениеАвтомобилей КАК Renault_РазмещениеАвтомобилей
	|ГДЕ
	|	Renault_РазмещениеАвтомобилей.Автомобиль = &Автомобиль
	|	И ВЫБОР
	|			КОГДА &Склад = НЕОПРЕДЕЛЕНО
	|				ТОГДА ИСТИНА
	|			ИНАЧЕ Renault_РазмещениеАвтомобилей.Склад = &Склад
	|		КОНЕЦ";
	
	Запрос.УстановитьПараметр("Автомобиль", Автомобиль);
	Запрос.УстановитьПараметр("Склад", Склад);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		ЗаполнитьЗначенияСвойств(Результат, Выборка);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

//&НаСервере
Функция ОсвободитьПарковочноеМесто(ВходящиеАвтомобили) Экспорт
	
	НесколькоАвтомобилей	= Неопределено;
	СписокАвтомобилей		= Новый Массив;
	Автомобиль				= Справочники.Автомобили.ПустаяСсылка();
	
	Если ТипЗнч(ВходящиеАвтомобили) = Тип("СправочникСсылка.Автомобили") Тогда
		НесколькоАвтомобилей	= Ложь;
		Автомобиль				= ВходящиеАвтомобили;
	ИначеЕсли ТипЗнч(ВходящиеАвтомобили) = Тип("Массив") Тогда
		НесколькоАвтомобилей	= Истина;
		СписокАвтомобилей		= Новый СписокЗначений;
		СписокАвтомобилей.ЗагрузитьЗначения(ВходящиеАвтомобили);
	КонецЕсли;
	
	Если НесколькоАвтомобилей <> Неопределено Тогда
		
		Запрос	= Новый Запрос;
		Запрос.Текст =
		"ВЫБРАТЬ
		|	Renault_РазмещениеАвтомобилей.Склад,
		|	Renault_РазмещениеАвтомобилей.Место,
		|	ЗНАЧЕНИЕ(Справочник.Автомобили.ПустаяСсылка) КАК Автомобиль
		|ИЗ
		|	РегистрСведений.Renault_РазмещениеАвтомобилей КАК Renault_РазмещениеАвтомобилей
		|ГДЕ
		|	ВЫБОР
		|			КОГДА &НесколькоАвтомобилей = ИСТИНА
		|				ТОГДА Renault_РазмещениеАвтомобилей.Автомобиль В (&СписокАвтомобилей)
		|			ИНАЧЕ Renault_РазмещениеАвтомобилей.Автомобиль = &Автомобиль
		|		КОНЕЦ";
		
		Запрос.УстановитьПараметр("НесколькоАвтомобилей",	НесколькоАвтомобилей);
		Запрос.УстановитьПараметр("Автомобиль", 			Автомобиль);
		Запрос.УстановитьПараметр("СписокАвтомобилей",		СписокАвтомобилей);
		
		Выборка = Запрос.Выполнить().Выбрать();
		Пока Выборка.Следующий() Цикл
			МенеджерЗаписи = РегистрыСведений.Renault_РазмещениеАвтомобилей.СоздатьМенеджерЗаписи();
			ЗаполнитьЗначенияСвойств(МенеджерЗаписи, Выборка);
			МенеджерЗаписи.Записать(Истина);
		КонецЦикла;
		
	Иначе
		
		Возврат Ложь;
		
	КонецЕсли;
	
	Возврат Истина;
	
КонецФункции

