
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	УстановитьВидимость();	
КонецПроцедуры

&НаКлиенте
Процедура НачисляютсяБонусыПриИзменении(Элемент)
	УстановитьВидимость();	
КонецПроцедуры

&НаКлиенте
Процедура ПредоставляетсяБесплатнаяУслугаРаботаПриИзменении(Элемент)
	УстановитьВидимость();	
КонецПроцедуры

&НаКлиенте
Процедура ПерсональныйМенеджерПриИзменении(Элемент)
	УстановитьВидимость();
КонецПроцедуры
 
&НаСервере
Процедура УстановитьВидимость()

	Элементы.СуммаБонуса.Видимость 		 	  = Объект.НачисляютсяБонусыВДеньРожденияКлиента;	
	Элементы.БесплатныеРаботыУслуги.Видимость = Объект.ПредоставляетсяБесплатнаяУслугаРабота;	
	Элементы.Менеджер.Видимость 			  = Объект.ПерсональныйМенеджер;	
	
	Если Объект.Ссылка = Справочники.DMS_ПривилегииВладельцамБонусныхКарт.ПерсональныйМенеджерМастерПриемщик Тогда
		Элементы.ГруппаНачислениеБонусов.Видимость 	   = Ложь;	
		Элементы.ГруппаБеслатныеРаботыУслуги.Видимость = Ложь;	
	ИначеЕсли Объект.Ссылка = Справочники.DMS_ПривилегииВладельцамБонусныхКарт.ПодарочныеБаллыВДеньРождения Тогда
		Элементы.ГруппаПерсональныйМенеджер.Видимость  = Ложь;	
		Элементы.ГруппаБеслатныеРаботыУслуги.Видимость = Ложь;
	ИначеЕсли Объект.Ссылка = Справочники.DMS_ПривилегииВладельцамБонусныхКарт.БесплатныеНапиткиПриОбслуживанииВТЦ
		Или Объект.Ссылка = Справочники.DMS_ПривилегииВладельцамБонусныхКарт.СтраховкаНаДом Тогда
		
		Элементы.ГруппаПерсональныйМенеджер.Видимость = Ложь;	
		Элементы.ГруппаНачислениеБонусов.Видимость 	  = Ложь;	
		
	КонецЕсли; 
	
КонецПроцедуры // УстановитьВидимость()
