Процедура ПередЗаписью(Отказ)
	Если ОбъектМД.БазаДанных<>Renault_ПередачаДанныхВСторонниеСистемы.ТекущаяБазаДанных() Тогда
		Сообщить("Метаданные другой базы не доступны для редактирования",СтатусСообщения.Информация);
		Отказ=Истина;
	КонецЕсли;
КонецПроцедуры

Процедура ПередУдалением(Отказ)
	Если ОбъектМД.БазаДанных<>Renault_ПередачаДанныхВСторонниеСистемы.ТекущаяБазаДанных() Тогда
		Сообщить("Метаданные другой базы не доступны для редактирования",СтатусСообщения.Информация);
		Отказ=Истина;
	КонецЕсли;	
КонецПроцедуры
