
//#Область ОбработчикиСобытийФормы

&НаСервере   
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Перем Данные;
	Данные=ХранилищеОбщихНастроек.Загрузить("ПомощникАвтобизнеса","ОбъектMySQL");
	Если ТипЗнч(Данные)=Тип("Структура") Тогда
		ЗаполнитьЗначенияСвойств(Объект,Данные);
	КонецЕсли;
	
	Обработка=РеквизитФормыВЗначение("Объект");
	Если Лев(Строка(ТипЗнч(Обработка)),7)="Внешняя" ТОгда
		Объект.ВнешняяОбработка="ВнешняяОбработка";
	Иначе
		Объект.ВнешняяОбработка="Обработка";
	КонецЕсли;
	
	Данные=Неопределено;
	Данные=ХранилищеОбщихНастроек.Загрузить("ПомощникАвтобизнеса","ЗаявкаНаОформление");
	Если ТипЗнч(Данные)=Тип("ТаблицаЗначений") Тогда
		КолДан=Данные.Количество();
		Если КолДан>0 Тогда
			Объект.ЗаявкаНаОформление.Загрузить(Данные);
			Элементы.СтрКорзина.Заголовок="Корзина ("+Строка(КолДан)+")";
			СуммаКорзины=Объект.ЗаявкаНаОформление.Итог("Всего");
		КонецЕсли;
	КонецЕсли;

	Данные=Неопределено;
	Данные=ХранилищеОбщихНастроек.Загрузить("ПомощникАвтобизнеса","ЗаявкаПоставщику");
	Если ТипЗнч(Данные)=Тип("ТаблицаЗначений") Тогда
		КолДан=Данные.Количество();
		Если КолДан>0 Тогда
			Объект.ЗаявкаПоставщику.Загрузить(Данные);
			Элементы.Группа10.Заголовок="Заказ поставщику ("+Строка(КолДан)+")";
		КонецЕсли;
	КонецЕсли;

	Данные=Неопределено;
	Данные=ХранилищеОбщихНастроек.Загрузить("ПомощникАвтобизнеса","УровниЦен");
	Если ТипЗнч(Данные)=Тип("ТаблицаЗначений") И Данные.Количество()>0 Тогда
		Мас=Данные.ВыгрузитьКолонку("Наименование");                                          
		Элементы.УровеньЦен.СписокВыбора.ЗагрузитьЗначения(Мас);
		Элементы.УровеньЦенЕмекс.СписокВыбора.ЗагрузитьЗначения(Мас);
	Иначе
		Мас=Новый Массив;
		Мас.Добавить("Закупочная");
		Элементы.УровеньЦен.СписокВыбора.ЗагрузитьЗначения(Мас);
		Элементы.УровеньЦенЕмекс.СписокВыбора.ЗагрузитьЗначения(Мас);
	КонецЕсли;

 	Попытка
		#Если ВебКлиент Тогда
			Объект.РежимМодальности=Ложь;
		#Иначе
			Объект.РежимМодальности=НЕ Метаданные.РежимИспользованияМодальности=Метаданные.СвойстваОбъектов.РежимИспользованияМодальности.НеИспользовать;
		#КонецЕсли
	Исключение
		Объект.РежимМодальности=Истина;
	КонецПопытки;
КонецПроцедуры

&НаСервере
Функция ВыяснитьКонфигурациюНаСервере()
	Обработка=РеквизитФормыВЗначение("Объект");
	Возврат Обработка.ВыяснитьКонфигурацию(ЭтаФорма.Элементы);
КонецФункции

&НаСервере
Процедура СохранитьЗаявкиНаСервере()
	Данные=Объект.ЗаявкаНаОформление.Выгрузить();
	ХранилищеОбщихНастроек.Сохранить("ПомощникАвтобизнеса","ЗаявкаНаОформление",Данные);
	Данные=Объект.ЗаявкаПоставщику.Выгрузить();
	ХранилищеОбщихНастроек.Сохранить("ПомощникАвтобизнеса","ЗаявкаПоставщику",Данные);
	Обработка=РеквизитФормыВЗначение("Объект");
	Обработка.ПризакрытииОграничения();
КонецПроцедуры

&НаКлиенте   
Процедура ПриОткрытии(Отказ)
	Состояние("Запуск Ниракс: Помощника автобизнеса...", , "Восстанавливаем ранее сохраненные настройки");
	Объект.Версия = "4.2.000";
	Объект.Лицензия = "ПРОФ";
	
	// Определение конфигурации
	Рез=ВыяснитьКонфигурациюНаСервере();
	
	ЗаполнитьЗначенияСвойств(Объект,Рез);
	Отказ = Объект.ОтказОт;
	ЭтаФорма.Заголовок = "Ниракс: Помощник автобизнеса " + Объект.Лицензия + " " + Объект.Версия;
	//Определение доступности реквизитов
	//Убираем элементы формы, данные которых отсутствуют в данной конфигурации
	Элементы.ЗаказПокупателяВрем.Видимость=Рез.ЕстьЗаказ;
	Элементы.РеализацияТоваровВрем.Видимость=Рез.ЕстьРеализация;
	Элементы.СчетФактураВрем.Видимость=Рез.ЕстьСчет;
	Элементы.Соглашение.Видимость=Рез.Свойство("Соглашение");
	Элементы.ДоговорДляЗаявки.Видимость=Объект.ДоговорДляЗаявки<>Неопределено;
	Элементы.ЧекККМ.Видимость=Объект.КассаККМ<>Неопределено;
	Элементы.ПоискЕмекс.Видимость=Объект.ИспользоватьПроценкуОнлайнПоставщиков;
	Элементы.ДополнительноTecDoc.Видимость=Объект.СпецНаз.ДополнительноПоставщикам;
	Элементы.ДополнительноПрайс.Видимость=Объект.СпецНаз.ДополнительноПоставщикам;
	Элементы.ДополнительноПроценки.Видимость=Объект.СпецНаз.ДополнительноПоставщикам;
	Элементы.ДополнительноКорзина.Видимость=Объект.СпецНаз.ДополнительноПоставщикам;
	Элементы.ДополнительноПоставщикам.Видимость=Объект.СпецНаз.ДополнительноПоставщикам;
	Элементы.СтраницаПоискПоАртикулу.Видимость=Рез.TecDocПодключен;
	Элементы.Стр3.Видимость=Рез.TecDocПодключен;
		
	// Присваиваем начальные значения реквизитам
	Если НЕ (Пред1 ИЛИ Пред2 ИЛИ Пред3 Или Пред4 Или Пред5) Тогда Пред1=Истина;КонецЕсли; 
	ПредПриИзменении(Неопределено);	
	ИзменениеУровняЦенНаСервере();
	УровеньЦенЕмексПриИзмененииНаСервере();
	Объект.ОбщийПоискВрем=Объект.ОбщийПоиск;
	Объект.ВыводитьНаличиеВрем=Объект.ВыводитьНаличие;
	Объект.ВыводитьАналогиВрем=Объект.ВыводитьАналоги;
	Объект.ЗаказПокупателяВрем=Объект.ЗаказПокупателя;
	Объект.РеализацияТоваровВрем=Объект.РеализацияТоваров;
	Объект.СчетФактураВрем=Объект.СчетФактура;
	Объект.СкладДляЗаявки=Объект.Склад;
	Объект.ФильтрСклад=Объект.Склад;
	Объект.ФильтрСкладЕмекс=Объект.Склад;
	Объект.ФильтрСкладПрайс=Объект.Склад;
	Если ПустаяСтрока(Объект.ШаблонНаименования) Тогда
		Объект.ШаблонНаименования = "&К &Н *&П";
	КонецЕсли;
	Если ПустаяСтрока(Объект.ШаблонНаименованияП) Тогда
		Объект.ШаблонНаименованияП = "&К &Н *&П";
	КонецЕсли;
	Если ПустаяСтрока(Объект.ШаблонНомераДляПоиска) Тогда
		Объект.ШаблонНомераДляПоиска = "&К_&П";
	КонецЕсли;
	Ошибки="";
		
	Если Не ЗначениеЗаполнено(ТипАвто) Тогда ТипАвто="всем автомобилям";КонецЕсли;
	Если Объект.TecDocПодключен Тогда
		ТипАвтоПриИзменении(Неопределено);
	КонецЕсли;
	
	// Заносим сохраненное значение артикула в список выбора
	Если Объект.НомерАртикула<>"" Тогда
		НомерАртикулаПриИзменении(Неопределено);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, СтандартнаяОбработка)
	#Если ВебКлиент Тогда
	#Иначе
		Если Объект.РежимМодальности Тогда
			Режим = РежимДиалогаВопрос.ДаНет;
			Текст = "Вы действительно хотите выйти из ""Ниракс: Помощник автобизнеса?""";
			Ответ = Вопрос(Текст, Режим, 0,,"Ниракс: Помощник автобизнеса");
			Если Ответ = КодВозвратаДиалога.Нет Тогда   //продолжаем работать
				Отказ=Истина; 
				Возврат;
			КонецЕсли;   
		КонецЕсли;
	#КонецЕсли
	СохранитьЗаявкиНаСервере();
КонецПроцедуры

//#КонецОбласти

//#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура НомерАртикулаПриИзменении(Элемент)
	Если Элементы.НомерАртикула.СписокВыбора.НайтиПоЗначению(Объект.НомерАртикула) = Неопределено Тогда
		Элементы.НомерАртикула.СписокВыбора.Вставить(0,Объект.НомерАртикула);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура КартинкаНираксНажатие(Элемент)
	ЗапуститьПриложение("https:\\www.nirax.ru?from=tecdoc_ut11");
КонецПроцедуры

&НаКлиенте
Процедура СтраницыПриСменеСтраницы(Элемент, ТекущаяСтраница)
	Если Элементы.Страницы.ТекущаяСтраница = Элементы.СтраницаПоискПоВИН Тогда
		Элементы.НомерАртикула.Заголовок = "Номер VIN";
	Иначе
		Элементы.НомерАртикула.Заголовок = "Номер артикула";
	КонецЕсли; 
КонецПроцедуры

//#КонецОбласти

//#Область ОбработчикиСобытийЭлементовСтраницыПоискаПоАртикулу

&НаКлиенте
Процедура ПредПриИзменении(Элемент)
	Если Элемент=Элементы.Пред4 Тогда
		Пред2=Пред4;
	КонецЕсли;
	Если Элемент=Элементы.Пред0 И Пред0 Тогда 
		Пред1=Истина; Пред2=Истина; Пред3=Истина;
		Пред4=Истина; Пред5=Истина;
		Элементы.Пред0.Доступность=Ложь;
	ИначеЕсли Пред1 И Пред2 И Пред3 И Пред4 И Пред5 Тогда
		Пред0=Истина;
		Элементы.Пред0.Доступность=Ложь;
	ИначеЕсли НЕ (Пред1 ИЛИ Пред2 ИЛИ Пред3 ИЛИ Пред4 ИЛИ Пред5) Тогда
		Пред1=Истина;
	Иначе
		Пред0=Ложь;
		Элементы.Пред0.Доступность=Истина;
	КонецЕсли;
	Предикат=Сред(?(Пред1,", '1'","")+?(Пред2,", '2'","")+?(Пред3,", '3'","")
	+?(Пред4,", '4'","")+?(Пред5,", '5'",""),3);
КонецПроцедуры

&НаКлиенте
Процедура Пред0ПриИзменении(Элемент)
	ПредПриИзменении(Элемент);
КонецПроцедуры

&НаКлиенте
Процедура Пред1ПриИзменении(Элемент)
	ПредПриИзменении(Элемент);
КонецПроцедуры

&НаКлиенте
Процедура Пред3ПриИзменении(Элемент)
	ПредПриИзменении(Элемент);
КонецПроцедуры

&НаКлиенте
Процедура Пред4ПриИзменении(Элемент)
	ПредПриИзменении(Элемент);
КонецПроцедуры

&НаКлиенте
Процедура Пред5ПриИзменении(Элемент)
	ПредПриИзменении(Элемент);
КонецПроцедуры

&НаКлиенте
Процедура ФильтрПриИзменении(Элемент)
	Если Элемент=Элементы.ФильтрСклад И 
		ТипЗнч(Элементы.Результат.ТекущаяОбласть)=Тип("ОбластьЯчеекТабличногоДокумента") Тогда
		ТекСтр=Элементы.Результат.ТекущаяОбласть.Верх;
		ТекКол=Элементы.Результат.ТекущаяОбласть.Лево;
	Иначе
		ТекСтр=1;ТекКол=1;
	КонецЕсли;
	
	ФильтрПриИзмененииНаСервере();
	ТекущаяОбласть=Результат.Область(ТекСтр,ТекКол,ТекСтр,ТекКол);
	Элементы.Результат.ТекущаяОбласть=ТекущаяОбласть;
КонецПроцедуры

&НаСервере
Процедура ФильтрПриИзмененииНаСервере()
	Обработка=РеквизитФормыВЗначение("Объект");
	ТЗ = РезультатПоискаТЗ.Выгрузить();
	Если ПустаяСтрока(Объект.ФильтрМарка) Тогда
		КолСтр=Обработка.ВыводРезультатаПоиска(ТЗ,Результат);
	Иначе
		Структура = Новый Структура("поставщик",Объект.ФильтрМарка);
		Массив = ТЗ.НайтиСтроки(Структура);
		КолСтр=Обработка.ВыводРезультатаПоиска(Массив, Результат);
	КонецЕсли;
	Элементы.СтраницаПоискПоАртикулу.Заголовок="Поиск по артикулу (TecDoc)("+Строка(КолСтр)+")";
КонецПроцедуры

&НаКлиенте
Процедура ФильтрМаркаПриИзменении(Элемент)
	ФильтрПриИзменении(Элемент);
КонецПроцедуры

&НаКлиенте
Процедура ФильтрСкладПриИзменении(Элемент)
	ФильтрПриИзменении(Элемент);
КонецПроцедуры

&НаКлиенте
Процедура ТипЦенПриИзменении(Элемент)
	ТекСтр=1;ТекКол=1;
	ФильтрПриИзмененииНаСервере();
	ТекущаяОбласть=Результат.Область(ТекСтр,ТекКол,ТекСтр,ТекКол);
	Элементы.Результат.ТекущаяОбласть=ТекущаяОбласть;
КонецПроцедуры

&НаКлиенте
Процедура РезультатОбработкаРасшифровки(Элемент, Расшифровка, СтандартнаяОбработка)
	
	СтандартнаяОбработка=Ложь;
	Если Расшифровка=Неопределено тогда
		Если ТипЗнч(Элемент.ТекущаяОбласть)=Тип("РисунокТабличногоДокумента") тогда
			Расшифровка=Элемент.ТекущаяОбласть.Расшифровка;
		иначе
			Возврат;
		КонецЕсли;
	КонецЕсли;	
	
	Попытка

		Если Расшифровка.Действие="ДобавитьВЗаявку" Тогда
			Если Объект.КонтрольОстатков И Расшифровка.Остаток=0 Тогда
				Попытка
					ТекстОшибки="Для оформления заявки с нулевыми остатками требуется в настройках убрать признак контроля остатков";
					Предупреждение(ТекстОшибки);
				Исключение
					Сообщить(ТекстОшибки);
				Конецпопытки;
				Возврат;
			КонецЕсли;
			
			ПередачаПараметров=Новый Структура;
			ПередачаПараметров.Вставить("Номенклатура",Расшифровка.Номенклатура);
			ПередачаПараметров.Вставить("Склад",Объект.ФильтрСклад);
			Если (Объект.ЗапрашиватьКоличество ИЛИ Объект.ЗапрашиватьЦену ИЛИ Объект.ЗапрашиватьСкидку) Тогда
				ПередачаПараметров.Вставить("Остаток",Расшифровка.Остаток);
				ПередачаПараметров.Вставить("ЦенаПоУмолчанию",Расшифровка.Цена);
				ПередачаПараметров.Вставить("КонтрольОстатков",Объект.КонтрольОстатков);
				ПередачаПараметров.Вставить("ЗапрашиватьКолво",Объект.ЗапрашиватьКоличество);
				ПередачаПараметров.Вставить("ЗапрашиватьЦену",Объект.ЗапрашиватьЦену);
				ПередачаПараметров.Вставить("ЗапрашиватьСкидку",Объект.ЗапрашиватьСкидку);
				
				Оповещение=Новый ОписаниеОповещения("ДобавитьВЗаявкуНаСервере",ЭтаФорма,Неопределено);
				ОткрытьФорму(Объект.ВнешняяОбработка+".Nirax_ПомощникАвтобизнесаОбщий.Форма.ВыборКоличестваУФ",ПередачаПараметров,ЭтаФорма,Истина,,,Оповещение);
			Иначе
				ПередачаПараметров.Вставить("Количество",1);
				ПередачаПараметров.Вставить("Цена",Расшифровка.Цена);
				ПередачаПараметров.Вставить("Скидка",0);
				ДобавитьВЗаявкуНаСервере(ПередачаПараметров);
			КонецЕсли;
			Возврат;
		ИначеЕсли Расшифровка.Действие="ОткрытьФорму" Тогда
		
			ПараметрыФормы=Новый Структура("Ключ",Расшифровка.Значение);
			ОткрытьФорму("Справочник.Номенклатура.ФормаОбъекта",ПараметрыФормы);
		ИначеЕсли Расшифровка.Действие = "ДополнитьИнформацию" Тогда
			ОбработкаРасшифровкиНаСервере(Расшифровка, Элемент.Имя);
			Если ЗначениеЗаполнено(Расшифровка.Номенклатура) Тогда
				Ключ = Новый Структура("Ключ", Расшифровка.Номенклатура);
				ФормаЭлемента=ОткрытьФорму("Справочник.Номенклатура.ФормаОбъекта", Ключ);
			КонецЕсли;	
			
		// если дополняем информацию	
		ИначеЕсли Расшифровка.Действие="ДобавитьДетальВБазу" Тогда
			ТипНомера=Неопределено;
        	Номенклатура=ДобавитьТоварВБазуНаСервере(Расшифровка.Значение, ТипНомера,Элемент.Имя,Расшифровка.НомерКартинки);
			Если ЗначениеЗаполнено(Номенклатура) Тогда
				Если Объект.ЗапрашиватьГруппуНоменклатуры Тогда
					ПараметрыФормы = Новый Структура("УникальныйИдентификатор", новый УникальныйИдентификатор);
					Оповещение = Новый ОписаниеОповещения("ВходВгруппу", ЭтаФорма, Номенклатура);
			
					ОткрытьФорму("Справочник.Номенклатура.ФормаВыбораГруппы",ПараметрыФормы,,,,,Оповещение);
				Иначе
					ПараметрыФормы=Новый Структура("Ключ",Номенклатура);
					ОткрытьФорму("Справочник.Номенклатура.ФормаОбъекта",ПараметрыФормы);
				КонецЕсли;
			КонецЕсли;
		ИначеЕсли Расшифровка.Действие = "Назад" Тогда
			Если Элемент.Имя="Результат1" Тогда
				Элементы.Результат1.Видимость=Ложь;
				Элементы.Результат.Видимость=Истина;
			Иначе
				Элементы.РезультатПоДереву1.Видимость=Ложь;
				Элементы.РезультатПоДереву.Видимость=Истина;
			КонецЕсли;
		ИначеЕсли Расшифровка.Действие="РасшифровкаДляПроценки" Тогда
			Объект.НомерАртикула = Расшифровка.Значение;
			ЭтаФорма.Элементы.Страницы.ТекущаяСтраница = ЭтаФорма.Элементы.ПоискЕмекс;
			ПоискПоАртикулу();
		Иначе
			ОбработкаРасшифровкиНаСервере(Расшифровка,Элемент.Имя);
		КонецЕсли;
		
	Исключение
		
		Сообщить(ОписаниеОшибки());
		
	КонецПопытки;
	
КонецПроцедуры

//#КонецОбласти

//#Область ОбработчикиСобытийЭлементовСтраницыПоискаПоПрайсу

&НаКлиенте
Процедура УровеньЦенПриИзменении(Элемент)
	
	ИзменениеУровняЦенНаСервере();	
	
КонецПроцедуры

&НаСервере
Процедура ИзменениеУровняЦенНаСервере()
	Данные=ХранилищеОбщихНастроек.Загрузить("ПомощникАвтобизнеса","УровниЦен");
	Если ТипЗнч(Данные)=Тип("ТаблицаЗначений") И Данные.Количество()>0 Тогда
		Стр=Данные.Найти(Объект.УровеньЦен,"Наименование");
		Объект.НаценкаПрайс=?(Стр=Неопределено,1,1+Стр.Наценка/100);
	Иначе
		Объект.УровеньЦен="Закупочная";
		Объект.НаценкаПрайс=1;
	КонецЕсли;
	
	Если РезультатПоискаПрайс.Количество()>0 Тогда
		Обработка=РеквизитФормыВЗначение("Объект");
		КолПрайс=Обработка.ВыводРезультатаПоискаПрайс(РезультатПоискаПрайс, РезультатПрайс);
		Элементы.СтраницаПоискПоПрайсу.Заголовок="Поиск по артикулу (прайс-листы) ("+Строка(КолПрайс)+")";
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ФильтрСкладПрайсПриИзменении(Элемент)
	Если РезультатПоискаПрайс.Количество()>0 Тогда
		ФильтрСкладПрайсПриИзмененииНаСервере()
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ФильтрСкладПрайсПриИзмененииНаСервере()
	Обработка=РеквизитФормыВЗначение("Объект");
	КолПрайс=Обработка.ВыводРезультатаПоискаПрайс(РезультатПоискаПрайс, РезультатПрайс);
	Элементы.СтраницаПоискПоПрайсу.Заголовок="Поиск по артикулу (прайс-листы) ("+Строка(КолПрайс)+")";
КонецПроцедуры

&НаКлиенте
Процедура РезультатПрайсОбработкаРасшифровки(Элемент, Расшифровка, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	Если Расшифровка=Неопределено тогда
		Если ТипЗнч(Элемент.ТекущаяОбласть)=Тип("РисунокТабличногоДокумента") тогда
			Расшифровка=Элемент.ТекущаяОбласть.Расшифровка;
		иначе
			Возврат;
		КонецЕсли;
	КонецЕсли;	
	
	ЕСли Расшифровка.Действие = "Открыть" Тогда
		ОткрытьФорму("Справочник.Номенклатура.ФормаОбъекта",Новый Структура("Ключ",Расшифровка.Значение));
		
	ИначеЕсли Расшифровка.Действие = "ДобавитьВЗаявкуПрайс" Тогда
	    // проверим наличие детали в базе
		Если Объект.ЗапрашиватьГруппуНоменклатуры Тогда
			Номенклатура=ПолучитьНоменклатуруТовараНаСервере(Новый Структура("Артикул,Наименование,Производитель",Расшифровка.Артикул,Расшифровка.Название,Расшифровка.Производитель),Ложь);
			Если Номенклатура = Неопределено Тогда
				Номенклатура=ПолучитьНоменклатуруТовараНаСервере(Новый Структура("Артикул,Наименование,Производитель",Расшифровка.Артикул,Расшифровка.Название,Расшифровка.Производитель));
				Оповещение = Новый ОписаниеОповещения("ВходВгруппуПрайс", ЭтаФорма, Новый Структура("Номенклатура, Расшифровка", Номенклатура, Расшифровка));
		        ПараметрыФормы = Новый Структура("УникальныйИдентификатор", новый УникальныйИдентификатор);
				ОткрытьФорму("Справочник.Номенклатура.ФормаВыбораГруппы",ПараметрыФормы,,,,,Оповещение);
			КонецЕсли;
		Иначе
			Номенклатура=ПолучитьНоменклатуруТовараНаСервере(Новый Структура("Артикул,Наименование,Производитель",Расшифровка.Артикул,Расшифровка.Название,Расшифровка.Производитель));
		КонецЕсли;
		
		
		ПроверкаОтбор = Новый Структура("Номенклатура, Поставщик, Склад", Номенклатура, Расшифровка.Поставщик, Объект.ФильтрСкладПрайс);
		ПроверкаСуществования = Объект.ЗаявкаПоставщику.НайтиСтроки(ПроверкаОтбор);
		Остаток=Число(Расшифровка.Остаток)-?(ПроверкаСуществования.Количество()=0,0,ПроверкаСуществования[0].Количество);
		Если Остаток<=0 И Объект.КонтрольОстатков Тогда
			ТекстОшибки="Для оформления заказа с нулевыми остатками требуется в настройках убрать признак контроля остатков";
			Попытка
				Предупреждение(ТекстОшибки);
			Исключение
				Сообщить(ТекстОшибки);
			Конецпопытки;
			Возврат;
		КонецЕсли;
		Если Объект.ЗапрашиватьКоличество ИЛИ ((Объект.ЗапрашиватьЦену ИЛИ Объект.ЗапрашиватьСкидку) И Объект.ВКорзину) Тогда
			ПередачаПараметров = Новый Структура(
			"Номенклатура,Склад,Остаток,ЦенаПоУмолчанию,КонтрольОстатков,ЗапрашиватьКолво,ЗапрашиватьЦену,ЗапрашиватьСкидку",
			Номенклатура,Объект.ФильтрСкладПрайс,Остаток,Расшифровка.Цена,Объект.КонтрольОстатков,
			Объект.ЗапрашиватьКоличество, Объект.ВКорзину И Объект.ЗапрашиватьЦену, Объект.ВКорзину И Объект.ЗапрашиватьСкидку);
			Оповещение=Новый ОписаниеОповещения("ОбработкаРасшифровкиПрайсНаСервере",ЭтаФорма,Расшифровка);
			ОткрытьФорму(Объект.ВнешняяОбработка+".Nirax_ПомощникАвтобизнесаОбщий.Форма.ВыборКоличестваУФ",ПередачаПараметров,ЭтаФорма,Истина,,,Оповещение)
		Иначе
			Данные=Новый Структура("Номенклатура,Склад,Количество,Цена,Скидка",
			Номенклатура,Объект.ФильтрСкладПрайс,1,Расшифровка.Цена,0);
			ОбработкаРасшифровкиПрайсНаСервере(Данные,Расшифровка)
		КонецЕсли;
			
	КонецЕсли;
		
КонецПроцедуры

//#КонецОбласти

//#Область ОбработчикиСобытийЭлементовСтраницыПоискаОнлайн

&НаКлиенте
Процедура ФильтрМаркаЕмексПриИзменении(Элемент)
	ФильтрТекст = Элемент.ВыделенныйТекст;
	ФильтрМаркаЕмексПриИзмененииНаСервере(Элемент.ВыделенныйТекст);
	Элемент.ВыделенныйТекст = ФильтрТекст;
КонецПроцедуры

Процедура ФильтрМаркаЕмексПриИзмененииНаСервере(эл)
	ЭтоОбъект=РеквизитФормыВЗначение("Объект");
	ОтборПараметры=Новый	Структура("Склад,ЕстьНаСкладе,ЕстьУПоставщика",Объект.ФильтрСкладЕмекс,ЕстьНаСкладе,ЕстьУПоставщика);
	ТЗ = РезультатПоискаЕмекс.Выгрузить();
	Если ЗначениеЗаполнено(эл) Тогда
		Структура = Новый Структура;
		Структура.Вставить("Производитель",эл);
		Массив = ТЗ.НайтиСтроки(Структура);
		Если ТЗ.Колонки.Найти("ДляПоиска") <> Неопределено Тогда
			КолЕмекс=ЭтоОбъект.ВыводРезультатаПоискаТоваровЕмекс(Массив, РезультатЕмекс);
		Иначе
			КолЕмекс=ЭтоОбъект.ВыводРезультатаПоискаЕмекс(Массив, РезультатЕмекс, ОтборПараметры);
		КонецЕсли;
	Иначе
		Если ТЗ.Колонки.Найти("ДляПоиска") <> Неопределено Тогда
			КолЕмекс=ЭтоОбъект.ВыводРезультатаПоискаТоваровЕмекс(ТЗ, РезультатЕмекс);
		Иначе
			КолЕмекс=ЭтоОбъект.ВыводРезультатаПоискаЕмекс(ТЗ,РезультатЕмекс,ОтборПараметры);
		КонецЕсли;
	КонецЕсли;
	//Сфокусируемся на первом элементе
	ТекущаяОбласть=Результат.Область("R1C1");
	Элементы.Результат.ТекущаяОбласть = ТекущаяОбласть;	
	Если ЗначениеЗаполнено(КолЕмекс) И КолЕмекс > 0 Тогда
		Элементы.ПоискЕмекс.Заголовок = "Поиск по артикулу (онлайн поставщики) (" + КолЕмекс + ")";
	Иначе
		Элементы.ПоискЕмекс.Заголовок = "Поиск по артикулу (онлайн поставщики)";
	КонецЕСли;
		
КонецПроцедуры

&НаКлиенте
Процедура ФильтрМаркаЕмексОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	Объект.ФильтрМаркаЕмекс = ВыбранноеЗначение;
КонецПроцедуры

&НаКлиенте
Процедура ФильтрСкладЕмексПриИзменении(Элемент)
	ФильтрСкладЕмексПриИзмененииНаСервере();
КонецПроцедуры

&НаСервере
Процедура ФильтрСкладЕмексПриИзмененииНаСервере()
	ЭтоОбъект=РеквизитФормыВЗначение("Объект");
	ОтборПараметры=Новый Структура("Склад,ЕстьНаСкладе,ЕстьУПоставщика",Объект.ФильтрСкладЕмекс,ЕстьНаСкладе,ЕстьУПоставщика);
	ТЗ = РезультатПоискаЕмекс.Выгрузить();
	//Сохраним позицию курсора
	ТекущаяОбласть = Элементы.РезультатЕмекс.ТекущаяОбласть;
	Если ЗначениеЗаполнено(Объект.ФильтрМаркаЕмекс) Тогда
		Структура = Новый Структура;
		Структура.Вставить("Производитель", Объект.ФильтрМаркаЕмекс);
		Массив = ТЗ.НайтиСтроки(Структура);
		КолЕмекс=ЭтоОбъект.ВыводРезультатаПоискаЕмекс(Массив, РезультатЕмекс, ОтборПараметры);
	Иначе
		КолЕмекс=ЭтоОбъект.ВыводРезультатаПоискаЕмекс(ТЗ,РезультатЕмекс,ОтборПараметры);
	КонецЕсли; 
	//Восстановим позицию курсора
	Элементы.РезультатЕмекс.ТекущаяОбласть = ТекущаяОбласть;
	Если ЗначениеЗаполнено(КолЕмекс) И КолЕмекс > 0 Тогда
		Элементы.ПоискЕмекс.Заголовок = "Поиск по артикулу (онлайн поставщики) (" + КолЕмекс + ")";
	Иначе
		Элементы.ПоискЕмекс.Заголовок = "Поиск по артикулу (онлайн поставщики)";
	КонецЕСли;

КонецПроцедуры

&НаКлиенте
Процедура УровеньЦенЕмексПриИзменении(Элемент)
	УровеньЦенЕмексПриИзмененииНаСервере();
КонецПроцедуры

&НаСервере
Процедура УровеньЦенЕмексПриИзмененииНаСервере()
	Данные=ХранилищеОбщихНастроек.Загрузить("ПомощникАвтобизнеса","УровниЦен");
	Если ТипЗнч(Данные)=Тип("ТаблицаЗначений") И Данные.Количество()>0 Тогда
		Стр=Данные.Найти(Объект.УровеньЦенЕмекс,"Наименование");
		Объект.НаценкаПроценки=?(Стр=Неопределено,1,1+Стр.Наценка/100);
	Иначе
		Объект.УровеньЦен="Закупочная";
		Объект.НаценкаПроценки=1;
	КонецЕсли;
	Для Каждого Стр Из РезультатПоискаЕмекс Цикл
		Стр.Цена=Стр.ЦенаПоставки*Объект.НаценкаПроценки;
	КонецЦикла;
	ФильтрСкладЕмексПриИзмененииНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура РезультатЕмексОбработкаРасшифровки(Элемент, Расшифровка, СтандартнаяОбработка)
	СтандартнаяОбработка=Ложь;
	Если Расшифровка=Неопределено тогда
		Если ТипЗнч(Элемент.ТекущаяОбласть)=Тип("РисунокТабличногоДокумента") тогда
			Расшифровка=Элемент.ТекущаяОбласть.Расшифровка;
		иначе
			Возврат;
		КонецЕсли;
	КонецЕсли;	
	
	Попытка

		Если Расшифровка.Действие="ДобавитьВЗаявку" Тогда
			
			Если НЕ Объект.КонтрольОстатков ИЛИ (Объект.КонтрольОстатков И Расшифровка.Остаток > 0)  Тогда
				
				Отбор = Новый Структура("Наименование, Склад, Сайт", Расшифровка.Название, Объект.ФильтрСкладЕмекс, "");
				ПроверкаСуществованияКорзина = Объект.ЗаявкаНаОформление.НайтиСтроки(Отбор);				
				
				Если Объект.ЗапрашиватьКоличество или Объект.ЗапрашиватьЦену или Объект.ЗапрашиватьСкидку Тогда
					ПередачаПараметров=Новый Структура("Номенклатура,Склад,Остаток,ЦенаПоУмолчанию,КонтрольОстатков,ЗапрашиватьКолво,ЗапрашиватьЦену,ЗапрашиватьСкидку",
					Расшифровка.Название,Объект.ФильтрСклад,Расшифровка.Остаток,Расшифровка.Цена,
					Объект.КонтрольОстатков,Объект.ЗапрашиватьКоличество,Объект.ЗапрашиватьЦену,Объект.ЗапрашиватьСкидку);
					Оповещение=Новый ОписаниеОповещения("ДобавитьВЗаявкуНаСервере",ЭтаФорма,Неопределено);
					ОткрытьФорму(Объект.ВнешняяОбработка+".Nirax_ПомощникАвтобизнесаОбщий.Форма.ВыборКоличестваУФ",ПередачаПараметров,ЭтаФорма,Истина,,,Оповещение);
				Иначе
					ПередачаПараметров=Новый Структура("Номенклатура,Склад,Количество,Цена,Скидка",
					Расшифровка.Название,Объект.ФильтрСклад,1,Расшифровка.Цена,0);
					ДобавитьВЗаявкуНаСервере(ПередачаПараметров);
				КонецЕсли;
			Иначе
				Попытка
					Предупреждение("Для оформления заявки с нулевыми остатками требуется в настройках убрать признак контроля остатков");
				Исключение
					Сообщить("Для оформления заявки с нулевыми остатками требуется в настройках убрать признак контроля остатков");
				КонецПопытки;
			КонецЕсли;
			
		ИначеЕсли Расшифровка.Действие="ДобавитьВЗаявкуССайта" Или Расшифровка.Действие="ДобавитьВЗаявкуССайтаПрисутствие" Тогда
			
			Запись = Расшифровка.Запись;
			
			Если Запись.Наличие <=0 И Объект.КонтрольОстатков Тогда
				Попытка
					Предупреждение("Не хватает товара на складе");
				Исключение
					Сообщить("Не хватает товара на складе");
				КонецПопытки;
				Возврат;
			КонецЕсли;
				
			//Если Расшифровка.Действие="ДобавитьВЗаявкуССайта" Тогда
			Если Запись.Номенклатура.Пустая() Тогда	
				НоменклатураСсылка = ДобавлениеТовараВБазуЕмекс(Запись);
				Если Не ЗначениеЗаполнено(НоменклатураСсылка) Тогда
					Возврат;
				Иначе
					Запись.Номенклатура=НоменклатураСсылка;
					Если Объект.ЗапрашиватьГруппуНоменклатуры Тогда
						Оповещение = Новый ОписаниеОповещения("ВходВгруппуЕмекс", ЭтаФорма, Запись);
				        ПараметрыФормы = Новый Структура("УникальныйИдентификатор", новый УникальныйИдентификатор);
						ОткрытьФорму("Справочник.Номенклатура.ФормаВыбораГруппы",ПараметрыФормы,,,,,Оповещение);
					КонецЕсли;	
					
				КонецЕсли;
			Иначе 
				НоменклатураСсылка = Запись.Номенклатура; //ЗначениеАналог; 
			КонецЕсли;
			
			Отбор = Новый Структура("Номенклатура, idСклад, Сайт", Запись.Номенклатура, Запись.idСклад, Запись.Сайт);
			ПроверкаСуществованияКорзина = Объект.ЗаявкаНаОформление.НайтиСтроки(Отбор);
			Если ПроверкаСуществованияКорзина.Количество()=0 Тогда
				ЗаписьВКорзине=Неопределено;
				МожноВКорзину=Запись.Наличие;
			Иначе
				ЗаписьВКорзине=ПроверкаСуществованияКорзина[0];
				МожноВКорзину=Запись.Наличие-ЗаписьВКорзине.Количество;
				Если МожноВКорзину<=0 И Объект.КонтрольОстатков Тогда
					Попытка
						Предупреждение("В корзине уже находится "+Строка(ЗаписьВКорзине.Количество)+" единиц на товара.");
					Исключение
						Сообщить("В корзине уже находится "+Строка(ЗаписьВКорзине.Количество)+" единиц на товара.");
					Конецпопытки;
					Возврат;
				КонецЕсли;
			КонецЕсли;
			
			Если Объект.ЗапрашиватьКоличество или Объект.ЗапрашиватьЦену или Объект.ЗапрашиватьСкидку Тогда
				ПараметрыФормы=Новый Структура("Номенклатура,Склад,Остаток,ЦенаПоУмолчанию,КонтрольОстатков,ЗапрашиватьКолво,ЗапрашиватьЦену,ЗапрашиватьСкидку",
				НоменклатураСсылка,Объект.ФильтрСкладЕмекс,МожноВКорзину,Запись.Цена,Объект.КонтрольОстатков,Объект.ЗапрашиватьКоличество,Объект.ЗапрашиватьЦену,Объект.ЗапрашиватьСкидку);
				Оповещение=Новый ОписаниеОповещения("ДобавитьВЗаявкуНаСервере",ЭтаФорма,Запись);
				ОткрытьФорму(Объект.ВнешняяОбработка+".Nirax_ПомощникАвтобизнесаОбщий.Форма.ВыборКоличестваУФ",ПараметрыФормы,ЭтаФорма,Истина,,,Оповещение);
			Иначе
				Данные=Новый Структура("Номенклатура,Склад,Количество,Цена,Скидка",
				НоменклатураСсылка,Объект.ФильтрСкладЕмекс,1,Запись.Цена,0);
				ДобавитьВЗаявкуНаСервере(Данные,Запись);
			КонецЕсли;
			
		ИначеЕсли Расшифровка.Действие = "ДобавитьДетальВБазу" Тогда
			
			Запись = Расшифровка.Запись;
			Если ЗначениеЗаполнено(Запись.Номенклатура) Тогда
				ОткрытьФорму("Справочник.Номенклатура.ФормаОбъекта",Новый Структура("Ключ",Запись.Номенклатура),Запись.Номенклатура);
				//Запись.Номенклатура.ПолучитьФорму("ФормаЭлемента").Открыть();
			Иначе
				НоменклатураСсылка = ДобавлениеТовараВБазуЕмекс(Запись);
				Если НоменклатураСсылка <> Неопределено Тогда
					Если Объект.ЗапрашиватьГруппуНоменклатуры Тогда
						Оповещение = Новый ОписаниеОповещения("ВходВгруппуЕмексДобавить", ЭтаФорма, НоменклатураСсылка);
				        ПараметрыФормы = Новый Структура("УникальныйИдентификатор", новый УникальныйИдентификатор);
						ОткрытьФорму("Справочник.Номенклатура.ФормаВыбораГруппы",ПараметрыФормы,,,,,Оповещение);
					Иначе
						ОткрытьФорму("Справочник.Номенклатура.ФормаОбъекта",Новый Структура("Ключ",НоменклатураСсылка),НоменклатураСсылка);
					КонецЕсли;
					
				КонецЕсли; 
			КонецЕсли;
			
		ИначеЕсли Расшифровка.Действие = "ОткрытьФорму" Тогда
		
			ОткрытьФорму("Справочник.Номенклатура.ФормаОбъекта",Новый Структура("Ключ",Расшифровка.Значение),Расшифровка.Значение);
			
		ИначеЕсли Расшифровка.Действие = "ПоискЦенТоваров" Тогда
			ПоискЦенТоваровСервер(Расшифровка.Данные,Врег(ПодготовитьНомер(Объект.НомерАртикула)),Объект.ЕмексИскатьСЗаменамиИАналогами);
			
				
		КонецЕсли;
		
	Исключение
		
		Сообщить(ОписаниеОшибки());
		
	КонецПопытки;
КонецПроцедуры

//#КонецОбласти

//#Область ОбработчикиСобытийЭлементовСтраницыПоискаПоАвтомобилю

&НаКлиенте
Процедура ТипАвтоПриИзменении(Элемент)
	Если ТипАвто="коду двигателя" Тогда
		Элементы.ФильтрМодельАвто.Видимость=Ложь;
		Элементы.КодДвигателя.Видимость=Истина;
	Иначе
		Элементы.ФильтрМодельАвто.Видимость=Истина;
		Элементы.КодДвигателя.Видимость=Ложь;
		Если ТипАвто="" Тогда
			ТипАвто="всем автомобилям";
		КонецЕсли;
	КонецЕсли;
	Элементы.ФильтрФирмаАвто.СписокВыбора.Очистить();
	ФильтрФирмаАвто="";
	КодДвигателя="";
	Состояние("Производится загрузка списка торговых марок.       Ж Д И Т Е . . .");
	
	//Элементы.ФильтрФирмаАвто.СписокВыбора.ВыбратьЭлемент();
	Элементы.ФильтрМодельАвто.СписокВыбора.Очистить();
	Элементы.ФильтрМодельАвто.Доступность=Ложь;
	Элементы.ЗагрузитьПоМодели.Доступность=Ложь;
	//Вызовем процедуру вывода марок
	ВыводМарокАвтоНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ФильтрФирмаАвтоПриИзменении(Элемент)
	КодДвигателя="";	
	Если ФильтрФирмаАвто="" Тогда	
		Элементы.ФильтрМодельАвто.СписокВыбора.Очистить(); 
		ФильтрМодельАвто = "";
		Элементы.ФильтрМодельАвто.Доступность=Ложь;
		Элементы.ЗагрузитьПоМодели.Доступность=Ложь;
		Состояние("Производится загрузка списка торговых марок.       Ж Д И Т Е . . .");
		ВыводМарокАвтоНаСервере();
	Иначе
		ФильтрМодельАвто="";
		Состояние("Производится загрузка марок автомобилей.        Ж Д И Т Е . . .");
		ВыводОтфильтрованныхМарокАвтоНаСервере();
		Элементы.ФильтрМодельАвто.Доступность=Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ВыводМарокАвтоНаСервере()
	Обработка = РеквизитФормыВЗначение("Объект");
	Обработка.ВыводМарокАвто(ТипАвто,РезультатУзлы,Элементы.ФильтрФирмаАвто.СписокВыбора,ТЗДляФильтраМарок);
КонецПроцедуры

&НаСервере
Процедура ВыводОтфильтрованныхМарокАвтоНаСервере()
	Обработка = РеквизитФормыВЗначение("Объект");
	МСтрФирма=ТЗДляФильтраМарок.НайтиСтроки(Новый Структура("MFA_BRAND",ФильтрФирмаАвто));
	Если НРЕГ(Лев(ТипАвто,1))="к" Тогда
		Обработка.ВыводОтфильтрованныхМарокАвто(МСтрФирма[0],РезультатУзлы,Элементы.КодДвигателя.СписокВыбора,Истина);
	Иначе
		Обработка.ВыводОтфильтрованныхМарокАвто(МСтрФирма[0],РезультатУзлы,Элементы.ФильтрМодельАвто.СписокВыбора);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура КодДвигателяПриИзменении(Элемент)
	Состояние("Производится загрузка комплектаций автомобилей.         Ж Д И Т Е . . .");
	УзлыОбработкаНаСервере(Новый Структура("Действие,Значение", "РасшифровкаДвигателя", КодДвигателя), Неопределено);
КонецПроцедуры

&НаСервере
Процедура УзлыОбработкаНаСервере( Расшифровка, СтандартнаяОбработка)
	
	СтандартнаяОбработка=Ложь;
	Попытка
		Если Расшифровка.Действие="РасшифровкаМодели" Тогда
			//Запомним таблицу до расшифровки
			Если РезультатУзлы.Область(2,1,2,1).Текст<>"Типы комплектаций:" Тогда
				РезультатМарокДляВозврата.Очистить();
				РезультатМарокДляВозврата.Вывести(РезультатУзлы);
				РезультатМарокДляВозврата.ТекущаяОбласть=Элементы.РезультатУзлы.ТекущаяОбласть;
			КонецЕсли;
			ФильтрМодельАвто=Элементы.РезультатУзлы.ТекущаяОбласть.Текст;
			Обработка = РеквизитФормыВЗначение("Объект");
			Обработка.ВыводТаблицыТипов(Расшифровка.Значение, РезультатУзлы);
		ИначеЕсли Расшифровка.Действие="РасшифровкаБренда" Тогда
			//Запомним таблицу до расшифровки
			ФильтрФирмаАвто=Расшифровка.Значение;
			ФильтрМодельАвто="";
			ВыводОтфильтрованныхМарокАвтоНаСервере();
			Элементы.ФильтрМодельАвто.Доступность=Истина;
		ИначеЕсли Расшифровка.Действие="НазадКМаркам" Тогда
			//вернем таблице исходный марочный вид
			РезультатУзлы.Очистить();
			РезультатУзлы.Вывести(РезультатМарокДляВозврата);
			Элементы.РезультатУзлы.ТекущаяОбласть=РезультатМарокДляВозврата.ТекущаяОбласть;
		ИначеЕсли Расшифровка.Действие="РасшифровкаОписания" Тогда
			Элементы.Группа4.Видимость=Ложь;
			Элементы.Группа5.Видимость=Истина;
			Обработка = РеквизитФормыВЗначение("Объект");
			Обработка.ВыводУзлов(Расшифровка.Значение, РезультатПоДереву, УзловоеДерево);
			ТипАвтоИзТаблицыТипов = Расшифровка.Значение;
			РезультатПоДереву.Очистить();
		ИначеЕсли Расшифровка.Действие="РасшифровкаДвигателя" Тогда
			Если РезультатУзлы.Область(2,1,2,1).Текст<>"Типы комплектаций:" Тогда
				РезультатМарокДляВозврата.Очистить();
				РезультатМарокДляВозврата.Вывести(РезультатУзлы);
				РезультатМарокДляВозврата.ТекущаяОбласть=Элементы.РезультатУзлы.ТекущаяОбласть;
			КонецЕсли;
			Если КодДвигателя<>Расшифровка.Значение Тогда КодДвигателя=Расшифровка.Значение;КонецЕсли;
			Обработка = РеквизитФормыВЗначение("Объект");
			Обработка.ВыводТаблицыТипов(Расшифровка.Значение, РезультатУзлы,Истина);
		КонецЕсли;
	Исключение
	КонецПопытки;
КонецПроцедуры

&НаКлиенте
Процедура ФильтрМодельАвтоПриИзменении(Элемент)
	
	Если Элемент.ВыделенныйТекст="" Тогда	
		Состояние("Производится загрузка марок автомобилей.        Ж Д И Т Е . . .");
		ВыводОтфильтрованныхМарокАвтоНаСервере();
		Элементы.ЗагрузитьПоМодели.Доступность=Ложь;
	Иначе
		Состояние("Производится загрузка модели автомобиля.        Ж Д И Т Е . . .");
		ФильтрМодельАвтоПриИзмененииНаСервере();
		Элементы.ЗагрузитьПоМодели.Доступность=Истина;
	КонецЕсли;
	
КонецПроцедуры

Процедура ФильтрМодельАвтоПриИзмененииНаСервере()
	Обработка = РеквизитФормыВЗначение("Объект");
	Обработка.ВыводОтфильтрованныхМоделейАвто(ФильтрФирмаАвто,ФильтрМодельАвто,РезультатУзлы,ТЗДляФильтраМарок);
	Элементы.РезультатУзлы.ТекущаяОбласть=РезультатУзлы.Область(1,1,1,1);
	
КонецПроцедуры

&НаКлиенте
Процедура РезультатУзлыОбработкаРасшифровки(Элемент, Расшифровка, СтандартнаяОбработка)
	Если Расшифровка=Неопределено тогда
		Если ТипЗнч(Элемент.ТекущаяОбласть)=Тип("РисунокТабличногоДокумента") тогда
			Расшифровка=Элемент.ТекущаяОбласть.Расшифровка;
		иначе
			Возврат;
		КонецЕсли;
	КонецЕсли;	
	
	Если Расшифровка.Действие="ЗагрузитьПоКомплектации" Тогда
		Состояние("Производится загрузка комплектующих автомобиля.  Ж Д И Т Е . . .");
		ПараметрыФормы=Новый Структура("Комплект", Расшифровка.Значение);
		ОткрытьФорму(Объект.ВнешняяОбработка+".Nirax_ПомощникАвтобизнесаОбщий.Форма.ФормаЗагрузкиУФ",ПараметрыФормы,ЭтаФорма);
	Иначе
		Состояние("Производится загрузка комплектаций автомобилей.         Ж Д И Т Е . . .");
		УзлыОбработкаНаСервере(Расшифровка, СтандартнаяОбработка);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура УзловоеДеревоПриАктивизацииСтроки(Элемент)
	
	попытка
		Если Элементы.УзловоеДерево.ТекущиеДанные<>Неопределено И Элементы.УзловоеДерево.ТекущиеДанные.ПолучитьЭлементы().Количество()=0 Тогда
			Если Элемент.ТекущиеДанные.Айди <> ОбработанныйУзелАйди или ОбработанныйУзелАйди="" тогда
				Элементы.РезультатПоДереву1.Видимость=Ложь;
				Элементы.РезультатПоДереву.Видимость=Истина;
				ОбработанныйУзелАйди=Элементы.УзловоеДерево.ТекущиеДанные.Айди;
				Состояние("Производится загрузка данных о комплектующих.     Ж Д И Т Е . . .");
				ПриАктивизацииНаСервере(Число(Элемент.ТекущиеДанные.айди));
			КонецЕсли;
		КонецЕсли;
	Исключение
		сообщить(ОписаниеОшибки());
	КонецПопытки;
	
КонецПроцедуры

&НаСервере                
Процедура ПриАктивизацииНаСервере(ТекДан) Экспорт
	РезультатПоДереву.Очистить();
	Обработка = РеквизитФормыВЗначение("Объект");
	ТЗРасшифровкаУзлов="";
	Обработка.ВыводРезультатаПоУзлам(ТЗРасшифровкаУзлов, РезультатПоДереву, ТекДан, 
	Элементы.РезультатУзлы.ТекущаяОбласть.Расшифровка.Значение);
КонецПроцедуры

&НаКлиенте
Процедура РезультатПоДеревуОбработкаРасшифровки(Элемент, Расшифровка, СтандартнаяОбработка)
	РезультатОбработкаРасшифровки(Элемент, Расшифровка, СтандартнаяОбработка)
КонецПроцедуры

&НаКлиенте
Процедура РезультатПоДереву1ОбработкаРасшифровки(Элемент, Расшифровка, СтандартнаяОбработка)
	РезультатОбработкаРасшифровки(Элемент, Расшифровка, СтандартнаяОбработка)
КонецПроцедуры

//#КонецОбласти

//#Область ОбработчикиСобытийЭлементовСтраницыКорзина

&НаКлиенте
Процедура ЗаявкаНаОформлениеПриИзменении(Элемент)
	Если  Объект.ЗаявкаНаОформление.Количество()>0 Тогда
		Данные=Новый Структура("Количество,Цена,Сумма,Скидка,СуммаСоСкидкой,СтавкаНДС,СуммаНДС,Всего");
		ЗаполнитьЗначенияСвойств(Данные,Элементы.ЗаявкаНаОформление.ТекущиеДанные);
		ЗаявкаНаОформлениеПриИзмененииНаСервере(Данные);
		ЗаполнитьЗначенияСвойств(Элементы.ЗаявкаНаОформление.ТекущиеДанные,Данные);
		СуммаКорзины=Объект.ЗаявкаНаОформление.Итог("Всего");
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ЗаявкаНаОформлениеПриИзмененииНаСервере(Данные)
	Обработка=РеквизитФормыВЗначение("Объект");
	Обработка.РассчитатьСуммы(Данные);
КонецПроцедуры

&НаКлиенте
Процедура ЗаявкаНаОформлениеПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	Если НоваяСтрока Тогда
		НовСтр=Элементы.ЗаявкаНаОформление.ТекущиеДанные;
		НовСтр.Склад=Объект.СкладДляЗаявки;
		НовСтр.СтавкаНДС=Объект.НДСПоУмолчанию;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ЗаявкаНаОформлениеПослеУдаления(Элемент)
	Колво=Объект.ЗаявкаНаОформление.Количество();
	Элементы.СтрКорзина.Заголовок="Корзина"+?(Колво=0,""," ("+Строка(Колво)+")");
	СуммаКорзины=Объект.ЗаявкаНаОформление.Итог("Всего");
КонецПроцедуры

&НаКлиенте
Процедура ЗаявкаНаОформлениеНаименованиеПриИзменении(Элемент)
	ЗаявкаНаОформлениеНаименованиеПриИзмененииНаСервере();
КонецПроцедуры

&НаСервере
Процедура ЗаявкаНаОформлениеНаименованиеПриИзмененииНаСервере()
	ТекСтр=Объект.ЗаявкаНаОформление.НайтиПоИдентификатору(Элементы.ЗаявкаНаОформление.ТекущаяСтрока);
	ТекСтр.Номенклатура=ТекСтр.Наименование;
	ТекСтр.Артикул=ТекСтр.Номенклатура.Артикул;
	Если ТекСтр.Номенклатура.Метаданные().Реквизиты.Найти("СтавкаНДС")<>Неопределено Тогда
		ТекСтр.СтавкаНДС=ТекСтр.Номенклатура.СтавкаНДС;
	КонецЕсли;
	Обработка=РеквизитФормыВЗначение("Объект");
	ТекСтр.Цена=Обработка.ПолучитьЦенуНоменклатуры(ТекСтр.Номенклатура,Объект.ТипЦен).Цена;
	Если ТекСтр.Количество=0 Тогда ТекСтр.Количество=1;КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ЗаявкаНаОформлениеКоличествоПриИзменении(Элемент)
	ЗаявкаНаОформлениеПриИзменении(Элемент);
КонецПроцедуры

&НаКлиенте
Процедура ЗаявкаНаОформлениеЦенаПриИзменении(Элемент)
	ЗаявкаНаОформлениеПриИзменении(Элемент);
КонецПроцедуры

&НаКлиенте
Процедура ЗаявкаНаОформлениеСкидкаПриИзменении(Элемент)
	ЗаявкаНаОформлениеПриИзменении(Элемент);
КонецПроцедуры

&НаКлиенте
Процедура ЗаявкаНаОформлениеСтавкаНдсПриИзменении(Элемент)
	ЗаявкаНаОформлениеПриИзменении(Элемент);
КонецПроцедуры


//#КонецОбласти

//#Область ОбработчикиСобытийЭлементовЗаказаПоставщику

&НаКлиенте
Процедура ЗаявкаПоставщикуПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	Если НоваяСтрока Тогда
		НовСтр=Элементы.ЗаявкаПоставщику.ТекущиеДанные;
		НовСтр.Склад=Объект.Склад;
		НовСтр.СтавкаНДС=Объект.НДСПоУмолчанию;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ЗаявкаПоставщикуПослеУдаления(Элемент)
	Элементы.Группа10.Заголовок="Заказ поставщику ("+Строка(Объект.ЗаявкаПоставщику.Количество())+")";
КонецПроцедуры

&НаКлиенте
Процедура ЗаявкаПоставщикуНоменклатураПриИзменении(Элемент)
	ЗаявкаПоставщикуНоменклатураПриИзмененииНаСервере();
КонецПроцедуры

&НаСервере
Процедура ЗаявкаПоставщикуНоменклатураПриИзмененииНаСервере()
	ТекСтр=Объект.ЗаявкаПоставщику.НайтиПоИдентификатору(Элементы.ЗаявкаПоставщику.ТекущаяСтрока);
	ТекСтр.Артикул=ТекСтр.Номенклатура.Артикул;
	Если ТекСтр.Номенклатура.Метаданные().Реквизиты.Найти("СтавкаНДС")<>Неопределено Тогда
		ТекСтр.СтавкаНДС=ТекСтр.Номенклатура.СтавкаНДС;
	КонецЕсли;
	Если ТекСтр.Количество=0 Тогда ТекСтр.Количество=1;КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ЗаявкаПоставщикуПриИзменении(Элемент)
	
	ИзмКолПостНаСервере(Элементы.ЗаявкаПоставщику.ТекущиеДанные.НомерСтроки-1);	
	
КонецПроцедуры

&НаСервере
Процедура ИзмКолПостНаСервере(НомерСтр)
	ТекДанные=Объект.ЗаявкаПоставщику.Получить(НомерСтр);
	Обработка=РеквизитФормыВЗначение("Объект");
	Обработка.РассчитатьСуммы(ТекДанные);
КонецПроцедуры

&НаКлиенте
Процедура ЗаявкаПоставщикуКоличествоПриИзменении(Элемент)
	ЗаявкаПоставщикуПриИзменении(Элемент);
КонецПроцедуры

&НаКлиенте
Процедура ЗаявкаПоставщикуЦенаПриИзменении(Элемент)
	ЗаявкаПоставщикуПриИзменении(Элемент);
КонецПроцедуры

&НаКлиенте
Процедура ЗаявкаПоставщикуСтавкаНдсПриИзменении(Элемент)
	ЗаявкаПоставщикуПриИзменении(Элемент);
КонецПроцедуры

//#КонецОбласти

//#Область ОбработчикиКоманд
//       ****** Шапка формы *****
&НаКлиенте
Процедура АвтодилерТест(Команда)
	ПолучитьФорму(Объект.ВнешняяОбработка+".Nirax_ПомощникАвтобизнесаОбщий.Форма.АвтоДилер_ПоискПоАвтомобилю",,ЭтаФорма).Открыть();
КонецПроцедуры
	
&НаКлиенте
Процедура НайтиАртикул(Команда)
	
	Попытка
		Если ЭтаФорма.Элементы.Страницы.ТекущаяСтраница = ЭтаФорма.Элементы.СтраницаПоискПоВИН Тогда
			ПоискПоВИН(); Возврат;
		КонецЕсли;
		СписокГрупп = "";
		Если ЭтаФорма.Элементы.Страницы.ТекущаяСтраница = ЭтаФорма.Элементы.СтраницаПоискПоАртикулу или Объект.ОбщийПоискВрем Тогда
			//Заполнение таблицы выбора групп
			Если  Объект.ВыбиратьГруппу Тогда
				Группы=ЗаполнитьТаблицуГрупп();
				Если Группы.Количество()>1 Тогда
					Оповещение=Новый ОписаниеОповещения("ПоискПоАртикулу",ЭтаФорма);
					ОткрытьФорму(Объект.ВнешняяОбработка+".Nirax_ПомощникАвтобизнесаОбщий.Форма.ФормаВыбораГруппыУФ",Новый Структура("Группы",Группы),ЭтаФорма,Истина,,,Оповещение);
					Возврат;
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
		ПоискПоАртикулу(СписокГрупп);
	Исключение
		Сообщить(ОписаниеОшибки());
	КонецПопытки;
		
КонецПроцедуры

&НаКлиенте  
Процедура Настройки(Команда)
	ОткрытьФорму(Объект.ВнешняяОбработка+".Nirax_ПомощникАвтобизнесаОбщий.Форма.НастройкиУФ",,ЭтаФорма);
	
КонецПроцедуры   

&НаКлиенте
Процедура ОПрограмме(Команда)
	Попытка
		ОткрытьФормуМодально(Объект.ВнешняяОбработка+".Nirax_ПомощникАвтобизнесаОбщий.Форма.ОПрограммеУФ", , ЭтаФорма);
	Исключение
		ОткрытьФорму(Объект.ВнешняяОбработка+".Nirax_ПомощникАвтобизнесаОбщий.Форма.ОПрограммеУФ", , ЭтаФорма);
	Конецпопытки;
КонецПроцедуры

//      ****** общие команды  ******
&НаКлиенте
Процедура Дополнительно(Команда)
	Страница=Сред(Команда.Имя,14);
	Если Страница="Поставщикам" Тогда
		ТекДан=Элементы.ЗаявкаПоставщику.ТекущиеДанные;
		ТекСтр=Элементы.ЗаявкаПоставщику.ТекущаяСтрока;
		Если ТекДан=Неопределено Тогда
			ПараметрыФормы=Новый Структура("Страница,Сайт,Состояние",Страница,Неопределено,Неопределено);
		Иначе
			ПараметрыФормы=Новый Структура("Страница,Сайт,Состояние",Страница,ТекДан.Сайт,ТекДан.Состояние);
		КонецЕсли;
	ИначеЕсли Страница="Корзина" Тогда
		ТекДан=Элементы.ЗаявкаНаОформление.ТекущиеДанные;
		ТекСтр=Элементы.ЗаявкаНаОформление.ТекущаяСтрока;
		Если ТекДан=Неопределено Тогда
			ПараметрыФормы=Новый Структура("Страница,Сайт",Страница,Неопределено);
		Иначе
			ПараметрыФормы=Новый Структура("Страница,Сайт",Страница,ТекДан.Сайт);
		КонецЕсли;
	Иначе
		ТекСтр=Неопределено;
		ПараметрыФормы=Новый Структура("Страница",Страница);
	КонецЕсли;	
	ПараметрыФормы.Вставить("ПараметрыПользователя",Объект.СпецНаз.НастройкиПользователя);
		
	Если Объект.РежимМодальности Тогда
		Рез=ОткрытьФормуМодально(Объект.ВнешняяОбработка+".Nirax_ПомощникАвтобизнесаОбщий.Форма.ДополнительноУФ",ПараметрыФормы,ЭтаФорма);
		Если Рез=Неопределено Тогда Возврат;КонецЕсли;
		ВыполнитьДопМетодНаКлиенте(Рез,ТекСтр);
	Иначе
		Оповещение=Новый ОписаниеОповещения("ВыполнитьДопМетодНаКлиенте",ЭтаФорма,ТекСтр);
		ОткрытьФорму(Объект.ВнешняяОбработка+".Nirax_ПомощникАвтобизнесаОбщий.Форма.ДополнительноУФ",ПараметрыФормы,ЭтаФорма,ПараметрыФормы,ВариантОткрытияОкна.ОтдельноеОкно,Оповещение);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьДопМетодНаКлиенте(Метод,ТекСтр) Экспорт
	Если Метод.НаКлиенте Тогда
		Рез=ВыполнитьМетодНаКлиенте(Метод,ТекСтр);
	Иначе
		Если Метод.Страница="Поставщикам" Тогда
			Если ТекСтр=Неопределено Тогда
				ТекДанные=Неопределено;
				ТекНом=Неопределено;
			Иначе
				ТекДанные=Объект.ЗаявкаПоставщику.НайтиПоИдентификатору(ТекСтр);
			    ТекНом=ТекДанные.НомерСтроки-1;
			КонецЕсли;
		ИначеЕсли Метод.Страница="Корзина" Тогда
			Если ТекСтр=Неопределено Тогда
				ТекДанные=Неопределено;
				ТекНом=Неопределено;
			Иначе
				ТекДанные=Объект.ЗаявкаНаОформление.НайтиПоИдентификатору(ТекСтр);
			    ТекНом=ТекДанные.НомерСтроки-1;
			КонецЕсли;
		Иначе
			ТекНом=Неопределено;
		КонецЕсли;
		//Параметры: Метиод - структура: Сайт, Метод из проценки
		//Номер строки из ТЧ ЗаявкиПоставщиков
	 	Рез=ВыполнитьДопМетодНаСервере(Метод,ТекНом);
	КонецЕсли;
	
	//Обработка результата выполнения метода:
	// Строка - сообщение об ошибке
	// Неопределено или Ложь - не выполнен
	// Истина - выполнен;
	// Табличный документ - выводится
	// Структура - изменены параметры (строки/заказа)
	//   если количество = 0 удалить - строку/заказ
	// Массив структур - требуется синхронизация
	
	// Если текст - сообщение об ошибке
	Если ТипЗнч(Рез)=Тип("Строка") Тогда
		ЕСли Не ПустаяСтрока(Рез) Тогда
			Если Объект.РежимМодальности Тогда
				Предупреждение(Рез);
			Иначе
				Сообщить(Рез);
			КонецЕсли;
		КонецЕсли;
		Возврат;
	КонецЕсли;
	
	// Если Табличный документ - показать его
	Если ТипЗнч(Рез)=Тип("ТабличныйДокумент") Тогда
		Рез.Показать();       //"Данные о исполняемых заказах на сайте autologist.ru");
		Возврат;
	КонецЕсли;
	
	Если ТипЗнч(Рез)=Тип("Булево") или Рез=Неопределено Тогда
		Если Рез=Неопределено или Рез=Ложь Тогда
			Текст = "Запрашиваемый метод не выполнен по неопределенным причинам";
		Иначе
			//Если выполнен - преобразования в соответствии с методом
			Текст= "Успешное завершение";
		КонецЕсли;
		Если Объект.РежимМодальности Тогда
			Предупреждение(Текст);
		Иначе
			Сообщить(Текст);
		КонецЕсли;
		Возврат;
	КонецЕсли;
	
	Если ТипЗнч(Рез)=Тип("Структура") Тогда
		Если Метод.Страница="Поставщикам" Тогда
			// Формируем массив строк изменяемых записей
			Если Метод.Объект="Запись" Тогда
				Мсиз=Новый Массив;
				МСиз.Добавить(ТекДанные);
			Иначе
				Отбор=Новый Структура("Сайт,Состояние",Метод.Сайт,Метод.Состояние);
				МСиз=Объект.ЗаявкаПоставщику.НайтиСтроки(Отбор);
			КонецЕсли;
			
			// Проверка на удаление записей
			Если Рез.Свойство("Количество") и Рез.Количество=0 Тогда
				Для Каждого Стр Из МСиз Цикл
					Объект.ЗаявкаПоставщику.Удалить(Стр);
				КонецЦикла;
			Иначе
				Для Каждого Стр Из МСиз Цикл
					ЗаполнитьЗначенияСвойств(Стр,Рез);
				КонецЦикла;
			КонецЕсли;
			Возврат;
		ИначеЕсли Метод.Страница="Корзина" Тогда
			Если Метод.Объект="Запись" Тогда
				Мсиз=Новый Массив;
				МСиз.Добавить(ТекДанные);
			Иначе
				Отбор=Новый Структура("Сайт",Метод.Сайт);
				МСиз=Объект.ЗаявкаНаОформление.НайтиСтроки(Отбор);
			КонецЕсли;
			
			// Проверка на удаление записей
			Если Рез.Свойство("Количество") и Рез.Количество=0 Тогда
				Для Каждого Стр Из МСиз Цикл
					Объект.ЗаявкаНаОформление.Удалить(Стр);
				КонецЦикла;
			Иначе
				Для Каждого Стр Из МСиз Цикл
					ЗаполнитьЗначенияСвойств(Стр,Рез);
				КонецЦикла;
			КонецЕсли;
			Возврат;
		 КонецЕсли;
	КонецЕсли;
	
	Предупреждение("Метод выполнен, но обработка данных выполнения еще не реализована");
	
КонецПроцедуры

&НаСервере
Функция ВыполнитьДопМетодНаСервере(Метод,ТекСтр)
	Обработка=РеквизитФормыВЗначение("Объект");
	Возврат Обработка.ВыполнитьДопМетод(Метод,ТекСтр);
КонецФункции

//      ****** Станица поиска по прайс-листам ******
&НаКлиенте
Процедура НастройкаПоставщиков(Команда)
	
	ОткрытьФорму(Объект.ВнешняяОбработка+".Nirax_ПомощникАвтобизнесаОбщий.Форма.ФормаУФ");
	
КонецПроцедуры

//      ****** Станица поиска онлайн ******
&НаКлиенте
Процедура ОтборПоНаличию(Команда)
	ОтборПараметры=Новый	Структура("Склад,ЕстьНаСкладе,ЕстьУПоставщика",Объект.ФильтрСкладЕмекс,ЕстьНаСкладе,ЕстьУПоставщика);
	КолЕмекс=ОтборПоНаличиюНаСервере(ОтборПараметры);
	Если ЗначениеЗаполнено(КолЕмекс) И КолЕмекс > 0 Тогда
		Элементы.ПоискЕмекс.Заголовок = "Поиск по артикулу (онлайн поставщики) (" + КолЕмекс + ")";
	Иначе
		Элементы.ПоискЕмекс.Заголовок = "Поиск по артикулу (онлайн поставщики)";
	КонецЕСли;
КонецПроцедуры

&НаСервере
Функция ОтборПоНаличиюНаСервере(ОтборПараметры)
	ТЗ = РезультатПоискаЕмекс.Выгрузить();
	ЭтоОбъект=РеквизитФормыВЗначение("Объект");
	Возврат ЭтоОбъект.ВыводРезультатаПоискаЕмекс(ТЗ,РезультатЕмекс,ОтборПараметры);
КонецФункции
	
//      ****** Станица поиска по автомобилю ******
&НаКлиенте
Процедура ЗагрузитьПоМодели(Команда)
	ИскомаяМарка=ТЗДляФильтраМарок.НайтиСтроки(Новый Структура("MFA_BRAND",ФильтрФирмаАвто));
	ПараметрыФормы=Новый Структура("Марка, Модель", ИскомаяМарка[0].MFA_ID, ФильтрМодельАвто);	
	ОткрытьФорму(Объект.ВнешняяОбработка+".Nirax_ПомощникАвтобизнесаОбщий.Форма.ФормаЗагрузкиУФ",ПараметрыФормы,ЭтаФорма);
КонецПроцедуры

&НаКлиенте
Процедура Назад(Команда)
	
	Элементы.Группа5.Видимость=Ложь;
	Элементы.Группа4.Видимость=Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьПоУзлу(Команда)
	Если ОбработанныйУзелАйди<>"" Тогда
		ПараметрыФормы=Новый Структура("Узел, Комплект", ОбработанныйУзелАйди, ТипАвтоИзТаблицыТипов);	
		ОткрытьФорму(Объект.ВнешняяОбработка+".Nirax_ПомощникАвтобизнесаОбщий.Форма.ФормаЗагрузкиУФ",ПараметрыФормы, ЭтаФорма);
	Иначе
		Сообщить("Не выбран узел для обработки!");
	КонецЕсли;
КонецПроцедуры

//      ****** Станица Корзина ******
&НаКлиенте
Процедура ОформитьЗаявку(Команда,СКодомЗаказа=Ложь)
	НетДокумента= НЕ (Объект.ЗаказПокупателяВрем ИЛИ Объект.РеализацияТоваровВрем ИЛИ Объект.СчетФактураВрем);
	НетЗаказов = Объект.ЗаявкаНаОформление.НайтиСтроки(Новый Структура("Выбран",Истина)).Количество()=0;
	Если НетДокумента ИЛИ НетЗаказов Тогда
		Если Объект.РежимМодальности Тогда
			Предупреждение(?(НетДокумента,"Не определен ни один тип документа для оформления"+Символы.ПС,"")+
			?(НетЗаказов,"Ни одна заявка не отмечена для оформления документов",""));
		Иначе
			Сообщить(?(НетДокумента,"Не определен ни один тип документа для оформления"+Символы.ПС,"")+
			?(НетЗаказов,"Ни одна заявка не отмечена для оформления документов",""));
		КонецЕсли;
		Возврат;
	КонецЕсли;
	Рез=КонтрольДанныхДляДокументовНаСервере();
	Если Рез<>"" Тогда
		Если Объект.РежимМодальности Тогда
			Если Лев(Рез,1)="!" Тогда
				Предупреждение("Для оформления документов необходимо в настройках и форме определить следующие данные:"+
				Символы.ПС+Сред(Рез,2));
				Возврат;
			ИначеЕсли Вопрос("Для оформления документов рекомендуется в настройках и форме определить следующие данные:"+
				Символы.ПС+Сред(Рез,2)+Символы.ПС+"Отменить оформление документов?",РежимДиалогаВопрос.ДаНет,,КодВозвратаДиалога.Да)=КодВозвратаДиалога.Да Тогда
				Возврат;
			КонецЕсли;
		ИначеЕсли Лев(Рез,1)="!" Тогда
			Сообщить("Для оформления документов необходимо в настройках и форме определить следующие данные:"+
			Символы.ПС+Сред(Рез,2));
			Возврат;
		Иначе
			
		КонецЕсли;
	КонецЕсли;
	МасДок=ОформитьЗаявкуНаСервере();
	Для Каждого Стр Из МасДок Цикл
		ОткрытьФорму("Документ."+Стр.Имя+".ФормаОбъекта",Стр);
	КонецЦикла;
КонецПроцедуры

&НаСервере      
Функция КонтрольДанныхДляДокументовНаСервере()
	Обработка=РеквизитФормыВЗначение("Объект");
	Возврат Обработка.КонтрольДанныхДляДокументов();
КонецФункции

&НаСервере
Функция ОформитьЗаявкуНаСервере()
	Обработка=РеквизитФормыВЗначение("Объект");
	МасДок=Обработка.ОформитьЗаявку();
	Если Объект.ЗаказПокупателяВрем Тогда
		Для Каждого Элем из МасДок Цикл
			Если НЕ Элем.Свойство("Склад") Тогда Продолжить; КонецЕсли;
			ЗаказМета=МетаДанные.Документы[Элем.Имя];
			Если ЗаказМета.ТабличныеЧасти.Найти("Товары")<>Неопределено Тогда
				ЗаказТовар="Товары";
			ИначеЕсли ЗаказМета.ТабличныеЧасти.Найти("Запасы")<>Неопределено  Тогда
				ЗаказТовар="Запасы";
			Иначе
				Прервать;
			КонецЕсли;
			Если Элем.Склад=Объект.СкладДляЗаявки Тогда
				Отбор=Новый Структура("Выбран,Номенклатура",Истина);
				Для Каждого Стр Из Элем.Ключ[ЗаказТовар] Цикл
					Отбор.Номенклатура=Стр.Номенклатура;
					МасРез=Объект.ЗаявкаНаОформление.НайтиСтроки(Отбор);
					Для Каждого ЭлРез Из МасРез Цикл
						Если ТипЗнч(ЭлРез.Склад)=Тип("Строка") или ЭлРез.Склад=Объект.СкладДляЗаявки Или
							Не ЗначениеЗаполнено(ЭлРез.Склад) ТОгда
							ЭлРез.ЗаказПокупателя=Элем.Ключ;
							Прервать;
						КонецЕсли;
					КонецЦикла;
				КонецЦикла;
			Иначе
				Отбор=Новый Структура("Выбран,Склад,Номенклатура",Истина,Элем.Склад);
				Для Каждого Стр из Элем.Ключ[ЗаказТовар] Цикл
					Отбор.Номенклатура=Стр.Номенклатура;
					МасРез=Объект.ЗаявкаНаОформление.НайтиСтроки(Отбор);
					Если МасРез.Количество()>0 Тогда
						МасРез[0].ЗаказПокупателя=Элем.Ключ;
					КонецЕсли;
				КонецЦикла;
			КонецЕсли;
		КонецЦикла;			
	КонецЕсли;		
	Возврат МасДок;
КонецФункции

&НаКлиенте
Процедура ОформитьЧекККМ(Команда)
	ЧекККМСсылка=ОформитьЧекККМНаСервере();
	Если ЗначениеЗаполнено(ЧекККМСсылка) Тогда
		  ОткрытьЗначение(ЧекККМСсылка);  
	КонецЕсли;	
КонецПроцедуры

&НаСервере
Функция ОформитьЧекККМНаСервере()
	
	Попытка
	
		Чек = Документы.ЧекККМ.СоздатьДокумент(); 		
		Чек.Дата = ТекущаяДата();
		Чек.КассаККМ = Объект.КассаККМ;
		Чек.Организация = Объект.ОрганизацияДляЗаявки;
		Чек.СуммаДокумента = СуммаКорзины;
		Попытка
			Чек.ЦенаВключаетНДС = Истина;
		Исключение
		    Чек.СуммаВключаетНДС = Истина;
		КонецПопытки;
		
		Если Объект.Конфигурация = "УправлениеТорговлей 11.0" ИЛИ
				 Объект.Конфигурация = "УправлениеТорговлей 11.1.2" ИЛИ
				 Объект.Конфигурация = "УправлениеТорговлей 11.1.4" Тогда
			Попытка	 
				Чек.Склад = Объект.СкладДляЗаявки;
				Чек.Партнер = Объект.КонтрагентДляЗаявки.Партнер;
				Чек.ВидЦены = Объект.ТипЦен;
				Чек.НалогообложениеНДС = Перечисления.ТипыНалогообложенияНДС.ПродажаОблагаетсяНДС;
				Чек.Кассир = ПараметрыСеанса.ТекущийПользователь;
				Чек.Валюта = Объект.ТипЦен.ВалютаЦены;
				Если НЕ Чек.Метаданные().Реквизиты.Найти("КассоваяСмена") = Неопределено Тогда
					Запрос = Новый Запрос(
					"ВЫБРАТЬ ПЕРВЫЕ 1
					|	КассоваяСмена.Номер               КАК НомерКассовойСмены,
					|	КассоваяСмена.Ссылка              КАК КассоваяСмена,
					|	КассоваяСмена.СтатусКассовойСмены КАК СтатусКассовойСмены,
					|	
					|	КассоваяСмена.КассаККМ             КАК КассаККМ,
					|	КассоваяСмена.Валюта               КАК Валюта,
					|	КассоваяСмена.Валюта.Представление КАК ВалютаПредставление,
					|	КассоваяСмена.ВидЦены              КАК ВидЦены,
					|	КассоваяСмена.Организация          КАК Организация,
					|	КассоваяСмена.Кассир               КАК Кассир,
					|	КассоваяСмена.Склад                КАК Склад,
					|	КассоваяСмена.ЦенаВключаетНДС      КАК ЦенаВключаетНДС,
					|	КассоваяСмена.НалогообложениеНДС   КАК НалогообложениеНДС,
					|	
					|	ВЫБОР
					|		КОГДА КассоваяСмена.СтатусКассовойСмены = ЗНАЧЕНИЕ(Перечисление.СтатусыКассовойСмены.Открыта)
					|			ТОГДА ИСТИНА
					|		ИНАЧЕ ЛОЖЬ
					|	КОНЕЦ КАК СменаОткрыта,
					|	
					|	ВЫБОР
					|		КОГДА КассоваяСмена.СтатусКассовойСмены = ЗНАЧЕНИЕ(Перечисление.СтатусыКассовойСмены.Открыта)
					|			ТОГДА КассоваяСмена.НачалоКассовойСмены
					|		ИНАЧЕ КассоваяСмена.ОкончаниеКассовойСмены
					|	КОНЕЦ КАК ДатаИзмененияСтатуса,
					|	
					|	ЕСТЬNULL(ДенежныеСредстваВКассахККМОстатки.СуммаОстаток, 0) КАК НаличностьВКассе
					|	
					|ИЗ
					|	Документ.КассоваяСмена КАК КассоваяСмена
					|	
					|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ДенежныеСредстваВКассахККМ.Остатки(, КассаККМ = &КассаККМ) КАК ДенежныеСредстваВКассахККМОстатки
					|		ПО КассоваяСмена.КассаККМ = ДенежныеСредстваВКассахККМОстатки.КассаККМ
					|	
					|ГДЕ
					|	КассоваяСмена.Проведен
					|	И КассоваяСмена.КассаККМ = &КассаККМ
					|
					|УПОРЯДОЧИТЬ ПО
					|	КассоваяСмена.Дата УБЫВ,
					|	КассоваяСмена УБЫВ");
					Запрос.УстановитьПараметр("КассаККМ",Объект.КассаККМ);
					Выборка = Запрос.Выполнить().Выбрать();
					Если Выборка.Следующий() Тогда
						Чек.КассоваяСмена = Выборка.КассоваяСмена;
					КонецЕсли;
				КонецЕсли;
			Исключение
				Чек.СтруктурнаяЕдиница = Объект.СкладДляЗаявки;
				Чек.асВидОперации = Перечисления.асВидыОперацийЧекККМ.ЧекККМ;
				Чек.ФормаОплаты = Перечисления.ТипыДенежныхСредств.Наличные;
				Чек.ВидЦен = Объект.ТипЦен;
				Чек.НалогообложениеНДС = Перечисления.ТипыНалогообложенияНДС.ОблагаетсяНДС;
				Чек.Автор = ПараметрыСеанса.ТекущийПользователь;
				Чек.ВалютаДокумента = Объект.ТипЦен.ВалютаЦены;
			КонецПопытки;
			
		ИначеЕсли Объект.Конфигурация = "РозницаМагазинАвтозапчастей 2.1" 
			или  Объект.Конфигурация = "РозницаМагазинАвтозапчастей 2.0"
			Тогда
			Чек.ВидОперации=Перечисления.ВидыОперацийЧекККМ.Продажа;
			Чек.АналитикаХозяйственнойОперации=Справочники.АналитикаХозяйственныхОпераций.РеализацияТоваров;
			Чек.Магазин=объект.КассаККМ.Магазин;
		КонецЕсли;
		
		Для каждого Строка Из Объект.ЗаявкаНаОформление Цикл
		    Попытка
				ЧекСтрока = Чек.Товары.Добавить();
				ЧекСтрока.Номенклатура = Строка.Наименование;
				ЧекСтрока.ПроцентРучнойСкидки = Строка.Скидка;
				ЧекСтрока.СуммаРучнойСкидки = Строка.Сумма - Строка.СуммаСоСкидкой;
				ЧекСтрока.КоличествоУпаковок = Строка.Количество;
				ЧекСтрока.Количество = Строка.Количество;
				ЧекСтрока.Цена = Строка.Цена;
				ЧекСтрока.Сумма = Строка.СуммаСоСкидкой;
				ЧекСтрока.СтавкаНДС = Строка.СтавкаНДС;
				ЧекСтрока.СуммаНДС = Строка.СуммаНДС;
				Если НЕ Чек.метаданные().ТабличныеЧасти.Товары.Реквизиты.Найти("Продавец") = Неопределено Тогда
					ЧекСтрока.Продавец = ПараметрыСеанса.ТекущийПользователь;
				КонецЕсли;
			Исключение
				ЧекСтрока = Чек.Запасы.Добавить();
				ЧекСтрока.Номенклатура = Строка.Наименование;
				ЧекСтрока.ЕдиницаИзмерения = Строка.Наименование.ЕдиницаИзмерения;
				ЧекСтрока.Количество = Строка.Количество;
				ЧекСтрока.Цена = Строка.Цена;
				ЧекСтрока.Сумма = Строка.СуммаСоСкидкой;
				ЧекСтрока.СтавкаНДС = Строка.СтавкаНДС;
				ЧекСтрока.СуммаНДС = Строка.СуммаНДС;
				ЧекСтрока.Всего = Строка.Всего;
			КонецПопытки;
			
			Если Объект.Конфигурация = "РозницаМагазинАвтозапчастей 2.1" 
				 или Объект.Конфигурация = "РозницаМагазинАвтозапчастей 2.0"				
				Тогда
				ЧекСтрока.Склад=объект.Склад;
			КонецЕсли;
		КонецЦикла; 
		
		Чек.Записать();
		Возврат Чек.Ссылка;
	
	Исключение
		Сообщить(ОписаниеОшибки());
		Возврат Неопределено;
	КонецПопытки;	
	
КонецФункции

&НаКлиенте
Процедура ОчиститьЗаявку(Команда)
	Попытка
		Отбор=Новый Структура("Выбран",Истина);
		Массив = Объект.ЗаявкаНаОформление.НайтиСтроки(Отбор);
		Если Массив.Количество()>0 Тогда
			Ответ = Вопрос("Удалить все записи ( Да ) или только выбранные ( Нет ) ?", РежимДиалогаВопрос.ДаНетОтмена,,КодВозвратаДиалога.Нет);
			Если Ответ = КодВозвратаДиалога.Отмена Тогда Возврат;
			ИначеЕсли Ответ = КодВозвратаДиалога.Нет Тогда
				Для Каждого Стр Из Массив Цикл
					Объект.ЗаявкаНаОформление.Удалить(Стр);
				КонецЦикла;
				ЗаявкаНаОформлениеПослеУдаления(Неопределено);
				Возврат;
			КонецЕсли;
		Иначе
			Ответ = Вопрос("Удалить все записи ?", РежимДиалогаВопрос.ДаНет,,КодВозвратаДиалога.Нет);
			Если Ответ = КодВозвратаДиалога.Нет Тогда Возврат;КонецЕсли;
		КонецЕСли;
	Исключение
	КонецПопытки;
	Объект.ЗаявкаНаОформление.Очистить();
	ЗаявкаНаОформлениеПослеУдаления(Неопределено);
КонецПроцедуры

&НаКлиенте
Процедура ВКорзинуОнлайн(Команда)
	Если Объект.ЗаявкаНаОформление.НайтиСтроки(Новый Структура("Выбран",Истина)).Количество()=0 Тогда
		Текст="Нет ни одной отмеченной заявки для переноса в корзину поставщика";
		Если Объект.РежимМодальности Тогда
			Предупреждение(Текст);
		Иначе
			Сообщить(Текст);
		КонецЕсли;
	Иначе
		ВКорзинуОнлайнНаСервере();
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ВКорзинуОнлайнНаСервере()
	Обработка=РеквизитФормыВЗначение("Объект");
	Обработка.ВКорзинуПроценки(Объект.ЗаявкаНаОформление,Объект.ЗаявкаПоставщику);
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьФлажки(Команда)
	Флаг=Команда.Имя="УстановитьФлажки";
	Для каждого СтрокаТЗ Из Объект.ЗаявкаНаОформление Цикл
	  Если Флаг = Неопределено Тогда
		  СтрокаТЗ.Выбран = НЕ СтрокаТЗ.Выбран;
		Иначе	
		  СтрокаТЗ.Выбран = Флаг;
		КонецЕсли; 
	КонецЦикла; 
КонецПроцедуры

&НаКлиенте
Процедура КПоставщику(Команда)
	МасСтр=Объект.ЗаявкаНаОформление.НайтиСтроки(Новый Структура("Выбран",Истина));
	Если МасСтр.Количество()=0 Тогда
		МасСтр.Добавить(Элементы.ЗаявкаНаОформление.ТекущаяСтрока);
	КонецЕсли;
	Для Каждого Заявка из МасСтр Цикл
		Нов=Объект.ЗаявкаПоставщику.Добавить();
		ЗаполнитьЗначенияСвойств(Нов,Заявка,"Номенклатура,Артикул,Количество,СтавкаНДС");
		Если ЗначениеЗаполнено(Заявка.ЗаказПокупателя) Тогда
			Нов.ЗаказПокупателя=Заявка.ЗаказПокупателя;
		КонецЕсли;	
		Нов.Срок=?(Заявка.СрокДоставкиГарантированный=0,Заявка.СрокДоставки,Заявка.СрокДоставкиГарантированный);
		Нов.Склад=?(ТипЗнч(Заявка.Склад)=Тип("Строка") или Не ЗначениеЗаполнено(Заявка.Склад),Объект.СкладДляЗаявки,Заявка.Склад);
		Если ЗначениеЗаполнено(Заявка.Поставщик) Тогда
			Нов.Поставщик=Заявка.Поставщик;
		ИначеЕсли Не ПустаяСтрока(Заявка.Сайт) Тогда
			Пост = ПолучитьПоставщика(Заявка.Сайт);
			Если ЗначениеЗаполнено(Пост) ТОгда
				Нов.Поставщик=Пост;
			КонецЕсли;
		КонецЕсли;	
		Нов.Цена=Заявка.ЦенаПоставки;
		Нов.Скидка=0;
		ИзмКолПостНаСервере(Нов.НомерСтроки-1);
		ЕСли Заявка.КодЗаказа="error" Тогда
			Нов.Состояние="Не определено";
		Иначе
			Нов.Состояние="В корзине";
		КонецЕсли;
		Нов.Сайт=Заявка.Сайт;
		Нов.КодТовара=Заявка.КодТовара;
		Нов.КодЗаказа=Заявка.КодЗаказа;
		Нов.idСклад=Заявка.idСклад;
		Нов.КодДоставки=Заявка.КодДоставки;
		Нов.ДанныеСайта="{""Производитель"":"""+СтрЗаменить(СтрЗаменить(Заявка.Производитель,"/","//"),"""","/""")+
		""",""КодПроизводителя"":"""+СтрЗаменить(СтрЗаменить(Заявка.КодПроизводителя,"/","//"),"""","/""")+
		""",""ДляКорзины"":"""+СтрЗаменить(СтрЗаменить(Заявка.ДляКорзины,"/","//"),"""","/""")+"""}";
	КонецЦикла;
	Элементы.Группа10.Заголовок="Заказ поставщику ("+Строка(Объект.ЗаявкаПоставщику.Количество())+")";
КонецПроцедуры

&НаСервере
Функция ПолучитьПоставщика(СайтПост)
	Пост = "";
	ЕСли Объект.СпецНаз.НастройкиПользователя Тогда
		Проценки = ХранилищеОбщихНастроек.Загрузить("ПомощникАвтобизнеса","Проценки");
	Иначе
		Проценки = ХранилищеОбщихНастроек.Загрузить("ПомощникАвтобизнеса","Проценки",,"Администратор");
	КонецЕсли;
	Сайт=Проценки.Найти(СайтПост,"Сайт");
	Если Сайт<>Неопределено ТОгда
		Попытка
		Если ЗначениеЗаполнено(Сайт.Поставщик) ТОгда
			Пост=Сайт.Поставщик;
		КонецЕсли;
		Исключение КонецПопытки;
	КонецЕсли;
	Возврат Пост;
КонецФункции

//     ****** Страница Заказы Поставщику  *****
&НаКлиенте
Процедура ОформитьЗаказы(Команда)
	Отбор=Новый Структура("Выбран",Истина);
	Если Объект.ЗаявкаПоставщику.НайтиСтроки(Отбор).Количество() > 0 Тогда
		ОформленныеЗаказы=ОформитьЗаказыНаСервере();
		Если ЗначениеЗаполнено(ОформленныеЗаказы) Тогда
			Для Каждого Значение Из ОформленныеЗаказы Цикл
				ЗаявкаПост = Значение.Значение;
				ОткрытьЗначение(ЗаявкаПост);
			КонецЦикла;
		КонецЕСли;	
	Иначе
		Попытка
			Предупреждение("Нет данных для формирования заказов!");
		Исключение
			Сообщить("Нет данных для формирования заказов!");
		Конецпопытки;
	КонецЕсли;
	РассчитатьКоличествоЭлементов();
		
КонецПроцедуры

&НаСервере
Функция ОформитьЗаказыНаСервере()
	
	Отбор=Новый Структура("Выбран",Истина);
	ТЗДляОформления = Объект.ЗаявкаПоставщику.Выгрузить(Объект.ЗаявкаПоставщику.НайтиСтроки(Отбор));
	ОформленныеЗаказы=Новый СписокЗначений;
	ТЗВЗаказ = ТЗДляОформления.СкопироватьКолонки();
	Если Объект.Конфигурация = "РозницаМагазинАвтозапчастей 2.1" или Объект.Конфигурация = "РозницаМагазинАвтозапчастей 2.0" Тогда	
		ТЗДляОформления.Сортировать("Поставщик,Склад");
		ТекущийПоставщик = ТЗДляОформления[0].Поставщик;
		ТекущийСклад=ТЗДляОформления[0].Склад;
		Для каждого Запись Из ТЗДляОформления Цикл
			
			Если (ТекущийПоставщик = Запись.Поставщик) и (Запись.Склад=ТекущийСклад) Тогда
				
				СтрокаВЗаказ = ТЗВЗаказ.Добавить();
				ЗаполнитьЗначенияСвойств(СтрокаВЗаказ, Запись);
				Если (ТЗДляОформления.Количество() - 1) = ТЗДляОформления.Индекс(Запись) Тогда
					СоздатьЗаказПоставщику(ТЗВЗаказ,ОформленныеЗаказы);
				КонецЕСли;
				
			Иначе
				
				Если ТЗВЗаказ.Количество() > 0 Тогда
					СоздатьЗаказПоставщику(ТЗВЗАказ,ОформленныеЗаказы);
				КонецЕСли;
				
				ТекущийПоставщик = Запись.Поставщик;
				ТекущийСклад = Запись.Склад;
				
				ТЗВЗаказ.Очистить();
				СтрокаВЗаказ = ТЗВЗАказ.Добавить();
				ЗаполнитьЗначенияСвойств(СтрокаВЗаказ, Запись);
				
				Если (ТЗДляОформления.Количество() - 1) = ТЗДляОформления.Индекс(Запись) Тогда
					СоздатьЗаказПоставщику(ТЗВЗаказ,ОформленныеЗаказы);
				КонецЕСли;
				
			КонецЕсли; 	
			
		КонецЦикла;
		
		РассчитатьКоличествоЭлементов();	
		
		Возврат ОформленныеЗаказы;
	КонецЕсли;
	
	ТЗДляОформления.Сортировать("Поставщик");
	
	ТекущийПоставщик = ТЗДляОформления[0].Поставщик;
	
	Для каждого Запись Из ТЗДляОформления Цикл
		
		Если ТекущийПоставщик = Запись.Поставщик Тогда
			
			СтрокаВЗаказ = ТЗВЗаказ.Добавить();
			ЗаполнитьЗначенияСвойств(СтрокаВЗаказ, Запись);
			Если (ТЗДляОформления.Количество() - 1) = ТЗДляОформления.Индекс(Запись) Тогда
				СоздатьЗаказПоставщику(ТЗВЗаказ,ОформленныеЗаказы);
			КонецЕСли;
			
		Иначе
			
			Если ТЗВЗаказ.Количество() > 0 Тогда
				СоздатьЗаказПоставщику(ТЗВЗАказ,ОформленныеЗаказы);
			КонецЕСли;
			
			ТекущийПоставщик = Запись.Поставщик;
			ТЗВЗаказ.Очистить();
			СтрокаВЗаказ = ТЗВЗАказ.Добавить();
			ЗаполнитьЗначенияСвойств(СтрокаВЗаказ, Запись);
			
			Если (ТЗДляОформления.Количество() - 1) = ТЗДляОформления.Индекс(Запись) Тогда
				СоздатьЗаказПоставщику(ТЗВЗаказ,ОформленныеЗаказы);
			КонецЕСли;
			
		КонецЕсли; 	
		
	КонецЦикла;
	
	РассчитатьКоличествоЭлементов();	
	
	Возврат ОформленныеЗаказы;
	
КонецФункции

&НаСервере
Процедура СоздатьЗаказПоставщику(ТЗВЗаказ,ОформленныеЗаказы)
	
	Попытка
	
		ЗаказПоставщику = Документы.ЗаказПоставщику.СоздатьДокумент();		
		ЗаказПоставщику.Дата = ТекущаяДата();
		МаксДней=0;
		Если Объект.Конфигурация = "УправлениеТорговлей 11.0" ИЛИ
				 Объект.Конфигурация = "УправлениеТорговлей 11.1.2" ИЛИ
				 Объект.Конфигурация = "УправлениеТорговлей 11.1.4" Тогда
				 Если Документы.ЗаказПоставщику.ПустаяСсылка().Метаданные().Реквизиты.Найти("Менеджер") = Неопределено тогда
					 Заказпоставщику.Ответственный = параметрыСеанса.ТекущийПользователь;
				 Иначе
					 ЗаказПоставщику.Менеджер = ПараметрыСеанса.ТекущийПользователь;
				 КонецЕсли;
				 Если Документы.ЗаказПоставщику.ПустаяСсылка().Метаданные().Реквизиты.Найти("ХозяйственнаяОперация") = Неопределено тогда
					 ЗаказПоставщику.ВидОперации = Перечисления.ВидыОперацийЗаказПоставщику.ЗаказНаЗакупку;
				 Иначе
					 ЗаказПоставщику.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ЗакупкаУПоставщика;
				 КонецЕсли;
				 Попытка
					 ЗаказПоставщику.ЗакупкаПодДеятельность = Перечисления.ТипыНалогообложенияНДС.ПродажаОблагаетсяНДС;
					 ЗаказПоставщику.НалогообложениеНДС = Перечисления.ТипыНалогообложенияНДС.ПродажаОблагаетсяНДС;
					 ЗаказПоставщику.Приоритет = Справочники.Приоритеты.НайтиПоНаименованию("Средний");  //Перечисления.Приоритеты.Средний;
					 ЗаказПоставщику.Статус = Перечисления.СтатусыЗаказовПоставщикам.Согласован;		
					 ЗаказПоставщику.Валюта = Объект.ТипЦен.ВалютаЦены;
					 ЗаказПоставщику.Партнер = ТЗВЗАказ[0].Поставщик.Партнер;
					 ЗаказПоставщику.ДатаСогласования = ТекущаяДата();
					 //ЗаказПоставщику.ЖелаемаяДатаПоступления = ТекущаяДата() + ТЗВЗаказ[0].Срок*24*60*60;
				 Исключение
					 ЗаказПоставщику.НалогообложениеНДС = Перечисления.ТипыНалогообложенияНДС.ОблагаетсяНДС;
					 ЗаказПоставщику.СостояниеЗаказа = Справочники.СостоянияЗаказовПоставщикам.Открыт;
					 Заказпоставщику.ВалютаДокумента = ТЗВЗАказ[0].Поставщик.ДоговорПоУмолчанию.ВалютаРасчетов;
					 ЗаказПоставщику.Контрагент = ТЗВЗАказ[0].Поставщик;
					 ЗаказПоставщику.ДатаПоступления = ТекущаяДата() + ТЗВЗаказ[0].Срок*24*60*60;
					 ЗаказПоставщику.Договор = ТЗВЗАказ[0].Поставщик.ДоговорПоУмолчанию;
					 Курс = РегистрыСведений.КурсыВалют.СрезПоследних();
						Для Каждого СтрокаКурс Из Курс Цикл
							Если СтрокаКурс.Валюта = Объект.ТипЦен.ВалютаЦены Тогда
								ЗаказПоставщику.Кратность = СтрокаКурс.Кратность;
								ЗаказПоставщику.Курс = СтрокаКурс.Курс;
							КонецЕсли;
						КонецЦикла;
				 Конецпопытки;
				 
					РежимЗаписиЗаказа = ?(Объект.ПроводитьДокументы=Истина,РежимЗаписиДокумента.Проведение,РежимЗаписиДокумента.Запись);
		ИначеЕсли Объект.Конфигурация = "РозницаМагазинАвтозапчастей 2.1" или Объект.Конфигурация = "РозницаМагазинАвтозапчастей 2.0" Тогда
			ЗаказПоставщику.Ответственный = ПараметрыСеанса.ТекущийПользователь;
			ЗаказПоставщику.Магазин = ТЗВЗАказ[0].Склад.Магазин;
			РежимЗаписиЗаказа = РежимЗаписиДокумента.Запись;
		КонецЕсли;
		ЗаказПоставщику.Организация = Объект.ОрганизацияДляЗаявки;
		ЗаказПоставщику.Контрагент = ТЗВЗАказ[0].Поставщик;
		Если НЕ ЗаказПоставщику.Метаданные().Реквизиты.Найти("Партнер") = Неопределено Тогда
			ЗаказПоставщику.Партнер=ЗаказПоставщику.Контрагент.Партнер;
		КонецЕсли;
		Если НЕ Документы.ЗаказПоставщику.ПустаяСсылка().Метаданные().Реквизиты.Найти("Склад") = Неопределено Тогда
			ЗаказПоставщику.Склад = ТЗВЗАказ[0].Склад;
		КонецЕсли;
		ЗаказПоставщику.ДатаПоступления = ТекущаяДата() + ТЗВЗаказ[0].Срок*24*60*60;
		
		Для каждого Строка Из ТЗВЗаказ Цикл
		    Попытка
				ЗаказПоставщикуСтрока = ЗаказПоставщику.Товары.Добавить();
				ЗаказПоставщикуСтрока.Номенклатура = Строка.Номенклатура;
				ЗаказПоставщикуСтрока.КоличествоУпаковок = Строка.Количество;
			Исключение
			    ЗаказПоставщикуСтрока = ЗаказПоставщику.Запасы.Добавить();
				ЗаказПоставщикуСтрока.Номенклатура = Строка.Номенклатура;
				ЗаказПоставщикуСтрока.ДатаПоступления = ТекущаяДата() + ТЗВЗаказ[0].Срок*24*60*60;
			КонецПопытки;
			
			ЗаказПоставщикуСтрока.Количество = Строка.Количество;
			ЗаказПоставщикуСтрока.Цена = Строка.Цена;
			ЗаказПоставщикуСтрока.Сумма = Строка.Сумма;
			ЗаказПоставщикуСтрока.СтавкаНДС = Строка.СтавкаНДС;
			ЗаказПоставщикуСтрока.СуммаНДС = Строка.СуммаНДС;
			Если Объект.Конфигурация = "УправлениеТорговлей 11.0" ИЛИ
				 Объект.Конфигурация = "УправлениеТорговлей 11.1.2" ИЛИ
				 Объект.Конфигурация = "УправлениеТорговлей 11.1.4" Тогда
				 Попытка
				ЗаказПоставщикуСтрока.СуммаСНДС = Строка.Всего;
				ЗаказПоставщикуСтрока.Склад = Строка.Склад;	
			Исключение
				КонецПопытки;
			ИначеЕсли Объект.Конфигурация = "РозницаМагазинАвтозапчастей 2.1" 
				или Объект.Конфигурация = "РозницаМагазинАвтозапчастей 2.0"
				Тогда
				//БСА151115(
				ЗаказПоставщикуСтрока.ор_ЗаказПокупателя=Строка.ЗаказПокупателя;
				//)
			КонецЕсли;
			Если Строка.Срок>МаксДней Тогда МаксДней=Строка.Срок КонецЕсли;
		КонецЦикла;  		
	    Если Метаданные.Документы.ЗаказПоставщику.Реквизиты.Найти("ЖелаемаяДатаПоступления")<>Неопределено Тогда
			ЗаказПоставщику.ЖелаемаяДатаПоступления = ТекущаяДата() + ТЗВЗаказ[0].Срок*86400;
		КонецЕсли;
		ЗаказПоставщику.Записать(?(Объект.ПроводитьДокументы=Истина,РежимЗаписиДокумента.Проведение,РежимЗаписиДокумента.Запись));
		ОформленныеЗаказы.Добавить(ЗаказПоставщику.Ссылка);	
				
	Исключение
		Сообщить(ОписаниеОшибки());
	КонецПопытки;
	
КонецПроцедуры

&НаКлиенте
Процедура ОчиститьЗаказы(Команда)
	Попытка
		Отбор=Новый Структура("Выбран",Истина);
		Массив = Объект.ЗаявкаПоставщику.НайтиСтроки(Отбор);
		Если Массив.Количество()>0 Тогда
			Ответ = Вопрос("Удалить все записи ( Да ) или только выбранные ( Нет ) ?", РежимДиалогаВопрос.ДаНетОтмена,,КодВозвратаДиалога.Отмена);
			Если Ответ = КодВозвратаДиалога.Отмена Тогда Возврат;
			ИначеЕсли Ответ = КодВозвратаДиалога.Нет Тогда
				Для Каждого Стр Из Массив Цикл
					Объект.ЗаявкаПоставщику.Удалить(Стр);
				КонецЦикла;
				Элементы.Группа10.Заголовок = "Заказы поставщикам (" + Объект.ЗаявкаПоставщику.Количество() + ")";
				Возврат;
			КонецЕсли;
		Иначе
			Ответ = Вопрос("Удалить все записи ?", РежимДиалогаВопрос.ДаНет,,КодВозвратаДиалога.Нет);
			Если Ответ = КодВозвратаДиалога.Нет Тогда Возврат;КонецЕсли;
		КонецЕСли;
	Исключение
	КонецПопытки;	
	Объект.ЗаявкаПоставщику.Очистить();
	Элементы.Группа10.Заголовок = "Заказы поставщикам";
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьФлажкиПоставщику(Команда)
	Флаг=Команда.Имя="УстановитьФлажкиПоставщику";
	Для каждого СтрокаТЗ Из Объект.ЗаявкаПоставщику Цикл
	  Если Флаг = Неопределено Тогда
		  СтрокаТЗ.Выбран = НЕ СтрокаТЗ.Выбран;
		Иначе	
		  СтрокаТЗ.Выбран = Флаг;
		КонецЕсли; 
	КонецЦикла; 
КонецПроцедуры

//#КонецОбласти

//#Область СлужебныеПроцедурыИФункции

//#Область ОбщегоНазаначения

// ***** Общего назаначения *****
&НаКлиентеНаСервереБезКонтекста 
Функция ПодготовитьНомер(СтрНом)
	СтрНомер=СокрЛП(строка(СтрНом));
	СтрНомер=Стрзаменить(СтрНомер,символы.НПП,"");
	СтрНомер=Стрзаменить(СтрНомер,",","");
	СтрНомер=Стрзаменить(СтрНомер,")","");
	СтрНомер=Стрзаменить(СтрНомер,"(","");
	СтрНомер=Стрзаменить(СтрНомер,"-","");
	СтрНомер=Стрзаменить(СтрНомер,".","");
	СтрНомер=Стрзаменить(СтрНомер," ","");
	СтрНомер=Стрзаменить(СтрНомер,"-","");
	СтрНомер=Стрзаменить(СтрНомер,"""","");
	СтрНомер=Стрзаменить(СтрНомер,"'","");
	СтрНомер=Стрзаменить(СтрНомер,":","");
	СтрНомер=Стрзаменить(СтрНомер,";","");
	СтрНомер=Стрзаменить(СтрНомер,"/","");
	СтрНомер=Стрзаменить(СтрНомер,"|","");
	СтрНомер=Стрзаменить(СтрНомер,"\","");
	СтрНомер=Стрзаменить(СтрНомер,"!","");
	СтрНомер=Стрзаменить(СтрНомер,"#","");
	СтрНомер=Стрзаменить(СтрНомер,"№","");
	СтрНомер=Стрзаменить(СтрНомер,"?","");
	СтрНомер=Стрзаменить(СтрНомер,"*","");
	Возврат СтрНомер;
Конецфункции

&НаСервере
Функция ЗаполнитьТаблицуГрупп()
	Обработка=РеквизитФормыВЗначение("Объект");
	ТаблицаГруппТоваров=Обработка.ПоискГруппПоАртикулу(Объект.НомерАртикула, Предикат);
	ТаблицаГруппТоваров.Сортировать("Родитель");
	Массив=Новый Массив;
	Для Каждого Стр Из ТаблицаГруппТоваров Цикл
		Массив.Добавить(Новый Структура("ID_Группы,Наименование,Родитель",Стр.ID_Группы,Стр.Наименование,Стр.Родитель));
	КонецЦикла;
	Возврат Массив;
КонецФункции

&НаКлиенте
Процедура ПоискПоАртикулу(СписокГрупп="",ДополнительныйПараметр=Неопределено) Экспорт
	Если СписокГрупп=Неопределено Тогда СписокГрупп="";КонецЕсли;
	Попытка
		СтрокаОриг = Объект.НомерАртикула;
		СтрокаПоиска = Врег(ПодготовитьНомер(СтрокаОриг));
		Если ЭтаФорма.Элементы.Страницы.ТекущаяСтраница = ЭтаФорма.Элементы.СтраницаПоискПоАртикулу или Объект.ОбщийПоискВрем Тогда
			ПоискВТекДок(СписокГрупп);
		КонецЕсли;
		
		Если Объект.ОбщийПоискВрем или ЭтаФорма.Элементы.Страницы.ТекущаяСтраница = ЭтаФорма.Элементы.СтраницаПоискПоПрайсу Тогда
			ПоискПрайсНаКлиенте(СтрокаПоиска,СтрокаОриг);
		КонецЕсли;

		Если (Объект.ОбщийПоискВрем или ЭтаФорма.Элементы.Страницы.ТекущаяСтраница = ЭтаФорма.Элементы.ПоискЕмекс)
			и Объект.ИспользоватьПроценкуОнлайнПоставщиков Тогда
			ПоискПроценки();
		КонецЕсли;
		
	Исключение
		Сообщить(ОписаниеОшибки());
	КонецПопытки;
КонецПроцедуры

Процедура РассчитатьКоличествоЭлементов()Экспорт
	
	Если ЗначениеЗаполнено(КолТекДок) И КолТекДок > 0 Тогда
		Элементы.СтраницаПоискПоАртикулу.Заголовок = "Поиск по артикулу (TecDoc) (" + КолТекДок + ")";
	Иначе
		Элементы.СтраницаПоискПоАртикулу.Заголовок = "Поиск по артикулу (TecDoc)";
	КонецЕСли;
	
	Если ЗначениеЗаполнено(КолПрайс) И КолПрайс > 0 Тогда
		Элементы.СтраницаПоискПоПрайсу.Заголовок = "Поиск по артикулу (прайс-листы) (" + КолПрайс + ")";
	Иначе
		Элементы.СтраницаПоискПоПрайсу.Заголовок = "Поиск по артикулу (прайс-листы)";
	КонецЕСли;
	
	Если ЗначениеЗаполнено(КолЕмекс) И КолЕмекс > 0 Тогда
		Элементы.ПоискЕмекс.Заголовок = "Поиск по артикулу (онлайн поставщики) (" + КолЕмекс + ")";
	Иначе
		Элементы.ПоискЕмекс.Заголовок = "Поиск по артикулу (онлайн поставщики)";
	КонецЕСли;
	
	ЕСли Объект.ЗаявкаНаОформление.Количество() > 0 Тогда
		Элементы.СтрКорзина.Заголовок = "Корзина (" + Объект.ЗаявкаНаОформление.Количество() + ")";
	Иначе
		Элементы.СтрКорзина.Заголовок = "Корзина";
	КонецЕСли;
	
	ЕСли Объект.ЗаявкаПоставщику.Количество() > 0 Тогда
		Элементы.Группа10.Заголовок = "Заказы поставщикам (" + Объект.ЗаявкаПоставщику.Количество() + ")";
	Иначе
		Элементы.Группа10.Заголовок = "Заказы поставщикам";
	КонецЕСли;	
	
КонецПроцедуры

&НаКлиенте
Функция ВыполнитьМетодНаКлиенте(Метод,ТекСтр)
	Попытка
		ИмяМетода=Метод.Сайт+"_"+Метод.Метод;
		Рез=Неопределено;
		Если ИмяМетода="Корзина_Подбор" Тогда
			Рез=Корзина_Подбор();
		Иначе
			Возврат "Метод "+Метод.Метод+" для сайта "+Метод.Сайт+" не найден";
		КонецЕсли;
		Возврат Рез;
	Исключение
		Возврат ОписаниеОшибки();
	КонецПопытки;	
	
КонецФункции

//#КонецОбласти

//#Область ПоискTECDOC

// ***** Поиск в TECDOC
&НаСервере
Процедура ПоискВТекДок(СписокГрупп)
	СтрокаОриг = Объект.НомерАртикула;
	СтрокаПоиска = Врег(ПодготовитьНомер(СтрокаОриг));
	Обработка=РеквизитФормыВЗначение("Объект");
	//Вызовем процедуру поиска
	ТЗТекДок = Обработка.ПоискПоАртикулуВТекДок(СтрокаПоиска, Предикат, СписокГрупп); 
	Обработка.ПоискВ1С(ТЗТекДок, СтрокаОриг,ПоШаблону);
	РезультатПоискаТЗ.Загрузить(ТЗТекДок);
	
	//Заполним список выбора ФильтрМарка
	ТабПоставщики=ТЗТекДок.Скопировать(,"поставщик");
	ТабПоставщики.Свернуть("поставщик");
	Элементы.ФильтрМарка.СписокВыбора.ЗагрузитьЗначения(ТабПоставщики.ВыгрузитьКолонку("поставщик"));
	КолСтр=Обработка.ВыводРезультатаПоиска(ТЗТекДок,Результат);
	Элементы.СтраницаПоискПоАртикулу.Заголовок="Поиск по артикулу (TecDoc)("+Строка(КолСтр)+")";
Конецпроцедуры

&НаКлиенте
Процедура ВходВгруппу(Результат,Номенклатура) Экспорт
	
	ВходВгруппуЕмексСервер(Результат,Номенклатура);	
	
	ПараметрыФормы=Новый Структура("Ключ",Номенклатура);
	ОткрытьФорму("Справочник.Номенклатура.ФормаОбъекта",ПараметрыФормы);	
КонецПроцедуры

&НаСервере
Функция ДобавитьТоварВБазуНаСервере(Значение, ТипНомера, Элемент, НомерКартинки=0)
	Обработка=РеквизитФормыВЗначение("Объект");
	Номенклатура=Обработка.ДобавлениеТовараВБазу(Значение, ТипНомера);
	Если Не ЗначениеЗаполнено(Номенклатура) Тогда Возврат Номенклатура;КонецЕсли;
	
	Если Элемент="Результат" или Элемент="Результат1" Тогда
		ТЗТекДок = РезультатПоискаТЗ.Выгрузить(); 
		Стр=ТЗТекДок.Найти(Значение,"ART_ID");
		Стр.Номенклатура=Номенклатура;
		Стр.ВБазе=1;
		Обработка.ЗаменаОбластиТабДок(Результат, "МакетПоискаПоАртикулу", Значение, Номенклатура);
		Элементы.Результат.ТекущаяОбласть=Результат.ТекущаяОбласть;
		
	Иначе
		
		Обработка.ЗаменаОбластиТабДок(РезультатПоДереву, "МакетУзлов", Значение, Номенклатура);
		Элементы.РезультатПоДереву.ТекущаяОбласть=РезультатПоДереву.ТекущаяОбласть;

	КонецЕсли;	
	
	Возврат Номенклатура;
КонецФункции

&НаСервере
Процедура ДобавитьВЗаявкуНаСервере(Данные,Запись=Неопределено) Экспорт
	Если Данные=Неопределено тогда возврат;КонецЕсли;
	Если Запись=Неопределено Тогда
		ЕстьПоставщик=Данные.Свойство("Поставщик");
		Если ЕстьПоставщик Тогда
			Отбор=Новый Структура("Наименование, Склад, Поставщик",Данные.Номенклатура,Данные.Склад,Данные.Поставщик);
		Иначе			
			Отбор=Новый Структура("Наименование, Склад, Сайт",Данные.Номенклатура,Данные.Склад,"");
		КонецЕсли;
		Массив=Объект.ЗаявкаНаОформление.НайтиСтроки(Отбор);
	Иначе
		Отбор = Новый Структура("Наименование, idСклад, Сайт", Данные.Номенклатура, Запись.idСклад, Запись.Сайт);
		Массив = Объект.ЗаявкаНаОформление.НайтиСтроки(Отбор);
	КонецЕсли;
	
	Если Массив.Количество()=0 Тогда
		Стр=Объект.ЗаявкаНаОформление.Добавить();
		Если Запись=Неопределено Тогда
			Стр.Склад=Данные.Склад;
			Стр.Артикул=Данные.Номенклатура.Артикул;
			Стр.НаименованиеТовара=Данные.Номенклатура.Наименование;
			Если ЕстьПоставщик Тогда
				Стр.Поставщик=Данные.Поставщик;
			КонецЕсли;
		Иначе
			ЗаполнитьЗначенияСвойств(Стр,Запись,,"Наименование");
			Стр.НаименованиеТовара=Запись.Наименование;
			Стр.Склад=Запись.Сайт+": "+Запись.Склад;
		КонецЕсли;
		Стр.Наименование = Данные.Номенклатура;
    	Стр.Номенклатура = Данные.Номенклатура;
		Стр.Количество   = Данные.Количество;
		Элементы.СтрКорзина.Заголовок="Корзина ("+Строка(Объект.ЗаявкаНаОформление.Количество())+")";
	Иначе
		Стр=Массив[0];
		Стр.Количество=Стр.Количество+Данные.Количество;
	КонецЕсли;
	Стр.СтавкаНдс = Данные.Номенклатура.СтавкаНДС;
	Стр.Цена=Данные.Цена;
	Стр.Скидка=Данные.Скидка;
	Если Запись=Неопределено  И ЕстьПоставщик Тогда
		Стр.ЦенаПоставки=Данные.ЦенаПоставки;
		Стр.СрокДоставки=Данные.СрокДоставки;
	КонецЕсли;		
	Обработка=РеквизитФормыВЗначение("Объект");
	Обработка.РассчитатьСуммы(Стр);
	СуммаКорзины=Объект.ЗаявкаНаОформление.Итог("Всего");
КонецПроцедуры

&НаСервере
Процедура ОбработкаРасшифровкиНаСервере(Расшифровка, Элемент)
	Если Элемент="Результат" Тогда
		ТабДок=Результат;
	ИначеЕсли Элемент="Результат1" Тогда
		ТабДок=Результат1;
	ИначеЕсли Элемент="РезультатПоДереву" Тогда
		ТабДок=РезультатПоДереву;
	ИначеЕсли Элемент="РезультатПоДереву1" Тогда
		ТабДок=РезультатпоДереву1;
	КонецЕсли;
	//Разберемся, что за расшифровка
	Попытка
		Обработка=РеквизитФормыВЗначение("Объект");
		Если Расшифровка.Действие="СледующаяКартинка" Тогда
			Расшифровка.НомерКартинки=Расшифровка.НомерКартинки+1;
			Обработка.ВыводРасшифровки(Расшифровка.Значение, ТабДок, Расшифровка.НомерКартинки); 
		ИначеЕсли Расшифровка.Действие="ПредыдущаяКартинка" Тогда
			Расшифровка.НомерКартинки=Расшифровка.НомерКартинки-1;
			Обработка.ВыводРасшифровки(Расшифровка.Значение, ТабДок, Расшифровка.НомерКартинки); 
			
		ИначеЕсли Расшифровка.Действие = "ДополнитьИнформацию" Тогда
			
			Обработка.ДополнитьИнформацию(Расшифровка.Значение, Расшифровка.Номенклатура);
		ИначеЕсли Расшифровка.Действие = "РасшифровкаПоАртикулу" Тогда
			//Найдем нужную строку
			НомерКартинки=0;
			Если Элемент="Результат" Тогда
				Обработка.ВыводРасшифровки(Расшифровка.Значение, Результат1, НомерКартинки);
				Элементы.Результат.Видимость=Ложь;
				Элементы.Результат1.Видимость=Истина;
			Иначе
				Обработка.ВыводРасшифровки(Расшифровка.Значение, РезультатПоДереву1, НомерКартинки);
				Элементы.РезультатПоДереву.Видимость=Ложь;
				Элементы.РезультатПоДереву1.Видимость=Истина;
			КонецЕсли;
		КонецЕсли;
	Исключение
		Сообщить(ОписаниеОшибки());
	КонецПопытки;
	
КонецПроцедуры

//#КонецОбласти

//#Область ПоискПрайс

// ***** Поиск в прайс-листах
&НаСервере
Функция ПолучитьНастройкиЗагрузки()
	НастройкаЗагрузки=ХранилищеОбщихНастроек.Загрузить("ПомощникАвтобизнеса","НастройкаЗагрузки");
	Мас=Новый Массив;
	ЕСли ТипЗнч(НастройкаЗагрузки)<>Тип("ТаблицаЗначений") Тогда
		Возврат Мас;
	КонецЕсли;
	Для Каждого Стр Из НастройкаЗагрузки Цикл
		Если Стр.Вкл Тогда
			Мас.Добавить(Новый Структура("Поставщик,ПутьКФайлу,Лист,Артикул,Наименование,Производитель,Время,Остаток,Цена",
			Стр.Поставщик,Стр.ПутьКФайлу,Стр.Лист,Стр.Артикул,Стр.Наименование,Стр.Производитель,Стр.Время,Стр.Остаток,Стр.Цена));
        КонецЕсли;
	КонецЦикла;
	Возврат Мас;
КонецФункции

&НаКлиенте
Процедура ПоискПрайсНаКлиенте(Артикул,АртОриг)
	Попытка
		Эксель = Новый COMОбъект("Excel.Application"); 
		Эксель.Displayalerts = 0;
	Исключение
		Сообщить("Ошибка при попытке работы с Mirosoft Excel, возможно он не установлен"+Символы.ПС+ОписаниеОшибки());
		Возврат;
	КонецПопытки;
	НастройкаЗагрузки=ПолучитьНастройкиЗагрузки();
	Если НастройкаЗагрузки.Количество()=0 Тогда
		Сообщить("Отсутствут данные - выполните настройку поставщиков");
	КонецЕсли;
	ТЗРез=Новый Массив;
	Для Каждого СтрТаб из НастройкаЗагрузки Цикл
		Попытка	
			Книга = Эксель.WorkBooks.Open(СокрЛП(СтрТаб.ПутьКФайлу),0,Истина);
			Если СтрТаб.Лист<>"" Тогда
				Лист=Книга.Worksheets(СтрТаб.Лист)
			Иначе
				Лист=Книга.Worksheets(1);
			КонецЕсли;
			Лист.Activate();
			ВсегоСтрок = Лист.Cells(1,1).SpecialCells(11).Row; 
			ИмяКолонки=Символ(64+СтрТаб.Артикул);
			КонОбл=":"+ИмяКолонки+Формат(ВсегоСтрок,"ЧГ=0");
			МасПоиск=Новый Массив;
			МасПоиск.Добавить(АртОриг);
			Если ВРЕГ(СокрЛП(АртОриг))<>ВРЕГ(СОКРЛП(Артикул)) Тогда
				МасПоиск.Добавить(Артикул);
			КонецЕсли;
			Попытка 
				АртЧисло=Число(АртОриг);
				МасПоиск.Добавить(АртЧисло);
			Исключение
			Конецпопытки;
			Для Каждого Искомое из МасПоиск Цикл
				НомерСтроки=1;
				Пока Истина Цикл
					Попытка
	        			Сдвиг=Эксель.WorksheetFunction.Match(Искомое,Лист.Range(ИмяКолонки+Формат(НомерСтроки,"ЧГ=0")+КонОбл),0);
					Исключение
						Сдвиг=Неопределено;
					Конецпопытки;
					//Если не нашли - выходим
					Если ТипЗнч(Сдвиг)<>Тип("Число") Тогда 
						Прервать;
					КонецЕсли;
					
					//Если нашли - вносим данные в таблицу
					НомерСтроки=НомерСтроки+Сдвиг-1;
					ТЗРез.Добавить(Новый Структура("Полное_описание_русский,поставщик,Артикул,ЦенаПрайс,Остаток,Срок,ПоставщикПрайс",
					СтрЗаменить(СокрЛП(Лист.Cells(НомерСтроки,СтрТаб.Наименование).Value), Символы.НПП, ""),
					СтрЗаменить(СокрЛП(Лист.Cells(НомерСтроки, СтрТаб.Производитель).Value), Символы.НПП, ""),
					СтрЗаменить(СокрЛП(Лист.Cells(НомерСтроки, СтрТаб.Артикул).Value), Символы.НПП, ""),
					СтрЗаменить(СокрЛП(Лист.Cells(НомерСтроки, СтрТаб.Цена).Value), Символы.НПП, ""),
					СтрЗаменить(СокрЛП(Лист.Cells(НомерСтроки, СтрТаб.Остаток).Value), Символы.НПП, ""),
					СтрТаб.Время,СтрТаб.Поставщик));
					НомерСтроки=НомерСтроки+1;
					Если НомерСтроки>ВсегоСтрок Тогда Прервать;КонецЕсли;
				КонецЦикла;
			КонецЦикла;
			Книга.Close();
		Исключение
			Сообщить("Ошибки при разборе данных прайс-листа:"+Символы.ПС+"Файл: "+СтрТаб.ПутьКфайлу+" лист: "+СтрТаб.Лист+символы.ПС+"Возможно ошибки в настройках или данных.");
			Попытка Книга.Close();Исключение;КонецПопытки;
		КонецПопытки;
	КонецЦикла;
	Эксель=Неопределено;
	ПоискПрайсНаСервере(ТЗРез, АртОриг);
КонецПроцедуры

&НаСервере
Процедура ПоискПрайсНаСервере(ТЗРез, АртОриг)
	
	КЧ = Новый КвалификаторыЧисла(10,2);
	КС = Новый КвалификаторыСтроки(500);
	ТипЧ = Новый ОписаниеТипов("Число", КЧ);
	ТипС = Новый ОписаниеТипов("Строка", КС);
	ТипСпр = Новый ОписаниеТипов("СправочникСсылка.Контрагенты");
	
	//Результирующая таблица
	ТЗПрайс = Новый ТаблицаЗначений();	
	ТЗПрайс.Колонки.Добавить("Полное_название_группы", ТипС);
	ТЗПрайс.Колонки.Добавить("Место_установки", ТипС);
	ТЗПрайс.Колонки.Добавить("Входит_в", ТипС);
	ТЗПрайс.Колонки.Добавить("поставщик", ТипС);
	ТЗПрайс.Колонки.Добавить("Артикул", ТипС);
	ТЗПрайс.Колонки.Добавить("ПоставщикЗапчасти", ТипЧ);
	ТЗПрайс.Колонки.Добавить("ART_ID", ТипЧ);
	ТЗПрайс.Колонки.Добавить("МОДЕЛЬ", ТипС);
	ТЗПрайс.Колонки.Добавить("Полное_описание_русский", ТипС);
	ТЗПрайс.Колонки.Добавить("ТипНомера", ТипС);
	ТЗПрайс.Колонки.Добавить("тип", ТипС);
	ТЗПрайс.Колонки.Добавить("номер", ТипС);
	ТЗПрайс.Колонки.Добавить("ПоставщикПрайс", ТипСпр);
	ТЗПрайс.Колонки.Добавить("Остаток", ТипС);
	ТЗПрайс.Колонки.Добавить("ЦенаПрайс", ТипЧ);
	ТЗПрайс.Колонки.Добавить("Срок", ТипЧ);
	ТЗПрайс.Колонки.Добавить("НашАрт", ТипЧ);
	ТЗПрайс.Колонки.Добавить("Источник",ТипЧ);
	ТЗПрайс.Колонки.Добавить("Номенклатура");
	Для Каждого Стр Из ТЗРез Цикл
		Нов=ТЗПрайс.Добавить();
		ЗаполнитьЗначенияСвойств(Нов,Стр);
	КонецЦикла;
	Обработка=РеквизитФормыВЗначение("Объект");
	ТЗПрайс.Сортировать("поставщик");
	ТекПроизводитель="";
	ТекНоменклатура=Справочники.Номенклатура.ПустаяСсылка();
	ТекИсточник=0;
	Если Объект.ПоискПоОчищенному И Объект.ОчищеннаяТаблица.Количество() = 0 Тогда
		Таб = Обработка.ПолучитьТаблицуНоменклатуры();
		Для Каждого Эл Из Таб Цикл
			Стр = Объект.ОчищеннаяТаблица.Добавить();
			Стр.Артикул = ВРЕГ(ПодготовитьНомер(СокрЛП(Эл.Артикул)));
			Стр.Производитель= ВРЕГ(ПодготовитьНомер(СокрЛП(Эл.Производитель)));
		    Стр.Номенклатура = Эл.Ссылка;
		КонецЦикла;
	КонецЕсли;
	Для каждого Стр Из ТЗПрайс Цикл
		Если Стр.поставщик<>ТекПроизводитель Тогда
			ТекПроизводитель=Стр.поставщик;
			Если Объект.ПоискПоОчищенному И Объект.ОчищеннаяТаблица.Количество() > 0 Тогда
				Рез=Объект.ОчищеннаяТаблица.НайтиСтроки(Новый Структура("Артикул,Производитель",АртОриг,ТекПроизводитель));
				Если Рез.Количество()=0 Тогда
					ТекИсточник=0;
					ТекНоменклатура=Справочники.Номенклатура.ПустаяСсылка();
				Иначе
					ТекИсточник=1;
					ТекНоменклатура=Рез[0].Номенклатура;
				КонецЕсли;
			Иначе
				Рез=Обработка.ПолучитьНоменклатуруТовара(Новый Структура("Артикул,Производитель",АртОриг,ТекПроизводитель),Ложь);
				Если Рез=Неопределено Тогда
					ТекИсточник=0;
					ТекНоменклатура=Справочники.Номенклатура.ПустаяСсылка();
				Иначе
					ТекИсточник=1;
					ТекНоменклатура=Рез;
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
		Стр.Номенклатура=ТекНоменклатура;
		Стр.Источник=ТекИсточник;
	КонецЦикла;
	РезультатПоискаПрайс.Загрузить(ТЗПрайс);
	КолСтр=Обработка.ВыводРезультатаПоискаПрайс(ТЗПрайс,РезультатПрайс);
	Элементы.СтраницаПоискПоПрайсу.Заголовок="Поиск по артикулу (прайс-листы) ("+Строка(КолСтр)+")";
КонецПроцедуры

&НаСервере
Функция ПолучитьНоменклатуруТовараНаСервере(Запись,Создать=Истина);
	Обработка=РеквизитФормыВЗначение("Объект");
	Возврат Обработка.ПолучитьНоменклатуруТовара(Запись,Создать);
КонецФункции

&НаСервере
Процедура ЗаписатьгруппуНоменклатуры(Группа,Номенклатура)
	Об = Номенклатура.ПолучитьОбъект();
	Об.Родитель = Группа;
	Об.Записать();
КонецПроцедуры
	
&НаКлиенте
Процедура ВходВгруппуПрайс(Результат,Отбор) Экспорт
	Если ЗначениеЗаполнено(Результат) Тогда
		ЗаписатьгруппуНоменклатуры(Результат,Отбор.Номенклатура);
	КонецЕсли;
	Номенклатура = Отбор.Номенклатура;
	Расшифровка = Отбор.Расшифровка;
	ПроверкаОтбор = Новый Структура("Номенклатура, Поставщик, Склад", Номенклатура, Расшифровка.Поставщик, Объект.ФильтрСкладПрайс);
	ПроверкаСуществования = Объект.ЗаявкаПоставщику.НайтиСтроки(ПроверкаОтбор);
	Остаток=Число(Расшифровка.Остаток)-?(ПроверкаСуществования.Количество()=0,0,ПроверкаСуществования[0].Количество);
	Если Остаток<=0 И Объект.КонтрольОстатков Тогда
		ТекстОшибки="Для оформления заказа с нулевыми остатками требуется в настройках убрать признак контроля остатков";
		Попытка
			Предупреждение(ТекстОшибки);
		Исключение
			Сообщить(ТекстОшибки);
		Конецпопытки;
		Возврат;
	КонецЕсли;
	Если Объект.ЗапрашиватьКоличество ИЛИ ((Объект.ЗапрашиватьЦену ИЛИ Объект.ЗапрашиватьСкидку) И Объект.ВКорзину) Тогда
		ПередачаПараметров = Новый Структура(
		"Номенклатура,Склад,Остаток,ЦенаПоУмолчанию,КонтрольОстатков,ЗапрашиватьКолво,ЗапрашиватьЦену,ЗапрашиватьСкидку",
		Номенклатура,Объект.ФильтрСкладПрайс,Остаток,Расшифровка.Цена,Объект.КонтрольОстатков,
		Объект.ЗапрашиватьКоличество, Объект.ВКорзину И Объект.ЗапрашиватьЦену, Объект.ВКорзину И Объект.ЗапрашиватьСкидку);
		Оповещение=Новый ОписаниеОповещения("ОбработкаРасшифровкиПрайсНаСервере",ЭтаФорма,Расшифровка);
		ОткрытьФорму(Объект.ВнешняяОбработка+".Nirax_ПомощникАвтобизнесаОбщий.Форма.ВыборКоличестваУФ",ПередачаПараметров,ЭтаФорма,Истина,,,Оповещение)
	Иначе
		Данные=Новый Структура("Номенклатура,Склад,Количество,Цена,Скидка",
		Номенклатура,Объект.ФильтрСкладПрайс,1,Расшифровка.Цена,0);
		ОбработкаРасшифровкиПрайсНаСервере(Данные,Расшифровка)
	КонецЕсли;
КонецПроцедуры

Процедура ОбработкаРасшифровкиПрайсНаСервере(Данные, Расшифровка) Экспорт
	//Отказ при выборе количества
	Если Данные=Неопределено Тогда Возврат; КонецЕсли;
	
	Если Объект.ВКорзину Тогда
		Данные.Вставить("Поставщик",Расшифровка.Поставщик);
		Данные.Вставить("ЦенаПоставки",Расшифровка.ЦенаПоставщика);
		Данные.Вставить("СрокДоставки",Расшифровка.Срок);
		ДобавитьВЗаявкуНаСервере(Данные,Неопределено);
		Возврат;
	КонецЕсли;
	
	Попытка
	
		ПроверкаОтбор = Новый Структура("Номенклатура, Поставщик, Склад", Данные.Номенклатура, Расшифровка.Поставщик, Данные.Склад);
		ПроверкаСуществованияЗаказ = Объект.ЗаявкаПоставщику.НайтиСтроки(ПроверкаОтбор);
		
		Если ПроверкаСуществованияЗаказ.Количество()=0 Тогда
			НоваяСтрока=Объект.ЗаявкаПоставщику.Добавить();
			НоваяСтрока.Номенклатура = Данные.Номенклатура;
			НоваяСтрока.Артикул = Данные.Номенклатура.Артикул;
			НоваяСтрока.Поставщик = Расшифровка.Поставщик;
			НоваяСтрока.Склад = Данные.Склад;
			НоваяСтрока.Количество = Данные.Количество;
		Иначе
			НоваяСтрока=ПроверкаСуществованияЗаказ[0];
			НоваяСтрока.Количество = НоваяСтрока.Количество+Данные.Количество;
		КонецЕсли;
		
		НоваяСтрока.Цена = Расшифровка.ЦенаПоставщика;
		НоваяСтрока.Скидка=0;
		НоваяСтрока.СтавкаНдс = Данные.Номенклатура.СтавкаНДС;
		НоваяСтрока.Срок = Расшифровка.Срок;
		НоваяСтрока.Пользователь = ПараметрыСеанса.ТекущийПользователь;
		Обработка=РеквизитФормыВЗначение("Объект");
		Обработка.РассчитатьСуммы(НоваяСтрока);
		
		КолСтр=Объект.ЗаявкаПоставщику.Количество();
		Элементы.Группа10.Заголовок="Заказы поставщику ("+Строка(КолСтр)+")";
			
	Исключение
	    Сообщить(ОписаниеОшибки());
	КонецПопытки;	
	
КонецПроцедуры

//#КонецОбласти

//#Область ПоискОнлайн
// ***** Поиск онлайн
&НаСервере
Процедура ПоискПроценки()
	СтрокаОриг = Объект.НомерАртикула;
	СтрокаПоиска = Врег(ПодготовитьНомер(СтрокаОриг));
	Обработка=РеквизитФормыВЗначение("Объект");
	Если Объект.ВыборочныйПоиск Тогда
		ТЗЕмекс=Обработка.ПоискПроценкиТовары(СтрокаОриг);
		КолЕмекс=Обработка.ВыводРезультатаПоискаТоваровЕмекс(ТЗЕмекс,РезультатЕмекс);
	Иначе
		ТЗЕмекс=Обработка.ПоискПроценки(СтрокаОриг,Объект.ЕмексИскатьСЗаменамиИАналогами,Парсинг);
				
		РезультатПоискаЕмекс.Очистить();
		РезультатПоискаЕмекс.Загрузить(ТЗЕмекс);
		ОтборПараметры=Новый	Структура("Склад,ЕстьНаСкладе,ЕстьУПоставщика",Объект.ФильтрСкладЕмекс,ЕстьНаСкладе,ЕстьУПоставщика);
		КолЕмекс=Обработка.ВыводРезультатаПоискаЕмекс(ТЗЕмекс,РезультатЕмекс,ОтборПараметры);
	КонецЕсли;
	ТабПро=ТЗЕмекс.Скопировать(,"Производитель");
	ТабПро.Свернуть("Производитель");ТабПро.Сортировать("Производитель");
	Элементы.ФильтрМаркаЕмекс.СписокВыбора.ЗагрузитьЗначения(ТабПро.ВыгрузитьКолонку("Производитель"));
	Если ЗначениеЗаполнено(КолЕмекс) И КолЕмекс > 0 Тогда
		Элементы.ПоискЕмекс.Заголовок = "Поиск по артикулу (онлайн поставщики) (" + КолЕмекс + ")";
	Иначе
		Элементы.ПоискЕмекс.Заголовок = "Поиск по артикулу (онлайн поставщики)";
	КонецЕСли;

Конецпроцедуры

&НаКлиенте
Процедура ВходВгруппуЕмексДобавить(Результат,НоменклатураСсылка) Экспорт
	
	ВходВгруппуЕмексСерверДобавить(Результат,НоменклатураСсылка);
	
	ОткрытьФорму("Справочник.Номенклатура.ФормаОбъекта",Новый Структура("Ключ",НоменклатураСсылка),НоменклатураСсылка);	
КонецПроцедуры

&НаКлиенте
Процедура ВходВгруппуЕмекс(Результат,Запись) Экспорт
	
	ВходВгруппуЕмексСервер(Результат,Запись);
	
	НоменклатураСсылка = Запись.Номенклатура;
	ОткрытьФорму("Справочник.Номенклатура.ФормаОбъекта",Новый Структура("Ключ",НоменклатураСсылка),НоменклатураСсылка);
	Отбор = Новый Структура("Номенклатура, idСклад, Сайт", Запись.Номенклатура, Запись.idСклад, Запись.Сайт);
	ПроверкаСуществованияКорзина = Объект.ЗаявкаНаОформление.НайтиСтроки(Отбор);
	Если ПроверкаСуществованияКорзина.Количество()=0 Тогда
		ЗаписьВКорзине=Неопределено;
		МожноВКорзину=Запись.Наличие;
	Иначе
		ЗаписьВКорзине=ПроверкаСуществованияКорзина[0];
		МожноВКорзину=Запись.Наличие-ЗаписьВКорзине.Количество;
		Если МожноВКорзину<=0 И Объект.КонтрольОстатков Тогда
			Попытка
				Предупреждение("В корзине уже находится "+Строка(ЗаписьВКорзине.Количество)+" единиц на товара.");
			Исключение
				Сообщить("В корзине уже находится "+Строка(ЗаписьВКорзине.Количество)+" единиц на товара.");
			Конецпопытки;
			Возврат;
		КонецЕсли;
	КонецЕсли;
			
	Если Объект.ЗапрашиватьКоличество или Объект.ЗапрашиватьЦену или Объект.ЗапрашиватьСкидку Тогда
		ПараметрыФормы=Новый Структура("Номенклатура,Склад,Остаток,ЦенаПоУмолчанию,КонтрольОстатков,ЗапрашиватьКолво,ЗапрашиватьЦену,ЗапрашиватьСкидку",
		НоменклатураСсылка,Объект.ФильтрСкладЕмекс,МожноВКорзину,Запись.Цена,Объект.КонтрольОстатков,Объект.ЗапрашиватьКоличество,Объект.ЗапрашиватьЦену,Объект.ЗапрашиватьСкидку);
		Оповещение=Новый ОписаниеОповещения("ДобавитьВЗаявкуНаСервере",ЭтаФорма,Запись);
		ОткрытьФорму(Объект.ВнешняяОбработка+".Nirax_ПомощникАвтобизнесаОбщий.Форма.ВыборКоличестваУФ",ПараметрыФормы,ЭтаФорма,Истина,,,Оповещение);
	Иначе
		Данные=Новый Структура("Номенклатура,Склад,Количество,Цена,Скидка",
		НоменклатураСсылка,Объект.ФильтрСкладЕмекс,1,Запись.Цена,0);
		ДобавитьВЗаявкуНаСервере(Данные,Запись);
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ВходВгруппуЕмексСервер(Результат,Запись) Экспорт
	Если ЗначениеЗаполнено(Результат) Тогда
		Об = Запись.Номенклатура.ПолучитьОбъект();
		Об.Родитель = Результат;
		Об.Записать();
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ВходВгруппуЕмексСерверДобавить(Результат,Запись) Экспорт
	Если ЗначениеЗаполнено(Результат) Тогда
		Об = Запись.ПолучитьОбъект();
		Об.Родитель = Результат;
		Об.Записать();
	КонецЕсли;
КонецПроцедуры

&НаСервере
Функция ДобавлениеТовараВБазуЕмекс(Запись, ТипНомера = Неопределено) Экспорт
	ЭтоОбъект=РеквизитФормыВЗначение("Объект");
	Номенклатура=ЭтоОбъект.ПолучитьНоменклатуруТовара(Запись, Истина, ТипНомера);
	
	Если Номенклатура<>Неопределено Тогда
		СтрокаВрем = РезультатПоискаЕмекс.Добавить();
		СтрокаВрем.Группа = Запись.Группа;
		СтрокаВрем.Тип = Запись.Тип;
		СтрокаВрем.Производитель = Запись.Производитель;
		СтрокаВрем.Артикул = Запись.Артикул;
		СтрокаВрем.Наименование = Номенклатура.Наименование;
		СтрокаВрем.Номенклатура = Номенклатура;
		РезультатПоискаЕмекс.Сортировать("Тип Возр, Производитель Возр, Группа Возр, Артикул Возр, Цена Возр");
	КонецЕсли;	
	Возврат Номенклатура;
		        	
КонецФункции

&НаСервере
Процедура ПоискЦенТоваровСервер(Данные,Арт,Аналоги)
	ЭтоОбъект=РеквизитФормыВЗначение("Объект");
	Дан = Данные;
	Таб=ЭтоОбъект.ПоискЦенПроценки(Дан,Арт,Аналоги);
	ТабПро=Таб.Скопировать(,"Производитель");
	ТабПро.Свернуть("Производитель");ТабПро.Сортировать("Производитель");
	Элементы.ФильтрМаркаЕмекс.СписокВыбора.ЗагрузитьЗначения(ТабПро.ВыгрузитьКолонку("Производитель"));
	ОтборПараметры=Новый Структура("Склад,ЕстьНаСкладе,ЕстьУПоставщика",Объект.ФильтрСкладЕмекс,ЕстьНаСкладе,ЕстьУПоставщика);
	КолЕмекс=ЭтоОбъект.ВыводРезультатаПоискаЕмекс(Таб,РезультатЕмекс,ОтборПараметры);
	Если ЗначениеЗаполнено(КолЕмекс) И КолЕмекс > 0 Тогда
		Элементы.ПоискЕмекс.Заголовок = "Поиск по артикулу (онлайн поставщики) (" + КолЕмекс + ")";
	Иначе
		Элементы.ПоискЕмекс.Заголовок = "Поиск по артикулу (онлайн поставщики)";
	КонецЕСли;
КонецПроцедуры

//#КонецОбласти

//#Область Корзина

&НаСервере
Функция Корзина_Подбор_ПолучитьВалюту()
	Если Метаданные.Обработки.Найти("ПодборТоваровВДокументПродажи")=Неопределено
		Тогда Возврат Неопределено;
	Иначе
		Возврат Константы.ВалютаРегламентированногоУчета.Получить();
	КонецЕсли;
КонецФункции

&Наклиенте
Функция Корзина_Подбор()
	Перем Валюта,ФрмВр,Эл,Стр;
	Попытка
		Валюта=Корзина_Подбор_ПолучитьВалюту();
		Если Валюта=Неопределено Тогда
			Возврат "Данная конфигурация не поддерживает функцию подбора";
		КонецЕсли;
		Если не ЗначениеЗаполнено(Объект.Соглашение)тогда
			Возврат "Не заполнено соглашение с контрагентом";
		КонецЕсли;
		ФрмВр=ПолучитьФорму("Документ.РеализацияТоваровУслуг.ФормаОбъекта",,Элементы.ЗаявкаНаОформление);
		Для каждого Эл из Объект.ЗаявкаНаОформление Цикл
		     Стр=ФрмВр.Объект.Товары.Добавить();
			 ЗаполнитьЗначенияСвойств(Стр,Эл);
		 КонецЦикла;
		ПараметрЗаголовок = НСтр("ru = 'Подбор товаров в корзину");
		ПараметрыФормы = Новый Структура;
		ПараметрыФормы.Вставить("Соглашение", Объект.Соглашение);
		ПараметрыФормы.Вставить("ЦенаВключаетНДС", Истина);
		ПараметрыФормы.Вставить("Склад", Объект.Склад);
		ПараметрыФормы.Вставить("Валюта",Валюта);
		ПараметрыФормы.Вставить("Заголовок", ПараметрЗаголовок);
		ПараметрыФормы.Вставить("Дата", ТекущаяДата());
		ПараметрыФормы.Вставить("РежимПодбораИспользоватьСкладыВТабличнойЧасти", Истина);
		ПараметрыФормы.Вставить("РежимПодбораИсключитьГруппыДоступныеВЗаказах", Истина);
		ПараметрыФормы.Вставить("СкрыватьПодакцизныеТовары", Ложь);
		ПараметрыФормы.Вставить("ОтображатьФлагСкрыватьПодакцизныеТовары", Ложь);
		ПараметрыФормы.Вставить("Документ", ФрмВр.Объект.Ссылка);
		ПараметрыФормы.Вставить("Заголовок", ПараметрЗаголовок);
		Оповещение=Новый ОписаниеОповещения("Корзина_Подбор_УТ11_ЗаявкаНаОформлениеОбработкаВыбора",ЭтаФорма);
		
		ОткрытьФорму("Обработка.ПодборТоваровВДокументПродажи.Форма",ПараметрыФормы,ЭтаФорма,Истина,,,Оповещение);
	Исключение
		Возврат "Ошибки при вызове подбора номенклатуры. "+Символы.ПС+ОписаниеОшибки();
	КонецПопытки;
	Возврат "";
КонецФункции

&НаСервере
Процедура Корзина_Подбор_УТ11_ЗаполнитьСтрокиДополнительно(Спис)
	Для каждого Эл из Спис Цикл
		ТекСтр=Объект.ЗаявкаНаОформление.НайтиПоИдентификатору(Эл);
		ТекСтр.Наименование=ТекСтр.Номенклатура;
		ТекСтр.Артикул=ТекСтр.Номенклатура.Артикул;
		ТекСтр.СтавкаНДС=ТекСтр.Номенклатура.СтавкаНДС;
		ТекСтр.СуммаСоСкидкой=ТекСтр.Сумма;
		ТекСтр.Всего=ТекСтр.Сумма;
		ТекСтр.СуммаНДС=0;
		Если ТекСтр.СтавкаНДС = Перечисления.СтавкиНДС.НДС10 ИЛИ ТекСтр.СтавкаНДС = Перечисления.СтавкиНДС.НДС10_110 Тогда
			ТекСтр.СуммаНДС = Окр(ТекСтр.Сумма*(1-(1/1.10)),2);
		ИначеЕсли ТекСтр.СтавкаНДС = Перечисления.СтавкиНДС.НДС18 ИЛИ ТекСтр.СтавкаНДС= Перечисления.СтавкиНДС.НДС18_118 Тогда
			ТекСтр.СуммаНДС = Окр(ТекСтр.Сумма*(1-(1/1.18)),2);
		КонецЕсли;
	КонецЦикла;

КонецПроцедуры

&НаКлиенте
Процедура Корзина_Подбор_УТ11_ЗаявкаНаОформлениеОбработкаВыбора(ВыбранноеЗначение,Источник) Экспорт
		ТаблицаТоваров = ПолучитьИзВременногоХранилища(ВыбранноеЗначение.АдресТоваровВХранилище);
        СписСтрок=Новый Массив; 
		Для каждого Эл из ТаблицаТоваров Цикл
			 Стр=Объект.ЗаявкаНаОформление.Добавить();
			 ЗаполнитьЗначенияСвойств(Стр,Эл);
			 СписСтрок.Добавить(Стр.ПолучитьИдентификатор());
		 КонецЦикла;
		 Корзина_Подбор_УТ11_ЗаполнитьСтрокиДополнительно(СписСтрок);
		 СуммаКорзины=Объект.ЗаявкаНаОформление.Итог("Всего");
КонецПроцедуры

//#КонецОбласти

//#КонецОбласти

//#Область ПоискВИН

&НаСервере
Процедура ПоискПоВин()
	Обработка=РеквизитФормыВЗначение("Объект");
	СтрокаОриг = Объект.НомерАртикула;
	Обработка.ПоискПоВИН(СтрокаОриг,РезультатПоВИН);
КонецПроцедуры

&НаКлиенте
Процедура РезультатПоВИНОбработкаРасшифровки(Элемент, Расшифровка, СтандартнаяОбработка)
	Если Расшифровка=Неопределено тогда
		Если ТипЗнч(Элемент.ТекущаяОбласть)=Тип("РисунокТабличногоДокумента") тогда
			Расшифровка=Элемент.ТекущаяОбласть.Расшифровка;
		иначе
			Возврат;
		КонецЕсли;
	КонецЕсли;	
	
	РезультатПоВИНОбработкаРасшифровкиНаСервере(Расшифровка);
	СтандартнаяОбработка=Ложь;
КонецПроцедуры

&НаСервере
Процедура РезультатПоВИНОбработкаРасшифровкиНаСервере(Расшифровка)
	Обработка=РеквизитФормыВЗначение("Объект");
	Обработка.ПоискПоВИН1(Расшифровка,РезультатПоВИН);
КонецПроцедуры

//#КонецОбласти


