&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
		
	Если Параметры.Свойство("спКП") Тогда спКП=Параметры.спКП КонецЕсли;
	Если Параметры.Свойство("ВидСобытия") Тогда ВидСобытия=Параметры.ВидСобытия КонецЕсли;	
	ОбновитьТаблицу();
	
КонецПроцедуры

Процедура ОбновитьТаблицу()
	
	Запрос=Новый Запрос;
	
	Сп=Новый Массив;
	Сп.Добавить(Справочники.CRM_ВидыСобытий.Кредит);
	Сп.Добавить(Справочники.CRM_ВидыСобытий.Страховка);
	Сп.Добавить(Справочники.CRM_ВидыСобытий.КонсультацияОФУ);
	
	Запрос.УстановитьПараметр("ВидыСобытий",Сп);
	Запрос.УстановитьПараметр("спКП",спКП.ВыгрузитьЗначения());
	
	Запрос.Текст="
	|Выбрать
	|	КП.Ссылка.Дата Дата,
	|	КП.Ссылка.Сумма Сумма,
		
	|	Выбор Когда СоставКП.Конфигурация.Модель=Значение(Справочник.Модели.ПустаяСсылка) Тогда
	|		СоставКП.Конфигурация.Автомобиль.Наименование+"" ""+СоставКП.Конфигурация.Автомобиль.VIN
	|	Иначе
	|		СоставКП.Конфигурация.Наименование+"" ""+СоставКП.Конфигурация.Модель.Наименование+"" ""+СоставКП.Конфигурация.Версия.Наименование
	|	Конец Конфигурация,

	|	ВЫБОР КОГДА ЕСТЬNULL(Воронка.IDK,0)>0 ТОГДА ИСТИНА ИНАЧЕ ЛОЖЬ КОНЕЦ ОсновноеКП,
	|	КП.Ссылка КП,
		
	|	Задача.Ссылка ЗадачаСсылка,
	|	Задача.ВидСобытия,
	|	Задача.Наименование Задача,
	|	Задача.Исполнитель,
	|	Задача.Сотрудник,
	|	Задача.Состояние

	|ИЗ Документ.CRM_КоммерческоеПредложение КП
	|Левое Соединение Документ.CRM_КоммерческоеПредложение.Состав СоставКП
	|По КП.Ссылка=СоставКП.Ссылка

	|Левое Соединение Задача.Renault_События Задача 
	|По КП.Ссылка=Задача.Объект И Не Задача.ПометкаУдаления И Задача.ВидСобытия В(&ВидыСобытий)

	|Левое Соединение РегистрСведений.CRM_ВоронкаПродаж Воронка
	|По КП.Ссылка=Воронка.Объект И Воронка.ЭтапПродаж=Значение(Справочник.CRM_ЭтапыПродаж.КоммерческоеПредложение)

	|ГДЕ СоставКП.НомерСтроки=1 "+?(спКП.Количество()>0,"И КП.Ссылка В(&спКП)","");
	Табл.Загрузить(Запрос.Выполнить().Выгрузить());
КонецПроцедуры	

&НаКлиенте
Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	СтандартнаяОбработка=Ложь;
	
	ТекЗадача=Табл.НайтиПоИдентификатору(ВыбраннаяСтрока).ЗадачаСсылка;
	
	ОбластиПрименения=Новый Массив;
	ОбластиПрименения.Добавить(Перечисления.Renault_ОбластиПрименения.ОФУ);
	ОбластиПрименения.Добавить(Перечисления.Renault_ОбластиПрименения.Общие);
	
	Задачи.Renault_События.ОткрытьЗадачу(ТекЗадача,ЭтаФорма,ОбластиПрименения);
КонецПроцедуры

&НаКлиенте
Процедура кнДействияКнопок(Команда)
	ТекЗадача=Элементы.Табл.ТекущиеДанные.ЗадачаСсылка;
	Если Команда.Имя="кнНазначитьИсполнителя" Тогда
		Если ТекЗадача.Пустая() Тогда Возврат КонецЕсли;
		
		Сотрудник=Renault_ОбщиеФункции.ПолучитьМенеджераОФУ(ЭтаФорма,ТекЗадача.Сотрудник);
		Если Сотрудник=Неопределено Тогда Возврат КонецЕсли;
		Если Не Задачи.Renault_События.УстановитьАдресацию(ТекЗадача,Сотрудник) Тогда Возврат КонецЕсли;
		
	ИначеЕсли Команда.Имя="кнСоздатьЗадачу" Тогда
		
		//может быть задача создана по другому виду события, найдем и переделаем...
		Если Не ТекЗадача.Пустая() И ТекЗадача.ВидСобытия<>ВидСобытия Тогда
			ТекЗадача=Задачи.Renault_События.НайтиЗадачуОФУ(Элементы.Табл.ТекущиеДанные.КП,ВидСобытия); 
		КонецЕсли;	
		Задачи.Renault_События.СоздатьОткрытьЗадачуОФУ(ТекЗадача,Элементы.Табл.ТекущиеДанные.КП,ЭтаФорма,ВидСобытия);
		
	ИначеЕсли Команда.Имя="кнУдалитьЗадачу" Тогда
		Если ТекЗадача.Пустая() Тогда Возврат КонецЕсли;
		
		Если Не Задачи.Renault_События.УдалитьЗадачу(ТекЗадача) Тогда Возврат КонецЕсли;
		
	КонецЕсли;
	ОбновитьТаблицу();
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии()
	
	Если ВладелецФормы<>Неопределено Тогда
		ВладелецФормы.УправлениеКнопкамиОФУ() 
	КонецЕсли;
	
КонецПроцедуры //перерисовать цвета кнопок
