
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	// в некоторых местах форма вызывается методом "получитьформу"
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ПриОткрытииНаСервере();
  	
КонецПроцедуры

&НаСервере
Процедура ПриОткрытииНаСервере()
	
	Если ЗначениеЗаполнено(СсылкаНаОбъект) Тогда
		
		Клиент = СсылкаНаОбъект.Клиент;
		//Организация = СсылкаНаОбъект.Организация;
		Дата = СсылкаНаОбъект.ДатаПроведения;
		//ФИО = СсылкаНаОбъект.Клиент.Наименование;
		//Паспорт = CRM_Сервер.ПолучитьДокумент(СсылкаНаОбъект.Клиент, Перечисления.ВидыДокументов.Паспорт);
		//Адрес = Renault_УправлениеКонтактнойИнформацией.АдресКлиента(СсылкаНаОбъект.Клиент);
		ОсновнойТелефон = Renault_УправлениеКонтактнойИнформацией.ПолучитьОсновнойТелефонКлиента(Клиент);
		ОсновнойТелефон = CRM_Сервер.Renault_CRM_СкорректироватьТелефонПриЗаписи(ОсновнойТелефон);
		ПервыйСимволТелефона = ПараметрыСеанса.Renault_ПраваПользователя.ДилерскийЦентр.ПервыйСимволТелефона;
		
		Если НЕ ПустаяСтрока(ПервыйСимволТелефона) Тогда
			ОсновнойТелефон = СтрЗаменить(ОсновнойТелефон, "+", "");
			Если СтрДлина(ОсновнойТелефон) = 11 Тогда
				ОсновнойТелефон = Прав(ОсновнойТелефон, 10);
			КонецЕсли;
		
			МаскаТелефона = Элементы.Телефон.Маска;
			
			ОстатокМаски = Прав(МаскаТелефона, СтрДлина(МаскаТелефона) - 1);
			
			МаскаТелефона = ПервыйСимволТелефона + ОстатокМаски;
			
			Элементы.Телефон.Маска = МаскаТелефона;			
		КонецЕсли;		
		
		Автомобиль = СсылкаНаОбъект.Автомобиль;
		Модель = СсылкаНаОбъект.Автомобиль.Модель;
		ГодВыпуска = СсылкаНаОбъект.Автомобиль.ГодВыпуска;
		VIN = СсылкаНаОбъект.Автомобиль.VIN;
		НомерКузова = СсылкаНаОбъект.Автомобиль.НомерКузова;
		ГосНомер = ПолучитьГосНомер(СсылкаНаОбъект.Автомобиль);
		Цвет = СсылкаНаОбъект.Автомобиль.Цвет;
		Начало = СсылкаНаОбъект.Начало;
		Окончание = СсылкаНаОбъект.Начало + СсылкаНаОбъект.Продолжительность*60;
		//РукОтделаПродаж = CRM_Сервер.ПолучитьРуководителяОтделаПродаж(СсылкаНаОбъект.Организация);
		//ВУ = CRM_Сервер.ПолучитьДокумент(СсылкаНаОбъект.Клиент, Перечисления.ВидыДокументов.Удостоверение);
		//Свидетельство = CRM_Сервер.ПолучитьДокумент(СсылкаНаОбъект.Клиент, Перечисления.ВидыДокументов.Свидетельство);
		
		ПрочитатьДанныеКлиента();
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Печать(Команда)
	
	Если Не СохранитьДанные() Тогда Возврат; КонецЕсли;
	
	//Запишем заполненные значения
	Закрыть(Истина);
	
КонецПроцедуры

&НаСервере
Процедура ПрочитатьДанныеКлиента()
	
	Запрос = Новый Запрос;                
	ТекстЗапроса = "ВЫБРАТЬ
	               |	ТаблицаКлиентов.НаименованиеПолное,
	               |	ТаблицаКлиентов.Фамилия,
	               |	ТаблицаКлиентов.Имя,
	               |	ТаблицаКлиентов.Отчество,
	               |	ТаблицаКлиентов.ДатаРождения,
	               |	ТаблицаКлиентов.Пол,
	               |	CRM_КлиентскиеДанные.ПредложенияИЗамечания,
	               |	CRM_КлиентскиеДанные.ПричинаВыбораМарки,
	               |	CRM_КлиентскиеДанные.МаркаТекущегоАвтомобиля,
	               |	CRM_КлиентскиеДанные.МаркаПредыдущегоАвтомобиля,
	               |	CRM_КлиентскиеДанные.ДатаСоздания,
	               |	CRM_КлиентскиеДанные.ИсточникИнформации,
	               |	CRM_КлиентскиеДанные.Город,
	               |	КонтактнаяИнформация_Email.Представление КАК ОсновнойEmail,
	               |	ПодтверждающиеДокументы_Паспорт.Серия КАК ПаспортСерия,
	               |	ПодтверждающиеДокументы_Паспорт.Номер КАК ПаспортНомер,
	               |	ПодтверждающиеДокументы_Паспорт.ДатаВыдачи КАК ПаспортДатаВыдачи,
	               |	ПодтверждающиеДокументы_Паспорт.КемВыдан КАК ПаспортКемВыдан,
	               |	ПодтверждающиеДокументы_ВУ.Серия КАК ВУСерия,
	               |	ПодтверждающиеДокументы_ВУ.Номер КАК ВУНомер,
	               |	ПодтверждающиеДокументы_ВУ.ДатаВыдачи КАК ВУДатаВыдачи,
	               |	ПодтверждающиеДокументы_ВУ.КемВыдан КАК ВУКемВыдано,
	               |	КонтактнаяИнформация_АдресФактический.Представление КАК АдресФактический,
	               |	КонтактнаяИнформация_АдресЮридический_Прописки.Представление КАК АдресЮридический,
	               |	ВЫБОР
	               |		КОГДА КонтактнаяИнформация_АдресЮридический_Прописки.Представление = """"
	               |				ИЛИ КонтактнаяИнформация_АдресЮридический_Прописки.Представление ЕСТЬ NULL
	               |			ТОГДА КонтактнаяИнформация_АдресФактический.Представление
	               |		ИНАЧЕ КонтактнаяИнформация_АдресЮридический_Прописки.Представление
	               |	КОНЕЦ КАК АдресПрописки,
	               |	ТаблицаКлиентов.ФормаСобственности,
	               |	ТаблицаКлиентов.ИНН,
	               |	ТаблицаКлиентов.КПП,
	               |	CRM_КлиентскиеДанные.ПодписантВЛице,
	               |	CRM_КлиентскиеДанные.ПодписантНаОсновании,
	               |	CRM_КлиентскиеДанные.ПодписантПодпись,
	               |	CRM_КлиентскиеДанные.ПодписантДолжность,
	               |	ТаблицаКлиентов.ОсновнойБанковскийСчет,
	               |	ТаблицаКлиентов.Наименование
	               |ИЗ
	               |	Справочник.CRM_ПотенциальныеКонтрагенты КАК ТаблицаКлиентов
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.CRM_КлиентскиеДанные КАК CRM_КлиентскиеДанные
	               |		ПО (CRM_КлиентскиеДанные.Клиент = ТаблицаКлиентов.Ссылка)
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КонтактнаяИнформация КАК КонтактнаяИнформация_ТелефонСотовый
	               |		ПО ТаблицаКлиентов.Ссылка = КонтактнаяИнформация_ТелефонСотовый.Объект
	               |			И (КонтактнаяИнформация_ТелефонСотовый.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.Телефон))
	               |			И (КонтактнаяИнформация_ТелефонСотовый.ЗначениеПоУмолчанию = ИСТИНА)
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КонтактнаяИнформация КАК КонтактнаяИнформация_Email
	               |		ПО ТаблицаКлиентов.Ссылка = КонтактнаяИнформация_Email.Объект
	               |			И (КонтактнаяИнформация_Email.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.АдресЭлектроннойПочты))
	               |			И (КонтактнаяИнформация_Email.ЗначениеПоУмолчанию = ИСТИНА)
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ПодтверждающиеДокументы КАК ПодтверждающиеДокументы_Паспорт
	               |		ПО ТаблицаКлиентов.Ссылка = ПодтверждающиеДокументы_Паспорт.Владелец
	               |			И (ПодтверждающиеДокументы_Паспорт.ВидПодтверждающегоДокумента = ЗНАЧЕНИЕ(Перечисление.ВидыДокументов.Паспорт))
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ПодтверждающиеДокументы КАК ПодтверждающиеДокументы_ВУ
	               |		ПО ТаблицаКлиентов.Ссылка = ПодтверждающиеДокументы_ВУ.Владелец
	               |			И (ПодтверждающиеДокументы_ВУ.ВидПодтверждающегоДокумента = ЗНАЧЕНИЕ(Перечисление.ВидыДокументов.Удостоверение))
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КонтактнаяИнформация КАК КонтактнаяИнформация_АдресЮридический_Прописки
	               |		ПО ТаблицаКлиентов.Ссылка = КонтактнаяИнформация_АдресЮридический_Прописки.Объект
	               |			И (КонтактнаяИнформация_АдресЮридический_Прописки.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.АдресЮридический))
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КонтактнаяИнформация КАК КонтактнаяИнформация_АдресФактический
	               |		ПО ТаблицаКлиентов.Ссылка = КонтактнаяИнформация_АдресФактический.Объект
	               |			И (КонтактнаяИнформация_АдресФактический.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.АдресФактический))
	               |ГДЕ
	               |	ТаблицаКлиентов.Ссылка = &Ссылка";
				   
	Если ТипЗнч(Клиент) = Тип("СправочникСсылка.Контрагенты") Тогда			   
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "CRM_ПотенциальныеКонтрагенты", "Контрагенты");
	КонецЕсли;
	
	Запрос.Текст = ТекстЗапроса;	
	Запрос.УстановитьПараметр("Ссылка", Клиент);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		ЗаполнитьЗначенияСвойств(ЭтаФорма, Выборка);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция СохранитьДанные()
	
	Если ОшибкиЗаполнения() Тогда Возврат Ложь; КонецЕсли;	
	
	//Потенциальный клиент / Контрагент
	КлиентОбъект = Клиент.ПолучитьОбъект();
	//ЗаполнитьЗначенияСвойств(КлиентОбъект, ЭтаФорма);
	КлиентОбъект.Наименование = Наименование;
	КлиентОбъект.НаименованиеПолное = Наименование;
	КлиентОбъект.Записать();
	
	//Клиентские данные
	//Запись = РегистрыСведений.CRM_КлиентскиеДанные.СоздатьМенеджерЗаписи();	
	//ЗаполнитьЗначенияСвойств(Запись, ЭтаФорма);
	//Запись.Записать();
	
	//Документы
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка", Клиент);
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ПодтверждающиеДокументы.Ссылка
	|ИЗ
	|	Справочник.ПодтверждающиеДокументы КАК ПодтверждающиеДокументы
	|ГДЕ
	|	ПодтверждающиеДокументы.Владелец = &Ссылка
	|	И ПодтверждающиеДокументы.ВидПодтверждающегоДокумента = &Вид";
	
	Запрос.УстановитьПараметр("Вид", Перечисления.ВидыДокументов.Паспорт);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Об = Выборка.Ссылка.ПолучитьОбъект();
	Иначе
		Об = Справочники.ПодтверждающиеДокументы.СоздатьЭлемент();
	КонецЕсли;
	Если ЗначениеЗаполнено(ПаспортСерия) 
			ИЛИ ЗначениеЗаполнено(ПаспортНомер) 
			ИЛИ ЗначениеЗаполнено(ПаспортДатаВыдачи) 
			ИЛИ ЗначениеЗаполнено(ПаспортКемВыдан) Тогда
		Об.Наименование = "Паспорт";
		Об.Владелец = Клиент;
		Об.Серия = ПаспортСерия;
		Об.Номер = ПаспортНомер;
		Об.ДатаВыдачи = ПаспортДатаВыдачи;
		Об.КемВыдан = ПаспортКемВыдан;
		Об.ВидПодтверждающегоДокумента = Перечисления.ВидыДокументов.Паспорт;
		Попытка
			Об.Записать();
		Исключение
			Сообщить(ОписаниеОшибки());
		КонецПопытки;

	ИначеЕсли НЕ Об.ЭтоНовый() Тогда
		Об.Удалить();
	КонецЕсли;
	
	Запрос.УстановитьПараметр("Вид", Перечисления.ВидыДокументов.Удостоверение);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Об = Выборка.Ссылка.ПолучитьОбъект();
	Иначе
		Об = Справочники.ПодтверждающиеДокументы.СоздатьЭлемент();
	КонецЕсли;
	Если ЗначениеЗаполнено(ВУСерия) 
			ИЛИ ЗначениеЗаполнено(ВУНомер) 
			ИЛИ ЗначениеЗаполнено(ВУДатаВыдачи) 
			ИЛИ ЗначениеЗаполнено(ВУКемВыдано) Тогда
		Об.Наименование = "Водительское удостоверение";
		Об.Владелец = Клиент;
		Об.Серия = ВУСерия;
		Об.Номер = ВУНомер;
		Об.ДатаВыдачи = ВУДатаВыдачи;
		Об.КемВыдан = ВУКемВыдано;
		Об.ВидПодтверждающегоДокумента = Перечисления.ВидыДокументов.Удостоверение;
		Попытка
			Об.Записать();
		Исключение
			Сообщить(ОписаниеОшибки());
		КонецПопытки;
	ИначеЕсли НЕ Об.ЭтоНовый() Тогда
		Об.Удалить();
	КонецЕсли;
	
	//Контактные данные
	
	Renault_УправлениеКонтактнойИнформацией.ЗаписатьОсновнойТелефонКлиента(ОсновнойТелефон, Клиент);
	
	//Менеджер = РегистрыСведений.КонтактнаяИнформация.СоздатьМенеджерЗаписи();
	//Менеджер.Объект = Объект.Ссылка;
	//Менеджер.Тип = Перечисления.ТипыКонтактнойИнформации.Телефон;
	//Менеджер.Вид = Справочники.ВидыКонтактнойИнформации.ТелефонДомашний;
	//Если ЗначениеЗаполнено(ДомашнийТелефон) Тогда
	//	Менеджер.Представление = ДомашнийТелефон;
	//	Менеджер.Записать(Истина);
	//Иначе
	//	Менеджер.Удалить();
	//КонецЕсли;
	
	//Менеджер = РегистрыСведений.КонтактнаяИнформация.СоздатьМенеджерЗаписи();
	//Менеджер.Объект = Клиент;
	//Менеджер.Тип = Перечисления.ТипыКонтактнойИнформации.АдресЭлектроннойПочты;
	//Менеджер.Вид = Справочники.ВидыКонтактнойИнформации.АдресЭлектроннойПочтыДомашний;
	//Если ЗначениеЗаполнено(ОсновнойEmail) Тогда
	//	Менеджер.Представление = ОсновнойEmail;
	//	Менеджер.Записать(Истина);
	//Иначе
	//	Менеджер.Удалить();
	//КонецЕсли;
	
	//Менеджер = РегистрыСведений.КонтактнаяИнформация.СоздатьМенеджерЗаписи();
	//Менеджер.Объект = Клиент;
	//Менеджер.Тип = Перечисления.ТипыКонтактнойИнформации.Адрес;
	//Менеджер.Вид = Справочники.ВидыКонтактнойИнформации.АдресФактический;
	//Если ЗначениеЗаполнено(АдресФактический) ИЛИ ЗначениеЗаполнено(Город) Тогда
	//	Менеджер.Представление = ?(ЗначениеЗаполнено(АдресФактический), АдресФактический, Город);
	//	Менеджер.Поле4 = Город;
	//	Менеджер.Записать(Истина);
	//Иначе
	//	Менеджер.Удалить();
	//КонецЕсли;
	
	Менеджер = РегистрыСведений.КонтактнаяИнформация.СоздатьМенеджерЗаписи();
	Менеджер.Объект = Клиент;
	Менеджер.Тип = Перечисления.ТипыКонтактнойИнформации.Адрес;
	Менеджер.Вид = Справочники.ВидыКонтактнойИнформации.АдресЮридический;
	Если ЗначениеЗаполнено(АдресПрописки) Тогда
		Менеджер.Представление = АдресПрописки;
		Менеджер.Записать(Истина);
	ИначеЕсли ЗначениеЗаполнено(АдресЮридический) Тогда
		Менеджер.Представление = АдресЮридический;
		Менеджер.Записать(Истина);
	Иначе
		Менеджер.Удалить();
	КонецЕсли;
	
	//Справочники.Автомобили.ЗаписьЗначенияРегистраСведения(Автомобиль,ГосНомер,Перечисления.ДополнительнаяИнформацияАвтомобилей.ГосНомер);
	
	Модифицированность = Ложь;
	
	Возврат Истина;
	
КонецФункции

&НаСервере
Функция ОшибкиЗаполнения()

	Отказ = Ложь;
	
	Отказ = ?(Отказ,Истина, Не ЗначениеЗаполнено(Наименование));
	Если Не ЗначениеЗаполнено(Наименование) Тогда Сообщить("Не заполнено поле ""ФИО"""); КонецЕсли;
	
	ВУзаполнено = ЗначениеЗаполнено(ВУСерия) И ЗначениеЗаполнено(ВУНомер) 
				  И ЗначениеЗаполнено(ВУКемВыдано) И ЗначениеЗаполнено(ВУДатаВыдачи);
				  
	Если Не ВУзаполнено Тогда Сообщить("Не заполнены данные водительского удостоверения"); КонецЕсли;			  
				  
	Отказ = ?(Отказ,Истина, Не ВУзаполнено);
	
	Возврат Отказ;

КонецФункции // ПроверитьЗаполненение()

&НаСервере
Процедура ПрочитатьДанные()
	
	Клиент = СсылкаНаОбъект.Клиент;
	//Организация = СсылкаНаОбъект.Организация;
	Дата = СсылкаНаОбъект.ДатаПроведения;
	//ФИО = СсылкаНаОбъект.Клиент.Наименование;
	//Паспорт = CRM_Сервер.ПолучитьДокумент(СсылкаНаОбъект.Клиент, Перечисления.ВидыДокументов.Паспорт);
	//Адрес = Renault_УправлениеКонтактнойИнформацией.АдресКлиента(СсылкаНаОбъект.Клиент);
	//Телефон = Renault_УправлениеКонтактнойИнформацией.ТелефонКлиента(СсылкаНаОбъект.Клиент);
	Автомобиль = СсылкаНаОбъект.Автомобиль;
	Модель = СсылкаНаОбъект.Автомобиль.Модель;
	ГодВыпуска = СсылкаНаОбъект.Автомобиль.ГодВыпуска;
	VIN = СсылкаНаОбъект.Автомобиль.VIN;
	НомерКузова = СсылкаНаОбъект.Автомобиль.НомерКузова;
	ГосНомер = ПолучитьГосНомер(СсылкаНаОбъект.Автомобиль);
	Цвет = СсылкаНаОбъект.Автомобиль.Цвет;
	Начало = СсылкаНаОбъект.Начало;
	Окончание = СсылкаНаОбъект.Начало + СсылкаНаОбъект.Продолжительность*60;
	//РукОтделаПродаж = CRM_Сервер.ПолучитьРуководителяОтделаПродаж(СсылкаНаОбъект.Организация);
	//ВУ = CRM_Сервер.ПолучитьДокумент(СсылкаНаОбъект.Клиент, Перечисления.ВидыДокументов.Удостоверение);
	//Свидетельство = CRM_Сервер.ПолучитьДокумент(СсылкаНаОбъект.Клиент, Перечисления.ВидыДокументов.Свидетельство);
	
	ПрочитатьДанныеКлиента();
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьГосНомер(Автомобиль,НаДату = Неопределено)
	Возврат Справочники.Автомобили.ЧтениеЗначенияРегистраСведения(Автомобиль, Перечисления.ДополнительнаяИнформацияАвтомобилей.ГосНомер,НаДату);
КонецФункции

 
