
Процедура ОбновитьПрофильКлиента()
	
	КоличествоКлиентов = Объект.Клиенты.Количество();
	
	Если КоличествоКлиентов = 0 Тогда
		
		Возврат;
		
	КонецЕсли;
	
	// Установим отбор
	Ограничения = Новый Структура;
	Ограничения.Вставить("ДатаНачала",    Дата(1, 1, 1));
	Ограничения.Вставить("ДатаОкончания", ТекущаяДата());
	
	//для начала добавим в список все выбранные документы по текущему контрагенту
	Клиенты_ = Объект.Клиенты.Выгрузить().ВыгрузитьКолонку("Клиент");
	Для Каждого Клиент Из Клиенты_ Цикл
		Ограничения.Вставить("Контрагент", Клиент);
		Если ТипЗнч(Клиент) = Тип("СправочникСсылка.Контрагенты") Тогда
			ТаблицаДокументов = Renault_ПолучитьСписокПодтверждающихДокументов(Клиент);
			Для Каждого ТекСтрока Из ТаблицаДокументов Цикл
				НоваяСтрока = КлиентыПрофиля.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрока, ТекСтрока);
			КонецЦикла;
		КонецЕсли;
	КонецЦикла;
	Renault_ДобавитьВПрофильРабочиеЛистыКлиентов(Клиенты_);
	ПрочитатьТрафикКлиентов(Клиенты_);
	
	СписокКлиентов.ЗагрузитьЗначения(Клиенты_);
	
	ТЗ = КлиентыПрофиля.Выгрузить();
	ТЗ.Свернуть("Активность,Дата,ID,ТипID");
	КлиентыПрофиля.Загрузить(ТЗ);
	КлиентыПрофиля.Сортировать("Дата Убыв");
		
	Клиент = Объект.Клиенты[Объект.Клиенты.Количество()-1].Клиент;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	КонтактнаяИнформация.Представление КАК Представление,
		|	КонтактнаяИнформация.Тип
		|ИЗ
		|	РегистрСведений.КонтактнаяИнформация КАК КонтактнаяИнформация
		|ГДЕ
		|	КонтактнаяИнформация.Объект В(&Клиенты)
		|
		|УПОРЯДОЧИТЬ ПО
		|	КонтактнаяИнформация.Тип,
		|	КонтактнаяИнформация.Вид";
		
	Запрос.УстановитьПараметр("Клиенты", Клиенты_);
	ВсеКонтакты = Запрос.Выполнить().Выгрузить();
		
	КоличествоКонтактов = ВсеКонтакты.Количество();
	
	Телефонс = ВсеКонтакты.Найти(Перечисления.ТипыКонтактнойИнформации.Телефон, "Тип");
	
	Если ЗначениеЗаполнено(Телефонс) Тогда
		
		Телефон = Телефонс.Представление;
		
	КонецЕсли;
	
	Почтас = ВсеКонтакты.Найти(Перечисления.ТипыКонтактнойИнформации.АдресЭлектроннойПочты, "Тип");
	
	Если ЗначениеЗаполнено(Почтас) Тогда
		
		EMail = Почтас.Представление;
		
	КонецЕсли;
	
	ПрочитатьАвтомобили();
	
	////////////////////////////////////////
	//Временное заполнение профиля
	////////////////////////////////////////
	//
	//Автомобили.Добавить();
	//Автомобили.Добавить();
	//Автомобили.Добавить();
	//Автомобили.Добавить();
	
	Наименование = Клиент.Наименование;
	
	Если Клиент.ДатаРождения < НачалоДня(ТекущаяДата()) И ЗначениеЗаполнено(Клиент.ДатаРождения) Тогда
	
		ВозрастПоГодам = Цел((ТекущаяДата() - Клиент.ДатаРождения)/(365*86400));
		
	Иначе
		
		ВозрастПоГодам = 0;
		
	КонецЕсли;
	
	Пол = "пол не определен";
	
	Если ЗначениеЗаполнено(Клиент.Пол) Тогда
		
		Если Клиент.Пол = Перечисления.ПолФизическихЛиц.Мужской Тогда
			
			Пол = "Мужчина";
			
		ИначеЕсли Клиент.Пол = Перечисления.ПолФизическихЛиц.Женский Тогда
			
			Пол = "Женщина";
			
		Иначе
			
		КонецЕсли;
		
	КонецЕсли;
	
	ПолВозраст = Пол + ", " + Строка(?(ВозрастПоГодам >0, ВозрастПоГодам, "(возвраст не указан)"));
	ДокументыКлиента = "Документы ";
	
	Если ТаблицаДокументов <> Неопределено И ТаблицаДокументов.Количество() > 0 Тогда
		
		ДокументыКлиента = ДокументыКлиента +"(" + Строка(ТаблицаДокументов.Количество()) + "):";
		
		Если ТаблицаДокументов.Количество() > 1 Тогда
			
			ДокументыКлиента = ДокументыКлиента + Строка(ТаблицаДокументов[0].Наименование) + ", " + Строка(ТаблицаДокументов[1].Наименование);
			
			
		Иначе
			
			ДокументыКлиента = ДокументыКлиента + Строка(ТаблицаДокументов[0].Наименование);
			
		КонецЕсли;
		
	Иначе
		
		ДокументыКлиента = ДокументыКлиента + "(документы не найдены)";
		
	КонецЕсли;
	
	//(2): Паспорт, Водительское удостоверение";
	АккаунтыКлиента = "Аккаунты (0)";
	СвязанныеПрофилиКлиента = "Связанные профили (0)";
	
	Если Автомобили.Количество() > 0 Тогда
		
		Если Автомобили.Количество() = 1 Тогда
			
			АвтомобилиКлиента = Строка(Автомобили[0].Автомобиль);
			
		Иначе
			
			АвтомобилиКлиента = Строка(Автомобили[0].Автомобиль) + " и еще " + Строка(Автомобили.Количество() - 1) + " авто";
			
		КонецЕсли;
		
	Иначе
		
		АвтомобилиКлиента = "Нет известных автомобилей"		
		
	КонецЕсли;
	
	ПолучитьВсеПродуктыКлиента();
	
	ВсеПродукты.Сортировать("ДатаНачалаДействия Убыв");
	
	Если ВсеПродукты.Количество() > 0 Тогда
		
		Если ВсеПродукты.Количество() = 1 Тогда
			
			ПродуктыКлиента = "1 продукт с "  + Строка(Формат(ВсеПродукты[0].ДатаНачалаДействия, "ДФ=гггг")) + " года";
			ПродуктКлиента1 = Строка(ВсеПродукты[0].ТипПродукта) + " - " + Строка(ВсеПродукты[0].Продукт);
			
		ИначеЕсли ВсеПродукты.Количество() = 2 Тогда 
			
			ПродуктыКлиента = "2 продукта начиная с "  + Строка(Формат(ВсеПродукты[0].ДатаНачалаДействия, "ДФ=гггг")) + " года";
			ПродуктКлиента1 = Строка(ВсеПродукты[0].ТипПродукта) + " - " + Строка(ВсеПродукты[0].Продукт);
			ПродуктКлиента2 = Строка(ВсеПродукты[1].ТипПродукта) + " - " + Строка(ВсеПродукты[1].Продукт);
			
		ИначеЕсли ВсеПродукты.Количество() = 3 Тогда 
			
			ПродуктыКлиента = "3 продукта начиная с "  + Строка(Формат(ВсеПродукты[0].ДатаНачалаДействия, "ДФ=гггг")) + " года";
			ПродуктКлиента1 = Строка(ВсеПродукты[0].ТипПродукта) + " - " + Строка(ВсеПродукты[0].Продукт);
			ПродуктКлиента2 = Строка(ВсеПродукты[1].ТипПродукта) + " - " + Строка(ВсеПродукты[1].Продукт);
			ПродуктКлиента3 = Строка(ВсеПродукты[2].ТипПродукта) + " - " + Строка(ВсеПродукты[2].Продукт);
			
		ИначеЕсли ВсеПродукты.Количество() > 3 Тогда 
			
			ПродуктыКлиента = "Несколько (" + Строка(ВсеПродукты.Количество()) + ") продуктов начиная с "  + Строка(Формат(ВсеПродукты[0].ДатаНачалаДействия, "ДФ=гггг")) + " года";
			ПродуктКлиента1 = Строка(ВсеПродукты[0].ТипПродукта) + " - " + Строка(ВсеПродукты[0].Продукт);
			ПродуктКлиента2 = Строка(ВсеПродукты[1].ТипПродукта) + " - " + Строка(ВсеПродукты[1].Продукт);
			ПродуктКлиента3 = Строка(ВсеПродукты[2].ТипПродукта) + " - " + Строка(ВсеПродукты[2].Продукт);
			
		КонецЕсли;
		
	Иначе
		
		ПродуктыКлиента = "Нет известных продуктов";
		
	КонецЕсли;
	
	ИнтересыКлиента = "Интересы (0)";
	
	//Получим все предложения
	ПрочитатьПредложения();
	
	Если ВсеПредложения.Количество() > 0 Тогда
		
		ПредложитьКлиенту = "Предложить (" + Строка(ВсеПредложения.Количество()) + ")";
		
		ПредложитьКлиенту1 = ВсеПредложения[0].Источник + " - " + ВсеПредложения[0].ТипПредложения;
		
		Если ВсеПредложения.Количество() > 1 Тогда
			
			ПредложитьКлиенту2 = ВсеПредложения[1].Источник + " - " + ВсеПредложения[1].ТипПредложения;
			
		КонецЕсли;
		
	Иначе
		
		ПредложитьКлиенту = "Пока нечего предложить клиенту"; 
		
	КонецЕсли;
	
	КонтактыКлиента = "Контакты (" +  Строка(КоличествоКонтактов) + ")";
	КонтактПозвонить = Телефон;
	КонтактЭлектроннаяПочта = EMail;
	КонтактныеЛицаКлиента = "Контактные лица (0)";
	
	Лояльность = "Лояльный клиент";
	Лояльность = "Лояльность не определена";
	
	СтатусКлиента = Лояльность + " " + ?(СкоростьПробега > 0, ", за месяц проезжает около: " + Строка(СкоростьПробега) + " км", ", среднемесячный пробег неизвестен");
	ИсторияВзаимодействий = "(12) 12.05.2015 - 12.05.2015";
	ИсторияВзаимодействийПродажи = "("+ Строка(Renault_ПолучитьКоличествоВзаимодействийПродажи(СписокКлиентов)) + ")";
	
	СтруктураДанныхПоРассылкам = ПолучитьДанныеПоРассылкам();	
	Если СтруктураДанныхПоРассылкам.Количество = 0 Тогда
		ИсторияВзаимодействийРассылки = "Нет информации о рассылках";
	Иначе
		ИсторияВзаимодействийРассылки = "(" + Строка(СтруктураДанныхПоРассылкам.Количество) + ") - " + Строка(СтруктураДанныхПоРассылкам.ПоследняяДата);
	КонецЕсли;
	
	СтруктураДанныхПоЖалобам = ПолучитьДанныеПоЖалобам();
	Если СтруктураДанныхПоРассылкам.Количество = 0 Тогда
		ИсторияВзаимодействийЖалобы = "Нет информации о жалобах";
	Иначе
		ИсторияВзаимодействийЖалобы = "(" + Строка(СтруктураДанныхПоЖалобам.Количество) + ") - " + Строка(СтруктураДанныхПоЖалобам.ПоследняяДата);
	КонецЕсли;
	
	СтруктураДанныхMyRenault = ПолучитьДанныеПоMyRenault();
	Если СтруктураДанныхMyRenault.ЕстьРегистрация Тогда
		ИсторияВзаимодействийMyRenault = "Зарегистрирован " + Строка(СтруктураДанныхMyRenault.ПоследняяДата);
	Иначе
		ИсторияВзаимодействийMyRenault = "Не зарегистрирован";
	КонецЕсли;
	
	ПолучитьВсеЗаездыНаСервис();
	Если ВсеЗаездыНаСервис.Количество() > 0 Тогда
		
		ИсторияВзаимодействийСервис = Строка(ВсеЗаездыНаСервис.Количество()) + " - " + Формат(ВсеЗаездыНаСервис[0].ДатаЗаезда, "ДФ=дд.ММ.гггг");
		
	Иначе
		
		ИсторияВзаимодействийСервис = "Заездов в сервис пока не было";
		
	КонецЕсли;
	
	ИсторияВзаимодействийОпросы = "(0)";
	
	Заголовок = Наименование + " - Профиль клиента";
	
	//Заполним все будущие звонки
	ПолучитьДанныеПоЗвонкам();
	
	ВсеЗвонки.Сортировать("ПлановаяДатаКонтакта Убыв"); 
	
	СледующиеСобытияЗвонки = "(0)";
	
	Если ВсеЗвонки.Количество() > 0 Тогда
		
		СледующиеСобытияЗвонки = "(" + Строка(ВсеЗвонки.Количество()) + ") - " + Строка(ВсеЗвонки[0].Кампания);
		
	КонецЕсли;
	
	КоличествоХобби = Renault_АвтосервисСервер.ПолучитьКоличествоХоббиПрофиля(СписокКлиентов);
	
	Если КоличествоХобби > 0 Тогда
		
		Элементы.Хобби.Видимость = Истина;
		Элементы.Хобби.Заголовок = "хобби (" + Строка(КоличествоХобби) + ")";
		
	Иначе
		
		Элементы.Хобби.Заголовок = "нет данных о хобби";
		
	КонецЕсли;
	
	События.Очистить();
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	Renault_CommunicationCenter_Обзвон.Дата КАК Дата,
	               |	Renault_CommunicationCenter_Обзвон.СхемаОбзвона.ТипКоммуникации КАК ТипКоммуникации,
	               |	Renault_CommunicationCenter_Обзвон.СхемаОбзвона.Наименование КАК Наименование
	               |ИЗ
	               |	Документ.Renault_CommunicationCenter_Обзвон КАК Renault_CommunicationCenter_Обзвон
	               |ГДЕ
	               |	Renault_CommunicationCenter_Обзвон.Проведен
	               |	И Renault_CommunicationCenter_Обзвон.Клиент В(&СписокКлиентов)
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	Дата";
	
	Запрос.УстановитьПараметр("СписокКлиентов", СписокКлиентов);
	
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	
	Пока Выборка.Следующий() Цикл
	
		НовСобытие = События.Добавить();
		НовСобытие.DATE_ACTION  = Формат(Выборка.Дата, "ДФ=dd.MM.yyyy");
		НовСобытие.ACTION       = ""+ Выборка.ТипКоммуникации;
		НовСобытие.VIN_DESC     = "Схема коммуникации: " + Выборка.Наименование;
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Функция ПолучитьДанныеПоРассылкам()
	
	МассивКлиентов = Объект.Ссылка.Клиенты.ВыгрузитьКолонку("Клиент");
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	Renault_ЦентрализованныеРассылки.Идентификатор,
	               |	Renault_ЦентрализованныеРассылки.НазваниеКампании КАК Событие,
	               |	Renault_ЦентрализованныеРассылки.ДатаРассылки КАК Дата
	               |ИЗ
	               |	РегистрСведений.Renault_ЦентрализованныеРассылки КАК Renault_ЦентрализованныеРассылки
	               |ГДЕ
	               |	Renault_ЦентрализованныеРассылки.Объект В(&МассивКлиентов)
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	"""",
	               |	Renault_CommunicationCenter_Обзвон.СхемаОбзвона.Наименование,
	               |	Renault_CommunicationCenter_Обзвон.Дата
				   |ИЗ
	               |	Документ.Renault_CommunicationCenter_Обзвон КАК Renault_CommunicationCenter_Обзвон
	               |ГДЕ
	               |	Renault_CommunicationCenter_Обзвон.Клиент В(&МассивКлиентов)
	               |	И НЕ Renault_CommunicationCenter_Обзвон.Ссылка.ПометкаУдаления
	               |	И Renault_CommunicationCenter_Обзвон.СхемаОбзвона.ТипКоммуникации = &ТипКоммуникации
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	Дата УБЫВ";

	Запрос.УстановитьПараметр("МассивКлиентов", МассивКлиентов);
	Запрос.УстановитьПараметр("ТипКоммуникации", Перечисления.ВидыСобытий.ЭлектронноеПисьмо);

	Выборка = Запрос.Выполнить().Выбрать();
	Количество = Выборка.Количество();
	Если Выборка.Следующий() Тогда
		ПоследняяДата = Выборка.Дата;
	Иначе
		ПоследняяДата = Дата('00010101');
	КонецЕсли;
	
	Ответ = Новый Структура;
	Ответ.Вставить("Количество", Количество);
	Ответ.Вставить("ПоследняяДата", ПоследняяДата);
	
	Возврат Ответ;
	
КонецФункции

Функция ПолучитьДанныеПоЖалобам()
	
	МассивКлиентов = Объект.Ссылка.Клиенты.ВыгрузитьКолонку("Клиент");
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	DMS_ОбращениеКлиента.Описание КАК Жалоба,
	               |	DMS_ОбращениеКлиента.Комментарий КАК Результат,
	               |	DMS_ОбращениеКлиента.Дата КАК Дата
	               |ИЗ
	               |	Документ.ЖалобаКлиента КАК ЖалобаКлиента,
	               |	Документ.DMS_ОбращениеКлиента КАК DMS_ОбращениеКлиента
	               |ГДЕ
	               |	DMS_ОбращениеКлиента.Контрагент В(&МассивКлиентов)
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	Дата УБЫВ";
	Запрос.УстановитьПараметр("МассивКлиентов", МассивКлиентов);
	Выборка = Запрос.Выполнить().Выбрать();
	Количество = Выборка.Количество();
	Если Выборка.Следующий() Тогда
		ПоследняяДата = Выборка.Дата;
	Иначе
		ПоследняяДата = Дата('00010101');
	КонецЕсли;
	
	Ответ = Новый Структура;
	Ответ.Вставить("Количество", Количество);
	Ответ.Вставить("ПоследняяДата", ПоследняяДата);
	
	Возврат Ответ;
	
КонецФункции

Функция ПолучитьДанныеПоЗвонкам()
	
	МассивКлиентов = Объект.Ссылка.Клиенты.ВыгрузитьКолонку("Клиент");
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	Renault_КонтактСКлиентом.Ссылка КАК Контакт,
	               |	Renault_КонтактСКлиентом.КонтактВыполнен,
	               |	Renault_КонтактСКлиентом.Кампания,
	               |	Renault_КонтактСКлиентом.ПлановаяДата КАК ПлановаяДатаКонтакта
	               |ИЗ
	               |	Документ.Renault_КонтактСКлиентом КАК Renault_КонтактСКлиентом
	               |ГДЕ
	               |	Renault_КонтактСКлиентом.Контрагент В(&СписокКлиентов)
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	Renault_CommunicationCenter_Обзвон.Ссылка,
	               |	ИСТИНА,
	               |	Renault_CommunicationCenter_Обзвон.СхемаОбзвона,
	               |	Renault_CommunicationCenter_Обзвон.Дата
	               |ИЗ
	               |	Документ.Renault_CommunicationCenter_Обзвон КАК Renault_CommunicationCenter_Обзвон
	               |ГДЕ
	               |	Renault_CommunicationCenter_Обзвон.Клиент В(&СписокКлиентов)
	               |	И Renault_CommunicationCenter_Обзвон.СхемаОбзвона.ТипКоммуникации = &ТипКоммуникации";
	Запрос.УстановитьПараметр("СписокКлиентов", МассивКлиентов);
	Запрос.УстановитьПараметр("ТипКоммуникации", Перечисления.ВидыСобытий.ТелефонныйЗвонок);
	ВсеЗвонки.Очистить();
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл 
		
		НоваяСтрока = ВсеЗвонки.Добавить();
		
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);
		
	КонецЦикла;
	
КонецФункции

Функция ПолучитьДанныеПоMyRenault()
	
	МассивКлиентов = Объект.Ссылка.Клиенты.ВыгрузитьКолонку("Клиент");
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	Renault_РегистрацииMyRenault.ДатаРегистрации
	               |ИЗ
	               |	РегистрСведений.Renault_РегистрацииMyRenault КАК Renault_РегистрацииMyRenault
	               |ГДЕ
	               |	Renault_РегистрацииMyRenault.Клиент В(&МассивКлиентов)";
	Запрос.УстановитьПараметр("МассивКлиентов", МассивКлиентов);
	Выборка = Запрос.Выполнить().Выбрать();
	Количество = Выборка.Количество();
	Если Выборка.Следующий() Тогда
		ЕстьРегистрация = Истина;
		ПоследняяДата = Выборка.ДатаРегистрации;
	Иначе
		ЕстьРегистрация = Ложь;
		ПоследняяДата = Дата('00010101');
	КонецЕсли;
	
	Если Не ЕстьРегистрация Тогда
		Для Каждого Строка Из События Цикл
			Если НРег(Строка.ACTION) = "создан в myrenault" Тогда
				ЕстьРегистрация = Истина;
				ПоследняяДата = Дата(СтрЗаменить(Строка.DATE_ACTION, "-", "") + "010101");
			КонецЕсли;
		КонецЦикла
	КонецЕсли;
	
	Ответ = Новый Структура;
	Ответ.Вставить("ЕстьРегистрация", ЕстьРегистрация);
	Ответ.Вставить("ПоследняяДата", ПоследняяДата);
	
	Возврат Ответ;
	
КонецФункции

Функция Renault_ПолучитьСписокПодтверждающихДокументов(Клиент)
	
	Запрос = Новый Запрос;
	
	Запрос.Текст = "ВЫБРАТЬ
	               |	ПодтверждающиеДокументы.Ссылка,
	               |	ПодтверждающиеДокументы.Наименование,
	               |	ПодтверждающиеДокументы.ВидПодтверждающегоДокумента
	               |ИЗ
	               |	Справочник.ПодтверждающиеДокументы КАК ПодтверждающиеДокументы
	               |ГДЕ
	               |	ПодтверждающиеДокументы.Владелец = &Владелец";
	
	Запрос.УстановитьПараметр("Владелец", Клиент);
	
	Возврат Запрос.Выполнить().Выгрузить();
	
	
КонецФункции

Функция Renault_ПолучитьТаблицуДокументовКритерияОтбора(Ограничения)
	
	Запрос = Новый Запрос;
	
	МассивВидовДокументов = Неопределено;
	ДатаНачала            = Неопределено;
	ДатаОкончания         = Неопределено;
	Ограничения.Свойство("ВидДокументов",   МассивВидовДокументов);
	Ограничения.Свойство("ДатаНачала",      ДатаНачала);
	Ограничения.Свойство("ДатаОкончания",   ДатаОкончания);
	
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	КритерийОтбораКонтрагенты.Документ КАК Активность,
	|	КритерийОтбораКонтрагенты.Дата,
	|	&Контрагент КАК Клиент
	|ИЗ (
	|		ВЫБРАТЬ
	|			Контрагенты.Ссылка КАК Документ,
	|			Контрагенты.Ссылка.Дата КАК Дата
	|		ИЗ
	|			КритерийОтбора.Контрагенты(&Контрагент) КАК Контрагенты
	|";
	
	ТекстУсловий = "";
	// Отбор по интервалу времени
	Если ДатаНачала<>Неопределено Тогда
		ТекстУсловий = ТекстУсловий + ?(ТекстУсловий="", "ГДЕ ", " И ") + "Контрагенты.Ссылка.Дата>=&ДатаНачала";	
	КонецЕсли;
	
	Если ДатаОкончания<>Неопределено Тогда
		ТекстУсловий = ТекстУсловий + ?(ТекстУсловий="", "ГДЕ ", " И ") + " Контрагенты.Ссылка.Дата<=&ДатаОкончания";
	КонецЕсли;
	
	// Отбор по виду документов
	Если (МассивВидовДокументов<>Неопределено) И (МассивВидовДокументов.Количество()<>0) Тогда
		ТекстУсловий = ТекстУсловий + ?(ТекстУсловий="", "ГДЕ (", " И (");
		
		Для Сч=0 По (МассивВидовДокументов.Количество()-1) Цикл
			Если Сч<>0 Тогда
				ТекстУсловий = ТекстУсловий + " ИЛИ ";
			КонецЕсли;
			ТекстУсловий = ТекстУсловий + "Контрагенты.Ссылка ССЫЛКА Документ." + МассивВидовДокументов[Сч];
		КонецЦикла;	
		
		ТекстУсловий = ТекстУсловий + ")";
	КонецЕсли;
	
	ТекстЗапроса = ТекстЗапроса + ТекстУсловий;
	
	ТекстЗапроса = ТекстЗапроса + "
	|) КАК КритерийОтбораКонтрагенты
	|УПОРЯДОЧИТЬ ПО
	|	Дата";
	Запрос.Текст = ТекстЗапроса;
	Запрос.УстановитьПараметр("Контрагент",      Ограничения.Контрагент);
	Запрос.УстановитьПараметр("ДатаНачала",      ДатаНачала);
	Запрос.УстановитьПараметр("ДатаОкончания",   ДатаОкончания);
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции // ЗаполнитьТаблицуДокументами() 

Функция Renault_ДобавитьВПрофильРабочиеЛистыКлиентов(Клиенты)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Renault_РабочиеЛисты.IDK КАК ID,
		|	""РабочийЛист"" КАК ТипID,
		|	Renault_РабочиеЛисты.ДатаID КАК Дата
		|ИЗ
		|	РегистрСведений.Renault_РабочиеЛисты КАК Renault_РабочиеЛисты
		|ГДЕ
		|	Renault_РабочиеЛисты.Клиент В(&Клиенты)";
	Запрос.УстановитьПараметр("Клиенты", Клиенты);
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		НоваяСтрока = КлиентыПрофиля.Добавить();
		НоваяСтрока.Активность = "Рабочий лист №" + Строка(Выборка.ID) +
			" от " + Формат(Выборка.Дата, "ДФ=""дд ММММ гггг 'г.' ЧЧ:мм:сс""");
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);
	КонецЦикла;
	
КонецФункции

&НаСервере
Функция Renault_ПолучитьКоличествоВзаимодействийПродажи(СписокКлиентов)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	Renault_Трафик.Период КАК Дата,
	               |	NULL КАК Ид,
	               |	Renault_Трафик.ТипТрафика КАК Событие,
	               |	"""" КАК Примечание,
	               |	Renault_Трафик.Менеджер
	               |ИЗ
	               |	РегистрСведений.Renault_Трафик КАК Renault_Трафик
	               |ГДЕ
	               |	Renault_Трафик.Клиент В(&МассивКлиентов)
	               |	И Renault_Трафик.Отдел.ПродажаАвтомобилей = ИСТИНА
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	Renault_РабочиеЛисты.ДатаID,
	               |	Renault_РабочиеЛисты.IDK,
	               |	""Рабочий лист"",
	               |	"""",
	               |	Renault_РабочиеЛисты.Сотрудник
	               |ИЗ
	               |	РегистрСведений.Renault_РабочиеЛисты КАК Renault_РабочиеЛисты
	               |ГДЕ
	               |	Renault_РабочиеЛисты.Клиент В(&МассивКлиентов)
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	CRM_КоммерческоеПредложениеСостав.Ссылка.Дата,
	               |	CRM_КоммерческоеПредложениеСостав.Ссылка,
	               |	""Коммерческое предложение"",
	               |	CRM_КоммерческоеПредложениеСостав.Конфигурация.Модель,
	               |	Renault_РабочиеЛисты.Сотрудник
	               |ИЗ
	               |	Документ.CRM_КоммерческоеПредложение.Состав КАК CRM_КоммерческоеПредложениеСостав
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.Renault_РабочиеЛисты КАК Renault_РабочиеЛисты
	               |		ПО CRM_КоммерческоеПредложениеСостав.Ссылка.РабочийЛист = Renault_РабочиеЛисты.IDK
	               |ГДЕ
	               |	Renault_РабочиеЛисты.Клиент В(&МассивКлиентов)
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	CRM_ЗаписиНаТестДрайв.ДатаНачала,
	               |	CRM_ЗаписиНаТестДрайв.IDK,
	               |	""Тест-драйв"",
	               |	CRM_ЗаписиНаТестДрайв.Автомобиль.Модель,
	               |	Renault_РабочиеЛисты.Сотрудник
	               |ИЗ
	               |	РегистрСведений.CRM_ЗаписиНаТестДрайв КАК CRM_ЗаписиНаТестДрайв
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.Renault_РабочиеЛисты КАК Renault_РабочиеЛисты
	               |		ПО CRM_ЗаписиНаТестДрайв.IDK = Renault_РабочиеЛисты.IDK
	               |ГДЕ
	               |	Renault_РабочиеЛисты.Клиент В(&МассивКлиентов)
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	Renault_Договор.Дата,
	               |	Renault_Договор.Ссылка,
	               |	""Договор на продажу а/м"",
	               |	Renault_Договор.СтатусДоговора,
	               |	Renault_РабочиеЛисты.Сотрудник
	               |ИЗ
	               |	Документ.Renault_Договор КАК Renault_Договор
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.Renault_РабочиеЛисты КАК Renault_РабочиеЛисты
	               |		ПО Renault_Договор.РабочийЛист = Renault_РабочиеЛисты.IDK
	               |ГДЕ
	               |	Renault_РабочиеЛисты.Клиент В(&МассивКлиентов)";
	Запрос.УстановитьПараметр("МассивКлиентов", СписокКлиентов);
	Выборка = Запрос.Выполнить().Выбрать();
	
	Возврат Выборка.Количество();
	
КонецФункции

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если ПараметрыСеанса.DMS_Бренд <> Справочники.CRM_МаркаАвтомобиля.RENAULT Тогда
		Элементы.ИсторияВзаимодействийMyRenault.Видимость = Ложь;
	КонецЕсли;
	
	ОбновитьПрофильКлиента();
	
	ЗаполнитьТаблицуВзаимодействия();
	
	ЗаполнитьИсториюСтатусов();
	СогласиеНаОПД();
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьТаблицуВзаимодействия();
	
	ТЗ = Справочники.Renault_ПрофилиКлиентов.ПолучитьТаблицуВзаимодействия(СписокКлиентов);
	ДатаПервогоКонтакта = "<не указано>";
	Для Каждого СтрокаТЗ Из ТЗ Цикл
		Если СтрокаТЗ.ДатаСобытия <> Дата(1,1,1) Тогда
			ДатаПервогоКонтакта = СтрокаТЗ.ДатаСобытия;
			Прервать;	
		КонецЕсли;	
	КонецЦикла;
	
	ИсторияВзаимодействий = ?(ТЗ.Количество()>0, "Всего: "+ ТЗ.Количество() + " начиная с " + ДатаПервогоКонтакта, "<не указано>");
	
КонецПроцедуры

&НаКлиенте
Процедура ПрофильВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ID = Элемент.ТекущиеДанные.ID;
	Если Не ЗначениеЗаполнено(ID) Тогда
		Элемент.ТекущиеДанные.Активность.ПолучитьФорму(, ЭтаФорма).Открыть();
	ИначеЕсли Элемент.ТекущиеДанные.ТипID = "РабочийЛист" Тогда
		Renault_CRM.ОткрытьФормуРЛ(ID);
	ИначеЕсли Элемент.ТекущиеДанные.ТипID = "Трафик" Тогда
		Renault_CRM.ПолучитьЗаписьТрафикаПоID(ID).ПолучитьФорму().Открыть();
	КонецЕсли;
	
КонецПроцедуры

Процедура ПрочитатьАвтомобили()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	АвтомобилиСрезПоследних.Автомобиль
		|ИЗ
		|	РегистрСведений.Автомобили.СрезПоследних КАК АвтомобилиСрезПоследних
		|ГДЕ
		|	АвтомобилиСрезПоследних.ВидЗначения = ЗНАЧЕНИЕ(Перечисление.ДополнительнаяИнформацияАвтомобилей.Хозяин)
		|	И АвтомобилиСрезПоследних.Значение В(&Клиенты)
		|
		|УПОРЯДОЧИТЬ ПО
		|	АвтомобилиСрезПоследних.Период УБЫВ";
	Запрос.УстановитьПараметр("Клиенты", Объект.Клиенты.Выгрузить(, "Клиент").ВыгрузитьКолонку("Клиент"));
	Автомобили.Загрузить(Запрос.Выполнить().Выгрузить());
	
КонецПроцедуры

Процедура ПрочитатьТрафикКлиентов(Клиенты)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Renault_Трафик.Идентификатор КАК ID,
		|	""Трафик"" КАК ТипID,
		|	Renault_Трафик.Период КАК Дата,
		|	Renault_Трафик.ТипТрафика.Наименование КАК ТипТрафика
		|ИЗ
		|	РегистрСведений.Renault_Трафик КАК Renault_Трафик
		|ГДЕ
		|	Renault_Трафик.Клиент В(&Клиенты)";
	Запрос.УстановитьПараметр("Клиенты", Клиенты);
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		НоваяСтрока = КлиентыПрофиля.Добавить();
		НоваяСтрока.Активность = Строка(Выборка.ТипТрафика) +
			" от " + Формат(Выборка.Дата, "ДФ=""дд ММММ гггг 'г.' ЧЧ:мм:сс""");
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка); 	
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ИзменитьПолВозраст(Команда)
	// Вставить содержимое обработчика.
КонецПроцедуры

&НаКлиенте
Процедура КонтактыКлиентаНажатие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ПараметрыОткрытия = Новый Структура;
	ПараметрыОткрытия.Вставить("Клиент", Клиент);
	ПараметрыОткрытия.Вставить("Клиенты", СписокКлиентов);
	
	ОткрытьФорму("ОбщаяФорма.Renault_ВсяКонтактнаяИнформация", ПараметрыОткрытия); 
	
КонецПроцедуры

&НаКлиенте
Процедура ПродуктыКлиентаНажатие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ПараметрыОткрытия = Новый Структура;
	ПараметрыОткрытия.Вставить("Клиенты", СписокКлиентов);
	
	ОткрытьФорму("Справочник.Renault_ПрофилиКлиентов.Форма.СписокПродуктов", ПараметрыОткрытия); 
	
КонецПроцедуры

&НаКлиенте
Процедура АвтомобилиКлиентаНажатие(Элемент, СтандартнаяОбработка)
	
	Если Автомобили.Количество() = 0 Тогда
		
		Возврат;
		
	КонецЕсли;
	
	СтандартнаяОбработка = Ложь;
	
	ПараметрыОткрытия = Новый Структура;
	ПараметрыОткрытия.Вставить("Клиент", Клиент);
	ПараметрыОткрытия.Вставить("Клиенты", СписокКлиентов);
	
	ОткрытьФорму("ОбщаяФорма.Renault_ВсеАвтомобили", ПараметрыОткрытия);
	
КонецПроцедуры

&НаКлиенте
Процедура ПредложитьКлиентуНажатие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ПараметрыОткрытия = Новый Структура;
	ПараметрыОткрытия.Вставить("Клиент", Клиент);
	
	ПараметрыОткрытия.Вставить("ВсеПредложения", ВсеПредложения);
	
	ОткрытьФорму("ОбщаяФорма.Renault_ВсеПредложения", ПараметрыОткрытия);
	
КонецПроцедуры

&НаСервере
Процедура ПолучитьВсеПродуктыКлиента()
	
	Если Объект.Клиенты.Количество() = 0 Тогда
		
		Возврат;
		
	КонецЕсли;
	
	МассивКлиентов = Объект.Ссылка.Клиенты.ВыгрузитьКолонку("Клиент");
		
	//Начнем с дисконтных карт
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	              |	Renault_КартыЛояльности.ПрограммаЛояльности,
	              |	Renault_КартыЛояльности.ДатаВыдачи
	              |ИЗ
	              |	Справочник.Renault_КартыЛояльности КАК Renault_КартыЛояльности
	              |ГДЕ
	              |	Renault_КартыЛояльности.Контрагент В(&Клиенты)
	              |	И Renault_КартыЛояльности.Недействительна = ЛОЖЬ";
	
	Запрос.УстановитьПараметр("Клиенты", МассивКлиентов);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		НоваяСтрока = ВсеПродукты.Добавить();
		НоваяСтрока.Продукт = ?(ЗначениеЗаполнено(Строка(Выборка.ПрограммаЛояльности)), Строка(Выборка.ПрограммаЛояльности),"Программа не указана");
		НоваяСтрока.ДатаНачалаДействия = Выборка.ДатаВыдачи;
		НоваяСтрока.ТипПродукта = "Бонусная карта";
		
	КонецЦикла;
	
	//Продленная гарантия, SARA, кредиты
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	Renault_ЦентрализованныеПродукты.ДатаНачалаДействияГарантии КАК ДатаНачалаДействия,
	               |	Renault_ЦентрализованныеПродукты.ТипКарты КАК ТипПродукта,
	               |	ВЫБОР
	               |		КОГДА Renault_ЦентрализованныеПродукты.ТипКарты = ""Кредит RN-Банка""
	               |			ТОГДА Renault_ЦентрализованныеПродукты.СуммаКредита
	               |		ИНАЧЕ Renault_ЦентрализованныеПродукты.НомерКарты
	               |	КОНЕЦ КАК Продукт
	               |ИЗ
	               |	РегистрСведений.Renault_ЦентрализованныеПродукты КАК Renault_ЦентрализованныеПродукты
	               |ГДЕ
	               |	Renault_ЦентрализованныеПродукты.Клиент В(&Клиенты)";
	
	Запрос.УстановитьПараметр("Клиенты", МассивКлиентов);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		НоваяСтрока = ВсеПродукты.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ПрочитатьПредложения()
	
	ТаблицаАвтомобили = ДанныеФормыВЗначение(Автомобили, Тип("ТаблицаЗначений"));
	
	МассивАвто = ТаблицаАвтомобили.ВыгрузитьКолонку("Автомобиль");
	
	//Сначала повреждения
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	Renault_ПоврежденияАвтомобилейСрезПоследних.Работа,
	               |	Renault_ПоврежденияАвтомобилейСрезПоследних.Автомобиль,
	               |	Renault_ПоврежденияАвтомобилейСрезПоследних.Цвет
	               |ИЗ
	               |	РегистрСведений.Renault_ПоврежденияАвтомобилей.СрезПоследних КАК Renault_ПоврежденияАвтомобилейСрезПоследних
	               |ГДЕ
	               |	Renault_ПоврежденияАвтомобилейСрезПоследних.Автомобиль В(&Автомобили)
	               |	И Renault_ПоврежденияАвтомобилейСрезПоследних.РаботаАктуальна = ИСТИНА";
	
	Запрос.УстановитьПараметр("Автомобили", МассивАвто);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		НоваяСтрока = ВсеПредложения.Добавить();
		НоваяСтрока.Источник = "Сервис";
		НоваяСтрока.Предложение = Строка(Выборка.Работа);
		НоваяСтрока.ДляАвтомобиля = Строка(Выборка.Автомобиль);
		НоваяСтрока.ТипПредложения = ?(Выборка.Цвет = Перечисления.Renault_ЦветаСертификатаКонтроля.Красный, "Рекомендация срочная", "Рекомендация");
		
	КонецЦикла;
	
	//ТеперьАкции	
	Для Каждого Автомобиль из МассивАвто Цикл
		
		ОтобратьАкции(Автомобиль);
		
	КонецЦикла;
	
	
	//Предложение по ТО
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	Renault_ВыполнениеТОСрезПоследних.ВидТО,
	               |	Renault_ВыполнениеТОСрезПоследних.ДатаПлан,
	               |	Renault_ВыполнениеТОСрезПоследних.Автомобиль,
	               |	Renault_ВыполнениеТОСрезПоследних.СкоростьПробега
	               |ИЗ
	               |	РегистрСведений.Renault_ВыполнениеТО.СрезПоследних КАК Renault_ВыполнениеТОСрезПоследних
	               |ГДЕ
	               |	Renault_ВыполнениеТОСрезПоследних.Автомобиль В(&Автомобили)
	               |	И Renault_ВыполнениеТОСрезПоследних.ДатаПлан >= &ДатаПланНачало
	               |	И Renault_ВыполнениеТОСрезПоследних.ДатаПлан <= &ДатаПланКонец
	               |	И Renault_ВыполнениеТОСрезПоследних.ДатаФакт = &Пустая";
	
	Запрос.УстановитьПараметр("ДатаПланНачало", ТекущаяДата() - 60*60*24*30);
	Запрос.УстановитьПараметр("ДатаПланКонец", ТекущаяДата() + 60*60*24*30*3);
	Запрос.УстановитьПараметр("Автомобили", МассивАвто);
	Запрос.УстановитьПараметр("Пустая", Дата('00010101'));
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	СкоростьПробега = 0;
	
	Пока Выборка.Следующий() Цикл
		
		НоваяСтрока = ВсеПредложения.Добавить();
		НоваяСтрока.Источник = "Сервис";
		НоваяСтрока.Предложение = Выборка.ВидТО;
		Новаястрока.ДляАвтомобиля = Выборка.Автомобиль;
		НоваяСтрока.ТипПредложения = "Приглашение на следующее ТО";
		
	КонецЦикла;
	
	//Калькуляции
	Запрос = Новый Запрос;
	
	Запрос.Текст = "ВЫБРАТЬ
	               |	Renault_Калькуляция.Автомобиль,
	               |	Renault_Калькуляция.Дата,
	               |	Renault_Калькуляция.Ссылка КАК Калькуляция
	               |ИЗ
	               |	Документ.Renault_Калькуляция КАК Renault_Калькуляция
	               |ГДЕ
	               |	Renault_Калькуляция.Автомобиль В(&Автомобили)";
	
	Запрос.УстановитьПараметр("Автомобили", МассивАвто);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		НоваяСтрока = ВсеПредложения.Добавить();
		НоваяСтрока.Источник = "Сервис";
		НоваяСтрока.Предложение = Выборка.Калькуляция;
		Новаястрока.ДляАвтомобиля = Выборка.Автомобиль;
		НоваяСтрока.ДокументИсточник = Выборка.Калькуляция;
		НоваяСтрока.ТипПредложения = "Калькуляция";
		
	КонецЦикла;
	
	Запрос = Новый Запрос;
	
	Запрос.Текст = "ВЫБРАТЬ
	               |	СУММА(Renault_ВыполнениеТО.СкоростьПробега) КАК СкоростьПробега,
	               |	СУММА(1) КАК КоличествоЗаписей
	               |ИЗ
	               |	РегистрСведений.Renault_ВыполнениеТО КАК Renault_ВыполнениеТО
	               |ГДЕ
	               |	Renault_ВыполнениеТО.Автомобиль В(&Автомобили)";
	
	Запрос.УстановитьПараметр("Автомобили", МассивАвто);
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		
		Если ЗначениеЗаполнено(Выборка.СкоростьПробега) И ЗначениеЗаполнено(Выборка.КоличествоЗаписей) Тогда
			
			СкоростьПробега = Выборка.СкоростьПробега / Выборка.КоличествоЗаписей;
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ОтобратьАкции(Автомобиль)
	
//Отберем локальные акции	
	Запрос = Новый Запрос();
	Запрос.Текст = "ВЫБРАТЬ
	               |	Renault_АкцииИСкидки.Ссылка,
	               |	Renault_АкцииИСкидки.Наименование
	               |ИЗ
	               |	Справочник.Renault_АкцииИСкидки КАК Renault_АкцииИСкидки
	               |ГДЕ
	               |	(Renault_АкцииИСкидки.ДляВсехМоделейАвто = ИСТИНА
	               |			ИЛИ Renault_АкцииИСкидки.МоделиАвто.Модель = &Модель)
	               |	И Renault_АкцииИСкидки.ПометкаУдаления = ЛОЖЬ
	               |	И (Renault_АкцииИСкидки.НачалоАкции <= &ТекДата
	               |	И Renault_АкцииИСкидки.ОкончаниеАкции >= &ТекДата)";
	
	Запрос.УстановитьПараметр("Модель", Автомобиль.Модель);
	Запрос.УстановитьПараметр("ВидАкции", Перечисления.Renault_ВидыАкций.Глобальная);
	Запрос.УстановитьПараметр("ТекДата", ТекущаяДата());
	
	Пробег = Справочники.Автомобили.ЧтениеЗначенияРегистраСведения(Автомобиль, Перечисления.ДополнительнаяИнформацияАвтомобилей.Пробег);
	
	Если ЗначениеЗаполнено(Пробег) Тогда
		
		Запрос.УстановитьПараметр("Пробег", Пробег);
		Запрос.Текст = Запрос.Текст + "
		|  	И (Renault_АкцииИСкидки.ПробегОт <= &Пробег
		|	И Renault_АкцииИСкидки.ПробегДо >= &Пробег)";
		
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Автомобиль.ГодВыпуска) Тогда
		
		Запрос.УстановитьПараметр("ГодВыпуска", Автомобиль.ГодВыпуска);
		Запрос.Текст = Запрос.Текст + "
		| 	И (Renault_АкцииИСкидки.ГодВыпускаОт <= &ГодВыпуска
		|	И Renault_АкцииИСкидки.ГодВыпускаДо >= &ГодВыпуска)";
		
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Автомобиль.ТипДвигателя) Тогда
		
		Запрос.УстановитьПараметр("ТипДВС", Автомобиль.ТипДвигателя);
		Запрос.УстановитьПараметр("ТипДВСПустой", Справочники.ТипыДвигателей.ПустаяСсылка());
		Запрос.Текст = Запрос.Текст + "
		|	И (Renault_АкцииИСкидки.ТипДВС = &ТипДВС 
		|	ИЛИ Renault_АкцииИСкидки.ТипДВС = &ТипДВСПустой)";
		
	КонецЕсли;
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		НоваяСтрока = ВсеПредложения.Добавить();
		НоваяСтрока.Предложение = Выборка.Наименование;
		НоваяСтрока.Источник = "Сервис";
		НоваяСтрока.ТипПредложения = "Акция дилера";
		НоваяСтрока.ДляАвтомобиля = Автомобиль;
		
	КонецЦикла;
	
	//Отберем центральные акции
	Запрос = Новый Запрос();
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Renault_ЦентрализованныеАкцииМодели.Ссылка,
	|	Renault_ЦентрализованныеАкцииМодели.Ссылка.Наименование,
	|	Renault_ЦентрализованныеАкцииМодели.Ссылка.ТолькоMyRenault,
	|	Renault_ЦентрализованныеАкцииМодели.УИД
	|ИЗ
	|	Справочник.Renault_ЦентрализованныеАкции.Модели КАК Renault_ЦентрализованныеАкцииМодели
	|ГДЕ
	|	(Renault_ЦентрализованныеАкцииМодели.Модель = &Модель
	|	ИЛИ Renault_ЦентрализованныеАкцииМодели.Модель = &ПустаяМодель)
	|	И Renault_ЦентрализованныеАкцииМодели.Ссылка.НачалоДействия <= &ТекущаяДата
	|	И Renault_ЦентрализованныеАкцииМодели.Ссылка.ОкончаниеДействия >= &ТекущаяДата
	|	И Renault_ЦентрализованныеАкцииМодели.Ссылка.УчастиеПодтверждено = ИСТИНА
	|	И Renault_ЦентрализованныеАкцииМодели.Ссылка.ДаноСогласиеНаУчастие = ИСТИНА";
	Запрос.УстановитьПараметр("Модель", Автомобиль.Модель);
	Запрос.УстановитьПараметр("ПустаяМодель", Справочники.Модели.ПустаяСсылка());
	
	Если ЗначениеЗаполнено(Автомобиль.ВариантКомплектации) Тогда
		
		Запрос.Текст = Запрос.Текст + Символы.ПС +
		"И (Renault_ЦентрализованныеАкцииМодели.ВариантКомплектации = &ВариантКомплектации
		| ИЛИ Renault_ЦентрализованныеАкцииМодели.ВариантКомплектации = &ПустойВариант)";
		
		Запрос.УстановитьПараметр("ВариантКомплектации", Автомобиль.ВариантКомплектации);
		Запрос.УстановитьПараметр("ПустойВариант", Справочники.ВариантыКомплектации.ПустаяСсылка());
		
	Иначе
		
		Запрос.Текст = Запрос.Текст + Символы.ПС +
		"И Renault_ЦентрализованныеАкцииМодели.ВариантКомплектации = &ПустойВариант";
		Запрос.УстановитьПараметр("ПустойВариант", Справочники.ВариантыКомплектации.ПустаяСсылка());
		
	КонецЕсли;
	
	Если НЕ Renault_АвтосервисОбщий.ЕстьMyRenault(Клиент) Тогда
		
		Запрос.Текст = Запрос.Текст + Символы.ПС +
		
		"И Renault_ЦентрализованныеАкцииМодели.Ссылка.ТолькоMyRenault = ЛОЖЬ";
		
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Автомобиль.ТипДвигателя) Тогда
		
		Запрос.Текст = Запрос.Текст + Символы.ПС + 
		"И (Renault_ЦентрализованныеАкцииМодели.ТипДвигателя = &ТипДвигателя
		| ИЛИ  Renault_ЦентрализованныеАкцииМодели.ТипДвигателя = &ПустойТип)";
		
		Запрос.УстановитьПараметр("ТипДвигателя", Автомобиль.ТипДвигателя);
		Запрос.УстановитьПараметр("ПустойТип", Справочники.ТипыДвигателей.ПустаяСсылка());
		
	Иначе
		
		Запрос.Текст = Запрос.Текст + Символы.ПС + 
		"И Renault_ЦентрализованныеАкцииМодели.ТипДвигателя = &ПустойТип";
		
		Запрос.УстановитьПараметр("ПустойТип", Справочники.ТипыДвигателей.ПустаяСсылка());
		
	КонецЕсли;
	
	Запрос.УстановитьПараметр("ТекущаяДата", ТекущаяДата());
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		НоваяСтрока = ВсеПредложения.Добавить();
		НоваяСтрока.Предложение = Выборка.Наименование;
		НоваяСтрока.Источник = "Сервис";
		НоваяСтрока.ТипПредложения = ?(Выборка.ТолькоMyRenault, "MyRenault", "Акция Renault");
		НоваяСтрока.ДляАвтомобиля = Автомобиль;
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ДокументыНажатие(Элемент, СтандартнаяОбработка)
	
	Если ДокументыКлиента = "Документы " + "(документы не найдены)" Тогда
		
		Возврат;
		
	КонецЕсли;
	
	СтандартнаяОбработка = Ложь;
	
	ПараметрыОткрытия = Новый Структура;
	ПараметрыОткрытия.Вставить("Клиент", Клиент);
	ПараметрыОткрытия.Вставить("Клиенты", Объект.Клиенты);
	
	ОткрытьФорму("ОбщаяФорма.Renault_ВсеДокументы", ПараметрыОткрытия);
	
КонецПроцедуры

&НаКлиенте
Процедура ПолВозрастНажатие(Элемент, СтандартнаяОбработка)
	// Вставить содержимое обработчика.
КонецПроцедуры

&НаСервере
Процедура ПолучитьВсеЗаездыНаСервис()
	
	Если Объект.Клиенты.Количество() = 0 Тогда
		
		Возврат;
		
	КонецЕсли;
	
	МассивКлиентов = Объект.Ссылка.Клиенты.ВыгрузитьКолонку("Клиент");
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЗаказНаряд.Ссылка,
	               |	ЗаказНаряд.ВидРемонта,
	               |	ЗаказНаряд.Автомобиль,
	               |	ВЫБОР
	               |		КОГДА ЗаказНаряд.ДатаНачала = ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	               |			ТОГДА ЗаказНаряд.Дата
	               |		ИНАЧЕ ЗаказНаряд.ДатаНачала
	               |	КОНЕЦ КАК ДатаНачала
	               |ИЗ
	               |	Документ.ЗаказНаряд КАК ЗаказНаряд
	               |ГДЕ
	               |	ЗаказНаряд.Контрагент В(&Клиенты)
	               |	И ЗаказНаряд.ПометкаУдаления = ЛОЖЬ
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	ДатаНачала УБЫВ";
	
	Запрос.УстановитьПараметр("Клиенты", МассивКлиентов);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		НоваяСтрока = ВсеЗаездыНаСервис.Добавить();
		НоваяСтрока.Автомобиль = Выборка.Автомобиль;
		НоваяСтрока.ДатаЗаезда = Выборка.ДатаНачала;
		НоваяСтрока.ВидРемонта = Выборка.ВидРемонта;
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ИсторияВзаимодействийСервисНажатие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Если ИсторияВзаимодействийСервис = "Заездов в сервис пока не было" Тогда
		
		Возврат;
		
	КонецЕсли;
	
	ПараметрыОткрытия = Новый Структура;
	ПараметрыОткрытия.Вставить("Клиент", Клиент);
	
	ПараметрыОткрытия.Вставить("ВсеЗаезды", ВсеЗаездыНаСервис);
	
	ОткрытьФорму("ОбщаяФорма.Renault_ВсеЗаездыНаСервис", ПараметрыОткрытия);
	
КонецПроцедуры

&НаКлиенте
Процедура ИсторияВзаимодействийОпросыНажатие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
КонецПроцедуры

&НаКлиенте
Процедура ИсторияВзаимодействийРассылкиНажатие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ПараметрыОткрытия = Новый Структура;
	ПараметрыОткрытия.Вставить("Клиенты", СписокКлиентов);
	
	ОткрытьФорму("Справочник.Renault_ПрофилиКлиентов.Форма.ЦентрализованныеРассылки", ПараметрыОткрытия); 
	
КонецПроцедуры

&НаКлиенте
Процедура ИсторияВзаимодействийПродажиНажатие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ПараметрыОткрытия = Новый Структура;
	ПараметрыОткрытия.Вставить("Клиенты", СписокКлиентов);
	
	ОткрытьФорму("Справочник.Renault_ПрофилиКлиентов.Форма.ВзаимодействияСОтделомПродаж", ПараметрыОткрытия); 
	
КонецПроцедуры

&НаКлиенте
Процедура ИсторияВзаимодействийЖалобыНажатие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ПараметрыОткрытия = Новый Структура;
	ПараметрыОткрытия.Вставить("Клиенты", СписокКлиентов);
	
	ОткрытьФорму("Справочник.Renault_ПрофилиКлиентов.Форма.Жалобы", ПараметрыОткрытия); 
	
КонецПроцедуры


&НаКлиенте
Процедура ИсторияВзаимодействийНажатие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Парам = Новый Структура;
	Парам.Вставить("СписокОтбора", СписокКлиентов);
	
	Форма = ПолучитьФорму("РегистрСведений.DMS_ЖурналВзаимодействий.ФормаСписка",Парам);
	
	Отбор = Форма.РегистрСведенийСписок.Отбор.Клиент;
	Отбор.ВидСравнения = ВидСравнения.ВСписке;
	Отбор.Значение = СписокКлиентов;
	Отбор.Использование = Истина;
	
	Форма.Открыть();
	
	ФормаКоммуникации = Документы.Renault_CommunicationCenter_Обзвон.ПолучитьФормуСписка();
	ФормаКоммуникации.Отбор.Клиент.ВидСравнения  = ВидСравнения.ВСписке;
	ФормаКоммуникации.Отбор.Клиент.Использование = Истина;
	ФормаКоммуникации.Отбор.Клиент.Значение      = СписокКлиентов;
	
	ФормаКоммуникации.Открыть();
	
КонецПроцедуры

&НаКлиенте
Процедура СвернутьПоказатьПанельКлиентов(Команда)
	
	Элементы.Клиенты.Видимость = Не Элементы.Клиенты.Видимость;
	
КонецПроцедуры

&НаКлиенте
Процедура СледующиеСобытияЗаездыНаСервисНажатие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
КонецПроцедуры

&НаКлиенте
Процедура СледующиеСобытияЗвонкиНажатие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Если ВсеЗвонки.Количество() = 0 Тогда
		
		Возврат;
		
	КонецЕсли;
	
	ПараметрыОткрытия = Новый Структура;
	ПараметрыОткрытия.Вставить("Клиент", Клиент);
	
	ПараметрыОткрытия.Вставить("ВсеЗвонки", ВсеЗвонки);
	
	ОткрытьФорму("ОбщаяФорма.Renault_ФормаСледующихЗвонков", ПараметрыОткрытия);
	
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьНастройкиОграниченияКонтакта(Команда)
	
	Парам = Новый Структура("Ссылка",ЭтаФорма.Объект.Ссылка);
	ОткрытьФорму("Справочник.Renault_ПрофилиКлиентов.Форма.ФормаНастроекОграниченияКонтакта", Парам);
	
КонецПроцедуры

&НаКлиенте
Процедура Хобби(Команда)
	
	Форма = РегистрыСведений.Renault_ХоббиКлиентов.ПолучитьФормуСписка();
	
	Форма.Отбор.Клиент.ВидСравнения = ВидСравнения.ВСписке;
	Форма.Отбор.Клиент.Значение = СписокКлиентов;
	Форма.Отбор.Клиент.Использование = Истина;
	
	Форма.Открыть();
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьИсториюСтатусов()
	
	Если ПараметрыСеанса.DMS_Бренд = Справочники.CRM_МаркаАвтомобиля.LADA Тогда
		Возврат;
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Истина);
	
	Настройки = Справочники.Renault_СлужебныеНастройкиБазыДанных[ПараметрыСеанса.DMS_Бренд.Наименование];
	АдресWS	 = Настройки.АдресWsGate;
	ЛогинWS	 = Настройки.ЛогинДоступаКВебСервисам;
	ПарольWS = Настройки.ПарольДоступаКВебСервисам;
	
	ВСОпределение = Новый WSОпределения(СокрЛП(АдресWS) + "ws/ClientsInfo.ws?wsdl",
									СокрЛП(ЛогинWS), СокрЛП(ПарольWS));
	
	ВебСервис = Новый WSПрокси(ВСОпределение, "http://renault-nissan.com/schema/ClientsInfo", 
							   "Renault_ClientsInfo", "Renault_ClientsInfoSoap12", 60000);
	
	ВебСервис.Пользователь	 = ЛогинWS;
	ВебСервис.Пароль		 = ПарольWS;
	
	Результат = ВебСервис.GetDataHubInfo(Строка(объект.GoldenId), "dms_get_commstatus");
	ТаблицаРезультат = СериализаторXDTO.ПрочитатьXDTO(Результат);
	
	Для Каждого Строка Из ТаблицаРезультат Цикл
		НоваяСТрока = СтатусыКлиента.Добавить();
		НоваяСтрока.Дата = Строка.DATE_ACTION;
		НоваяСтрока.Статус = Строка.STATUS_NAME;
		НоваяСтрока.goldenID = Строка.GOLDEN_ID;
	КонецЦикла;
	
	Результат = ВебСервис.GetDataHubInfo(Строка(объект.GoldenId), "dms_get_phones");
	ТаблицаРезультат = СериализаторXDTO.ПрочитатьXDTO(Результат);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	КонтактнаяИнформация.Представление
		|ИЗ
		|	РегистрСведений.КонтактнаяИнформация КАК КонтактнаяИнформация
		|ГДЕ
		|	КонтактнаяИнформация.Объект = &Объект
		|	И КонтактнаяИнформация.Тип = &Тип";
	Запрос.УстановитьПараметр("Объект", Клиент);
	Запрос.УстановитьПараметр("Тип", Перечисления.ТипыКонтактнойИнформации.Телефон);
	Таблица = Запрос.Выполнить().Выгрузить();
	
	Для Каждого Строка Из ТаблицаРезультат Цикл
		
		Найден = Ложь;
		Для Каждого КонтСтрока ИЗ Таблица Цикл
			Если КонтСтрока.Представление = Строка(Строка.CITY_CODE) + Строка(Строка.NUMBER) Тогда
				Найден = Истина;
				Прервать;
			КонецЕсли;
		КонецЦикла;
		
		Если Не найден Тогда
			
			ВидКИ = Неопределено;
			
			Для Счетчик = 1 по 10 Цикл
				МенеджерЗаписи = РегистрыСведений.КонтактнаяИнформация.СоздатьМенеджерЗаписи();
				МенеджерЗаписи.Объект = Клиент;
				МенеджерЗаписи.Тип = Перечисления.ТипыКонтактнойИнформации.Телефон;
				
				ВидКИ = Справочники.ВидыКонтактнойИнформации.НайтиПоНаименованию("RenaultТелефон" + Строка(Счетчик));
				Если Не ЗначениеЗаполнено(ВидКИ) Тогда
					Вид = Справочники.ВидыКонтактнойИнформации.СоздатьЭлемент();
					Вид.Тип = Перечисления.ТипыКонтактнойИнформации.Телефон;
					Вид.Наименование = "RenaultТелефон" + Строка(Счетчик);
					Вид.Записать();
					ВидКИ = Вид.Ссылка;
				КонецЕсли;
				МенеджерЗаписи.Вид = ВидКИ;
				МенеджерЗаписи.Прочитать();
				Если Не МенеджерЗаписи.Выбран() Тогда
					Прервать;
				КонецЕсли;
			КонецЦикла;
			
			МенеджерЗаписи = РегистрыСведений.КонтактнаяИнформация.СоздатьМенеджерЗаписи();
			МенеджерЗаписи.Объект = Клиент;
			МенеджерЗаписи.Тип = Перечисления.ТипыКонтактнойИнформации.Телефон;
			МенеджерЗаписи.Вид = ВидКИ;
			МенеджерЗаписи.Представление = Строка(Строка.CITY_CODE) + Строка(Строка.NUMBER);
			МенеджерЗаписи.Записать();
		КонецЕсли;
		
	КонецЦикла;
	
	Результат = ВебСервис.GetDataHubInfo(Строка(объект.GoldenId), "dms_get_emails");
	ТаблицаРезультат = СериализаторXDTO.ПрочитатьXDTO(Результат);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	КонтактнаяИнформация.Представление
		|ИЗ
		|	РегистрСведений.КонтактнаяИнформация КАК КонтактнаяИнформация
		|ГДЕ
		|	КонтактнаяИнформация.Объект = &Объект
		|	И КонтактнаяИнформация.Тип = &Тип";
	Запрос.УстановитьПараметр("Объект", Клиент);
	Запрос.УстановитьПараметр("Тип", Перечисления.ТипыКонтактнойИнформации.Телефон);
	Таблица = Запрос.Выполнить().Выгрузить();
	
	Для Каждого Строка Из ТаблицаРезультат Цикл
		Найден = Ложь;
		Для Каждого КонтСтрока ИЗ Таблица Цикл
			Если КонтСтрока.Представление = Строка.EMAIL Тогда
				Найден = Истина;
				Прервать;
			КонецЕсли;
		КонецЦикла;
		
		Если Не найден Тогда
			
			ВидКИ = Неопределено;
			
			Для Счетчик = 1 по 10 Цикл
				МенеджерЗаписи = РегистрыСведений.КонтактнаяИнформация.СоздатьМенеджерЗаписи();
				МенеджерЗаписи.Объект = Клиент;
				МенеджерЗаписи.Тип = Перечисления.ТипыКонтактнойИнформации.АдресЭлектроннойПочты;
				
				ВидКИ = Справочники.ВидыКонтактнойИнформации.НайтиПоНаименованию("RenaultEmail" + Строка(Счетчик));
				Если Не ЗначениеЗаполнено(ВидКИ) Тогда
					Вид = Справочники.ВидыКонтактнойИнформации.СоздатьЭлемент();
					Вид.Тип = Перечисления.ТипыКонтактнойИнформации.АдресЭлектроннойПочты;
					Вид.Наименование = "RenaultEmail" + Строка(Счетчик);
					Вид.Записать();
					ВидКИ = Вид.Ссылка;
				КонецЕсли;
				МенеджерЗаписи.Вид = ВидКИ;
				МенеджерЗаписи.Прочитать();
				Если Не МенеджерЗаписи.Выбран() Тогда
					Прервать;
				КонецЕсли;
			КонецЦикла;
			
			МенеджерЗаписи = РегистрыСведений.КонтактнаяИнформация.СоздатьМенеджерЗаписи();
			МенеджерЗаписи.Объект = Клиент;
			МенеджерЗаписи.Тип = Перечисления.ТипыКонтактнойИнформации.АдресЭлектроннойПочты;
			МенеджерЗаписи.Вид = ВидКИ;
			МенеджерЗаписи.Представление = Строка(Строка.EMAIL);
			МенеджерЗаписи.Записать();
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

Функция СогласиеНаОПД() ДокументСогласиеНаОбработкуПерсональныхДанных=Документы.DMS_СогласиеНаОбработкуПерсональныхДанных.СогласиеНаОбработку(Клиент); Возврат ДокументСогласиеНаОбработкуПерсональныхДанных КонецФункции	
