Перем ТипЦенЗакупочная Экспорт;
Перем ВалютаУпр Экспорт;

Функция СоздатьЗаказПоЗаявке()
	
	
	
КонецФункции

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ РАБОТЫ С КОРЗИНОЙ

Процедура КорзинаПриИзмененииКоличества(Стр) Экспорт

	//Стр.СуммаPCL        = Стр.Количество * Стр.PCL;
	//Стр.СуммаPNC        = Стр.Количество * Стр.PNC;
	//Стр.СуммаPNCСрочная = Стр.Количество * Стр.PNCСрочная;

	// [ВОРОБЬЕВ]] 06.02.2017 17:42:10 +++
	 
	Стр.Сумма = Стр.Количество * Стр.Номенклатура.ОсновнаяЕдиницаИзмерения.Коэффициент * Стр.Цена;
	
	// [[ВОРОБЬЕВ]] --- 
	
	
КонецПроцедуры

Процедура КорзинаПриИзмененииЦены(Стр) Экспорт

    КорзинаПриИзмененииКоличества(Стр);

КонецПроцедуры

Процедура КорзинаПриИзмененииНоменклатуры(Стр) Экспорт

	Стр.ЦенаБезНДС = 0;
	Стр.Цена       = 0;

    Запрос = Новый Запрос;
    Запрос.УстановитьПараметр("Артикул", Стр.Номенклатура.Артикул);
	Запрос.УстановитьПараметр("СтавкаНДС", Стр.Номенклатура.СтавкаНДС.Ставка/100);
	Запрос.УстановитьПараметр("ТипЦен", ТипЦен);

	Запрос.Текст = "ВЫБРАТЬ
	               |	Renault_ТарифЦен.ТипЦены,
	               |	Renault_ТарифЦен.Цена КАК ЦенаБезНДС,
	               |	ВЫБОР
	               |		КОГДА Renault_ТарифЦен.ТипЦены.ЦенаВключаетНДС
	               |			ТОГДА Renault_ТарифЦен.Цена
	               |		ИНАЧЕ Renault_ТарифЦен.Цена + Renault_ТарифЦен.Цена * &СтавкаНДС
	               |	КОНЕЦ КАК Цена
	               |ИЗ
	               |	РегистрСведений.Renault_ТарифЦен КАК Renault_ТарифЦен
	               |ГДЕ
	               |	Renault_ТарифЦен.Артикул = &Артикул
	               |	И Renault_ТарифЦен.ТипЦены = &ТипЦен";

    Цены = Запрос.Выполнить().Выгрузить();

    Для Каждого Цена Из Цены Цикл
		
		Стр.ЦенаБезНДС = Цена.ЦенаБезНДС;
		Стр.Цена       = Цена.Цена;
		
    КонецЦикла;

    КорзинаПриИзмененииКоличества(Стр);

КонецПроцедуры

Процедура КорзинаДобавитьНоменклатуру(Номенклатура) Экспорт

    Стр = Корзина.Найти(Номенклатура, "Номенклатура");

    Если Стр = Неопределено Тогда
        Стр = Корзина.Добавить();
        Стр.Номенклатура = Номенклатура;
        Стр.Артикул      = Стр.Номенклатура.Артикул;
        Стр.Количество   = 1;
        КорзинаПриИзмененииНоменклатуры(Стр);
    Иначе
        Стр.Количество   = Стр.Количество + 1;
        КорзинаПриИзмененииКоличества(Стр);
    КонецЕсли;

КонецПроцедуры

Процедура ПересчитатьКорзинуПоТипуЦен(мТипЦен) Экспорт

	Запрос = Новый Запрос;
	
	Запрос.Текст = "ВЫБРАТЬ
	               |	Номенклатура.Ссылка КАК Номенклатура,
	               |	Номенклатура.Артикул КАК Артикул
	               |ПОМЕСТИТЬ ВТ_Номенклатура
	               |ИЗ
	               |	Справочник.Номенклатура КАК Номенклатура
	               |ГДЕ
	               |	Номенклатура.Ссылка В (&СписокНоменклатуры)
	               |
	               |ИНДЕКСИРОВАТЬ ПО
	               |	Артикул
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВТ_Номенклатура.Номенклатура,
	               |	ВЫБОР
	               |		КОГДА Renault_ТарифЦен.ТипЦены.ЦенаВключаетНДС
	               |			ТОГДА Renault_ТарифЦен.Цена
	               |		ИНАЧЕ Renault_ТарифЦен.Цена + Renault_ТарифЦен.Цена * (ВТ_Номенклатура.Номенклатура.СтавкаНДС.Ставка/100)
	               |	КОНЕЦ КАК Цена,
	               |	Renault_ТарифЦен.Цена КАК ЦенаБезНДС
	               |ИЗ
	               |	ВТ_Номенклатура КАК ВТ_Номенклатура
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.Renault_ТарифЦен КАК Renault_ТарифЦен
	               |		ПО (Renault_ТарифЦен.ТипЦены = &ТипЦен)
	               |			И ВТ_Номенклатура.Артикул = Renault_ТарифЦен.Артикул";
	
	Запрос.УстановитьПараметр("ТипЦен", мТипЦен);
	Запрос.УстановитьПараметр("СписокНоменклатуры", Корзина.ВыгрузитьКолонку("Номенклатура"));
	
	Цены = Запрос.Выполнить().Выгрузить();
	
	Для каждого СтрокаКорзины Из Корзина Цикл
		стрЦена = Цены.Найти(СтрокаКорзины.Номенклатура, "Номенклатура");
		
		СтрокаКорзины.Цена = ?(стрЦена = Неопределено, 0, стрЦена.Цена);
		СтрокаКорзины.ЦенаБезНДС = ?(стрЦена = Неопределено, 0, стрЦена.ЦенаБезНДС);
		
  		КорзинаПриИзмененииКоличества(СтрокаКорзины);
	КонецЦикла;

КонецПроцедуры
 
// Функция - Получить типы цен
// 
// Возвращаемое значение:
//  Массив - массив типов цен
//
Функция ПолучитьТипыЦен() Экспорт

    Настройки = Справочники.Renault_НастройкиПодсистемыЗапчасти.ЭтаБаза;

	ТипыЦен = Новый Массив;
	Если ЗначениеЗаполнено(Настройки.ТипЦенPCL) 
		И ТипыЦен.Найти(Настройки.ТипЦенPCL) = Неопределено Тогда
		
		ТипыЦен.Добавить(Настройки.ТипЦенPCL);	
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Настройки.ТипЦенPNC) 
		И ТипыЦен.Найти(Настройки.ТипЦенPNC) = Неопределено Тогда
		
		ТипыЦен.Добавить(Настройки.ТипЦенPNC);	
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Настройки.ТипЦенPNCU) 
		И ТипыЦен.Найти(Настройки.ТипЦенPNCU) = Неопределено Тогда
		
		ТипыЦен.Добавить(Настройки.ТипЦенPNCU);	
	КонецЕсли;
	
	Возврат ТипыЦен;
	
КонецФункции // ПолучитьТипыЦен()

////////////////////////////////////////////////////////////////////////////////
////////////////////////////////////////////////////////////////////////////////
// СКЛАД (БЫВШИЙ АРМ ЛОГИСТА) ++ (начало)

Процедура ОбновитьТаблицыСклад(НастройкиКДСклад) Экспорт

    Товары.Очистить();
    СписокЗаказов.Очистить();

	СКДСклад = ПолучитьМакетСКДСклад();
	
	Для каждого стрПар Из НастройкиКДСклад.ПараметрыДанных.Элементы Цикл
		Если стрПар.Параметр = Новый ПараметрКомпоновкиДанных("ТекущаяДата") Тогда
			стрПар.Значение = НачалоДня(ТекущаяДата());
			стрПар.Использование = Истина;
		КонецЕсли;	
	КонецЦикла;
	
	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
	
	МакетКомпоновки = КомпоновщикМакета.Выполнить(СКДСклад, НастройкиКДСклад,,, Тип("ГенераторМакетаКомпоновкиДанныхДляКоллекцииЗначений"));
	
	ПроцессорКомпоновки = Новый ПроцессорКомпоновкиДанных;
	ПроцессорКомпоновки.Инициализировать(МакетКомпоновки);
	
	ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВКоллекциюЗначений;
	
	Таблица = Новый ТаблицаЗначений;
	
	ПроцессорВывода.УстановитьОбъект(Таблица);
	ПроцессорВывода.Вывести(ПроцессорКомпоновки);

	СписокЗаказов.Загрузить(Таблица);
	
	Таблица.Свернуть("Артикул, Номенклатура, ХарактеристикаНоменклатуры, ОсновнойПоставщик, Промоакция", "Нераспределено, Заказано");
	Товары.Загрузить(Таблица);
	
КонецПроцедуры

Функция ПолучитьМакетСКДСклад() Экспорт
	
	ВозвращаемоеЗначение = ПолучитьМакет("СКЛАД_СКД_ЗапросДанные");
	
	Возврат ВозвращаемоеЗначение;
	
КонецФункции // ПолучитьМакетСКДСклад()

// СКЛАД (БЫВШИЙ АРМ ЛОГИСТА) -- (конец)
////////////////////////////////////////////////////////////////////////////////
////////////////////////////////////////////////////////////////////////////////

ВалютаУпр = Константы.ВалютаУправленческогоУчетаКомпании.Получить();
ТипЦенЗакупочная = Справочники.Renault_ОбщиеНастройкиБазыДанных.ЭтаБаза.PNCЗакупСкладская;
