//Функция получения заявки на хранение шин по подчиненности документов
Функция ПолучитьЗаявкуНаХранениеШин(ДокументОснование) Экспорт
	ЗаявкаНаХранениеШин=ДокументОснование;
	Пока ТипЗнч(ЗаявкаНаХранениеШин)<>Тип("ДокументСсылка.ЗаявкаНаХранениеШин") Цикл
		Если обЗначениеНеЗаполнено(ЗаявкаНаХранениеШин) Тогда
			Прервать;
		КонецЕсли; 
		ЗаявкаНаХранениеШин=ЗаявкаНаХранениеШин.ДокументОснование;
	КонецЦикла;
	Если обЗначениеНеЗаполнено(ЗаявкаНаХранениеШин) Тогда
		ЗаявкаНаХранениеШин=Неопределено;
	КонецЕсли;
	Возврат ЗаявкаНаХранениеШин;
КонецФункции // ПолучитьЗаявкуНаХранениеШин()
