
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ЗаполнитьТаблицу(Параметры.ДокументККП);
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьТаблицу(ДокументККП)

	Если ДокументККП.ЧекЛистХранения.Количество()=0 Тогда Возврат; КонецЕсли;
	
	// Дата производства А/М
	Запись = РегистрыСведений.CRM_СостояниеАвтомобилейПроизводителя_v2.СоздатьМенеджерЗаписи();
	Запись.VIN = ДокументККП.VIN;
	Запись.Прочитать();
	MADC = ?(Запись.Выбран(),Запись.DATE_MADC,Дата("00010101"));
	
	Месяцы = Новый Массив; Месяцы.Добавить(0); Месяцы.Добавить(3); Месяцы.Добавить(6); Месяцы.Добавить(9); Месяцы.Добавить(12);
	
	Для каждого НомерМесяца Из Месяцы Цикл
		
		НоваяСтрока = ТаблицаДанных.Добавить();
		НоваяСтрока.Автомобиль = ДокументККП.Автомобиль;
		НоваяСтрока.MADC = MADC;
		НоваяСтрока.Месяц = НомерМесяца;

		Если Месяцы.Найти(НомерМесяца)=0 Тогда
			// первая строка это план работ через 3 месяца от MADC
			НоваяСтрока.ДатаСледующейОперации = ДобавитьМесяц(MADC,Месяцы[1]);
			
			СтрокиПлан = ДокументККП.ЧекЛистХранения.НайтиСтроки(Новый Структура("Месяц",Месяцы[1]));
			Для каждого СтрокаТЧ Из СтрокиПлан Цикл
				НоваяСтрока.СледующаяОперация = ?(ПустаяСтрока(НоваяСтрока.СледующаяОперация),СтрокаТЧ.Операция,НоваяСтрока.СледующаяОперация+", "+Строка(СтрокаТЧ.Операция));
			КонецЦикла;
			
			Продолжить;
		КонецЕсли;
		
		// заполним прошлые операции
		СтрокиТЧ = ДокументККП.ЧекЛистХранения.НайтиСтроки(Новый Структура("Месяц",НомерМесяца));
		
		Для каждого СтрокаТЧ Из СтрокиТЧ Цикл
			Если Не ЗначениеЗаполнено(СтрокаТЧ.ДатаФакт) Тогда Продолжить; КонецЕсли;
			НоваяСтрока.ПрошлаяОперация = ?(ПустаяСтрока(НоваяСтрока.ПрошлаяОперация),СтрокаТЧ.Операция,НоваяСтрока.ПрошлаяОперация+", "+Строка(СтрокаТЧ.Операция));
			НоваяСтрока.ДатаПрошлойОперации = ?(Не ЗначениеЗаполнено(НоваяСтрока.ДатаПрошлойОперации),СтрокаТЧ.ДатаФакт,?(СтрокаТЧ.ДатаФакт>НоваяСтрока.ДатаПрошлойОперации,НоваяСтрока.ДатаПрошлойОперации,СтрокаТЧ.ДатаФакт));
		КонецЦикла;
		
		//Если ЗначениеЗаполнено(НоваяСтрока.ДатаПрошлойОперации) Тогда
		//	ПрошлаяОперация = Новый Структура("Дата,Месяц",НоваяСтрока.ДатаПрошлойОперации,НоваяСтрока.Месяц);
		//КонецЕсли;
		
		// заполним следующие операции
		Если Месяцы.Количество()-1 <> Месяцы.Найти(НомерМесяца) Тогда 
			НомерСледМесяца = Месяцы[Месяцы.Найти(НомерМесяца)+1];

			СтрокиТЧ = ДокументККП.ЧекЛистХранения.НайтиСтроки(Новый Структура("Месяц",НомерСледМесяца));
			Для каждого СтрокаТЧ Из СтрокиТЧ Цикл
				НоваяСтрока.СледующаяОперация = ?(ПустаяСтрока(НоваяСтрока.СледующаяОперация),СтрокаТЧ.Операция,НоваяСтрока.СледующаяОперация+", "+Строка(СтрокаТЧ.Операция));
				НоваяСтрока.ДатаСледующейОперации = ?(Не ЗначениеЗаполнено(НоваяСтрока.ДатаСледующейОперации),СтрокаТЧ.ДатаПлан,?(СтрокаТЧ.ДатаПлан>НоваяСтрока.ДатаСледующейОперации,НоваяСтрока.ДатаСледующейОперации,СтрокаТЧ.ДатаПлан));
				//Если ПрошлаяОперация<>Неопределено Тогда
				//	НоваяСтрока.ДатаСледующейОперации = ДобавитьМесяц(ПрошлаяОперация.Дата,НоваяСтрока.Месяц-ПрошлаяОперация.Месяц+3);
				//Иначе	
				//	НоваяСтрока.ДатаСледующейОперации = ДобавитьМесяц(MADC,НомерСледМесяца);
				//КонецЕсли;
			КонецЦикла;
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры
