//	Получает массив, содержащий ссылки на элементы справочника, документы, задачи, процессы, 
//	а также наборы регистров сведений, входящие в состав плана обмена указанного узла 
//	и зарегистрированных в данный момент на этом узле.
//
// Параметры:
//  УзелОбмена  - ссылка на узел плана обмена
//
// Возвращаемое значение:
//	Массив - содержит ссылки на справочники и документы, наборы записей регистров, менеджеры констант, 
//		изменения которых были зарегистрированы на указанном узле плана обмена в момент вызова функции.
Функция ПолучитьИзмененныеДанные(УзелОбмена, Количество = 0) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	МассивИзмененныхДанных = Новый Массив;
	Для Каждого ЭлементСоставаПланаОбмена Из УзелОбмена.Метаданные().Состав Цикл
		ЗапросИзменения = Новый Запрос;
		МетаданныеЭлемента = ЭлементСоставаПланаОбмена.Метаданные;
		Если ЭтоРегистрСведений(МетаданныеЭлемента) Тогда
			ПолучитьИзмененныеДанныеРегистра(УзелОбмена, МассивИзмененныхДанных, МетаданныеЭлемента, Количество);
			
		ИначеЕсли ЭтоКонстанта(МетаданныеЭлемента) Тогда
			ПолучитьИзмененнуюКонстанту(УзелОбмена, МассивИзмененныхДанных, МетаданныеЭлемента, Количество);

		Иначе
			ПолучитьИзмененныеДанныеСсылочногоТипа(УзелОбмена, МассивИзмененныхДанных, МетаданныеЭлемента, Количество);
			
		КонецЕсли;
	КонецЦикла;
	
	Возврат МассивИзмененныхДанных;
	
КонецФункции

Функция ПолучитьИзмененныеДанныеРегистра(УзелОбмена, МассивИзмененныхДанных, МетаданныеЭлемента, Количество)
	
	ИмяМетаданныхЭлемента = МетаданныеЭлемента.Имя;
	ПолноеИмяМетаданныхЭлемента = МетаданныеЭлемента.ПолноеИмя();
	
	// Сначала считываются все наборы значений измерений, соответствующие записям регистра,
	//	изменения которых зарегистрированы на указанном узле плана обмена.
	ЗапросИзменения = Новый Запрос;
	Если Количество = 0 Тогда
		ТекстЗапроса = 
			"ВЫБРАТЬ
			|	%1
			|ИЗ
			|	%2.Изменения КАК ИзмененияДанныхРегистра
			|ГДЕ
			|	ИзмененияДанныхРегистра.Узел = &Узел";
	Иначе
		ТекстЗапроса = 
			"ВЫБРАТЬ Первые " + Строка(Количество) + 
			"	%1
			|ИЗ
			|	%2.Изменения КАК ИзмененияДанныхРегистра
			|ГДЕ
			|	ИзмененияДанныхРегистра.Узел = &Узел";	
	КонецЕсли;	
		
	СтрокаРеквизитыВЗапросе = "";	
	Измерения = МетаданныеЭлемента.Измерения;
	Для Каждого Измерение Из Измерения Цикл
		СтрокаДляДобавления = "ИзмененияДанныхРегистра." + Измерение.Имя + " Как " + Измерение.Имя;
		Если ЗначениеЗаполнено(СтрокаРеквизитыВЗапросе) Тогда
			СтрокаРеквизитыВЗапросе = СтрокаРеквизитыВЗапросе + ", " + СтрокаДляДобавления;
		Иначе
			СтрокаРеквизитыВЗапросе = СтрокаДляДобавления;
		КонецЕсли;
	КонецЦикла;

	ЗапросИзменения.Текст = Renault_СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
		ТекстЗапроса,
		СтрокаРеквизитыВЗапросе,
		ПолноеИмяМетаданныхЭлемента);
		
	ЗапросИзменения.УстановитьПараметр("Узел", УзелОбмена);
	РезультатЗапроса = ЗапросИзменения.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		
		// После того, как был считан очередной набор значений измерений регистра,
		//	по этому набору значений формируется набор записей регистра.
		ЗапросДанныеРегистра = Новый Запрос;
		ТекстЗапросаДляЧтенияДанныхРегистра = 
			"ВЫБРАТЬ
			|	%1
			|ИЗ
			|	%2 КАК Регистр
			|%3";
			
		// Добавление измерений регистра в секцию "Выбрать"
		СтрокаВыбрать = "";
		Для Каждого Измерение Из Измерения Цикл
			Если ЗначениеЗаполнено(СтрокаВыбрать) Тогда
				СтрокаВыбрать = СтрокаВыбрать + ", " + "Регистр." + Измерение.Имя;
			Иначе
				СтрокаВыбрать = "Регистр." + Измерение.Имя;
			КонецЕсли;
		КонецЦикла;
		
		// Добавление ресурсов регистра в секцию "Выбрать"
		Ресурсы = МетаданныеЭлемента.Ресурсы;
		Для Каждого Ресурс Из Ресурсы Цикл
			Если ЗначениеЗаполнено(СтрокаВыбрать) Тогда
				СтрокаВыбрать = СтрокаВыбрать + ", " + "Регистр." + Ресурс.Имя;
			Иначе
				СтрокаВыбрать = "Регистр." + Ресурс.Имя;
			КонецЕсли;
		КонецЦикла;
		
		// Добавление реквизитов регистра в секцию "Выбрать"
		Реквизиты = МетаданныеЭлемента.Реквизиты;
		Для Каждого Реквизит Из Реквизиты Цикл
			Если ЗначениеЗаполнено(СтрокаВыбрать) Тогда
				СтрокаВыбрать = СтрокаВыбрать + ", " + "Регистр." + Реквизит.Имя;
			Иначе
				СтрокаВыбрать = "Регистр." + Реквизит.Имя;
			КонецЕсли;
		КонецЦикла;
		
		// Установка отбора в запрос на основании значений измерений регистра
		СтрокаГде = "";
		Для Каждого Измерение Из Измерения Цикл
			Если ЗначениеЗаполнено(СтрокаГде) Тогда
				СтрокаГде = СтрокаГде + " И " + "Регистр." + Измерение.Имя + " = &" + Измерение.Имя;
			Иначе
				СтрокаГде = "ГДЕ Регистр." + Измерение.Имя + " = &" + Измерение.Имя;
			КонецЕсли;
			ЗапросДанныеРегистра.УстановитьПараметр(Измерение.Имя, Выборка[Измерение.Имя]);
		КонецЦикла;
		
		ТекстЗапросаДляЧтенияДанныхРегистра = Renault_СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			ТекстЗапросаДляЧтенияДанныхРегистра,
			СтрокаВыбрать,
			ПолноеИмяМетаданныхЭлемента,
			СтрокаГде);
		
		ЗапросДанныеРегистра.Текст = ТекстЗапросаДляЧтенияДанныхРегистра;
		ВыборкаДанныеРегистра = ЗапросДанныеРегистра.Выполнить().Выбрать();
		
		// После получения всех данных регистра запросом формируется набор записей регистра,
		//	так как дальнейшая обработка данных производится именно над наборами записей.
		НаборЗаписейРегистра = РегистрыСведений[ИмяМетаданныхЭлемента].СоздатьНаборЗаписей();
		Для Каждого Измерение Из Измерения Цикл
			НаборЗаписейРегистра.Отбор[Измерение.Имя].Установить(Выборка[Измерение.Имя]);
		КонецЦикла;
		Пока ВыборкаДанныеРегистра.Следующий() Цикл
			НоваяЗапись = НаборЗаписейРегистра.Добавить();
			ЗаполнитьЗначенияСвойств(Новаязапись, ВыборкаДанныеРегистра);
		КонецЦикла;
		
		// Добавление сформированного набора записей регистра в массив измененных данных.
		// Этот массив будет передан в дальнейшую обработку.
		МассивИзмененныхДанных.Добавить(НаборЗаписейРегистра);
		
	КонецЦикла;
	
КонецФункции

Функция ПолучитьИзмененнуюКонстанту(УзелОбмена, МассивИзмененныхДанных, МетаданныеЭлемента, Количество)
	
	ИмяМетаданныхЭлемента = МетаданныеЭлемента.Имя;
	ПолноеИмяМетаданныхЭлемента = МетаданныеЭлемента.ПолноеИмя();
	
	ЗапросИзмененияКонстанты = Новый Запрос;
	Если Количество = 0 Тогда
		ТекстЗапроса = 
			"ВЫБРАТЬ
			|	ТаблицаИзменения.НомерСообщения
			|ИЗ
			|	%1.Изменения КАК ТаблицаИзменения
			|ГДЕ
			|	ТаблицаИзменения.Узел = &Узел";
	Иначе
		ТекстЗапроса = 
			"ВЫБРАТЬ Первые " + Строка(Количество) + 
			"	ТаблицаИзменения.НомерСообщения
			|ИЗ
			|	%1.Изменения КАК ТаблицаИзменения
			|ГДЕ
			|	ТаблицаИзменения.Узел = &Узел";	
	КонецЕсли;
	
	ЗапросИзмененияКонстанты.Текст = Renault_СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
		ТекстЗапроса,
		ПолноеИмяМетаданныхЭлемента);
	ЗапросИзмененияКонстанты.УстановитьПараметр("Узел", УзелОбмена);
	РезультатЗапроса = ЗапросИзмененияКонстанты.Выполнить();
	Если Не РезультатЗапроса.Пустой() Тогда
		МассивИзмененныхДанных.Добавить(Константы[ИмяМетаданныхЭлемента]);
	КонецЕсли;
			
КонецФункции

Функция ПолучитьИзмененныеДанныеСсылочногоТипа(УзелОбмена, МассивИзмененныхДанных, МетаданныеЭлемента, Количество)
	
	ИмяМетаданныхЭлемента = МетаданныеЭлемента.Имя;
	ПолноеИмяМетаданныхЭлемента = МетаданныеЭлемента.ПолноеИмя();
	
	ЗапросИзмененияДанных = Новый Запрос;
	
	Если Количество = 0 Тогда
		ТекстЗапроса = 
			"ВЫБРАТЬ
			|	ТаблицаИзменения.Ссылка
			|ИЗ
			|	%1.Изменения КАК ТаблицаИзменения
			|ГДЕ
			|	ТаблицаИзменения.Узел = &Узел";
	Иначе
		ТекстЗапроса = 
			"ВЫБРАТЬ Первые " + Строка(Количество) + 
			"	ТаблицаИзменения.Ссылка
			|ИЗ
			|	%1.Изменения КАК ТаблицаИзменения
			|ГДЕ
			|	ТаблицаИзменения.Узел = &Узел";	
	КонецЕсли;	
	
		
	ЗапросИзмененияДанных.Текст = Renault_СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
		ТекстЗапроса,
		ПолноеИмяМетаданныхЭлемента);
	ЗапросИзмененияДанных.УстановитьПараметр("Узел", УзелОбмена);
	РезультатЗапроса = ЗапросИзмененияДанных.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		МассивИзмененныхДанных.Добавить(Выборка.Ссылка); 
	КонецЦикла;
	
КонецФункции

// Определяет принадлежность объекта метаданных к общему типу "Регистр сведений".
//
// Параметры:
//  ОбъектМетаданных - ОбъектМетаданных - объект, для которого необходимо определить принадлежность к заданному типу.
// 
//  Возвращаемое значение:
//   Булево.
//
Функция ЭтоРегистрСведений(ОбъектМетаданных) 
	
	Возврат Метаданные.РегистрыСведений.Содержит(ОбъектМетаданных);
	
КонецФункции

// Определяет принадлежность объекта метаданных к общему типу "Константа".
//
// Параметры:
//  ОбъектМетаданных - ОбъектМетаданных - объект, для которого необходимо определить принадлежность к заданному типу.
// 
//  Возвращаемое значение:
//   Булево.
//
Функция ЭтоКонстанта(ОбъектМетаданных)
	
	Возврат Метаданные.Константы.Содержит(ОбъектМетаданных);
	
КонецФункции

