// Модуль документа РабочийЛист

////////////////////////////////////////////////////////////////////////////////
// ПЕРЕМЕННЫЕ ОБЪЕКТА

Перем Права Экспорт;				// Переменная объекта - ссылка на коллекцию прав, настроек и переменных окружения
Перем РезультатОбработки Экспорт;	// Переменная для накопления результатов проведения по модулям наборов записей
Перем ИмяРеквизитаКода Экспорт;     // Кэш права "РежимВыводаКодаВДокументах". Служит для настройки вывода кода/атрикула в ТЧ
Перем ОбработкаЗначенияСвойствОбъектов Экспорт; // Переменная для хранения значения свойств основания/объекта копирования
Перем СписокВидовКонтактов Экспорт;				// Список видов контактов
Перем СписокКомуПокупает Экспорт;				// Список назначения покупки
Перем СписокСКемПришел Экспорт;					// Список сопровождающих клиента
Перем СписокСроков Экспорт;						// Список сроков сделки
Перем СписокСтатусов Экспорт;					// Список статусов рабочего листа
Перем ВводИзАРМРесепшен;						// Переменная хранит флаг, был ли введен данный документ из АРМ Ресепшен
//Гэндальф+++
Перем РегистрацияЗвонковИКонтактов Экспорт;				// Переменная хранит структуру при вводе на основании из АРМ Ре
//Гэндальф---

//Бондаренко++ 20250816
Функция ЕстьНезакрытыеДокументы(Автомобиль,ДатаПоследнегоПоступления) Экспорт
	
	Флаг_ = Ложь; 
	
	СпСостояний = Новый СписокЗначений;
	СпСостояний.Добавить(Справочники.ВидыСостоянийЗаказНарядов.Отказ);
	СпСостояний.Добавить(Справочники.ВидыСостоянийЗаказНарядов.Закрыт);
	
	Запрос = Новый Запрос;
	
	Запрос.Текст = "ВЫБРАТЬ
	|	ЗаказНаряд.Проведен КАК ДокПроведен,
	|	ЗаказНаряд.Ссылка КАК Ссылка,
	|	ЗаказНаряд.Состояние КАК Состояние,
	|	ЗаказНаряд.Автомобиль КАК Автомобиль,
	|	ЗаказНаряд.Проведен КАК Проведен,
	|	ЗаказНаряд.Автомобиль.VIN КАК АвтомобильVIN
	|ИЗ
	|	Документ.ЗаказНаряд КАК ЗаказНаряд
	|ГДЕ
	|	ЗаказНаряд.Автомобиль = &Автомобиль
	|	И НЕ ЗаказНаряд.Состояние В (&СпСостояний)
	|	И ЗаказНаряд.Проведен
	|	И НЕ ЗаказНаряд.ВидРемонта.ГарантияЗавода
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	КомплектацияАвтомобиля.Проведен,
	|	КомплектацияАвтомобиля.Ссылка,
	|	КомплектацияАвтомобиля.Состояние,
	|	КомплектацияАвтомобиля.Автомобиль,
	|	КомплектацияАвтомобиля.Проведен,
	|	КомплектацияАвтомобиля.Автомобиль.VIN
	|ИЗ
	|	Документ.КомплектацияАвтомобиля КАК КомплектацияАвтомобиля
	|ГДЕ
	|	КомплектацияАвтомобиля.Автомобиль = &Автомобиль
	|	И НЕ КомплектацияАвтомобиля.Состояние В (&СпСостояний)
	|	И КомплектацияАвтомобиля.Проведен";
	
	Запрос.УстановитьПараметр("ДатаПоследнегоПоступления",ДатаПоследнегоПоступления);
	Запрос.УстановитьПараметр("Автомобиль",Автомобиль);
	Запрос.УстановитьПараметр("СпСостояний",СпСостояний);
	
	ТЗ = Запрос.Выполнить().Выгрузить();
	
	Если ТЗ.Количество() > 0 Тогда
		Флаг_ = Истина;
		Для каждого Стр Из ТЗ Цикл
			#Если Клиент Тогда
				СМГ_Сообщить("ОШИБКА! Есть незакрытый документ: "+Стр.Ссылка,СтатусСообщения.Важное); 
			#КонецЕсли
		КонецЦикла;
	КонецЕсли;
	
	Возврат Флаг_;
	
КонецФункции // ЕстьНезакрытыеДокументы(Автомобиль,ДатаПоследнегоПоступления)
//Бондаренко-- 20250816


////////////////////////////////////////////////////////////////////////////////
// ЭКСПОРТНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ ДОПОЛНИТЕЛЬНЫХ МЕТОДОВ ОБЪЕКТА

// Возвращает структуру обязательных / уникальных реквизитов документа
// Возвращаемая структура содержит строковые идентификаторы реквизитов или вложенные структуры для табличных частей
// Для реквизита значение структуры содержит число 1-Обязательный, 2-Уникальный, 3-Уникальный и обязательный
Функция ПолучитьОбязательныеРеквизиты() Экспорт
	
	// Обязательные реквизиты документа
	ОбязательныеРеквизиты=Новый Структура();
	
	//Бондаренко++ 20231116
	Если  stenquiryurn = ""  Тогда	
		//Бондаренко-- 20231116	
		
		//Бондаренко++ 20250826
		Если НЕ РольДоступна("ПолныеПрава") Тогда
			//Бондаренко-- 20250826
			
			//Бондаренко++ 20250816
			Если Не обЗначениеНеЗаполнено(ПрограммаКАСКО) Тогда
				Если НЕ ПрограммаКАСКО.КомиссионноеВознаграждениеНеПредусмотрено Тогда
					ОбязательныеРеквизиты.Вставить("КВКаско",1);
				КонецЕсли;
			КонецЕсли;
			Если Не обЗначениеНеЗаполнено(ПрограммаОсаго) Тогда
				Если НЕ ПрограммаОСАГО.КомиссионноеВознаграждениеНеПредусмотрено Тогда
					ОбязательныеРеквизиты.Вставить("КВОсаго",1);
				КонецЕсли;
			КонецЕсли;
			Если Не обЗначениеНеЗаполнено(ПрограммаСтрахованиеЖизни) Тогда
				Если НЕ ПрограммаСтрахованиеЖизни.КомиссионноеВознаграждениеНеПредусмотрено Тогда
					ОбязательныеРеквизиты.Вставить("КВСЖ",1);
				КонецЕсли;
			КонецЕсли;
			Если ВидОплаты = Перечисления.ВидыОплаты.Лизинг Тогда
				Если Не обЗначениеНеЗаполнено(ЛизинговаяПрограмма) Тогда
					Если НЕ ЛизинговаяПрограмма.КомиссионноеВознаграждениеНеПредусмотрено Тогда
						ОбязательныеРеквизиты.Вставить("КВКредит",1);
					КонецЕсли;
				КонецЕсли;
			КонецЕсли;	
			Если ВидОплаты = Перечисления.ВидыОплаты.Кредит Тогда
				Если Не обЗначениеНеЗаполнено(КредитнаяПрограмма) Тогда
					Если НЕ КредитнаяПрограмма.КомиссионноеВознаграждениеНеПредусмотрено Тогда
						ОбязательныеРеквизиты.Вставить("КВКредит",1);
					КонецЕсли;
				КонецЕсли;
			КонецЕсли;
			//Бондаренко-- 20250816
			
			//Бондаренко++ 20250826
		КонецЕсли; 
		//Бондаренко-- 20250826
		
		ОбязательныеРеквизиты.Вставить("ПредставлениеТелефона",1);
		ОбязательныеРеквизиты.Вставить("Контрагент",1);
		ОбязательныеРеквизиты.Вставить("Модель",1);
		
		ОбязательныеРеквизиты.Вставить("Автор",1);
		ОбязательныеРеквизиты.Вставить("ПодразделениеКомпании",1);
		ОбязательныеРеквизиты.Вставить("Организация",1);
		ОбязательныеРеквизиты.Вставить("Менеджер",1);
		
		ОбязательныеРеквизиты.Вставить("Пол",1);
		ОбязательныеРеквизиты.Вставить("ПредставлениеТелефона",1);
		ОбязательныеРеквизиты.Вставить("ВидКонтакта",1);
		ОбязательныеРеквизиты.Вставить("ВидОплаты",1);
		ОбязательныеРеквизиты.Вставить("Статус",1);
		
		ОбязательныеОпции=Новый Структура();
		ОбязательныеОпции.Вставить("Опция",      3);
		ОбязательныеОпции.Вставить("Количество", 1);
		ОбязательныеРеквизиты.Вставить("Опции",  ОбязательныеОпции);
		
		ОбязательныеВозражения=Новый Структура();
		ОбязательныеВозражения.Вставить("Возражение", 3);
		ОбязательныеРеквизиты.Вставить("Возражения",  ОбязательныеВозражения);	
		
		ОбязательныеПользователи=Новый Структура();
		ОбязательныеПользователи.Вставить("Пользователь",      3);
		ОбязательныеРеквизиты.Вставить("Пользователи",  ОбязательныеПользователи);	
		
		ОбязательныеДругиеВарианты=Новый Структура();
		Если НЕ ВыкупКомиссия тогда
			ОбязательныеДругиеВарианты.Вставить("Модель",      1);
			ОбязательныеРеквизиты.Вставить("ДругиеВарианты",  ОбязательныеДругиеВарианты);
		КонецЕсли;
		// +++++ Соколмоторс +++++
		ОбязательныеРодственники=Новый Структура();
		ОбязательныеРодственники.Вставить("СтепеньРодства",      1);
		ОбязательныеРодственники.Вставить("ФИО",      1);
		ОбязательныеРодственники.Вставить("Автомобиль",      1);
		ОбязательныеРодственники.Вставить("ГдеПроживает",      1);
		ОбязательныеРодственники.Вставить("ГдеРаботает",      1);
		ОбязательныеРодственники.Вставить("Телефон",      1);
		ОбязательныеРеквизиты.Вставить("Родственники",  ОбязательныеРодственники);
		// ----- Соколмоторс -----  	
		
		Если Статус = Справочники.СтатусыРабочегоЛиста.Интерес Или Статус = Справочники.СтатусыРабочегоЛиста.Сделка Или Статус = Справочники.СтатусыРабочегоЛиста.Продажа Тогда
			//Бондаренко++ 20240327
			Если ТрейдИн ИЛИ ТолькоВыкуп Тогда
				//Бондаренко-- 20240327		
				
				ОбязательныеРеквизиты.Вставить("АвтомобильТрейдИн", 1);
				ОбязательныеРеквизиты.Вставить("МодельТрейдИн", 1);
				ОбязательныеРеквизиты.Вставить("СобственникТрейдИн", 1);
				
				Если Не НетОбъявленияВInternet Тогда
					ОбязательныеРеквизиты.Вставить("СсылкаНаОбъявление", 1);
				КонецЕсли;  
				
			КонецЕсли;		
		КонецЕсли;
	КонецЕсли;
	
	// Бондаренко++ 20240307
	Если Не ЭтоНовый() И НЕ (РольДоступна("СМ_КредитныйСпециалист") Или РольДоступна("ПолныеПрава") Или
		РольДоступна("СМ_CallCenter") ИЛИ РольДоступна("СМ_АдминистраторТорговогоЗала") ИЛИ РольДоступна("СМ_РуководительОтделаПродаж") ) Тогда
	

		
		// Бондаренко++ 20240308
		ОбязательныеРеквизиты.Вставить("ГотовКВыгодномуПредложению",1);
		// Бондаренко-- 20240308
		
		ОбязательныеРеквизиты.Вставить("Альтернативы",1);
		ОбязательныеРеквизиты.Вставить("ГодВыпускаАльтернативы",1);
		ОбязательныеРеквизиты.Вставить("ГодПокупкиАльтернативы",1);
		Если Не обЗначениеНеЗаполнено(Альтернативы) Тогда
			Если Альтернативы <> Справочники.Модели.НЕТ Тогда
				ОбязательныеРеквизиты.Вставить("КомментарийАльтернативы",1);
			КонецЕсли;
		КонецЕсли;
		
		//Бондаренко++ 20240327
		ОбязательныеРеквизиты.Вставить("АвтомобильКлиентаМодель",1);
		//Бондаренко++ 20240329
		Если АвтомобильКлиентаМодель <> Справочники.Модели.НЕ_СМОГ_ВЫЯСНИТЬ Тогда
			//Бондаренко-- 20240329	
			ОбязательныеРеквизиты.Вставить("ГодВыпускаАвтомобиляКлиента",1);
			ОбязательныеРеквизиты.Вставить("ГодПокупкиАвтомобиляКлиента",1);
			//Бондаренко++ 20240329	
		КонецЕсли;	
		//Бондаренко-- 20240329
		//Бондаренко-- 20240327                                             
		
		//Бондаренко++ 20240329
		Если Не обЗначениеНеЗаполнено(АвтомобильКлиентаМодель) Тогда
			Если АвтомобильКлиентаМодель <> Справочники.Модели.НЕТ Тогда
				//Бондаренко++ 20240329
				Если АвтомобильКлиентаМодель <> Справочники.Модели.НЕ_СМОГ_ВЫЯСНИТЬ Тогда
					//Бондаренко++ 20240329	
					ОбязательныеРеквизиты.Вставить("КомментарийАвтомобиляКлиента",1);
					//Бондаренко-- 20240329	
				КонецЕсли;	
				//Бондаренко-- 20240329
			КонецЕсли;
		КонецЕсли;
		//Бондаренко-- 20240329		
		
		ОбязательныеРеквизиты.Вставить("ГдеПроживает",1);
		ОбязательныеРеквизиты.Вставить("СоставСемьи",1);
		ОбязательныеРеквизиты.Вставить("ВидДеятельности",1);
		ОбязательныеРеквизиты.Вставить("Возраст",1);
	КонецЕсли;
	// Бондаренко-- 20240307
	
	//Бондаренко++ 20250826
	Если НЕ РольДоступна("ПолныеПрава") Тогда
		//Бондаренко-- 20250826
		
		//Бондаренко++ 20250621
		// Обязательные поля таблицы ИныеСтраховыеПродукты
		ОбязательныеИныеСтраховыеПродукты=Новый Структура();
		ОбязательныеИныеСтраховыеПродукты.Вставить("ПрограммаСтрахования",3);
		ОбязательныеИныеСтраховыеПродукты.Вставить("СтраховаяКомпания",1);
		ОбязательныеИныеСтраховыеПродукты.Вставить("АгентПодразделение",1);
		
		ОбязательныеРеквизиты.Вставить("ИныеСтраховыеПродукты",ОбязательныеИныеСтраховыеПродукты);
		//Бондаренко-- 20250621 
		
		//Бондаренко++ 20250624
		Если КВКаско > 0 Тогда
			ОбязательныеРеквизиты.Вставить("СтраховаяКомпанияКАСКО",1);
			ОбязательныеРеквизиты.Вставить("АгентПодразделениеКАСКО",1);
		КонецЕсли;
		Если КВОсаго > 0 Тогда
			ОбязательныеРеквизиты.Вставить("СтраховаяКомпанияОСАГО",1);
			ОбязательныеРеквизиты.Вставить("АгентПодразделениеОСАГО",1);
		КонецЕсли;
		Если КВСЖ > 0 Тогда
			ОбязательныеРеквизиты.Вставить("СтраховаяКомпанияСЖ",1);
			ОбязательныеРеквизиты.Вставить("АгентПодразделениеСЖ",1);
		КонецЕсли;
		//Бондаренко-- 20250624
		
		//Бондаренко++ 20250729
		Если ТолькоВыкуп ИЛИ ТрейдИн Тогда
			ОбязательныеРеквизиты.Вставить("ВариантПриобретенияАвтоСПробегом",1);
			ОбязательныеРеквизиты.Вставить("ПрогнозируемаяЦенаПродажи",1);
			ОбязательныеРеквизиты.Вставить("ПрогнозСрокаПодготовкиАвтоВДнях",1);
			ОбязательныеРеквизиты.Вставить("ПрогнозСрокаПродажиАвтоВДнях",1);
			ОбязательныеРеквизиты.Вставить("ПрогнозСуммыРемонта",1);
			ОбязательныеРеквизиты.Вставить("ПрогнозСуммыМКЦ",1);
			ОбязательныеРеквизиты.Вставить("ПрогнозСуммыДетейлинга",1);
			ОбязательныеРеквизиты.Вставить("ФамилияПриемщика",1);
			ОбязательныеРеквизиты.Вставить("ФамилияРОС",1);
		КонецЕсли;
		//Бондаренко-- 20250729
		
		//Бондаренко++ 20250826	
	КонецЕсли;
	//Бондаренко-- 20250826
	
	Возврат ОбязательныеРеквизиты;
КонецФункции // ПолучитьОбязательныеРеквизиты()

// Проверяет корректность заполнения объекта.
// может управляться булевыми флагами выполняемых проверок Заполнение, Уникальность
// (могут быть и другие необязательные)
// Обычно выполняется универсальным обработчиком, но могут быть добавлены доп. проверки
//
// Параметры:
//  Ошибки       - строка, в случае некорректного заполнения содержит описанием возникших ошибок, 
//  ДопРеквизиты - структура, на вход может быть передана структура с дополнительными реквизитами для проверки,
//  Заполнение   - булево, флаг проверки, 
//  Уникальность - булево, флаг проверки.
//
// Возвращаемое значение:
//  Булево - Возвращает Истина если все заполнено корректно и Ложь иначе.
// 
Функция ПроверитьКорректность(Ошибки="", ДопРеквизиты=Неопределено, Заполнение=Истина, Уникальность=Истина) Экспорт
	Результат = дкПроверитьКорректность(ЭтотОбъект, Ошибки, ДопРеквизиты, Заполнение, Уникальность);
	Возврат Результат;	
КонецФункции // ПроверитьКорректность()

// Проверяет корректность заполнения табличных частей объекта.
// Возвращает Истина если все заполнено корректно и Ложь иначе.
// В случае некорректного заполнения формирует строку описанием возникших ошибок "Ошибки"
// На вход может быть передана структура ДопРеквизиты с дополнительными реквизитами для проверки
Функция ПроверитьЗаполненностьТЧ(Ошибки="", ДопРеквизиты=Неопределено) Экспорт
	//Документ считаем корректно заполненным, независимо от заполненности табличных частей
	Возврат Истина;
КонецФункции

// Функция проверяет, допустимо ли изменение объекта
//
// Параметры:
//  БлокироватьРеквизиты - структура, структура блокируемых на изменение реквизитов.
//
// Возвращаемое значение:
// Булево - Возвращает Истина, если изменения возможны, ложь иначе
//          Если изменения доступны частично, возвращает ложь и структуру блокируемых на изменение реквизитов.
//
Функция ДоступностьИзменения(БлокироватьРеквизиты=Неопределено) Экспорт
	// Здесь может быть прописано определение наличия ссылок, блокирующих изменение объекта
	Возврат Истина;
КонецФункции // ДоступностьИзменения()

// Возвращает список возможных хозяйственных операций документа
// Вовращаемое значение: 
//  СписокЗначений. 
//  Строка списка: Значение - имя предопределенного элемента; 
//				   Представление - красивое его представление
// 				   "Помеченная" строка - ХО по умолчанию.
Функция ПолучитьСписокХозОпераций() Экспорт
	СписокХозОпераций = Новый СписокЗначений;
	СписокХозОпераций.Добавить("РабочийЛист","Рабочий лист",Истина);
	
	Возврат СписокХозОпераций;
КонецФункции // ПолучитьСписокХозОпераций()

// Обработка изменения реквизитов документа
// Параметры
//  Имя			– Строка			– Имя реквизита документа с полным путем (например Тавары.Номенклатура).
//  ЭтаФорма	– Форма				– Ссылка на форму документа. Если значение неопределено, производится программная обработка реквизитов.
//  ТекСтрока	– СтрокаТабличнойЧасти – Ссылка на строку табличной части документа, реквизит которой обрабатывается.
//										 Имеет смысл только для табличных частей документов.
//  ДопПараметры– Стркутура			– Структура, содержащая дополнительные параметры обработки реквизита.
// Возвращаемое значение:
//   Булево   – Результат выполнения обработки.
Функция ОбработкаРеквизита(Имя,ТекСтрока=Неопределено,ЭтаФорма=Неопределено,ДопПараметры=Неопределено) Экспорт
	Если Имя="Контрагент" Тогда
		Если ТипЗнч(Контрагент)=Тип("СправочникСсылка.Контрагенты") Тогда
			Результат	= дкОбработкаРеквизита(ЭтотОбъект,Имя,ТекСтрока,ЭтаФорма,ДопПараметры);			
			Если НЕ обЗначениеНеЗаполнено(Контрагент) Тогда
				
				Если Контрагент.ФормаСобственности	= Перечисления.ФормыСобственности.ЮридическоеЛицо Тогда
					ЮридическоеЛицо	= Истина;
				Иначе
					ЮридическоеЛицо	= Ложь;
				КонецЕсли;
				
				Если ЮридическоеЛицо Тогда
					Пол	= Перечисления.ПолФизическихЛиц.НеУказан;
				ИначеЕсли НЕ обЗначениеНеЗаполнено(Контрагент.Пол) Тогда
					Пол	= Контрагент.Пол;
				КонецЕсли;
				
				Если обЗначениеНеЗаполнено(Реклама) Тогда
					Реклама	= Контрагент.РекламныйИсточник;
				КонецЕсли;
				
				//Бондаренко++ 20240618
				Если обЗначениеНеЗаполнено(ПредставлениеТелефона) Тогда
					ПредставлениеТелефона = СокрЛП(Контрагент.ОсновнойТелефон);
				КонецЕсли;	
				//Бондаренко-- 20240618
				
				//Бондаренко++ 20230809
				СМГ_ПересчетПоказателей(ЭтаФорма);
				//Бондаренко++ 20230809
				
			КонецЕсли;						
		КонецЕсли;        
		
		Возврат Результат;
		//Бондаренко++ 20231201	
	ИначеЕсли Имя="Кредит" Тогда	
		
		Если Кредит Тогда
			ВидОплаты = Перечисления.ВидыОплаты.Кредит;	
		Иначе
			ВидОплаты = Перечисления.ВидыОплаты.ПроизвольнаяОплата;	
		КонецЕсли;	
		
		Возврат Результат;
		//Бондаренко-- 20231201		
		
		//Бондаренко++ 20240319
	ИначеЕсли Имя="ГосПрограмма" Тогда	
		
		Если ГосПрограмма Тогда
			АгентПодразделение = "";
			Агент = "";
			СуммаКомпенсации = 0;               
			//Бондаренко++ 20240427
			ОбработкаРеквизита("Автомобиль");	
			//Бондаренко-- 20240427
		Иначе
			ОбработкаРеквизита("Автомобиль");	
		КонецЕсли;	
		
		Возврат Результат;
		//Бондаренко-- 20240319
		
		//Бондаренко++ 20240504
	ИначеЕсли Имя="ОплатаПоQRCode" Тогда	
		
		Если ОплатаПоQRCode Тогда
			Если НЕ обЗначениеНеЗаполнено(ВидАвтомобиля) Тогда
				Если ВидАвтомобиля = Перечисления.ВидАвтомобиля.Новый Тогда
					АгентПодразделение = "";
					Агент = "";
					СуммаКомпенсации = 0;               
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;	
		ОбработкаРеквизита("Автомобиль");	 		
		Возврат Результат;
		
	ИначеЕсли Имя="ИныеСтраховыеПродукты" Тогда
		
		Если ВидОплаты = Перечисления.ВидыОплаты.Кредит Тогда
			Если СкидкаСубсидияКредитФакт > 0 Тогда
				Если ЕстьСтраховыеПродуктыКромеКаскоИОсаго() Тогда
					Если НЕ обЗначениеНеЗаполнено(ВидАвтомобиля) Тогда
						Если ВидАвтомобиля = Перечисления.ВидАвтомобиля.Новый Тогда
							АгентПодразделение = "";
							Агент = "";
							СуммаКомпенсации = 0;               
						КонецЕсли;
					КонецЕсли;
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;             
		
		Результат = Истина;
		СМГ_ПересчетПоказателей(ЭтаФорма);
		Возврат Результат;
		//Бондаренко00 20240507	
		
		//Бондаренко-- 20240504
		
	ИначеЕсли Имя="ТипЦен" Тогда
		Результат = дкОбработкаРеквизита(ЭтотОбъект, Имя, ТекСтрока, ЭтаФорма, ДопПараметры);
		// Определение цены автомобиля
		Если ЗначениеЗаполнено(Автомобиль) Тогда
			ЦенаПродажи = обПолучитьЦену(ТипЦен,Новый Структура("Автомобиль, ВариантКомплектации", Автомобиль, Справочники.ВариантыКомплектации.ПустаяСсылка()),?(Ссылка.Пустая(),Дата,МоментВремени()),,ВалютаДокумента,КурсДокумента);
		Иначе
			ЦенаПродажи	= обПолучитьЦену(ТипЦен,Новый Структура("Автомобиль, ВариантКомплектации", Модель, ВариантКомплектации),?(Ссылка.Пустая(),Дата,МоментВремени()),,ВалютаДокумента,КурсДокумента);
		КонецЕсли;			
		СуммаПродажи	= ЦенаПродажи*КоличествоАвтомобилей;
		Результат		= ОбработкаРеквизита("СуммаПродажи",ТекСтрока,ЭтаФорма,ДопПараметры) И Результат;
		Возврат Результат;
		
	ИначеЕсли Имя="ТипЦенЗакупки" Тогда
		// Определение цены автомобиля
		Если ЗначениеЗаполнено(Автомобиль) Тогда
			ЦенаЗакупки = обПолучитьЦену(ТипЦенЗакупки,Новый Структура("Автомобиль, ВариантКомплектации", Автомобиль, Справочники.ВариантыКомплектации.ПустаяСсылка()),?(Ссылка.Пустая(),Дата,МоментВремени()),,ВалютаДокумента,КурсДокумента);
		Иначе
			ЦенаЗакупки	= обПолучитьЦену(ТипЦенЗакупки,Новый Структура("Автомобиль, ВариантКомплектации", Модель, ВариантКомплектации),?(Ссылка.Пустая(),Дата,МоментВремени()),,ВалютаДокумента,КурсДокумента);
		КонецЕсли;			
		СуммаЗакупки	= ЦенаЗакупки*КоличествоАвтомобилей;
		Результат		= ОбработкаРеквизита("СуммаЗакупки",ТекСтрока,ЭтаФорма,ДопПараметры);
		Возврат Результат;
		
		//Бондаренко++ 2023111	
	ИначеЕсли Имя="АвтомобильТрейдИн" Тогда
		
		Результат = Истина; 	
		
		Если Не обЗначениеНеЗаполнено(АвтомобильТрейдИн) Тогда
			
			Если Не обЗначениеНеЗаполнено(АвтомобильТрейдИн.ВариантКомплектации) Тогда
				ПредпочтенияПоКоробкеПередачTradeIn = АвтомобильТрейдИн.ВариантКомплектации.ТипКПП;
				ТрейдИнТипДвигателя = АвтомобильТрейдИн.ВариантКомплектации.ТипДвигателя;
				ТрейдИнМощностьДвигателяЛС = АвтомобильТрейдИн.ВариантКомплектации.ТипДвигателя.МощностьЛС;
				ТрейдИнОбъемДвигателя = АвтомобильТрейдИн.ВариантКомплектации.ТипДвигателя.ОбъемДвигателя;
				ТрейдИнТипКузова = АвтомобильТрейдИн.ВариантКомплектации.ТипКузова;
			Иначе	
				ПредпочтенияПоКоробкеПередачTradeIn = АвтомобильТрейдИн.ТипКПП;
				ТрейдИнТипДвигателя = АвтомобильТрейдИн.ТипДвигателя;
				ТрейдИнМощностьДвигателяЛС = АвтомобильТрейдИн.ТипДвигателя.МощностьЛС;
				ТрейдИнОбъемДвигателя = АвтомобильТрейдИн.ТипДвигателя.ОбъемДвигателя;
				ТрейдИнТипКузова = АвтомобильТрейдИн.ТипКузова;
			КонецЕсли;
			
			МодельТрейдИн = АвтомобильТрейдИн.Модель;
			ТрейдИнVIN = АвтомобильТрейдИн.VIN;
			ТрейдИнКоличествоВладельцев = АвтомобильТрейдИн.КоличествоВладельцевПоПТС;
			ГодВыпускаТрейдИн = АвтомобильТрейдИн.ГодВыпуска;
			ПробегТрейдИн = Справочники.Автомобили.ЧтениеЗначенияРегистраСведения(АвтомобильТрейдИн, Перечисления.ДополнительнаяИнформацияАвтомобилей.Пробег,ТекущаяДата());
			Если ГодВыпускаТрейдИн <> Дата(1,1,1) Тогда
				СрокЭксплуатации = Год(ТекущаяДата()) - Год(ГодВыпускаТрейдИн);
				Если СрокЭксплуатации > 0  Тогда
					СреднегодовойПробегЭксплуатируемого = ПробегТрейдИн / СрокЭксплуатации;
				КонецЕсли;
			КонецЕсли;                                                          
			ТрейдИнОригиналПТС = ОпределитьОригинальностьПТС(АвтомобильТрейдИн);
		Иначе
			ПредпочтенияПоКоробкеПередачTradeIn = "";
			ТрейдИнТипДвигателя = "";
			ТрейдИнМощностьДвигателяЛС = "";
			ТрейдИнОбъемДвигателя = "";
			ТрейдИнТипКузова = "";
			МодельТрейдИн = "";
			ТрейдИнVIN = "";
			ТрейдИнКоличествоВладельцев = "";
			ГодВыпускаТрейдИн = "";
			ПробегТрейдИн = "";
			СрокЭксплуатации = "";
			СреднегодовойПробегЭксплуатируемого = "";
			ТрейдИнОригиналПТС = Ложь;
		КонецЕсли;
		//Бондаренко-- 2023111		
		
	ИначеЕсли Имя="Автомобиль" Тогда
		Результат = Истина;
		Если ЗначениеЗаполнено(Автомобиль) Тогда
			Если ДопПараметры = Неопределено Тогда
				ДопПараметры = Новый Структура;
			КонецЕсли;
			ДопПараметры.Вставить("НеИзменятьЦенуАвтомобиля",Истина);
			
			// Семенихин 08.12.2024 +++++
			Если ТолькоБУ Тогда
				Модель = Справочники.Модели.АвтоСПробегом;
				ВариантКомплектации = Справочники.ВариантыКомплектации.ПустаяСсылка();
			//Иванченко 20260127 ++	
			//ИначеЕсли ВидАвтомобиля = Перечисления.ВидАвтомобиля.АвтомобильСПробегом Тогда
			//	Автомобиль = Ссылка.Автомобиль;
			//	Возврат Результат;
			//Иванченко 20260127 --	
			Иначе
				Модель = Автомобиль.Модель;
				ВариантКомплектации	= Автомобиль.ВариантКомплектации;
			КонецЕсли;
			// Семенихин 09.12.2024 -----
			
			Результат = ОбработкаРеквизита("Модель", ТекСтрока, ЭтаФорма, ДопПараметры);
			Результат = ОбработкаРеквизита("ВариантКомплектации", ТекСтрока, ЭтаФорма, ДопПараметры);
			
			ДопПараметры.Удалить("НеИзменятьЦенуАвтомобиля");
			Цвет				= Автомобиль.Цвет;
			Интерьер			= Автомобиль.ТипСалона; 
		КонецЕсли;
		
		// Определение цены автомобиля
		Если ЗначениеЗаполнено(Автомобиль) Тогда
			ЦенаЗакупки = обПолучитьЦену(ТипЦенЗакупки,Новый Структура("Автомобиль, ВариантКомплектации", Автомобиль, Справочники.ВариантыКомплектации.ПустаяСсылка()),?(Ссылка.Пустая(),Дата,МоментВремени()),,ВалютаДокумента,КурсДокумента);
			ЦенаПродажи = обПолучитьЦену(ТипЦен,Новый Структура("Автомобиль, ВариантКомплектации", Автомобиль, Справочники.ВариантыКомплектации.ПустаяСсылка()),?(Ссылка.Пустая(),Дата,МоментВремени()),,ВалютаДокумента,КурсДокумента);
		Иначе
			ЦенаЗакупки	= обПолучитьЦену(ТипЦенЗакупки,Новый Структура("Автомобиль, ВариантКомплектации", Модель, ВариантКомплектации),?(Ссылка.Пустая(),Дата,МоментВремени()),,ВалютаДокумента,КурсДокумента);
			ЦенаПродажи	= обПолучитьЦену(ТипЦен,Новый Структура("Автомобиль, ВариантКомплектации", Модель, ВариантКомплектации),?(Ссылка.Пустая(),Дата,МоментВремени()),,ВалютаДокумента,КурсДокумента);
		КонецЕсли;			
		СуммаЗакупки	= ЦенаЗакупки*КоличествоАвтомобилей;
		Результат		= ОбработкаРеквизита("СуммаЗакупки",ТекСтрока,ЭтаФорма,ДопПараметры);
		СуммаПродажи	= ЦенаПродажи*КоличествоАвтомобилей;
		Результат		= ОбработкаРеквизита("СуммаПродажи",ТекСтрока,ЭтаФорма,ДопПараметры) И Результат;
		
		//Бондаренко++ 20240123
		Если НЕ обЗначениеНеЗаполнено(Автомобиль) Тогда
			СМГ_ЗаполнитьДанныеПоАвтомобилюИКлиенту(Автомобиль,ЭтаФорма,Истина);
		КонецЕсли;
		//Бондаренко-- 20240123
		
		//Бондаренко++ 20231230
		ПоискатьДругиеАвто(Автомобиль);
		//Бондаренко-- 20231230
		
		//Бондаренко++ 20240507	
		Если ВидАвтомобиля = Перечисления.ВидАвтомобиля.Новый И Автомобиль.Модель.Марка = Справочники.Марка.LADA_ВАЗ Тогда
			ГосПрограмма=Истина;
			АгентПодразделение = "";
			Агент = "";
			СуммаКомпенсации = 0;
		Иначе
			СМГ_ЗаполнитьОчиститьАгента(СкладВладельцаАвто,ВладелецАвто);
		КонецЕсли;
		//Бондаренко-- 20240507
		
		#Если Клиент Тогда
			дкСообщитьОЗаметках(ЭтотОбъект,ЭтотОбъект["Автомобиль"],ЭтаФорма);
		#КонецЕсли
		
		Возврат Результат;
		
	ИначеЕсли Имя="СуммаЗакупки" Тогда
		Результат = Истина;
		Маржа	= СуммаПродажи-СуммаЗакупки;
		Возврат Результат;
		
	ИначеЕсли Имя="СуммаПродажи" Тогда
		Результат = Истина;
		Маржа	= СуммаПродажи-СуммаЗакупки;
		Возврат Результат;
		
	ИначеЕсли Имя="Модель" Тогда
		// Семенихин 09.12.2024 +++++
		Если Модель <> Справочники.Модели.АвтоСПробегом И ЗначениеЗаполнено(Автомобиль) И Автомобиль.Модель <> Модель Тогда
			Автомобиль = Справочники.Автомобили.ПустаяСсылка();
			Результат = ОбработкаРеквизита("Автомобиль", ТекСтрока, ЭтаФорма, ДопПараметры);
		КонецЕсли;
		// Семенихин 09.12.2024 -----
		
		Если Модель <> Справочники.Модели.АвтоСПробегом И ВариантКомплектации.Владелец <> Модель Тогда
			ВариантКомплектации	= Справочники.ВариантыКомплектации.ПустаяСсылка();
			Результат			= ОбработкаРеквизита("ВариантКомплектации",ТекСтрока,ЭтаФорма,ДопПараметры);
		КонецЕсли;
		
		// Определение цены автомобиля
		Если ЗначениеЗаполнено(Автомобиль) Тогда
			ЦенаЗакупки = обПолучитьЦену(ТипЦенЗакупки,Новый Структура("Автомобиль, ВариантКомплектации", Автомобиль, Справочники.ВариантыКомплектации.ПустаяСсылка()),?(Ссылка.Пустая(),Дата,МоментВремени()),,ВалютаДокумента,КурсДокумента);
			ЦенаПродажи = обПолучитьЦену(ТипЦен,Новый Структура("Автомобиль, ВариантКомплектации", Автомобиль, Справочники.ВариантыКомплектации.ПустаяСсылка()),?(Ссылка.Пустая(),Дата,МоментВремени()),,ВалютаДокумента,КурсДокумента);
		Иначе
			ЦенаЗакупки	= обПолучитьЦену(ТипЦенЗакупки,Новый Структура("Автомобиль, ВариантКомплектации", Модель, ВариантКомплектации),?(Ссылка.Пустая(),Дата,МоментВремени()),,ВалютаДокумента,КурсДокумента);
			ЦенаПродажи	= обПолучитьЦену(ТипЦен,Новый Структура("Автомобиль, ВариантКомплектации", Модель, ВариантКомплектации),?(Ссылка.Пустая(),Дата,МоментВремени()),,ВалютаДокумента,КурсДокумента);
		КонецЕсли;			
		СуммаЗакупки	= ЦенаЗакупки*КоличествоАвтомобилей;
		Результат		= ОбработкаРеквизита("СуммаЗакупки",ТекСтрока,ЭтаФорма,ДопПараметры);
		СуммаПродажи	= ЦенаПродажи*КоличествоАвтомобилей;
		Результат		= ОбработкаРеквизита("СуммаПродажи",ТекСтрока,ЭтаФорма,ДопПараметры) И Результат;		
		
		Возврат Результат;
		
	ИначеЕсли Имя="ВариантКомплектации" Тогда
		Результат	= Истина;
		
		Если Модель <> Справочники.Модели.АвтоСПробегом И Автомобиль.ВариантКомплектации<>ВариантКомплектации Тогда
			Автомобиль	= Справочники.Автомобили.ПустаяСсылка();
			Результат	= ОбработкаРеквизита("Автомобиль", ТекСтрока, ЭтаФорма, ДопПараметры);
		КонецЕсли;
		
		Если НЕ обЗначениеНеЗаполнено(ВариантКомплектации) Тогда
			Если Модель <> Справочники.Модели.АвтоСПробегом И ВариантКомплектации.Владелец <> Модель Тогда
				Модель		= ВариантКомплектации.Владелец;
				Результат	= ОбработкаРеквизита("Модель",ТекСтрока,ЭтаФорма,ДопПараметры) И Результат;
			КонецЕсли;
		КонецЕсли;
		
		// Определение цены автомобиля
		Если ЗначениеЗаполнено(Автомобиль) Тогда
			ЦенаЗакупки = обПолучитьЦену(ТипЦенЗакупки,Новый Структура("Автомобиль, ВариантКомплектации", Автомобиль, Справочники.ВариантыКомплектации.ПустаяСсылка()),?(Ссылка.Пустая(),Дата,МоментВремени()),,ВалютаДокумента,КурсДокумента);
			ЦенаПродажи = обПолучитьЦену(ТипЦен,Новый Структура("Автомобиль, ВариантКомплектации", Автомобиль, Справочники.ВариантыКомплектации.ПустаяСсылка()),?(Ссылка.Пустая(),Дата,МоментВремени()),,ВалютаДокумента,КурсДокумента);
		Иначе
			ЦенаЗакупки	= обПолучитьЦену(ТипЦенЗакупки,Новый Структура("Автомобиль, ВариантКомплектации", Модель, ВариантКомплектации),?(Ссылка.Пустая(),Дата,МоментВремени()),,ВалютаДокумента,КурсДокумента);
			ЦенаПродажи	= обПолучитьЦену(ТипЦен,Новый Структура("Автомобиль, ВариантКомплектации", Модель, ВариантКомплектации),?(Ссылка.Пустая(),Дата,МоментВремени()),,ВалютаДокумента,КурсДокумента);
		КонецЕсли;			
		СуммаЗакупки	= ЦенаЗакупки*КоличествоАвтомобилей;
		Результат		= ОбработкаРеквизита("СуммаЗакупки",ТекСтрока,ЭтаФорма,ДопПараметры) И Результат;
		СуммаПродажи	= ЦенаПродажи*КоличествоАвтомобилей;
		Результат		= ОбработкаРеквизита("СуммаПродажи",ТекСтрока,ЭтаФорма,ДопПараметры) И Результат;		
		
		Для Каждого СтрокаТЧ Из Опции Цикл
			Результат = ОбработкаРеквизита("Опции.Опция",СтрокаТЧ,ЭтаФорма,ДопПараметры) И Результат;
		КонецЦикла;
		
		Возврат Результат;
		
	ИначеЕсли Имя="КоличествоАвтомобилей" Тогда
		
		// Определение цены автомобиля
		Если ЗначениеЗаполнено(Автомобиль) Тогда
			ЦенаЗакупки = обПолучитьЦену(ТипЦенЗакупки,Новый Структура("Автомобиль, ВариантКомплектации", Автомобиль, Справочники.ВариантыКомплектации.ПустаяСсылка()),?(Ссылка.Пустая(),Дата,МоментВремени()),,ВалютаДокумента,КурсДокумента);
			ЦенаПродажи = обПолучитьЦену(ТипЦен,Новый Структура("Автомобиль, ВариантКомплектации", Автомобиль, Справочники.ВариантыКомплектации.ПустаяСсылка()),?(Ссылка.Пустая(),Дата,МоментВремени()),,ВалютаДокумента,КурсДокумента);
		Иначе
			ЦенаЗакупки	= обПолучитьЦену(ТипЦенЗакупки,Новый Структура("Автомобиль, ВариантКомплектации", Модель, ВариантКомплектации),?(Ссылка.Пустая(),Дата,МоментВремени()),,ВалютаДокумента,КурсДокумента);
			ЦенаПродажи	= обПолучитьЦену(ТипЦен,Новый Структура("Автомобиль, ВариантКомплектации", Модель, ВариантКомплектации),?(Ссылка.Пустая(),Дата,МоментВремени()),,ВалютаДокумента,КурсДокумента);
		КонецЕсли;			
		СуммаЗакупки	= ЦенаЗакупки*КоличествоАвтомобилей;
		Результат		= ОбработкаРеквизита("СуммаЗакупки",ТекСтрока,ЭтаФорма,ДопПараметры);
		СуммаПродажи	= ЦенаПродажи*КоличествоАвтомобилей;
		Результат		= ОбработкаРеквизита("СуммаПродажи",ТекСтрока,ЭтаФорма,ДопПараметры) И Результат;		
		Возврат Результат;
		
		// ОБРАБОТКА РЕКВИЗИТОВ ТАБЛИЧНОЙ ЧАСТИ "ДОПОЛНИТЕЛЬНОЕ ОБОРУДОВАНИЕ"
	ИначеЕсли Имя="Опции.Опция" Тогда
		Результат	= Истина;
		Если ЭтаФорма<>Неопределено Тогда
			Если НЕ обЗначениеНеЗаполнено(ТекСтрока.Опция) Тогда
				Если ЭтаФорма.ОборудованиеПроизводителя.НайтиПоЗначению(ТекСтрока.Опция)=Неопределено Тогда
					#Если Клиент Тогда
						Если ЭтаФорма<>Неопределено Тогда
							Сообщить("Опция <"+ТекСтрока.Опция+"> недопустима для данного варианта комплектации.");
						КонецЕсли; 
					#КонецЕсли
					ТекСтрока.Опция=Неопределено;
					Возврат ОбработкаРеквизита("Опции.Опция",ТекСтрока,ЭтаФорма,ДопПараметры);
				КонецЕсли; 
			КонецЕсли; 
		КонецЕсли; 
		
		// проверим а не набор ли у нас...
		Если НЕ ТекСтрока.Опция.ПризнакНабора Тогда
			// установим количество
			Если ТекСтрока.Количество=0 Тогда ТекСтрока.Количество=1 КонецЕсли;
			// Заполним ставку НДС
			ОсвобожденОтНДС=ПодразделениеКомпании.ОсвобожденОтНДС ИЛИ Организация.ОсвобожденОтНДС;
			Если ОсвобожденОтНДС Тогда
				ТекСтрока.СтавкаНДС=Справочники.СтавкиНДС.БезНДС;
			Иначе
				ТекСтрока.СтавкаНДС=Справочники.СтавкиНДС.ОсновнаяСтавкаНДС;
			КонецЕсли;
			// попытаемся получить цену
			ТекСтрока.Цена=обПолучитьЦену(ТипЦен,Новый Структура("Автомобиль,ВариантКомплектации,Опция",Модель,ВариантКомплектации,ТекСтрока.Опция),?(Ссылка.Пустая(),Дата,МоментВремени()),,ВалютаДокумента,КурсДокумента);
			Результат = ОбработкаРеквизита("Опции.Цена",ТекСтрока,ЭтаФорма,ДопПараметры);
		Иначе
			// имеем дело с набором, разложим его...
			Набор=ТекСтрока.Опция.СоставНабора;
			КоличествоНабора=ТекСтрока.Количество;
			Если КоличествоНабора=0 Тогда
				КоличествоНабора=1;
			КонецЕсли;
			// удалим строку из табличной части
			Опции.Удалить(ТекСтрока);
			// теперь будем рекурсивно добавлять состав набора
			Для Каждого ОборудованиеИзНабора Из Набор Цикл
				СтрокаТЧ=Опции.Найти(ОборудованиеИзНабора.Опция,"Опция");
				Если СтрокаТЧ=Неопределено Тогда
					СтрокаТЧ=Опции.Добавить();
					СтрокаТЧ.Опция=ОборудованиеИзНабора.Опция;
					СтрокаТЧ.Количество=ОборудованиеИзНабора.Количество*КоличествоНабора;
					ОбработкаРеквизита("Опции.Опция",СтрокаТЧ,ЭтаФорма,ДопПараметры);
					Если обЗначениеНеЗаполнено(СтрокаТЧ.Опция) Тогда
						Опции.Удалить(СтрокаТЧ);
					КонецЕсли; 
				Иначе
					СтрокаТЧ.Количество=СтрокаТЧ.Количество+(ОборудованиеИзНабора.Количество*КоличествоНабора);
					ОбработкаРеквизита("Опции.Количество",СтрокаТЧ,ЭтаФорма,ДопПараметры);
				КонецЕсли; 
			КонецЦикла;
		КонецЕсли;
		Возврат Результат;
		
	ИначеЕсли Имя="Опции.Количество" Тогда
		Результат=ОбработкаРеквизита("Опции.Цена",ТекСтрока,ЭтаФорма,ДопПараметры);
		
	ИначеЕсли Имя="Опции.Цена" Тогда
		Результат	= Истина;
		ТекСтрока.Сумма=ТекСтрока.Цена*ТекСтрока.Количество;
		Результат=ОбработкаРеквизита("Опции.СтавкаНДС",ТекСтрока,ЭтаФорма,ДопПараметры);
		Возврат Результат;
		
	ИначеЕсли Имя="Опции.Сумма" Тогда
		ТекСтрока.Цена=?(ТекСтрока.Количество=0,0,ТекСтрока.Сумма/ТекСтрока.Количество);
		Результат=ОбработкаРеквизита("Опции.СтавкаНДС",ТекСтрока,ЭтаФорма,ДопПараметры);
		Возврат Результат;
		
	ИначеЕсли Имя="Опции.СтавкаНДС" Тогда
		СуммаВсегоБезСкидки=ТекСтрока.Сумма;
		// Определим каким образом у нас вычисляется НДС
		ЦенаВключаетНДС=(обЗначениеНеЗаполнено(ТипЦен) ИЛИ ТипЦен.ЦенаВключаетНДС);
		// Расчет НДС
		Если ЦенаВключаетНДС Тогда
			ТекСтрока.СуммаНДС=Окр((СуммаВсегоБезСкидки*ТекСтрока.СтавкаНДС.Ставка)/(100+ТекСтрока.СтавкаНДС.Ставка),2);
		Иначе
			ТекСтрока.СуммаНДС=Окр(СуммаВсегоБезСкидки*ТекСтрока.СтавкаНДС.Ставка/100,2);
		КонецЕсли;
		// В любом случаее идем в секцию "СуммаНДС", т.к. в ней будем произведен расчет суммы всего.
		Результат=ЭтотОбъект.ОбработкаРеквизита("Опции.СуммаНДС",ТекСтрока,ЭтаФорма,ДопПараметры);
		Возврат Результат;
		
	ИначеЕсли Имя="Опции.СуммаНДС" Тогда
		Результат	= Истина;
		СуммаВсегоБезСкидки=ТекСтрока.Сумма;
		// Определим каким образом у нас вычисляется НДС
		ЦенаВключаетНДС=(обЗначениеНеЗаполнено(ТипЦен) ИЛИ ТипЦен.ЦенаВключаетНДС);
		Если ЦенаВключаетНДС Тогда
			ТекСтрока.СуммаВсего=СуммаВсегоБезСкидки;
		Иначе
			ТекСтрока.СуммаВсего=СуммаВсегоБезСкидки+ТекСтрока.СуммаНДС;
		КонецЕсли;
		Возврат Результат;
		
	ИначеЕсли Имя="Опции.СуммаВсего" Тогда
		Результат	= истина;
		// Определим включают ли в себя НДС цены документа
		ЦенаВключаетНДС=(обЗначениеНеЗаполнено(ТипЦен) ИЛИ ТипЦен.ЦенаВключаетНДС);
		// Рассчитаем значение реквизита "Сумма". Если расчет НДС не ведется, то ЦенаВключаетНДС будет всегда Истина. 
		Если ЦенаВключаетНДС Тогда
			ТекСтрока.Сумма=Окр(ТекСтрока.СуммаВсего/(1/100),2);
		Иначе
			Сумма=ТекСтрока.СуммаВсего*100/(100+ТекСтрока.СтавкаНДС.Ставка);
			ТекСтрока.Сумма=Окр(Сумма/(1/100),2);
		КонецЕсли;
		// Пересчитываем цену.
		ТекСтрока.Цена=?(ТекСтрока.Количество=0,0,ТекСтрока.Сумма/ТекСтрока.Количество);
		// Рассчитываем новую сумму НДС. 		
		СуммаВсегоБезСкидки=ТекСтрока.Сумма;
		Если ЦенаВключаетНДС Тогда			
			ТекСтрока.СуммаНДС=Окр((СуммаВсегоБезСкидки*ТекСтрока.СтавкаНДС.Ставка)/(100+ТекСтрока.СтавкаНДС.Ставка),2);
		Иначе
			ТекСтрока.СуммаНДС=Окр(СуммаВсегоБезСкидки*ТекСтрока.СтавкаНДС.Ставка/100,2);
		КонецЕсли;
		Возврат Результат;
	ИначеЕсли Имя="Менеджер" Тогда
		Результат	= Истина;
		РуководительМенеджера = Справочники.Сотрудники.ПустаяСсылка();	
		Если НЕ обЗначениеНеЗаполнено(Менеджер) И НЕ обЗначениеНеЗаполнено(Менеджер.Подразделение) Тогда
			НазначениеПодразделения	= ПланыВидовХарактеристик.НазначенияСвойствОбъектов.Справочник_ПодразделенияКомпании;
			СвойствоРуководитель	= зфЗащищенныеФункцииСервер.РабочийЛистНайтиСоздатьСвойство(НазначениеПодразделения, "Руководитель");	
			РуководительМенеджера	= зфЗащищенныеФункцииСервер.РабочийЛистПолучитьЗначениеСвойстваОбъекта(Менеджер.Подразделение, СвойствоРуководитель);
			
			// Семенихин 29.11.2021 +++++
			РуководительМенеджера = Менеджер.Подразделение.РуководительОП;
			// Семенихин 29.11.2021 -----
		КонецЕсли;
		Возврат Результат;
		//Бондаренко++ 20230907
	ИначеЕсли Имя="ДоговорВзаиморасчетов" Тогда
		Результат = Истина;
		СМГ_ПересчетПоказателей(ЭтаФорма);
		//Бондаренко-- 20230907
		//Бондаренко++ 20230828
	ИначеЕсли Имя="РРЦ" Тогда
		Результат = Истина;
		СМГ_ПересчетПоказателей(ЭтаФорма);
		Возврат Результат;
	ИначеЕсли Имя="СкидкаТрейдИн" Тогда
		Результат = Истина;
		СМГ_ПересчетПоказателей(ЭтаФорма);
		Возврат Результат;
	ИначеЕсли Имя="СкидкаТрейдИнФакт" Тогда
		Результат = Истина;
		СМГ_ПересчетПоказателей(ЭтаФорма);
		Возврат Результат;       
		//Бондаренко++ 20250207
	ИначеЕсли Имя="СкидкаТрейдИн2" Тогда
		Результат = Истина;
		СМГ_ПересчетПоказателей(ЭтаФорма);
		Возврат Результат;
	ИначеЕсли Имя="СкидкаТрейдИн2Факт" Тогда
		Результат = Истина;
		СМГ_ПересчетПоказателей(ЭтаФорма);
		Возврат Результат;
		//Бондаренко-- 20250207		
	ИначеЕсли Имя="СкидкаСубсидияКредит" Тогда
		Результат = Истина;
		СМГ_ПересчетПоказателей(ЭтаФорма);
		Возврат Результат;
		
		//Бондаренко++ 20240507	
	ИначеЕсли Имя="СуммаСтрахованиеЖизни" Тогда
		Если ВидОплаты = Перечисления.ВидыОплаты.Кредит Тогда
			Если СкидкаСубсидияКредитФакт > 0 Тогда
				Если ЕстьСтраховыеПродуктыКромеКаскоИОсаго() Тогда
					Если НЕ обЗначениеНеЗаполнено(ВидАвтомобиля) Тогда
						Если ВидАвтомобиля = Перечисления.ВидАвтомобиля.Новый Тогда
							АгентПодразделение = "";
							Агент = "";
							СуммаКомпенсации = 0;               
						КонецЕсли;
					КонецЕсли;
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
		
		//Бондаренко++ 20250719
		Если НЕ обЗначениеНеЗаполнено(ПрограммаСтрахованиеЖизни) Тогда
			Если КВСЖ = 0 Тогда
				КВСЖ = СуммаСтрахованиеЖизни * ПрограммаСтрахованиеЖизни.Вознаграждение / 100;
			КонецЕсли;
		КонецЕсли;
		//Бондаренко-- 20250719
		
		Результат = Истина;
		СМГ_ПересчетПоказателей(ЭтаФорма);
		Возврат Результат;
		
	ИначеЕсли Имя="СкидкаСубсидияКредитФакт" Тогда
		
		Если ВидОплаты = Перечисления.ВидыОплаты.Кредит Тогда
			Если СкидкаСубсидияКредитФакт > 0 Тогда
				Если ЕстьСтраховыеПродуктыКромеКаскоИОсаго() Тогда
					Если НЕ обЗначениеНеЗаполнено(ВидАвтомобиля) Тогда
						Если ВидАвтомобиля = Перечисления.ВидАвтомобиля.Новый Тогда
							АгентПодразделение = "";
							Агент = "";
							СуммаКомпенсации = 0;               
						КонецЕсли;
					КонецЕсли;
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;             
		//Бондаренко-- 20240507
		
		Результат = Истина;
		СМГ_ПересчетПоказателей(ЭтаФорма);
		Возврат Результат;
	ИначеЕсли Имя="СкидкаПоПрограммамЛояльности" Тогда
		Результат = Истина;
		СМГ_ПересчетПоказателей(ЭтаФорма);
		Возврат Результат;
	ИначеЕсли Имя="СкидкаРозничная" Тогда
		Результат = Истина;
		СМГ_ПересчетПоказателей(ЭтаФорма);
		Возврат Результат;
	ИначеЕсли Имя="СкидкаАвтоЦентра" Тогда
		Результат = Истина;
		СМГ_ПересчетПоказателей(ЭтаФорма);
		Возврат Результат;
		//Бондаренко++ 20240904	
	ИначеЕсли Имя="СкидкаДополнительная" Тогда
		Результат = Истина;
		СМГ_ПересчетПоказателей(ЭтаФорма);
		Возврат Результат;	
		//Бондаренко-- 20240904		
	ИначеЕсли Имя="ПредоплатаТО" Тогда
		Результат = Истина;
		СМГ_ПересчетПоказателей(ЭтаФорма);
		Возврат Результат;
	ИначеЕсли Имя="СтоимостьДО" Тогда
		Результат = Истина;
		СМГ_ПересчетПоказателей(ЭтаФорма);
		Возврат Результат;
	ИначеЕсли Имя="СтоимостьДОФакт" Тогда
		Результат = Истина;
		СМГ_ПересчетПоказателей(ЭтаФорма);
		Возврат Результат;
	ИначеЕсли Имя="ПервоначальныйВзнос" Тогда
		//Бондаренко++ 20240507
		Если ВидОплаты = Перечисления.ВидыОплаты.Кредит Тогда
			Если СуммаПредоплаты = 0 Тогда
				Если НЕ обЗначениеНеЗаполнено(ВидАвтомобиля) Тогда
					Если ВидАвтомобиля = Перечисления.ВидАвтомобиля.Новый Тогда
						АгентПодразделение = "";
						Агент = "";
						СуммаКомпенсации = 0;               
					КонецЕсли;
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;             
		//Бондаренко-- 20240507
		Результат = Истина;
		СМГ_ПересчетПоказателей(ЭтаФорма);
		Возврат Результат;
	ИначеЕсли Имя="СебестоимостьДО" Тогда
		Результат = Истина;
		СМГ_ПересчетПоказателей(ЭтаФорма);
		Возврат Результат;                
	ИначеЕсли Имя="ВидОплаты" Тогда
		//Бондаренко++ 20240805
		Если ВидОплаты = Перечисления.ВидыОплаты.Кредит Тогда
			Кредит = Истина;
			Если СуммаПредоплаты = 0 Тогда
				Если НЕ обЗначениеНеЗаполнено(ВидАвтомобиля) Тогда
					Если ВидАвтомобиля = Перечисления.ВидАвтомобиля.Новый Тогда
						АгентПодразделение = "";
						Агент = "";
						СуммаКомпенсации = 0;               
					КонецЕсли;
				КонецЕсли;
			КонецЕсли;
		Иначе
			Кредит = Ложь;
		КонецЕсли;             
		//Бондаренко-- 20240805
		Результат = Истина;
		СМГ_ПересчетПоказателей(ЭтаФорма);
		//Бондаренко++ 20240301
		Если ВидОплаты <> Перечисления.ВидыОплаты.ПроизвольнаяОплата Тогда
			Если НЕ РеализацияПоОдномуДоговору Тогда
				РеализацияПоОдномуДоговору = Истина;
			КонецЕсли;
		КонецЕсли;
		//Бондаренко-- 20240301
		Возврат Результат;
	ИначеЕсли Имя="БанкЛК" Тогда
		Результат = Истина;
		СМГ_ПересчетПоказателей(ЭтаФорма);
		Возврат Результат;
	ИначеЕсли Имя = "Партнер" Тогда
		//Бондаренко++ 20250805
		Если Не обЗначениеНеЗаполнено(Партнер) Тогда
			Если НЕ обЗначениеНеЗаполнено(АгентПодразделениеКредитЛизинг) Тогда 
				ДоговорБанкЛК = НайтиСоздатьДоговорПродажаПД(АгентПодразделениеКредитЛизинг,Партнер.БанкКонтрагент);
			КонецЕсли;
			БанкЛК = Партнер.БанкКонтрагент;
		Иначе
			БанкЛК = "";
		КонецЕсли;
		//Бондаренко-- 20250805	
		Результат = Истина;
		СМГ_ПересчетПоказателей(ЭтаФорма);
		Возврат Результат;  
		//Бондаренко-- 20241120		
	ИначеЕсли Имя="КомпенсацияТрейдИНРетроспективная" Тогда
		Результат = Истина;
		СМГ_ПересчетПоказателей(ЭтаФорма);
		Возврат Результат;
	ИначеЕсли Имя="КомпенсацияСубсидияКредитРетроспективная" Тогда
		Результат = Истина;
		СМГ_ПересчетПоказателей(ЭтаФорма);
		Возврат Результат;
	ИначеЕсли Имя="КомпенсацияПоПрограммамЛояльностиРетроспективная" Тогда
		Результат = Истина;
		СМГ_ПересчетПоказателей(ЭтаФорма);
		Возврат Результат;
	ИначеЕсли Имя="КомпенсацияРозничнаяРетроспективная" Тогда
		Результат = Истина;
		СМГ_ПересчетПоказателей(ЭтаФорма);
		Возврат Результат;
	ИначеЕсли Имя="КомпенсацияТрейдИНВИнВойсеСледующегоАвтомобиля" Тогда
		Результат = Истина;
		СМГ_ПересчетПоказателей(ЭтаФорма);
		Возврат Результат;
		//Бондаренко++ 20250204	
	ИначеЕсли Имя="КомпенсацияТрейдИН2ВИнВойсеСледующегоАвтомобиля" Тогда
		Результат = Истина;
		СМГ_ПересчетПоказателей(ЭтаФорма);
		Возврат Результат;
		//Бондаренко-- 20250204		
	ИначеЕсли Имя="КомпенсацияСубсидияКредитВИнВойсеСледующегоАвтомобиля" Тогда
		Результат = Истина;
		СМГ_ПересчетПоказателей(ЭтаФорма);
		Возврат Результат;
	ИначеЕсли Имя="КомпенсацияПоПрограммамЛояльностиВИнВойсеСледующегоАвтомобиля" Тогда
		Результат = Истина;
		СМГ_ПересчетПоказателей(ЭтаФорма);
		Возврат Результат;
	ИначеЕсли Имя="КомпенсацияРозничнаяВИнВойсеСледующегоАвтомобиля" Тогда
		Результат = Истина;
		СМГ_ПересчетПоказателей(ЭтаФорма);
		Возврат Результат;
		//Бондаренко++ 20230824	
		//Бондаренко++ 20240307	
	ИначеЕсли Имя = "Альтернативы" Тогда	
		Если Альтернативы = Справочники.Модели.НЕОПРЕДЕЛЕНО Тогда
			Альтернативы = Справочники.Модели.НЕТ;
		КонецЕсли;
		Если Альтернативы = Справочники.Модели.НЕТ Тогда                     
			//Бондаренко++ 20240308
			ГотовКВыгодномуПредложению = Перечисления.ВариантыОтветов.Нет;
			//Бондаренко-- 20240308
			ГодВыпускаАльтернативы = Перечисления.ВариантыОтветов.Нет;	
			ГодПокупкиАльтернативы = Перечисления.ВариантыОтветов.Нет;	
		Иначе
			ГодВыпускаАльтернативы = Дата(1,1,1);	
			ГодПокупкиАльтернативы = Дата(1,1,1);	
		КонецЕсли;
	ИначеЕсли Имя = "ГодВыпускаАльтернативы" Тогда	
		Если ГодВыпускаАльтернативы = Перечисления.ВариантыОтветов.Нет Тогда
			//Бондаренко++ 20240308
			ГотовКВыгодномуПредложению = Перечисления.ВариантыОтветов.Нет;
			//Бондаренко-- 20240308
			Альтернативы = Справочники.Модели.НЕТ;	
			ГодПокупкиАльтернативы = Перечисления.ВариантыОтветов.Нет;	
		КонецЕсли;
	ИначеЕсли Имя = "ГодПокупкиАльтернативы" Тогда	
		Если ГодПокупкиАльтернативы = Перечисления.ВариантыОтветов.Нет Тогда
			//Бондаренко++ 20240308
			ГотовКВыгодномуПредложению = Перечисления.ВариантыОтветов.Нет;
			//Бондаренко-- 20240308
			Альтернативы = Справочники.Модели.НЕТ;	
			ГодВыпускаАльтернативы = Перечисления.ВариантыОтветов.Нет;		
		КонецЕсли;
		//Бондаренко-- 20240307
		//Бондаренко++ 20240327	
	ИначеЕсли Имя = "АвтомобильКлиентаМодель" Тогда	
		Если АвтомобильКлиентаМодель = Справочники.Модели.НЕОПРЕДЕЛЕНО Тогда
			АвтомобильКлиентаМодель = Справочники.Модели.НЕТ;
		КонецЕсли;
		Если АвтомобильКлиентаМодель = Справочники.Модели.НЕТ Тогда                     
			ГодВыпускаАвтомобиляКлиента = Перечисления.ВариантыОтветов.Нет;	
			ГодПокупкиАвтомобиляКлиента = Перечисления.ВариантыОтветов.Нет;	
		Иначе
			ГодВыпускаАвтомобиляКлиента = Дата(1,1,1);	
			ГодПокупкиАвтомобиляКлиента = Дата(1,1,1);	
		КонецЕсли;
	ИначеЕсли Имя = "ГодВыпускаАвтомобиляКлиента" Тогда	
		Если ГодВыпускаАвтомобиляКлиента = Перечисления.ВариантыОтветов.Нет Тогда
			АвтомобильКлиентаМодель = Справочники.Модели.НЕТ;	
			ГодПокупкиАвтомобиляКлиента = Перечисления.ВариантыОтветов.Нет;	
		КонецЕсли;
	ИначеЕсли Имя = "ГодПокупкиАвтомобиляКлиента" Тогда	
		Если ГодПокупкиАвтомобиляКлиента = Перечисления.ВариантыОтветов.Нет Тогда
			АвтомобильКлиентаМодель = Справочники.Модели.НЕТ;	
			ГодВыпускаАвтомобиляКлиента = Перечисления.ВариантыОтветов.Нет;		
		КонецЕсли;
		//Бондаренко-- 20240327
		//Бондаренко++ 2024114
	ИначеЕсли Имя = "МаркетинговаяПрограммаСкидкаТрейдИн" Тогда
		Если Не обЗначениеНеЗаполнено(Автомобиль) Тогда    
			СтруктураПоказателей = ПолучитьСкидкуИБонусТрейдИн(Автомобиль.Модель,Автомобиль.ВариантКомплектации,МаркетинговаяПрограммаСкидкаТрейдИн);
			Если ТипЗНЧ(СтруктураПоказателей) = Тип("Структура") Тогда
				СкидкаТрейдИнФакт_ = СтруктураПоказателей.РазмерСкидки;
				Если СкидкаТрейдИнФакт <> СкидкаТрейдИнФакт_ Тогда
					СкидкаТрейдИнФакт = СкидкаТрейдИнФакт_; 
					//Бондаренко++ 20241127
					ОбработкаРеквизита("СкидкаТрейдИнФакт");
					//Бондаренко-- 20241127
				КонецЕсли;
				КомпенсацияТрейдИНВИнВойсеСледующегоАвтомобиля_ = СтруктураПоказателей.РазмерБонуса;
				Если КомпенсацияТрейдИНВИнВойсеСледующегоАвтомобиля <> КомпенсацияТрейдИНВИнВойсеСледующегоАвтомобиля_ Тогда
					КомпенсацияТрейдИНВИнВойсеСледующегоАвтомобиля = КомпенсацияТрейдИНВИнВойсеСледующегоАвтомобиля_;
					//Бондаренко++ 20241127
					ОбработкаРеквизита("КомпенсацияТрейдИНВИнВойсеСледующегоАвтомобиля");
					//Бондаренко-- 20241127
				КонецЕсли;
				//Бондаренко+++ 20250606
				КомпенсацияТрейдИНРетроспективная_ = СтруктураПоказателей.РазмерБонусаРетро;
				Если КомпенсацияТрейдИНРетроспективная <> КомпенсацияТрейдИНРетроспективная_ Тогда
					КомпенсацияТрейдИНРетроспективная = КомпенсацияТрейдИНРетроспективная_;
					ОбработкаРеквизита("КомпенсацияТрейдИНРетроспективная");
				КонецЕсли;
				//Бондаренко--- 20250606
			КонецЕсли;
		КонецЕсли;
		
		//Бондаренко++ 20250204
	ИначеЕсли Имя = "МаркетинговаяПрограммаСкидкаТрейдИн2" Тогда
		Если Не обЗначениеНеЗаполнено(Автомобиль) Тогда    
			СтруктураПоказателей = ПолучитьСкидкуИБонусТрейдИн(Автомобиль.Модель,Автомобиль.ВариантКомплектации,МаркетинговаяПрограммаСкидкаТрейдИн2);
			Если ТипЗНЧ(СтруктураПоказателей) = Тип("Структура") Тогда
				СкидкаТрейдИнФакт_ = СтруктураПоказателей.РазмерСкидки;
				Если СкидкаТрейдИн2Факт <> СкидкаТрейдИнФакт_ Тогда
					СкидкаТрейдИн2Факт = СкидкаТрейдИнФакт_; 
					ОбработкаРеквизита("СкидкаТрейдИн2Факт");
				КонецЕсли;
				КомпенсацияТрейдИНВИнВойсеСледующегоАвтомобиля_ = СтруктураПоказателей.РазмерБонуса;
				Если КомпенсацияТрейдИН2ВИнВойсеСледующегоАвтомобиля <> КомпенсацияТрейдИНВИнВойсеСледующегоАвтомобиля_ Тогда
					КомпенсацияТрейдИН2ВИнВойсеСледующегоАвтомобиля = КомпенсацияТрейдИНВИнВойсеСледующегоАвтомобиля_;
					ОбработкаРеквизита("КомпенсацияТрейдИН2ВИнВойсеСледующегоАвтомобиля");
				КонецЕсли;
				//Бондаренко+++ 20250606
				КомпенсацияТрейдИН2Ретроспективная_ = СтруктураПоказателей.РазмерБонусаРетро;
				Если КомпенсацияТрейдИН2Ретроспективная <> КомпенсацияТрейдИН2Ретроспективная_ Тогда
					КомпенсацияТрейдИН2Ретроспективная = КомпенсацияТрейдИН2Ретроспективная_;
					ОбработкаРеквизита("КомпенсацияТрейдИН2Ретроспективная");
				КонецЕсли;
				//Бондаренко--- 20250606
			КонецЕсли;
		КонецЕсли;
		//Бондаренко++ 20250204
		
	ИначеЕсли Имя = "МаркетинговаяПрограммаСкидкаСубсидияКредит" Тогда
		Если Не обЗначениеНеЗаполнено(Автомобиль) Тогда    
			СтруктураПоказателей = ПолучитьСкидкуИБонусТрейдИн(Автомобиль.Модель,Автомобиль.ВариантКомплектации,МаркетинговаяПрограммаСкидкаСубсидияКредит);
			Если ТипЗНЧ(СтруктураПоказателей) = Тип("Структура") Тогда
				СкидкаСубсидияКредитФакт_ = СтруктураПоказателей.РазмерСкидки;
				Если СкидкаСубсидияКредитФакт <> СкидкаСубсидияКредитФакт_ Тогда
					СкидкаСубсидияКредитФакт = СкидкаСубсидияКредитФакт_;
					//Бондаренко++ 20241127
					ОбработкаРеквизита("СкидкаСубсидияКредитФакт");
					//Бондаренко-- 20241127
				КонецЕсли;
				КомпенсацияСубсидияКредитВИнВойсеСледующегоАвтомобиля_ = СтруктураПоказателей.РазмерБонуса;
				Если КомпенсацияСубсидияКредитВИнВойсеСледующегоАвтомобиля <> КомпенсацияСубсидияКредитВИнВойсеСледующегоАвтомобиля_ Тогда
					КомпенсацияСубсидияКредитВИнВойсеСледующегоАвтомобиля = КомпенсацияСубсидияКредитВИнВойсеСледующегоАвтомобиля_;
					//Бондаренко++ 20241127
					ОбработкаРеквизита("КомпенсацияСубсидияКредитВИнВойсеСледующегоАвтомобиля");
					//Бондаренко-- 20241127
				КонецЕсли;
				//Бондаренко+++ 20250606
				КомпенсацияСубсидияКредитРетроспективная_ = СтруктураПоказателей.РазмерБонусаРетро;
				Если КомпенсацияСубсидияКредитРетроспективная <> КомпенсацияСубсидияКредитРетроспективная_ Тогда
					КомпенсацияСубсидияКредитРетроспективная = КомпенсацияСубсидияКредитРетроспективная_;
					ОбработкаРеквизита("КомпенсацияСубсидияКредитРетроспективная");
				КонецЕсли;
				//Бондаренко--- 20250606
			КонецЕсли;
		КонецЕсли; 
		//Бондаренко++ 20250815	
	ИначеЕсли Имя = "ПрограммаБрокерФинанс" Тогда
		Если Не обЗначениеНеЗаполнено(ПрограммаБрокерФинанс) Тогда  
			Если Не обЗначениеНеЗаполнено(Автомобиль) Тогда  
				Если Не обЗначениеНеЗаполнено(Автомобиль.Модель) Тогда
					КомпенсацияБрокерФинанс = ПолучитьКомпенсациюБрокерФинанс(Автомобиль.Модель,ПрограммаБрокерФинанс);
					ВариантБрокерФинанс = Перечисления.ВариантыОтветов.Да;
				КонецЕсли;	
			КонецЕсли;	
		Иначе
			ВариантБрокерФинанс = Перечисления.ВариантыОтветов.Нет;
			КомпенсацияБрокерФинанс = 0;
		КонецЕсли;	
		//Бондаренко-- 20250815
		
	//Иванченко 20260313 ++
	ИначеЕсли Имя = "АгентПодразделение" Тогда
		Результат = Истина;
		СМГ_ПересчетПоказателей(ЭтаФорма);
		Возврат Результат;
	//Иванченко 20260313 --
	ИначеЕсли Имя = "МаркетинговаяПрограммаСкидкаПоПрограммамЛояльности" Тогда
		Если Не обЗначениеНеЗаполнено(Автомобиль) Тогда    
			СтруктураПоказателей = ПолучитьСкидкуИБонусТрейдИн(Автомобиль.Модель,Автомобиль.ВариантКомплектации,МаркетинговаяПрограммаСкидкаПоПрограммамЛояльности);
			Если ТипЗНЧ(СтруктураПоказателей) = Тип("Структура") Тогда
				СкидкаПоПрограммамЛояльности_ = СтруктураПоказателей.РазмерСкидки;
				Если СкидкаПоПрограммамЛояльности <> СкидкаПоПрограммамЛояльности_ Тогда
					СкидкаПоПрограммамЛояльности = СкидкаПоПрограммамЛояльности_;
					//Бондаренко++ 20241127
					ОбработкаРеквизита("СкидкаПоПрограммамЛояльности");
					//Бондаренко-- 20241127
				КонецЕсли;
				КомпенсацияПоПрограммамЛояльностиВИнВойсеСледующегоАвтомобиля_ = СтруктураПоказателей.РазмерБонуса;
				Если КомпенсацияПоПрограммамЛояльностиВИнВойсеСледующегоАвтомобиля <> КомпенсацияПоПрограммамЛояльностиВИнВойсеСледующегоАвтомобиля_ Тогда
					КомпенсацияПоПрограммамЛояльностиВИнВойсеСледующегоАвтомобиля = КомпенсацияПоПрограммамЛояльностиВИнВойсеСледующегоАвтомобиля_;
					//Бондаренко++ 20241127
					ОбработкаРеквизита("КомпенсацияПоПрограммамЛояльностиВИнВойсеСледующегоАвтомобиля");
					//Бондаренко-- 20241127
				КонецЕсли;
				//Бондаренко+++ 20250607
				КомпенсацияПоПрограммамЛояльностиРетроспективная_ = СтруктураПоказателей.РазмерБонусаРетро;
				Если КомпенсацияПоПрограммамЛояльностиРетроспективная <> КомпенсацияПоПрограммамЛояльностиРетроспективная_ Тогда
					КомпенсацияПоПрограммамЛояльностиРетроспективная = КомпенсацияПоПрограммамЛояльностиРетроспективная_;
					ОбработкаРеквизита("КомпенсацияПоПрограммамЛояльностиРетроспективная");
				КонецЕсли;
				КомпенсацияПоПрограммамЛояльностиВИнВойсеТекущегоАвтомобиля_ = СтруктураПоказателей.РазмерБонусаТекущего;
				Если КомпенсацияПоПрограммамЛояльностиВИнВойсеТекущегоАвтомобиля <> КомпенсацияПоПрограммамЛояльностиВИнВойсеТекущегоАвтомобиля_ Тогда
					КомпенсацияПоПрограммамЛояльностиВИнВойсеТекущегоАвтомобиля = КомпенсацияПоПрограммамЛояльностиВИнВойсеТекущегоАвтомобиля_;
					ОбработкаРеквизита("КомпенсацияПоПрограммамЛояльностиВИнВойсеТекущегоАвтомобиля");
				КонецЕсли;				
				//Бондаренко--- 20250607
				//Бондаренко++ 20250823
				УдержаниеКомпенсации_ = СтруктураПоказателей.УдержаниеКомпенсации;				
				Если УдержаниеКомпенсации <> УдержаниеКомпенсации_ Тогда
					УдержаниеКомпенсации = УдержаниеКомпенсации_;
					ОбработкаРеквизита("УдержаниеКомпенсации");
				КонецЕсли;				
				//Бондаренко-- 20250823
				//Бондаренко++ 20250618	
			Иначе
				СкидкаПоПрограммамЛояльности = 0;
				КомпенсацияПоПрограммамЛояльностиВИнВойсеСледующегоАвтомобиля = 0;
				КомпенсацияПоПрограммамЛояльностиРетроспективная  = 0;
				КомпенсацияПоПрограммамЛояльностиВИнВойсеТекущегоАвтомобиля = 0;
				//Бондаренко++ 20250823
				УдержаниеКомпенсации = 0;
				//Бондаренко-- 20250823
				//Бондаренко--- 20250618	
			КонецЕсли;
		КонецЕсли; 		
	ИначеЕсли Имя = "МаркетинговаяПрограммаСкидкаПоПрограммамЛояльностиДополнительно" Тогда
		Если Не обЗначениеНеЗаполнено(Автомобиль) Тогда
			//Бондаренко++ 20250626
			Если МаркетинговаяПрограммаСкидкаПоПрограммамЛояльностиДополнительно.УниверсальнаяСпецпрограмма Тогда
				СтруктураПоказателей = ПолучитьСкидкуИБонусТрейдИн(Автомобиль.Модель,Автомобиль.ВариантКомплектации,МаркетинговаяПрограммаСкидкаПоПрограммамЛояльностиДополнительно);
			Иначе                  
				//Бондаренко-- 20250626	
				СтруктураПоказателей = ПолучитьСкидкуИБонусСпецпрограмма(Автомобиль,МаркетинговаяПрограммаСкидкаПоПрограммамЛояльностиДополнительно);
				//Бондаренко++ 20250626	
			КонецЕсли;
			//Бондаренко-- 20250626
			Если ТипЗНЧ(СтруктураПоказателей) = Тип("Структура") Тогда
				СкидкаАвтоЦентра_ = СтруктураПоказателей.РазмерСкидки;
				Если СкидкаАвтоЦентра <> СкидкаАвтоЦентра_ Тогда
					СкидкаАвтоЦентра = СкидкаАвтоЦентра_;
					//Бондаренко++ 20241127
					ОбработкаРеквизита("СкидкаАвтоЦентра");
					//Бондаренко-- 20241127
				КонецЕсли;
				КомпенсацияРозничнаяВИнВойсеСледующегоАвтомобиля_ = СтруктураПоказателей.РазмерБонуса;
				Если КомпенсацияРозничнаяВИнВойсеСледующегоАвтомобиля <> КомпенсацияРозничнаяВИнВойсеСледующегоАвтомобиля_ Тогда
					КомпенсацияРозничнаяВИнВойсеСледующегоАвтомобиля = КомпенсацияРозничнаяВИнВойсеСледующегоАвтомобиля_;
					//Бондаренко++ 20241127
					ОбработкаРеквизита("КомпенсацияРозничнаяВИнВойсеСледующегоАвтомобиля");
					//Бондаренко-- 20241127
				КонецЕсли;
				//Бондаренко++ 20250611
				КомпенсацияРозничнаяРетроспективная_ = СтруктураПоказателей.РазмерБонусаРетро;
				Если КомпенсацияРозничнаяРетроспективная <> КомпенсацияРозничнаяРетроспективная_ Тогда
					КомпенсацияРозничнаяРетроспективная = КомпенсацияРозничнаяРетроспективная_;
					ОбработкаРеквизита("КомпенсацияРозничнаяРетроспективная");
				КонецЕсли;
				//Бондаренко-- 20250611
			Иначе
				//Бондаренко++ 20251003
				Если СкидкаАвтоЦентра <> 0 Тогда
					СкидкаАвтоЦентра = 0;
					ОбработкаРеквизита("СкидкаАвтоЦентра");
				КонецЕсли;
				Если КомпенсацияРозничнаяВИнВойсеСледующегоАвтомобиля <> 0 Тогда
					КомпенсацияРозничнаяВИнВойсеСледующегоАвтомобиля = 0;
					ОбработкаРеквизита("КомпенсацияРозничнаяВИнВойсеСледующегоАвтомобиля");
				КонецЕсли;
				Если КомпенсацияРозничнаяРетроспективная <> 0 Тогда
					КомпенсацияРозничнаяРетроспективная = 0;
					ОбработкаРеквизита("КомпенсацияРозничнаяРетроспективная");
				КонецЕсли;
				//Бондаренко-- 20251003
			КонецЕсли;
		КонецЕсли; 		
		//Бондаренко-- 2024114             
		//Бондаренко++ 20250805
	ИначеЕсли Имя = "ПроцентАВЛизинг" Тогда	
		Если ВидОплаты = Перечисления.ВидыОплаты.Лизинг Тогда
			КВКредит_ = ДКПавто * ПроцентАВЛизинг / 100;	
		ИначеЕсли ВидОплаты = Перечисления.ВидыОплаты.Кредит Тогда 
			
			//Иванченко 20260709 ++
			//КВКредит_ = СчетИлиАвтоВКредит * ПроцентАВЛизинг / 100;
			Если КредитнаяПРограмма.ВариантРассчетаКВ = Перечисления.ВариантыРассчетаКВ.ОтСтоимостиАвтомобиля Тогда
				КВКредит = ДКПавто * ПроцентАВЛизинг / 100; 
			Иначе
				КВКредит = СчетИлиАвтоВКредит * ПроцентАВЛизинг / 100; 
			КонецЕсли;	

			//Иванченко 20260709 --			
		Иначе	
			КВКредит_ = 0;	
		КонецЕсли;	
		Если КВКредит <> КВКредит_ Тогда
			КВКредит = КВКредит_;
		Иначе	
			КВКредит = 0;
		КонецЕсли;
		//Бондаренко-- 20250805
		//Бондаренко++ 20250718
	ИначеЕсли Имя = "СтраховаяКомпанияКАСКО" Тогда
		Если Не обЗначениеНеЗаполнено(СтраховаяКомпанияКАСКО) Тогда
			Если НЕ обЗначениеНеЗаполнено(АгентПодразделениеКАСКО) Тогда 
				ДоговорКвКАСКО = НайтиСоздатьДоговорПродажаПД(АгентПодразделениеКАСКО,СтраховаяКомпанияКАСКО.БанкКонтрагент);
			КонецЕсли;
		КонецЕсли;
	ИначеЕсли Имя = "СтраховаяКомпанияОСАГО" Тогда
		Если Не обЗначениеНеЗаполнено(СтраховаяКомпанияОСАГО) Тогда
			Если НЕ обЗначениеНеЗаполнено(АгентПодразделениеОСАГО) Тогда 
				ДоговорКвОСАГО = НайтиСоздатьДоговорПродажаПД(АгентПодразделениеОСАГО,СтраховаяКомпанияОСАГО.БанкКонтрагент);
			КонецЕсли;
		КонецЕсли;
	ИначеЕсли Имя = "СтраховаяКомпанияСЖ" Тогда
		Если Не обЗначениеНеЗаполнено(СтраховаяКомпанияСЖ) Тогда
			Если НЕ обЗначениеНеЗаполнено(АгентПодразделениеСЖ) Тогда 
				ДоговорКвСЖ = НайтиСоздатьДоговорПродажаПД(АгентПодразделениеСЖ,СтраховаяКомпанияСЖ.БанкКонтрагент);
			КонецЕсли;
		КонецЕсли;
	ИначеЕсли Имя = "ИныеСтраховыеПродукты.СтраховаяКомпания" Тогда
		Если Не обЗначениеНеЗаполнено(ТекСтрока.СтраховаяКомпания) Тогда
			Если НЕ обЗначениеНеЗаполнено(ТекСтрока.АгентПодразделение) Тогда 
				ТекСтрока.ДоговорКв = НайтиСоздатьДоговорПродажаПД(ТекСтрока.АгентПодразделение,ТекСтрока.СтраховаяКомпания.БанкКонтрагент);
			КонецЕсли;
		КонецЕсли;
		//Бондаренко-- 20250718
		//Бондаренко++ 20250621
	ИначеЕсли Имя = "АгентПодразделениеКАСКО" Тогда
		Если Не обЗначениеНеЗаполнено(АгентПодразделениеКАСКО) Тогда
			ЕстьПодчиненные = Справочники.ПодразделенияКомпании.СМГ_ЕстьПодчиненныеПодразделения(АгентПодразделениеКАСКО);
			Если ЕстьПодчиненные Тогда
				СМГ_Сообщить("ОШИБКА! Запрещено использовать подразделение """+СокрЛП(АгентПодразделениеКАСКО)+""" из группы """+СокрЛП(АгентПодразделениеКАСКО.Родитель)+""".",СтатусСообщения.ОченьВажное);
				АгентПодразделениеКАСКО = "";
			КонецЕсли; 
			//Бондаренко++ 20250710
			Если обЗначениеНеЗаполнено(СтраховаяКомпанияКАСКО) Тогда
				СтраховаяКомпанияКАСКО = Справочники.БанкиЛкПартнеры.НайтиПоРеквизиту("БанкКонтрагент",ПрограммаКАСКО.СтраховаяКомпания);
			КонецЕсли;
			Если НЕ обЗначениеНеЗаполнено(АгентПодразделениеКАСКО) Тогда 
				Если НЕ обЗначениеНеЗаполнено(СтраховаяКомпанияКАСКО) Тогда	
					ДоговорКвКАСКО = НайтиСоздатьДоговорПродажаПД(АгентПодразделениеКАСКО,СтраховаяКомпанияКАСКО.БанкКонтрагент);
				КонецЕсли;
			КонецЕсли;
			//Бондаренко++ 20250710
		КонецЕсли;
	ИначеЕсли Имя = "АгентПодразделениеОСАГО" Тогда
		Если Не обЗначениеНеЗаполнено(АгентПодразделениеОСАГО) Тогда
			ЕстьПодчиненные = Справочники.ПодразделенияКомпании.СМГ_ЕстьПодчиненныеПодразделения(АгентПодразделениеОСАГО);
			Если ЕстьПодчиненные Тогда
				СМГ_Сообщить("ОШИБКА! Запрещено использовать подразделение """+СокрЛП(АгентПодразделениеОСАГО)+""" из группы """+СокрЛП(АгентПодразделениеОСАГО.Родитель)+""".",СтатусСообщения.ОченьВажное);
				АгентПодразделениеОСАГО = "";
			КонецЕсли;
			//Бондаренко++ 20250710
			Если обЗначениеНеЗаполнено(СтраховаяКомпанияОСАГО) Тогда
				СтраховаяКомпанияОСАГО = Справочники.БанкиЛкПартнеры.НайтиПоРеквизиту("БанкКонтрагент",ПрограммаКАСКО.СтраховаяКомпания);
			КонецЕсли;
			Если НЕ обЗначениеНеЗаполнено(АгентПодразделениеОСАГО) Тогда 
				Если НЕ обЗначениеНеЗаполнено(СтраховаяКомпанияОСАГО) Тогда	
					ДоговорКвОСАГО = НайтиСоздатьДоговорПродажаПД(АгентПодразделениеОСАГО,СтраховаяКомпанияОСАГО.БанкКонтрагент);
				КонецЕсли;
			КонецЕсли;
			//Бондаренко++ 20250710
		КонецЕсли;
	ИначеЕсли Имя = "АгентПодразделениеСЖ" Тогда
		Если Не обЗначениеНеЗаполнено(АгентПодразделениеСЖ) Тогда
			ЕстьПодчиненные = Справочники.ПодразделенияКомпании.СМГ_ЕстьПодчиненныеПодразделения(АгентПодразделениеСЖ);
			Если ЕстьПодчиненные Тогда
				СМГ_Сообщить("ОШИБКА! Запрещено использовать подразделение """+СокрЛП(АгентПодразделениеСЖ)+""" из группы """+СокрЛП(АгентПодразделениеСЖ.Родитель)+""".",СтатусСообщения.ОченьВажное);
				АгентПодразделениеСЖ = "";
			КонецЕсли;
			//Бондаренко++ 20250710
			Если обЗначениеНеЗаполнено(СтраховаяКомпанияСЖ) Тогда
				СтраховаяКомпанияСЖ = Справочники.БанкиЛкПартнеры.НайтиПоРеквизиту("БанкКонтрагент",ПрограммаСтрахованиеЖизни.СтраховаяКомпания);
			КонецЕсли;
			Если НЕ обЗначениеНеЗаполнено(АгентПодразделениеСЖ) Тогда 
				Если НЕ обЗначениеНеЗаполнено(СтраховаяКомпанияСЖ) Тогда	
					ДоговорКвСЖ = НайтиСоздатьДоговорПродажаПД(АгентПодразделениеСЖ,СтраховаяКомпанияСЖ.БанкКонтрагент);
				КонецЕсли;
			КонецЕсли;
			//Бондаренко++ 20250710
		КонецЕсли;
		//Бондаренко++ 20250805	
	ИначеЕсли Имя = "АгентПодразделениеКредитЛизинг" Тогда
		Если Не обЗначениеНеЗаполнено(АгентПодразделениеКредитЛизинг) Тогда
			ЕстьПодчиненные = Справочники.ПодразделенияКомпании.СМГ_ЕстьПодчиненныеПодразделения(АгентПодразделениеКредитЛизинг);
			Если ЕстьПодчиненные Тогда
				СМГ_Сообщить("ОШИБКА! Запрещено использовать подразделение """+СокрЛП(АгентПодразделениеКредитЛизинг)+""" из группы """+СокрЛП(АгентПодразделениеКредитЛизинг.Родитель)+""".",СтатусСообщения.ОченьВажное);
				АгентПодразделениеСЖ = "";
			КонецЕсли;
			//Бондаренко++ 20250710
			Если обЗначениеНеЗаполнено(Партнер) Тогда
				Если ВидОплаты = Перечисления.ВидыОплаты.Кредит Тогда
					Партнер = Справочники.БанкиЛкПартнеры.НайтиПоРеквизиту("БанкКонтрагент",КредитнаяПрограмма.СтраховаяКомпания);
				Иначе	
					Партнер = Справочники.БанкиЛкПартнеры.НайтиПоРеквизиту("БанкКонтрагент",ЛизинговаяПрограмма.СтраховаяКомпания);
				КонецЕсли;
			КонецЕсли;
			Если НЕ обЗначениеНеЗаполнено(АгентПодразделениеКредитЛизинг) Тогда 
				Если НЕ обЗначениеНеЗаполнено(Партнер) Тогда	
					ДоговорБанкЛК = НайтиСоздатьДоговорПродажаПД(АгентПодразделениеКредитЛизинг,Партнер.БанкКонтрагент);
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
		//Бондаренко-- 20250805
	ИначеЕсли Имя = "ИныеСтраховыеПродукты.АгентПодразделение" Тогда
		Если Не обЗначениеНеЗаполнено(ТекСтрока.АгентПодразделение) Тогда
			ЕстьПодчиненные = Справочники.ПодразделенияКомпании.СМГ_ЕстьПодчиненныеПодразделения(ТекСтрока.АгентПодразделение);
			Если ЕстьПодчиненные Тогда
				СМГ_Сообщить("ОШИБКА! Запрещено использовать подразделение """+СокрЛП(ТекСтрока.АгентПодразделение)+""" из группы """+СокрЛП(ТекСтрока.АгентПодразделение.Родитель)+""".",СтатусСообщения.ОченьВажное);
				ТекСтрока.АгентПодразделение = "";
			КонецЕсли;
			//Бондаренко++ 20250712
			Если обЗначениеНеЗаполнено(ТекСтрока.СтраховаяКомпания) Тогда
				ТекСтрока.СтраховаяКомпания = Справочники.БанкиЛкПартнеры.НайтиПоРеквизиту("БанкКонтрагент",ТекСтрока.ПрограммаСтрахование.СтраховаяКомпания);
			КонецЕсли;
			Если НЕ обЗначениеНеЗаполнено(ТекСтрока.АгентПодразделение) Тогда 
				Если НЕ обЗначениеНеЗаполнено(ТекСтрока.СтраховаяКомпания) Тогда	
					ТекСтрока.ДоговорКв = НайтиСоздатьДоговорПродажаПД(ТекСтрока.АгентПодразделение,ТекСтрока.СтраховаяКомпания.БанкКонтрагент);
				КонецЕсли;
			КонецЕсли;
			//Бондаренко++ 20250712
		КонецЕсли;
		//Бондаренко--+ 20250621
		//Бондаренко++ 20250702
	ИначеЕсли Имя = "ПрограммаКАСКО" Тогда
		Если обЗначениеНеЗаполнено(СтраховаяКомпанияКАСКО) Тогда
			СтраховаяКомпанияКАСКО = Справочники.БанкиЛкПартнеры.НайтиПоРеквизиту("БанкКонтрагент",ПрограммаКАСКО.СтраховаяКомпания);
		КонецЕсли;
	ИначеЕсли Имя = "ПрограммаОСАГО" Тогда
		Если обЗначениеНеЗаполнено(СтраховаяКомпанияОСАГО) Тогда
			СтраховаяКомпанияОСАГО = Справочники.БанкиЛкПартнеры.НайтиПоРеквизиту("БанкКонтрагент",ПрограммаОСАГО.СтраховаяКомпания);
		КонецЕсли;
	ИначеЕсли Имя = "ПрограммаСтрахованиеЖизни" Тогда
		Если обЗначениеНеЗаполнено(СтраховаяКомпанияСЖ) Тогда
			СтраховаяКомпанияСЖ = Справочники.БанкиЛкПартнеры.НайтиПоРеквизиту("БанкКонтрагент",ПрограммаСтрахованиеЖизни.СтраховаяКомпания);
		КонецЕсли;
	ИначеЕсли Имя = "ИныеСтраховыеПродукты.ПрограммаСтрахования" Тогда
		Если обЗначениеНеЗаполнено(ТекСтрока.СтраховаяКомпания) Тогда
			ТекСтрока.СтраховаяКомпания = Справочники.БанкиЛкПартнеры.НайтиПоРеквизиту("БанкКонтрагент",ТекСтрока.ПрограммаСтрахования.СтраховаяКомпания);
		КонецЕсли;
		//Бондаренко-- 20250702
		//Бондаренко++ 20250801	
	ИначеЕсли Имя = "ЛизинговаяПрограмма" Тогда
		Партнер = ЛизинговаяПрограмма.Партнер;
		Если Не обЗначениеНЕЗаполнено(Партнер) Тогда
			БанкЛК = Партнер.БанкКонтрагент;
		КонецЕсли;
		ПроцентАВЛизинг = ЛизинговаяПрограмма.ПроцентКВ;
		КВКредит = ДКПавто * ПроцентАВЛизинг / 100;
	ИначеЕсли Имя = "КредитнаяПрограмма" Тогда
		Партнер = КредитнаяПрограмма.БанкПартнер;
		Если Не обЗначениеНЕЗаполнено(Партнер) Тогда
			БанкЛК = Партнер.БанкКонтрагент;
		КонецЕсли;
		ПроцентАВЛизинг = КредитнаяПРограмма.ПроцентКВ;  
		//Иванченко 20260709 ++
		//КВКредит = СчетИлиАвтоВКредит * ПроцентАВЛизинг / 100;
		
		Если КредитнаяПРограмма.ВариантРассчетаКВ = Перечисления.ВариантыРассчетаКВ.ОтСтоимостиАвтомобиля Тогда
			КВКредит = ДКПавто * ПроцентАВЛизинг / 100; 
		Иначе
			КВКредит = СчетИлиАвтоВКредит * ПроцентАВЛизинг / 100; 
		КонецЕсли;	
		
		//Иванченко 20260709 --	
		//Бондаренко-- 20250801	
		//Бондаренко++ 20250719	
	ИначеЕсли Имя = "СуммаКаско" Тогда
		Если НЕ обЗначениеНеЗаполнено(ПрограммаКаско) Тогда
			Если КвКаско = 0 Тогда
				КвКаско = СуммаКаско * ПрограммаКАСКО.Вознаграждение / 100;
			КонецЕсли;
		КонецЕсли;
	ИначеЕсли Имя = "CуммаОсаго" Тогда
		Если НЕ обЗначениеНеЗаполнено(ПрограммаОсаго) Тогда
			Если КвОсаго = 0 Тогда
				КвОсаго = СуммаОсаго * ПрограммаОсаго.Вознаграждение / 100;
			КонецЕсли;
		КонецЕсли;
	ИначеЕсли Имя = "ИныеСтраховыеПродукты.СуммаСтрахования" Тогда
		Если НЕ обЗначениеНеЗаполнено(ТекСтрока.ПрограммаСтрахования) Тогда
			Если ТекСтрока.КВ = 0 Тогда
				ТекСтрока.КВ = ТекСтрока.СуммаСтрахования * ТекСтрока.ПрограммаСтрахования.Вознаграждение / 100;
			КонецЕсли;
		КонецЕсли;	
		//Бондаренко-- 20250719	
		
		//Бондаренко++ 20251016		
	ИначеЕсли Имя = "ПоступлениеАвтомобиля" Тогда
		Если НЕ обЗначениеНеЗаполнено(ПоступлениеАвтомобиля) Тогда
			Если ДатаПоследнегоПоступления <> ПоступлениеАвтомобиля.Дата Тогда
				ДатаПоследнегоПоступления = ПоступлениеАвтомобиля.Дата;
			КонецЕсли;
		Иначе
			Если ДатаПоследнегоПоступления <> Дата(1,1,1) Тогда
				ДатаПоследнегоПоступления = Дата(1,1,1);
			КонецЕсли;
		КонецЕсли;	
	ИначеЕсли Имя = "РеализацияАвтомобиля" Тогда
		Если НЕ обЗначениеНеЗаполнено(РеализацияАвтомобиля) Тогда
			Если ДатаРеализацииАвтомобиля <> РеализацияАвтомобиля.Дата Тогда
				ДатаРеализацииАвтомобиля = РеализацияАвтомобиля.Дата;
			КонецЕсли;
		Иначе
			Если ДатаРеализацииАвтомобиля <> Дата(1,1,1) Тогда
				ДатаРеализацииАвтомобиля = Дата(1,1,1);
			КонецЕсли;
		КонецЕсли;	
		//Бондаренко-- 20251016		
		
	Иначе	
		Возврат дкОбработкаРеквизита(ЭтотОбъект,Имя,ТекСтрока,ЭтаФорма,ДопПараметры);
	КонецЕсли;		
КонецФункции // ОбработкаРеквизита()

//Бондаренко++ 20250710
Функция НайтиСоздатьДоговорПродажаПД(Подр,Контр) Экспорт
	
	Дог_ = "";
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ДоговорыВзаиморасчетов.Ссылка КАК Договор,
	|	ДоговорыВзаиморасчетов.ЭтоГруппа КАК ЭтоГруппа,
	|	ДоговорыВзаиморасчетов.ПометкаУдаления КАК ПометкаУдаления,
	|	ДоговорыВзаиморасчетов.ВидДоговора КАК ВидДоговора,
	|	ДоговорыВзаиморасчетов.ДатаНачала КАК ДатаНачала,
	|	ДоговорыВзаиморасчетов.ДатаКонца КАК ДатаКонца,
	|	ДоговорыВзаиморасчетов.Владелец КАК Владелец,
	|	ДоговорыВзаиморасчетов.Организация КАК Организация,
	|	ДоговорыВзаиморасчетов.ДляПервичныхДокументов КАК ДляПервичныхДокументов
	|ИЗ
	|	Справочник.ДоговорыВзаиморасчетов КАК ДоговорыВзаиморасчетов
	|ГДЕ
	|	НЕ ДоговорыВзаиморасчетов.ПометкаУдаления
	|	И НЕ ДоговорыВзаиморасчетов.ЭтоГруппа
	|	И ДоговорыВзаиморасчетов.Владелец = &Владелец
	|	И ДоговорыВзаиморасчетов.Организация = &Организация
	|	И ДоговорыВзаиморасчетов.ВидДоговора = &ВидДоговора
	|	И ДоговорыВзаиморасчетов.ДляПервичныхДокументов";
	
	Запрос.УстановитьПараметр("ВидДоговора", Перечисления.ВидыДоговоров.Продажа);
	Запрос.УстановитьПараметр("Владелец", Контр);
	Запрос.УстановитьПараметр("Организация", Подр.Организация);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Дог_ = ВыборкаДетальныеЗаписи.Договор;
		//СМГ_Сообщить("Договор найден");
		Прервать;
	КонецЦикла;
	
	Если обЗначениеНеЗаполнено(Дог_) Тогда
		
		//СМГ_Сообщить("Договор НЕ найден",СтатусСообщения.ОченьВажное);
		
		Дог_ = Справочники.ДоговорыВзаиморасчетов.СоздатьЭлемент();		
		
		Дог_.Заполнить("");
		
		Дог_.Владелец = Контр;
		Дог_.Организация = Подр.Организация;
		Дог_.Подразделение = Подр;
		Дог_.ВидДоговора = Перечисления.ВидыДоговоров.Продажа;
		
		//Бондаренко++ 20250801
		Дог_.ДляАвтомобилей = Истина;
		Дог_.ДляАвтосалона = Истина;
		Дог_.ДляПервичныхДокументов = Истина;
		//Бондаренко-- 20250801
		
		Дог_.СформироватьНаименование();
		
		//Бондаренко-- 20250801
		//Дог_.Внутренний = Истина;
		Дог_.Внутренний = Ложь;
		//Бондаренко-- 20250801
		
		Дог_.УстановитьНовыйКод("");
		
		Попытка
			Дог_.Записать();		
		Исключение
			СМГ_Сообщить("ОШИБКА! Не удалось создать договор <<Продажа ПД>> для контрагента <<"+СокрЛП(Контр)+">> по организации <<"+СокрЛП(Подр.Организация)+">>.");
		КонецПопытки;
		
	КонецЕсли;
	
	Возврат Дог_.Ссылка;    	
	//}}КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
	
	
КонецФункции // НайтиСоздатьДоговорПродажаПД(Подр,Контр)
//Бондаренко-- 20250710

//Бондаренко++ 2024114
Функция ПолучитьСкидкуИБонусТрейдИн(Модель,ВариантКомплектации,МаркетинговаяПрограмма)
	
	СтуктураВрем_ = Неопределено; 
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	//Иванченко 20251116 ++
	//"ВЫБРАТЬ
	//|	ПоказателиМаркетинговыхПрограммСрезПоследних.МаркетинговаяПрограмма КАК МаркетинговаяПрограмма,
	//|	ПоказателиМаркетинговыхПрограммСрезПоследних.Модель КАК Модель,
	//|	ПоказателиМаркетинговыхПрограммСрезПоследних.ВариантКомплектации КАК ВариантКомплектации,
	//|	ПоказателиМаркетинговыхПрограммСрезПоследних.РазмерБонуса КАК РазмерБонуса,
	//|	ПоказателиМаркетинговыхПрограммСрезПоследних.РазмерСкидки КАК РазмерСкидки,
	//|	ПоказателиМаркетинговыхПрограммСрезПоследних.РазмерБонусаРетро КАК РазмерБонусаРетро,
	//|	ПоказателиМаркетинговыхПрограммСрезПоследних.РазмерБонусаТекущего КАК РазмерБонусаТекущего,
	//|	ПоказателиМаркетинговыхПрограммСрезПоследних.РазмерПерепродажи КАК РазмерПерепродажи,
	//|	ПоказателиМаркетинговыхПрограммСрезПоследних.УдержаниеКомпенсации КАК УдержаниеКомпенсации
	//|ИЗ
	//|	РегистрСведений.ПоказателиМаркетинговыхПрограмм.СрезПоследних КАК ПоказателиМаркетинговыхПрограммСрезПоследних
	//|ГДЕ
	//|	ПоказателиМаркетинговыхПрограммСрезПоследних.МаркетинговаяПрограмма = &МаркетинговаяПрограмма
	//|	И ПоказателиМаркетинговыхПрограммСрезПоследних.Модель = &Модель
	//|	И ПоказателиМаркетинговыхПрограммСрезПоследних.ВариантКомплектации = &ВариантКомплектации";     
	"ВЫБРАТЬ
	|	ПоказателиМаркетинговыхПрограммСрезПоследних.МаркетинговаяПрограмма КАК МаркетинговаяПрограмма,
	|	ПоказателиМаркетинговыхПрограммСрезПоследних.Модель КАК Модель,
	|	ПоказателиМаркетинговыхПрограммСрезПоследних.ВариантКомплектации КАК ВариантКомплектации,
	|	ПоказателиМаркетинговыхПрограммСрезПоследних.РазмерБонуса КАК РазмерБонуса,
	|	ПоказателиМаркетинговыхПрограммСрезПоследних.РазмерСкидки КАК РазмерСкидки,
	|	ПоказателиМаркетинговыхПрограммСрезПоследних.РазмерБонусаРетро КАК РазмерБонусаРетро,
	|	ПоказателиМаркетинговыхПрограммСрезПоследних.РазмерБонусаТекущего КАК РазмерБонусаТекущего,
	|	ПоказателиМаркетинговыхПрограммСрезПоследних.РазмерПерепродажи КАК РазмерПерепродажи,
	|	ПоказателиМаркетинговыхПрограммСрезПоследних.УдержаниеКомпенсации КАК УдержаниеКомпенсации
	|ИЗ
	|	РегистрСведений.ПоказателиМаркетинговыхПрограмм.СрезПоследних КАК ПоказателиМаркетинговыхПрограммСрезПоследних
	|ГДЕ
	|	ПоказателиМаркетинговыхПрограммСрезПоследних.МаркетинговаяПрограмма = &МаркетинговаяПрограмма
	|	И ПоказателиМаркетинговыхПрограммСрезПоследних.Модель = &Модель
	|	И ПоказателиМаркетинговыхПрограммСрезПоследних.ВариантКомплектации = &ВариантКомплектации
	|	И НЕ ПоказателиМаркетинговыхПрограммСрезПоследних.Отменена";	
	//Иванченко 20251116 --	
	
	Запрос.УстановитьПараметр("ВариантКомплектации", ВариантКомплектации);
	Запрос.УстановитьПараметр("МаркетинговаяПрограмма", МаркетинговаяПрограмма);
	Запрос.УстановитьПараметр("Модель", Модель);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл 
		СтуктураВрем_ = Новый Структура();
		СтуктураВрем_.Вставить("РазмерСкидки",ВыборкаДетальныеЗаписи.РазмерСкидки);
		СтуктураВрем_.Вставить("РазмерБонуса",ВыборкаДетальныеЗаписи.РазмерБонуса);
		//Бондаренко++ 20250606
		СтуктураВрем_.Вставить("РазмерБонусаРетро",ВыборкаДетальныеЗаписи.РазмерБонусаРетро);
		СтуктураВрем_.Вставить("РазмерБонусаТекущего",ВыборкаДетальныеЗаписи.РазмерБонусаТекущего);
		СтуктураВрем_.Вставить("РазмерПерепродажи",ВыборкаДетальныеЗаписи.РазмерПерепродажи);
		//Бондаренко-- 20250606 
		//Бондаренко++ 20250823
		СтуктураВрем_.Вставить("УдержаниеКомпенсации",ВыборкаДетальныеЗаписи.УдержаниеКомпенсации);
		//Бондаренко-- 20250823
	КонецЦикла;
	
	Возврат СтуктураВрем_;
	
КонецФункции // ПолучитьСкидкуИБонусТрейдИн(Модель,ВариантКомплектации,МаркетинговаяПрограмма)
//Бондаренко-- 2024114 


Функция ПолучитьКомпенсациюБрокерФинанс(Модель,ПрограммаБФ)
	
	КомпБФ_ = 0; 
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	//Иванченко 20251106 ++
	//"ВЫБРАТЬ
	//|	ПоказателиМаркетинговыхПрограммСрезПоследних.МаркетинговаяПрограмма КАК МаркетинговаяПрограмма,
	//|	ПоказателиМаркетинговыхПрограммСрезПоследних.Модель КАК Модель,
	//|	ПоказателиМаркетинговыхПрограммСрезПоследних.ВариантКомплектации КАК ВариантКомплектации,
	//|	ПоказателиМаркетинговыхПрограммСрезПоследних.РазмерБонуса+ПоказателиМаркетинговыхПрограммСрезПоследних.РазмерБонусаРетро КАК СуммаБонуса
	//|ИЗ
	//|	РегистрСведений.ПоказателиМаркетинговыхПрограмм.СрезПоследних КАК ПоказателиМаркетинговыхПрограммСрезПоследних
	//|ГДЕ
	//|	ПоказателиМаркетинговыхПрограммСрезПоследних.МаркетинговаяПрограмма = &МаркетинговаяПрограмма
	//|	И ПоказателиМаркетинговыхПрограммСрезПоследних.Модель = &Модель";    
	"ВЫБРАТЬ
	|	ПоказателиМаркетинговыхПрограммСрезПоследних.МаркетинговаяПрограмма КАК МаркетинговаяПрограмма,
	|	ПоказателиМаркетинговыхПрограммСрезПоследних.Модель КАК Модель,
	|	ПоказателиМаркетинговыхПрограммСрезПоследних.ВариантКомплектации КАК ВариантКомплектации,
	|	ПоказателиМаркетинговыхПрограммСрезПоследних.РазмерБонуса+ПоказателиМаркетинговыхПрограммСрезПоследних.РазмерБонусаРетро КАК СуммаБонуса
	|ИЗ
	|	РегистрСведений.ПоказателиМаркетинговыхПрограмм.СрезПоследних КАК ПоказателиМаркетинговыхПрограммСрезПоследних
	|ГДЕ
	|	ПоказателиМаркетинговыхПрограммСрезПоследних.МаркетинговаяПрограмма = &МаркетинговаяПрограмма
	|	И ПоказателиМаркетинговыхПрограммСрезПоследних.Модель = &Модель";    
	//Иванченко 20251106 --
	
	Запрос.УстановитьПараметр("МаркетинговаяПрограмма", ПрограммаБФ);
	Запрос.УстановитьПараметр("Модель", Модель);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл 
		КомпБФ_ = ВыборкаДетальныеЗаписи.СуммаБонуса;
	КонецЦикла;
	
	Возврат КомпБФ_;
	
КонецФункции
//Бондаренко++ 20250611
Функция ПолучитьСкидкуИБонусСпецпрограмма(Автомобиль,МаркетинговаяПрограмма)
	
	СтуктураВрем_ = Неопределено; 
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	//Иванченко 20251106 ++	
	//"ВЫБРАТЬ
	//|	ПоказателиМаркетинговыхПрограммСрезПоследних.МаркетинговаяПрограмма КАК МаркетинговаяПрограмма,
	//|	ПоказателиМаркетинговыхПрограммСрезПоследних.Модель КАК Модель,
	//|	ПоказателиМаркетинговыхПрограммСрезПоследних.ВариантКомплектации КАК ВариантКомплектации,
	//|	ПоказателиМаркетинговыхПрограммСрезПоследних.РазмерБонуса КАК РазмерБонуса,
	//|	ПоказателиМаркетинговыхПрограммСрезПоследних.РазмерСкидки КАК РазмерСкидки,
	//|	ПоказателиМаркетинговыхПрограммСрезПоследних.РазмерБонусаРетро КАК РазмерБонусаРетро,
	//|	ПоказателиМаркетинговыхПрограммСрезПоследних.РазмерБонусаТекущего КАК РазмерБонусаТекущего,
	//|	ПоказателиМаркетинговыхПрограммСрезПоследних.РазмерПерепродажи КАК РазмерПерепродажи,
	//|	ПоказателиМаркетинговыхПрограммСрезПоследних.Автомобиль КАК Автомобиль
	//|ИЗ
	//|	РегистрСведений.ПоказателиМаркетинговыхПрограмм.СрезПоследних КАК ПоказателиМаркетинговыхПрограммСрезПоследних
	//|ГДЕ
	//|	ПоказателиМаркетинговыхПрограммСрезПоследних.МаркетинговаяПрограмма = &МаркетинговаяПрограмма
	//|	И ПоказателиМаркетинговыхПрограммСрезПоследних.Автомобиль = &Автомобиль";
	//Иванченко 20251109 ++
	//"ВЫБРАТЬ
	//|	ПоказателиМаркетинговыхПрограммСрезПоследних.МаркетинговаяПрограмма КАК МаркетинговаяПрограмма,
	//|	ПоказателиМаркетинговыхПрограммСрезПоследних.Модель КАК Модель,
	//|	ПоказателиМаркетинговыхПрограммСрезПоследних.ВариантКомплектации КАК ВариантКомплектации,
	//|	ПоказателиМаркетинговыхПрограммСрезПоследних.РазмерБонуса КАК РазмерБонуса,
	//|	ПоказателиМаркетинговыхПрограммСрезПоследних.РазмерСкидки КАК РазмерСкидки,
	//|	ПоказателиМаркетинговыхПрограммСрезПоследних.РазмерБонусаРетро КАК РазмерБонусаРетро,
	//|	ПоказателиМаркетинговыхПрограммСрезПоследних.РазмерБонусаТекущего КАК РазмерБонусаТекущего,
	//|	ПоказателиМаркетинговыхПрограммСрезПоследних.РазмерПерепродажи КАК РазмерПерепродажи,
	//|	ПоказателиМаркетинговыхПрограммСрезПоследних.Автомобиль КАК Автомобиль
	//|ИЗ
	//|	РегистрСведений.ПоказателиМаркетинговыхПрограмм.СрезПоследних КАК ПоказателиМаркетинговыхПрограммСрезПоследних
	//|ГДЕ
	//|	ПоказателиМаркетинговыхПрограммСрезПоследних.МаркетинговаяПрограмма = &МаркетинговаяПрограмма
	//|	И ПоказателиМаркетинговыхПрограммСрезПоследних.Автомобиль = &Автомобиль
	//|	И НЕ ПоказателиМаркетинговыхПрограммСрезПоследних.Отменена";
	////Иванченко 20251106 --	
	//
	//Запрос.УстановитьПараметр("Автомобиль", Автомобиль);  
	//Иванченко 20251226 ++
	//"ВЫБРАТЬ
	//|	ПоказателиМаркетинговыхПрограммСрезПоследних.МаркетинговаяПрограмма КАК МаркетинговаяПрограмма,
	//|	ПоказателиМаркетинговыхПрограммСрезПоследних.Модель КАК Модель,
	//|	ПоказателиМаркетинговыхПрограммСрезПоследних.ВариантКомплектации КАК ВариантКомплектации,
	//|	ПоказателиМаркетинговыхПрограммСрезПоследних.РазмерБонуса КАК РазмерБонуса,
	//|	ПоказателиМаркетинговыхПрограммСрезПоследних.РазмерСкидки КАК РазмерСкидки,
	//|	ПоказателиМаркетинговыхПрограммСрезПоследних.РазмерБонусаРетро КАК РазмерБонусаРетро,
	//|	ПоказателиМаркетинговыхПрограммСрезПоследних.РазмерБонусаТекущего КАК РазмерБонусаТекущего,
	//|	ПоказателиМаркетинговыхПрограммСрезПоследних.РазмерПерепродажи КАК РазмерПерепродажи,
	//|	ПоказателиМаркетинговыхПрограммСрезПоследних.Автомобиль КАК Автомобиль
	//|ИЗ
	//|	РегистрСведений.ПоказателиМаркетинговыхПрограмм.СрезПоследних КАК ПоказателиМаркетинговыхПрограммСрезПоследних
	//|ГДЕ
	//|	ПоказателиМаркетинговыхПрограммСрезПоследних.МаркетинговаяПрограмма = &МаркетинговаяПрограмма
	//|	И ПоказателиМаркетинговыхПрограммСрезПоследних.Модель = &Модель
	//|	И ПоказателиМаркетинговыхПрограммСрезПоследних.ВариантКомплектации = &ВариантКомплектации
	//|	И НЕ ПоказателиМаркетинговыхПрограммСрезПоследних.Отменена";
	//"ВЫБРАТЬ
	//|	ПоказателиМаркетинговыхПрограммСрезПоследних.МаркетинговаяПрограмма КАК МаркетинговаяПрограмма,
	//|	ПоказателиМаркетинговыхПрограммСрезПоследних.Модель КАК Модель,
	//|	ПоказателиМаркетинговыхПрограммСрезПоследних.ВариантКомплектации КАК ВариантКомплектации,
	//|	ПоказателиМаркетинговыхПрограммСрезПоследних.РазмерБонуса КАК РазмерБонуса,
	//|	ПоказателиМаркетинговыхПрограммСрезПоследних.РазмерСкидки КАК РазмерСкидки,
	//|	ПоказателиМаркетинговыхПрограммСрезПоследних.РазмерБонусаРетро КАК РазмерБонусаРетро,
	//|	ПоказателиМаркетинговыхПрограммСрезПоследних.РазмерБонусаТекущего КАК РазмерБонусаТекущего,
	//|	ПоказателиМаркетинговыхПрограммСрезПоследних.РазмерПерепродажи КАК РазмерПерепродажи,
	//|	ПоказателиМаркетинговыхПрограммСрезПоследних.Автомобиль КАК Автомобиль
	//|ИЗ
	//|	РегистрСведений.ПоказателиМаркетинговыхПрограмм.СрезПоследних КАК ПоказателиМаркетинговыхПрограммСрезПоследних
	//|ГДЕ
	//|	ПоказателиМаркетинговыхПрограммСрезПоследних.МаркетинговаяПрограмма = &МаркетинговаяПрограмма
	//|	И ВЫБОР
	//|			КОГДА ПоказателиМаркетинговыхПрограммСрезПоследних.Автомобиль.Модель = ЗНАЧЕНИЕ(Справочник.Модели.ПустаяСсылка)
	//|				ТОГДА ПоказателиМаркетинговыхПрограммСрезПоследних.Модель = &Модель
	//|			ИНАЧЕ ПоказателиМаркетинговыхПрограммСрезПоследних.Автомобиль.Модель = &Модель
	//|		КОНЕЦ
	//|	И ВЫБОР
	//|			КОГДА ПоказателиМаркетинговыхПрограммСрезПоследних.Автомобиль.Модель.Марка = ЗНАЧЕНИЕ(Справочник.Марка.ПустаяСсылка)
	//|				ТОГДА ПоказателиМаркетинговыхПрограммСрезПоследних.ВариантКомплектации = &ВариантКомплектации
	//|			ИНАЧЕ ПоказателиМаркетинговыхПрограммСрезПоследних.Автомобиль.ВариантКомплектации = &ВариантКомплектации
	//|		КОНЕЦ
	//|	И НЕ ПоказателиМаркетинговыхПрограммСрезПоследних.Отменена";  
	"ВЫБРАТЬ
	|	ПоказателиМаркетинговыхПрограммСрезПоследних.МаркетинговаяПрограмма КАК МаркетинговаяПрограмма,
	|	ПоказателиМаркетинговыхПрограммСрезПоследних.Модель КАК Модель,
	|	ПоказателиМаркетинговыхПрограммСрезПоследних.ВариантКомплектации КАК ВариантКомплектации,
	|	ПоказателиМаркетинговыхПрограммСрезПоследних.Автомобиль КАК Автомобиль,
	|	ПоказателиМаркетинговыхПрограммСрезПоследних.РазмерБонуса КАК РазмерБонуса,
	|	ПоказателиМаркетинговыхПрограммСрезПоследних.РазмерСкидки КАК РазмерСкидки,
	|	ПоказателиМаркетинговыхПрограммСрезПоследних.РазмерБонусаРетро КАК РазмерБонусаРетро,
	|	ПоказателиМаркетинговыхПрограммСрезПоследних.РазмерБонусаТекущего КАК РазмерБонусаТекущего,
	|	ПоказателиМаркетинговыхПрограммСрезПоследних.РазмерПерепродажи КАК РазмерПерепродажи
	|ПОМЕСТИТЬ ВТ_Основа
	|ИЗ
	|	РегистрСведений.ПоказателиМаркетинговыхПрограмм.СрезПоследних КАК ПоказателиМаркетинговыхПрограммСрезПоследних
	|ГДЕ
	|	ПоказателиМаркетинговыхПрограммСрезПоследних.МаркетинговаяПрограмма = &МаркетинговаяПрограмма
	|	И НЕ ПоказателиМаркетинговыхПрограммСрезПоследних.Отменена
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЕСТЬNULL(ПоАвто.МаркетинговаяПрограмма, ПоВариантуКомплектации.МаркетинговаяПрограмма) КАК МаркетинговаяПрограмма,
	|	ЕСТЬNULL(ПоАвто.Модель, ПоВариантуКомплектации.Модель) КАК Модель,
	|	ЕСТЬNULL(ПоАвто.ВариантКомплектации, ПоВариантуКомплектации.ВариантКомплектации) КАК ВариантКомплектации,
	|	ЕСТЬNULL(ПоАвто.Автомобиль, ПоВариантуКомплектации.Автомобиль) КАК Автомобиль,
	|	ЕСТЬNULL(ПоАвто.РазмерБонуса, ПоВариантуКомплектации.РазмерБонуса) КАК РазмерБонуса,
	|	ЕСТЬNULL(ПоАвто.РазмерСкидки, ПоВариантуКомплектации.РазмерСкидки) КАК РазмерСкидки,
	|	ЕСТЬNULL(ПоАвто.РазмерБонусаРетро, ПоВариантуКомплектации.РазмерБонусаРетро) КАК РазмерБонусаРетро,
	|	ЕСТЬNULL(ПоАвто.РазмерБонусаТекущего, ПоВариантуКомплектации.РазмерБонусаТекущего) КАК РазмерБонусаТекущего,
	|	ЕСТЬNULL(ПоАвто.РазмерПерепродажи, ПоВариантуКомплектации.РазмерПерепродажи) КАК РазмерПерепродажи
	|ИЗ
	|	(ВЫБРАТЬ
	|		ВТ_Основа.МаркетинговаяПрограмма КАК МаркетинговаяПрограмма,
	|		ВТ_Основа.Модель КАК Модель,
	|		ВТ_Основа.ВариантКомплектации КАК ВариантКомплектации,
	|		ВТ_Основа.Автомобиль КАК Автомобиль,
	|		ВТ_Основа.РазмерБонуса КАК РазмерБонуса,
	|		ВТ_Основа.РазмерСкидки КАК РазмерСкидки,
	|		ВТ_Основа.РазмерБонусаРетро КАК РазмерБонусаРетро,
	|		ВТ_Основа.РазмерБонусаТекущего КАК РазмерБонусаТекущего,
	|		ВТ_Основа.РазмерПерепродажи КАК РазмерПерепродажи
	|	ИЗ
	|		ВТ_Основа КАК ВТ_Основа
	|	ГДЕ
	|		ВТ_Основа.Автомобиль = &Автомобиль) КАК ПоАвто,
	|	(ВЫБРАТЬ
	|		ВТ_Основа.МаркетинговаяПрограмма КАК МаркетинговаяПрограмма,
	|		ВТ_Основа.Модель КАК Модель,
	|		ВТ_Основа.ВариантКомплектации КАК ВариантКомплектации,
	|		ВТ_Основа.Автомобиль КАК Автомобиль,
	|		ВТ_Основа.РазмерБонуса КАК РазмерБонуса,
	|		ВТ_Основа.РазмерСкидки КАК РазмерСкидки,
	|		ВТ_Основа.РазмерБонусаРетро КАК РазмерБонусаРетро,
	|		ВТ_Основа.РазмерБонусаТекущего КАК РазмерБонусаТекущего,
	|		ВТ_Основа.РазмерПерепродажи КАК РазмерПерепродажи
	|	ИЗ
	|		ВТ_Основа КАК ВТ_Основа
	|	ГДЕ
	|		ВТ_Основа.ВариантКомплектации = &ВариантКомплектации) КАК ПоВариантуКомплектации,
	|	(ВЫБРАТЬ
	|		ВТ_Основа.МаркетинговаяПрограмма КАК МаркетинговаяПрограмма,
	|		ВТ_Основа.Модель КАК Модель,
	|		ВТ_Основа.ВариантКомплектации КАК ВариантКомплектации,
	|		ВТ_Основа.Автомобиль КАК Автомобиль,
	|		ВТ_Основа.РазмерБонуса КАК РазмерБонуса,
	|		ВТ_Основа.РазмерСкидки КАК РазмерСкидки,
	|		ВТ_Основа.РазмерБонусаРетро КАК РазмерБонусаРетро,
	|		ВТ_Основа.РазмерБонусаТекущего КАК РазмерБонусаТекущего,
	|		ВТ_Основа.РазмерПерепродажи КАК РазмерПерепродажи
	|	ИЗ
	|		ВТ_Основа КАК ВТ_Основа
	|	ГДЕ
	|		ВТ_Основа.Модель = &Модель) КАК ПоМодели";    
	//Иванченко 20260731 --		
	//Иванченко 20251226 --	
   	Запрос.УстановитьПараметр("Модель", Модель);   
	Запрос.УстановитьПараметр("ВариантКомплектации", ВариантКомплектации);   
	//Иванченко 20251109 --
	//Иванченко 20251106 --	
	
	Запрос.УстановитьПараметр("Автомобиль", Автомобиль);
	Запрос.УстановитьПараметр("МаркетинговаяПрограмма", МаркетинговаяПрограмма);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл 
		СтуктураВрем_ = Новый Структура();
		СтуктураВрем_.Вставить("РазмерСкидки",ВыборкаДетальныеЗаписи.РазмерСкидки);
		СтуктураВрем_.Вставить("РазмерБонуса",ВыборкаДетальныеЗаписи.РазмерБонуса);
		СтуктураВрем_.Вставить("РазмерБонусаРетро",ВыборкаДетальныеЗаписи.РазмерБонусаРетро);
		СтуктураВрем_.Вставить("РазмерБонусаТекущего",ВыборкаДетальныеЗаписи.РазмерБонусаТекущего);
		СтуктураВрем_.Вставить("РазмерПерепродажи",ВыборкаДетальныеЗаписи.РазмерПерепродажи);
	КонецЦикла;
	
	Возврат СтуктураВрем_;
	
КонецФункции // ПолучитьСкидкуИБонусСпецпрограмма(Автомобиль,МаркетинговаяПрограмма)
//Бондаренко-- 20250611

//Бондаренко++ 20230824	
Процедура СМГ_ПересчетПоказателей(ЭтаФорма) Экспорт 
	
	Попытка
		ЭтаФорма.ЭлементыФормы.СуммаПродажи.ТолькоПросмотр = Ложь;
		ЭтаФорма.ЭлементыФормы.СчетИлиАвтоВКредит.ТолькоПросмотр = Ложь;
		ЭтаФорма.ЭлементыФормы.ДКПАвто.ТолькоПросмотр = Ложь;
	Исключение
	КонецПопытки;
	
	//Бондаренко++ 20240205
	Попытка
		ЭтаФорма.ЭлементыФормы.КомпенсацияРетроспективная.Значение = Формат(КомпенсацияТрейдИНРетроспективная + КомпенсацияСубсидияКредитРетроспективная + 
		КомпенсацияПоПрограммамЛояльностиРетроспективная + КомпенсацияРозничнаяРетроспективная,"ЧЦ=15; ЧДЦ=2");
		ЭтаФорма.ЭлементыФормы.КомпенсацияВИнвойсе.Значение = Формат(КомпенсацияТрейдИНВИнВойсеСледующегоАвтомобиля + КомпенсацияСубсидияКредитВИнВойсеСледующегоАвтомобиля + 
		КомпенсацияПоПрограммамЛояльностиВИнВойсеСледующегоАвтомобиля + КомпенсацияРозничнаяВИнВойсеСледующегоАвтомобиля,"ЧЦ=15; ЧДЦ=2"); 
		ЭтаФорма.ЭлементыФормы.КомпенсацияРетроспективная.Значение = Формат(КомпенсацияТрейдИНРетроспективная + КомпенсацияТрейдИН2Ретроспективная + КомпенсацияСубсидияКредитРетроспективная + 
		КомпенсацияПоПрограммамЛояльностиРетроспективная + КомпенсацияРозничнаяРетроспективная,"ЧЦ=15; ЧДЦ=2");
		ЭтаФорма.ЭлементыФормы.КомпенсацияВИнвойсе.Значение = Формат(КомпенсацияТрейдИНВИнВойсеСледующегоАвтомобиля + КомпенсацияТрейдИН2ВИнВойсеСледующегоАвтомобиля + КомпенсацияСубсидияКредитВИнВойсеСледующегоАвтомобиля + 
		КомпенсацияПоПрограммамЛояльностиВИнВойсеСледующегоАвтомобиля + КомпенсацияРозничнаяВИнВойсеСледующегоАвтомобиля,"ЧЦ=15; ЧДЦ=2");
	Исключение
	КонецПопытки;
	//Бондаренко-- 20240205
	                                            
	//Бондаренко++ 20240123
	Если ВидОплаты <> Перечисления.ВидыОплаты.ПроизвольнаяОплата Тогда
		Если ТипЗНЧ(Контрагент) = Тип("СправочникСсылка.Контрагенты") Тогда
			Если ТипЗНЧ(Автомобиль) = Тип("СправочникСсылка.Автомобили") Тогда
				//Если (Контрагент.ФормаСобственности = Перечисления.ФормыСобственности.ЧастноеЛицо) Тогда
				//Бондаренко-- 20240123
				//Бондаренко++ 20240904
				//СуммаПродажи = РРЦ - СкидкаТрейдИнФакт - СкидкаСубсидияКредитФакт - СкидкаПоПрограммамЛояльности - СкидкаРозничная - СкидкаАвтоЦентра + ПредоплатаТО + СтоимостьДОФакт;
				//Бондаренко++ 20250322
				//СуммаПродажи = РРЦ - СкидкаТрейдИнФакт - СкидкаСубсидияКредитФакт - СкидкаПоПрограммамЛояльности - СкидкаРозничная - СкидкаАвтоЦентра - СкидкаДополнительная + ПредоплатаТО + СтоимостьДОФакт;
				СуммаПродажи = РРЦ - СкидкаТрейдИнФакт - СкидкаТрейдИн2Факт - СкидкаСубсидияКредитФакт - СкидкаПоПрограммамЛояльности - СкидкаРозничная - СкидкаАвтоЦентра - СкидкаДополнительная + ПредоплатаТО + СтоимостьДОФакт;
				//Бондаренко-- 20250322
				//Бондаренко-- 20240904
				Если ВидОплаты = Перечисления.ВидыОплаты.Кредит Тогда
					СчетИлиАвтоВКредит = СуммаПродажи - СуммаПредоплаты;
					Кредит = Истина;
				Иначе	
					СчетИлиАвтоВКредит = 0; 
					Кредит = Ложь;
				КонецЕсли;  
				
				//Иванченко 20251127 ++  
				СтруктураОтбораНА = Новый Структура("Автомобиль, ВидЗначения", Автомобиль, Перечисления.ВидАвтомобиля.Новый);
				РезультатНА = РегистрыСведений.Автомобили.ПолучитьПоследнее(Дата, СтруктураОтбораНА).Количество();
				
				Если РезультатНА > 0 
					И ЕстьДиректоваяПрограмма И (Автомобиль.Модель.Марка = Справочники.Марка.HAVAL
					ИЛИ Автомобиль.Модель.Марка = Справочники.Марка.CHERY
					ИЛИ Автомобиль.Модель.Марка = Справочники.Марка.TENET
					ИЛИ Автомобиль.Модель.Марка = Справочники.Марка.EXEED
					ИЛИ Автомобиль.Модель.Марка = Справочники.Марка.OMODA
					ИЛИ Автомобиль.Модель.Марка = Справочники.Марка.JAECOO)Тогда
					//Иванченко 20251209 ++
					//Параметр_ЗННаДО = ?(СтоимостьДОФакт < СкидкаРозничная, 0, СтоимостьДОФакт - СкидкаРозничная);  
					Параметр_ЗННаДО = ?(СтоимостьДОФакт < СкидкаРозничная + СкидкаДополнительная, 0, СтоимостьДОФакт - СкидкаРозничная - СкидкаДополнительная); 					
					//Иванченко 20251209 --					
				Иначе
					Параметр_ЗННаДО = 0; 
				КонецЕсли;
				//Иванченко 20251127 -- 
				
				//Иванченко 20260226 ++
				//Если РеализацияПоОдномуДоговору Тогда                       
				//	//Бондаренко++ 20240312
				//	//ДКПавто = СуммаПродажи - ПредоплатаТО;   
				//	//Иванченко 20251127 ++
				//	//ДКПавто = СуммаПродажи - ПредоплатаТО - СуммаКомпенсации;  
				//	ДКПавто = СуммаПродажи - ПредоплатаТО - СуммаКомпенсации - Параметр_ЗННаДО;  
				//	//Иванченко 20251127 --
				//	//Бондаренко-- 20240312
				//Иначе
				//	//Иванченко 20251127 ++
				//	//ДКПавто = СуммаПродажи - СебестоимостьДО - ПредоплатаТО; 
				//	ДКПавто = СуммаПродажи - СебестоимостьДО - ПредоплатаТО - Параметр_ЗННаДО;  
				//	//Иванченко 20251127 --
				//КонецЕсли; 
				
				Параметр_СебестоимостьДОКоммерция = СМГ_ПолучитьСебестоимостьДОКоммерции(Автомобиль, ДатаПоследнегоПоступления, ДатаРеализацииАвтомобиля); 
               	//Иванченко 20260301 ++
				//Если РеализацияПоОдномуДоговору Тогда                       
				//	ДКПавто = СуммаПродажи - ПредоплатаТО - СуммаКомпенсации - Параметр_ЗННаДО + Параметр_СебестоимостьДОКоммерция;  
				//Иначе
				//	ДКПавто = СуммаПродажи - СебестоимостьДО - ПредоплатаТО - Параметр_ЗННаДО + Параметр_СебестоимостьДОКоммерция;  
				//КонецЕсли; 
				
				Если РеализацияПоОдномуДоговору Тогда                       
					ДКПавто = СуммаПродажи - ПредоплатаТО - СуммаКомпенсации - Параметр_ЗННаДО;  
				Иначе
					ДКПавто = СуммаПродажи - СебестоимостьДО - ПредоплатаТО - Параметр_ЗННаДО;  
				КонецЕсли; 	
				//Иванченко 20260301 --				
				//Иванченко 20260226 --
				
				Попытка
					ЭтаФорма.ЭлементыФормы.СуммаПродажи.ТолькоПросмотр = Истина;
					ЭтаФорма.ЭлементыФормы.СчетИлиАвтоВКредит.ТолькоПросмотр = Истина;
					ЭтаФорма.ЭлементыФормы.ДКПАвто.ТолькоПросмотр = Истина;
				Исключение
				КонецПопытки;
				ТекстПредупреждения = "";
				Если СуммаПродажи <> Ссылка.СуммаПродажи Тогда
					ТекстПредупреждения = ?(ТекстПредупреждения <> "",ТекстПредупреждения+Символы.ПС,ТекстПредупреждения);
					ТекстПредупреждения = ТекстПредупреждения+"Реквизит ""Фактическая цена"" изменён с "+Ссылка.СуммаПродажи+" руб. на "+СуммаПродажи+" руб. ";	 
				КонецЕсли;
				Если СчетИлиАвтоВКредит <> Ссылка.СчетИлиАвтоВКредит Тогда
					ТекстПредупреждения = ?(ТекстПредупреждения <> "",ТекстПредупреждения+Символы.ПС,ТекстПредупреждения);
					ТекстПредупреждения = ТекстПредупреждения+"Реквизит ""Счет или авто в кредит"" изменён с "+Ссылка.СчетИлиАвтоВКредит+" руб. на "+СчетИлиАвтоВКредит+" руб. ";
				КонецЕсли;
				Если ДКПавто <> Ссылка.ДКПавто Тогда
					ТекстПредупреждения = ?(ТекстПредупреждения <> "",ТекстПредупреждения+Символы.ПС,ТекстПредупреждения);
					ТекстПредупреждения = ТекстПредупреждения+"Реквизит ""ДКП авто"" изменён с "+Ссылка.ДКПавто+" руб. на "+ДКПавто+" руб.";
				КонецЕсли;                                        
				Если ТекстПредупреждения <> "" Тогда
					//СМГ_Предупреждение(ТекстПредупреждения,0,"Внимание");
					//ЭтаФорма.Модифицированность = Истина;
				Иначе
					//ЭтаФорма.Модифицированность = Ложь;
				КонецЕсли;             
				//Бондаренко++ 20231117
				//СтоимостьЗНДО = СебестоимостьДО;                           
				//Бондаренко-- 20231117
				//Бондаренко++ 20230907
				Если Не обЗначениеНеЗаполнено(ДоговорВзаиморасчетов) Тогда
					ПредоплатаЗаАМ = ПолучитьПредоплату(ДоговорВзаиморасчетов);
				КонецЕсли;             
				//Бондаренко-- 20230907
				//Бондаренко++ 20250528
				Если ВидОплаты=Перечисления.ВидыОплаты.Лизинг Тогда
					СуммаАВЛизинг_ = ПроцентАВЛизинг * ДКПавто / 100;
					Если СуммаАВЛизинг <> СуммаАВЛизинг_ Тогда
						СуммаАВЛизинг = СуммаАВЛизинг_;
					КонецЕсли;
				КонецЕсли;
				//Бондаренко++ 20250528
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	//Бондаренко++ 20231229
	Если НЕ обЗначениеНеЗаполнено(Автомобиль) Тогда
		Инвойс_ = СМГ_ПолучитьИнвойсПоОстаткуНаСкладе(Автомобиль);
	КонецЕсли;
	//Бондаренко-- 20231229
	
КонецПроцедуры // СМГ_ПересчетПоказателей(ЭтаФорма) 

//Бондаренко++ 20230907
Функция ПолучитьПредоплату(ДоговорВзаиморасчетов)
	
	СуммаОстаток = 0;
	
	Запрос = Новый Запрос;
	
	Запрос.Текст = "ВЫБРАТЬ
	|	-СУММА(ВзаиморасчетыКомпанииОстатки.СуммаОстаток) КАК СуммаОстаток,
	|	ВзаиморасчетыКомпанииОстатки.ДоговорВзаиморасчетов КАК ДоговорВзаиморасчетов
	|ИЗ
	|	РегистрНакопления.ВзаиморасчетыКомпании.Остатки КАК ВзаиморасчетыКомпанииОстатки
	|ГДЕ
	|	ВзаиморасчетыКомпанииОстатки.ДоговорВзаиморасчетов = &ДоговорВзаиморасчетов
	|
	|СГРУППИРОВАТЬ ПО
	|	ВзаиморасчетыКомпанииОстатки.ДоговорВзаиморасчетов";
	
	Запрос.УстановитьПараметр("ДоговорВзаиморасчетов",ДоговорВзаиморасчетов);
	
	ТЗ = Запрос.Выполнить().Выгрузить();
	
	Если ТЗ.Количество() > 0 Тогда
		СуммаОстаток = ТЗ.Итог("СуммаОстаток");
	КонецЕсли; 
	
	Возврат СуммаОстаток;	
	
КонецФункции // ПолучитьПредоплату(Договор)
//Бондаренко-- 20230907

//Бондаренко++ 20230824	

// Функция возвращает сотрудника на основании переданного пользователя
//
Функция ПолучитьСотрудникаПоПользователю(ТекущийПользователь) Экспорт
	ТекущийСотрудник	= Справочники.Сотрудники.ПустаяСсылка();
	
	Если НЕ обЗначениеНеЗаполнено(ТекущийПользователь) И НЕ ПустаяСтрока(ТекущийПользователь.Наименование) Тогда
		Если обЗначениеНеЗаполнено(ТекущийПользователь.Сотрудник) Тогда
			ТекущийСотрудник	= Справочники.Сотрудники.НайтиПоНаименованию(ТекущийПользователь.Наименование, Истина);
			Если обЗначениеНеЗаполнено(ТекущийСотрудник) Тогда
				// Создадим нового сотрудника
				СотрудникОбъект	= Справочники.Сотрудники.СоздатьЭлемент();
				СотрудникОбъект.УстановитьНовыйКод();
				СотрудникОбъект.Наименование	= ТекущийПользователь.Наименование;
				СотрудникОбъект.Организация= ПараметрыСеанса.Организация;
				СотрудникОбъект.Подразделение	= ПараметрыСеанса.ПодразделениеКомпании;
				СотрудникОбъект.Должность		= Справочники.Должности.Неопределена;
				Попытка
					СотрудникОбъект.Записать();
					ТекущийСотрудник	= СотрудникОбъект.Ссылка;
				Исключение КонецПопытки;
			КонецЕсли;
		Иначе
			ТекущийСотрудник	= ТекущийПользователь.Сотрудник;
		КонецЕсли;
	КонецЕсли;
	
	Возврат ТекущийСотрудник;
КонецФункции

//////////////////////////////////////////////////////////////////////////
#Если Клиент Тогда
	// НАЧАЛО кода модуля клиента
	
	// Функция возвращает данные о контактах с клиентом
	//
	Функция ПолучитьДанныеОКонтактах(Режим=1, ТолькоОднаЗапись=Истина,ВидСобытия=Неопределено) Экспорт
		Возврат зфРабочийЛистПолучитьДанныеОКонтактах(ЭтотОбъект,Режим,ТолькоОднаЗапись,ВидСобытия);
	КонецФункции
	
	// Расчет общей балансовой стоимости активов
	//
	// Возвращаемое значение:
	//  СуммаВсего - число - итог по колонке "БалансоваяСтоимость".
	//
	Функция РассчитатьСуммуВсего() Экспорт
		// Если выбран авто - то “Сумма продажи” включает опции,
		// если выбрана “Модель+Вариант комплектации” - то “Сумма продажи” не включает сумму опций
		Если (НЕ обЗначениеНеЗаполнено(Модель)) И (НЕ обЗначениеНеЗаполнено(ВариантКомплектации)) Тогда
			СуммаВсего = СуммаПродажи+Опции.Итог("СуммаВсего");
		Иначе
			СуммаВсего = СуммаПродажи;
		КонецЕсли;
		Возврат СуммаВсего;
	КонецФункции // РассчитатьСуммуВсего()
	
	// Выводит сумму по табличной части документа
	//
	// Параметры:
	// ЭтаФорма - форма, форма документа
	//
	Процедура ВывестиЗаголовокСуммаДокумента(ЭтаФорма) Экспорт
		
		Попытка
			ВремСумма = РассчитатьСуммуВсего();
		Исключение
			ВремСумма	= 0;
		КонецПопытки;
		
		// обновим надпись валюты и суммы документа
		ТекстВалюта = "";
		Попытка	
			ТекстВалюта = "Валюта: " + СокрЛП(ЭтаФорма.ВалютаДокумента) + " (" + Формат(ЭтаФорма.КурсДокумента,"ЧДЦ = 4") + ")";
			Попытка
				Если ВремСумма <> Неопределено Тогда
					ТекстСумма = " ИТОГО: " + Формат(ВремСумма,"ЧДЦ = 2; ЧН = 0,00");
				КонецЕсли; 
			Исключение
			КонецПопытки;
			ЭтаФорма.ЭлементыФормы.тСуммаДокумента.Заголовок = ТекстВалюта + ТекстСумма;
		Исключение 
		КонецПопытки;
		
		// здесь же установим подписи количества строк в заголовках страниц основной панели
		ТекстЦена = ""; ТекстСкидка = "";
		Попытка
			ТекстЦена = ?(обЗначениеНеЗаполнено(ЭтаФорма.ТипЦен)," < не указан > ",СокрЛП(ЭтаФорма.ТипЦен.Наименование));
		Исключение КонецПопытки;
		ТекстСкидка = "";
		
		Мет = ЭтаФорма.ЭтотОбъект.Метаданные();
		Для Каждого ТаблЧасть Из Мет.ТабличныеЧасти Цикл
			Попытка ЭтаФорма.ЭлементыФормы.ОсновнаяПанель.Страницы[ТаблЧасть.Имя].Заголовок = СокрЛП(ТаблЧасть.Синоним) + " (" + СокрЛП(ЭтаФорма[ТаблЧасть.Имя].Количество()) + " поз.)"; Исключение КонецПопытки;
			// и тут же попытаемся установить текст подвала для колоники "Номенклатура"
			Попытка
				ЭтаФорма.ЭлементыФормы[ТаблЧасть.Имя].Колонки.Цена.ТекстПодвала = ТекстЦена;
			Исключение КонецПопытки;
			Попытка
				ЭтаФорма.ЭлементыФормы[ТаблЧасть.Имя].Колонки.Номенклатура.ТекстПодвала = ?(ПустаяСтрока(ТекстСкидка),"",ТекстСкидка);
			Исключение КонецПопытки;
		КонецЦикла; 
	КонецПроцедуры // ВывестиЗаголовокСуммаДокумента()
	
	////////////////////////////////////////////////////////////////////////////////
	// ЭКСПОРТНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ ПЕЧАТИ ДОКУМЕНТА +++++
	
	// Формирует печатную форму "РабочийЛист"
	// Возвращает сформированный табличный документ:
	Функция ПечатьРабочийЛист(ТабДокумент) Экспорт
		// Предварительные обработки данных
		
		//валюта печати	
		ВалютаПечатногоДокумента = зфВыборВалютыПечатногоДокумента(ЭтотОбъект);
		Если ВалютаПечатногоДокумента = Неопределено Тогда
			Возврат Неопределено;
		КонецЕсли;
		КоэффициентПересчета = обПересчет(1, ЭтотОбъект.ВалютаДокумента, ЭтотОбъект.КурсДокумента, ВалютаПечатногоДокумента, ЭтотОбъект.Дата);
		
		// приступим к печати
		Макет = ПолучитьМакет("РабочийЛист");
		
		//зададим параметры макета
		ТабДокумент.ПолеСверху = 0;
		ТабДокумент.ПолеСлева  = 0;
		ТабДокумент.ПолеСнизу  = 0;
		ТабДокумент.ПолеСправа = 0;
		//ТабДокумент.ТолькоПросмотр = Истина;
		ТабДокумент.ОриентацияСтраницы = ОриентацияСтраницы.Портрет;
		
		ФорматВыводаСуммы = обПраво("ФорматВыводаСуммы",Права,,ЭтотОбъект);
		
		//получим адрес электронной почты
		Если ТипЗнч(Контрагент)=Тип("СправочникСсылка.Контрагенты") И НЕ обЗначениеНеЗаполнено(Контрагент) Тогда
			НаборЗаписей = РегистрыСведений.КонтактнаяИнформация.СоздатьНаборЗаписей(); 	
			НаборЗаписей.Отбор.Объект.Значение      = Контрагент;
			НаборЗаписей.Отбор.Объект.Использование = Истина;
			НаборЗаписей.Прочитать();
			
			ТаблицаКИ	= НаборЗаписей.Выгрузить();
			МассивОсновныхТелефонов=ТаблицаКИ.НайтиСтроки(Новый Структура("Объект,Тип",Контрагент,Перечисления.ТипыКонтактнойИнформации.АдресЭлектроннойПочты));
			Если МассивОсновныхТелефонов.Количество()>0 Тогда
				АдресЭП = МассивОсновныхТелефонов[0].Представление;
				Для Каждого ТекСтрока Из МассивОсновныхТелефонов Цикл
					Если ТекСтрока.ЗначениеПоУмолчанию Тогда
						АдресЭП = ТекСтрока.Представление;	
					КонецЕсли;
				КонецЦикла
			КонецЕсли;
		КонецЕсли;
		
		//вывод заголовка документа
		ОбластьМакета							= Макет.ПолучитьОбласть("Заголовок");
		ОбластьМакета.Параметры.Заполнить(ЭтотОбъект);
		ОбластьМакета.Параметры.ВалютаДокумента	= ВалютаПечатногоДокумента;
		ОбластьМакета.Параметры.ТекстЗаголовка	= дкПолучитьПредставление(ЭтотОбъект);
		
		//фирма, адрес и телефон
		ОбластьМакета.Параметры.ФирмаПолноеНаименование = спПолучитьНаименование(Организация);
		ОбластьМакета.Параметры.ФирмаАдресЮридический = киПолучитьПредставлениеКИ(ПодразделениеКомпании, Справочники.ВидыКонтактнойИнформации.АдресЮридический);
		Если ПустаяСтрока(СокрЛП(ОбластьМакета.Параметры.ФирмаАдресЮридический)) Тогда
			ОбластьМакета.Параметры.ФирмаАдресЮридический = киПолучитьПредставлениеКИ(Организация, Справочники.ВидыКонтактнойИнформации.АдресЮридический);
		КонецЕсли;
		ОбластьМакета.Параметры.ФирмаТелефоны = киПолучитьПредставлениеКИ(ПодразделениеКомпании, Справочники.ВидыКонтактнойИнформации.ТелефонРабочий);
		Если ПустаяСтрока(СокрЛП(ОбластьМакета.Параметры.ФирмаТелефоны)) Тогда
			ОбластьМакета.Параметры.ФирмаТелефоны = киПолучитьПредставлениеКИ(Организация, Справочники.ВидыКонтактнойИнформации.ТелефонРабочий);
		КонецЕсли;	
		
		//Клиент
		ОбластьМакета.Параметры.Менеджер				= Строка(Менеджер);
		ОбластьМакета.Параметры.ДатаДокумента			= Формат(Дата, "ДЛФ=DD");
		ОбластьМакета.Параметры.ПредполагаемыйСрок		= ?(обЗначениеНеЗаполнено(ПредполагаемыйСрок),"неопределен",ПредполагаемыйСрок);
		Если ТипЗнч(Контрагент) = Тип("СправочникСсылка.Контрагенты") Тогда
			ОбластьМакета.Параметры.НаименованиеКлиента		= Контрагент.Наименование;
		ИначеЕсли ТипЗнч(Контрагент) = Тип("Строка") Тогда
			ОбластьМакета.Параметры.НаименованиеКлиента		= Контрагент;
		КонецЕсли;
		ОбластьМакета.Параметры.КонтактныйТелефон		= ПредставлениеТелефона;
		ОбластьМакета.Параметры.ЭлектроннаяПочта		= АдресЭП;
		ОбластьМакета.Параметры.ПредыдущееАвто 			= МодельТрейдИн;
		
		//Автомобиль
		ОбластьМакета.Параметры.Заполнить(ВариантКомплектации);	
		ОбластьМакета.Параметры.Модель					= спПолучитьНаименование(Модель);
		ОбластьМакета.Параметры.ВариантКомплектации 	= спПолучитьНаименование(ВариантКомплектации);
		ОбластьМакета.Параметры.Цвет					= спПолучитьНаименование(Цвет);
		ОбластьМакета.Параметры.Интерьер				= спПолучитьНаименование(Интерьер);
		
		//ОбластьМакета.Параметры.СуммаПродажи			= Формат(СуммаПродажи * КоэффициентПересчета, ?(НЕ ПустаяСтрока(ФорматВыводаСуммы),ФорматВыводаСуммы,ФорматВыводаСуммы + "ЧДЦ=2; ЧН=0,00"));
		ОтображатьСуммуЗакупкиВРабочемЛисте	= обПраво("ОтображатьСуммуЗакупкиВРабочемЛисте",Права);
		Если ОтображатьСуммуЗакупкиВРабочемЛисте Тогда
			ОбластьМакета.Параметры.СуммаЗакупки		= Формат(СуммаЗакупки * КоэффициентПересчета, ?(НЕ ПустаяСтрока(ФорматВыводаСуммы),ФорматВыводаСуммы,ФорматВыводаСуммы + "ЧДЦ=2; ЧН=0,00"));
		КонецЕсли;
		
		//базовое оборудование автомобиля
		ТекстЗапроса = "ВЫБРАТЬ
		|	ОпцииВариантовКомплектации.Опция КАК Опция,
		|	ОпцииВариантовКомплектации.Количество КАК Количество
		|ИЗ
		|	РегистрСведений.ОпцииВариантовКомплектации КАК ОпцииВариантовКомплектации
		|ГДЕ
		|	ОпцииВариантовКомплектации.ВариантКомплектации = &ВариантКомплектации
		|	И ОпцииВариантовКомплектации.ВидВключения = &ВидВключения";
		Запрос = Новый Запрос(ТекстЗапроса);
		Запрос.УстановитьПараметр("ВариантКомплектации", ВариантКомплектации);
		Запрос.УстановитьПараметр("ВидВключения", 2);
		
		Выборка = Запрос.Выполнить().Выбрать();	СтрокаДопОборудования = "";
		Пока Выборка.Следующий() Цикл
			СтрокаДопОборудования = СтрокаДопОборудования + спПолучитьНаименование(Выборка.Опция) + ?(Выборка.Количество = 0,"","("+Выборка.Количество+")") + " ,";
		КонецЦикла;
		ОбластьМакета.Параметры.СписокБазовогоОборудования = Лев(СтрокаДопОборудования, СтрДлина(СтрокаДопОборудования) - 2);
		
		ТабДокумент.Вывести(ОбластьМакета);
		
		// Выводим представления и расшифровки подписей
		ОбластьМакета = Макет.ПолучитьОбласть("Подписи");
		ТабДокумент.Вывести(ОбластьМакета);
		
		ТабДокумент.Автомасштаб = Истина;
		
		Возврат ТабДокумент;
	КонецФункции
	
	// Формирует печатную форму "РабочийЛистЗвонка"
	// Возвращает сформированный табличный документ:
	Функция ПечатьРабочийЛистЗвонка(ТабДокумент) Экспорт
		
		// приступим к печати
		Макет = ПолучитьМакет("РабочийЛистЗвонка");
		
		ФорматВыводаСуммы = обПраво("ФорматВыводаСуммы",Права,,ЭтотОбъект);
		
		//вывод заголовка документа
		ОбластьМакета							= Макет.ПолучитьОбласть("Заголовок");
		ОбластьМакета.Параметры.Заполнить(ЭтотОбъект);
		ОбластьМакета.Параметры.ОрганизацияПредставление	= спПолучитьПредставление(Организация);
		ОбластьМакета.Параметры.ДатаДокумента				= Формат(Дата, "ДЛФ=DDT");
		ДатаЧас	= Час(Дата);
		Если ДатаЧас>=12 И ДатаЧас<18 Тогда
			ВремяСуток	= "Добрый день!";
		ИначеЕсли ДатаЧас>=18 И ДатаЧас<24 Тогда
			ВремяСуток	= "Добрый вечер!";
		Иначе
			ВремяСуток	= "Доброе утро!";
		КонецЕсли;	
		ОбластьМакета.Параметры.ВремяСуток				= ВремяСуток;
		
		ТабДокумент.Вывести(ОбластьМакета);
		
		// Выводим представления и расшифровки подписей
		ОбластьМакета = Макет.ПолучитьОбласть("Подписи");
		
		ТабДокумент.Вывести(ОбластьМакета);
		
		Возврат ТабДокумент;
	КонецФункции
	
	// Формирует печатную форму "РабочийЛистВстречи"
	// Возвращает сформированный табличный документ:
	Функция ПечатьРабочийЛистВстречи(ТабДокумент) Экспорт
		
		// приступим к печати
		Макет = ПолучитьМакет("РабочийЛистВстречи");
		
		ФорматВыводаСуммы = обПраво("ФорматВыводаСуммы",Права,,ЭтотОбъект);
		
		//вывод заголовка документа
		ОбластьМакета							= Макет.ПолучитьОбласть("Заголовок");
		ОбластьМакета.Параметры.Заполнить(ЭтотОбъект);
		ОбластьМакета.Параметры.ОрганизацияПредставление	= спПолучитьПредставление(Организация);
		ОбластьМакета.Параметры.ДатаДокумента				= Формат(Дата, "ДЛФ=DD");
		ОбластьМакета.Параметры.ДатаВремя					= Формат(Дата, "ДЛФ=T");
		
		// Клиент
		Если обЗначениеНеЗаполнено(Контрагент) Тогда
			ОбластьМакета.Параметры.КонтрагентФамилия	= "";	
		Иначе
			Если ТипЗнч(Контрагент) = Тип("СправочникСсылка.Контрагенты") Тогда
				ОбластьМакета.Параметры.КонтрагентИмя		= Контрагент.Имя;
				ОбластьМакета.Параметры.КонтрагентФамилия	= Контрагент.Фамилия;
				ОбластьМакета.Параметры.КонтрагентОтчество	= Контрагент.Отчество;
				ОбластьМакета.Параметры.КонтрагентАдрес		= спПолучитьПредставление(Контрагент, Новый Структура("АдресФактический",""));
				ОбластьМакета.Параметры.КонтрагентТелефон	= спПолучитьПредставление(Контрагент, Новый Структура("ТелефонРабочий",""));
			ИначеЕсли ТипЗнч(Контрагент) = Тип("Строка") Тогда
				ОбластьМакета.Параметры.КонтрагентФамилия	= Контрагент;
			КонецЕсли;
		КонецЕсли;
		
		// Автомобиль
		ОбластьМакета.Параметры.Заполнить(ВариантКомплектации);	
		ОбластьМакета.Параметры.Модель					= спПолучитьНаименование(Модель);
		ОбластьМакета.Параметры.Цвет					= спПолучитьНаименование(Цвет);
		ОбластьМакета.Параметры.АвтомобильТипКузова		= спПолучитьНаименование(ВариантКомплектации.ТипКузова);
		ОбластьМакета.Параметры.АвтомобильТипДвигателя	= спПолучитьНаименование(ВариантКомплектации.ТипДвигателя);
		ОбластьМакета.Параметры.АвтомобильТипКПП		= спПолучитьНаименование(ВариантКомплектации.ТипКПП);
		
		Если НЕ обЗначениеНеЗаполнено(ВариантКомплектации.ТипДвигателя) И
			НЕ обЗначениеНеЗаполнено(ВариантКомплектации.ТипДвигателя.ОбъемДвигателя) Тогда
			ОбластьМакета.Параметры.АвтомобильДвигательОбъем	= Строка(ВариантКомплектации.ТипДвигателя.ОбъемДвигателя);
		КонецЕсли;
		
		ТабДокумент.Вывести(ОбластьМакета);
		
		// Выводим представления и расшифровки подписей
		ОбластьМакета = Макет.ПолучитьОбласть("Подписи");
		
		ТабДокумент.Вывести(ОбластьМакета);
		
		Возврат ТабДокумент;
	КонецФункции
	
	// Формирует печатную форму "КоммерческоеПредложение"
	// Возвращает сформированный табличный документ:
	Функция ПечатьКоммерческоеПредложение(ТабДокумент) Экспорт
		// Предварительные обработки данных
		
		//валюта печати	
		ВалютаПечатногоДокумента = зфВыборВалютыПечатногоДокумента(ЭтотОбъект);
		Если ВалютаПечатногоДокумента = Неопределено Тогда
			Возврат Неопределено;
		КонецЕсли;
		КоэффициентПересчета = обПересчет(1, ЭтотОбъект.ВалютаДокумента, ЭтотОбъект.КурсДокумента, ВалютаПечатногоДокумента, ЭтотОбъект.Дата);
		
		// приступим к печати
		Макет = ПолучитьМакет("КоммерческоеПредложение");
		
		//для начала настроим макет
		ОбластьТовар = Макет.Область("Товар");
		
		//определяем есть ли скидки
		ОбластьСкидка = Макет.Область("Скидка");
		ОбластьТовар.ШиринаКолонки = ОбластьТовар.ШиринаКолонки + ОбластьСкидка.ШиринаКолонки;
		Макет.УдалитьОбласть(ОбластьСкидка,ТипСмещенияТабличногоДокумента.ПоВертикали);
		
		ЕстьКод = обПраво("ВыводитьКодВПечатныхФормах",Права,,ЭтотОбъект);
		//если код не выводим
		Если НЕ ЕстьКод Тогда
			ОбластьКод = Макет.Область("Код");
			ОбластьТовар.ШиринаКолонки = ОбластьТовар.ШиринаКолонки + ОбластьКод.ШиринаКолонки;
			Макет.УдалитьОбласть(ОбластьКод,ТипСмещенияТабличногоДокумента.ПоВертикали);		
		КонецЕсли;
		
		ОбластьЗаголовокТаблицы = Макет.ПолучитьОбласть("ЗаголовокТаблицы");	
		ФорматВыводаСуммы = обПраво("ФорматВыводаСуммы",Права,,ЭтотОбъект);
		
		//вывод заголовка документа
		ОбластьМакета = Макет.ПолучитьОбласть("Заголовок");
		ОбластьМакета.Параметры.Заполнить(ЭтотОбъект);
		ОбластьМакета.Параметры.ВалютаДокумента = ВалютаПечатногоДокумента;
		ТекстЗаголовка							= "Коммерческое предложение"; //дкПолучитьПредставление(ЭтотОбъект);
		ОбластьМакета.Параметры.ТекстЗаголовка	= ТекстЗаголовка;
		ОбластьМакета.Параметры.ОрганизацияПредставление	= спПолучитьПредставление(Организация);
		
		//контрагент
		ОбластьМакета.Параметры.КонтрагентПредставление	= спПолучитьПредставление(Контрагент);
		ОбластьМакета.Параметры.ПредполагаемыйСрок		= ?(обЗначениеНеЗаполнено(ПредполагаемыйСрок),"неопределен",ПредполагаемыйСрок);
		
		//автомобиль
		ОбластьМакета.Параметры.Заполнить(ВариантКомплектации);	
		ОбластьМакета.Параметры.Модель					= спПолучитьНаименование(Модель);
		ОбластьМакета.Параметры.ВариантКомплектации 	= спПолучитьНаименование(ВариантКомплектации);
		ОбластьМакета.Параметры.Цвет					= спПолучитьНаименование(Цвет);
		ОбластьМакета.Параметры.АвтомобильТипКузова		= спПолучитьНаименование(ВариантКомплектации.ТипКузова);
		ОбластьМакета.Параметры.АвтомобильТипДвигателя	= спПолучитьНаименование(ВариантКомплектации.ТипДвигателя);
		ОбластьМакета.Параметры.АвтомобильТипКПП		= спПолучитьНаименование(ВариантКомплектации.ТипКПП);
		ОбластьМакета.Параметры.Интерьер				= спПолучитьНаименование(Интерьер);
		
		ОбластьМакета.Параметры.СуммаПродажи			= Формат(СуммаПродажи * КоэффициентПересчета, ?(НЕ ПустаяСтрока(ФорматВыводаСуммы),ФорматВыводаСуммы,ФорматВыводаСуммы + "ЧДЦ=2; ЧН=0,00"));
		
		//базовое оборудование автомобиля
		ТекстЗапроса = "ВЫБРАТЬ
		|	ОпцииВариантовКомплектации.Опция КАК Опция,
		|	ОпцииВариантовКомплектации.Количество КАК Количество
		|ИЗ
		|	РегистрСведений.ОпцииВариантовКомплектации КАК ОпцииВариантовКомплектации
		|ГДЕ
		|	ОпцииВариантовКомплектации.ВариантКомплектации = &ВариантКомплектации
		|	И ОпцииВариантовКомплектации.ВидВключения = &ВидВключения";
		Запрос = Новый Запрос(ТекстЗапроса);
		Запрос.УстановитьПараметр("ВариантКомплектации", ВариантКомплектации);
		Запрос.УстановитьПараметр("ВидВключения", 2);
		
		Выборка = Запрос.Выполнить().Выбрать();	СтрокаДопОборудования = "";
		Пока Выборка.Следующий() Цикл
			СтрокаДопОборудования = СтрокаДопОборудования + спПолучитьНаименование(Выборка.Опция) + ?(Выборка.Количество = 0,"","("+Выборка.Количество+")") + " ,";
		КонецЦикла;
		ОбластьМакета.Параметры.СписокБазовогоОборудования = Лев(СтрокаДопОборудования, СтрДлина(СтрокаДопОборудования) - 2);
		
		//вывод свойств
		СтрокаСвойств = дкПолучитьСтрокуСвойствДокумента(ЭтотОбъект);
		ОбластьМакета.Параметры.СтрокаСвойств = СтрокаСвойств;
		ТабДокумент.Вывести(ОбластьМакета);
		
		НомерСтраницы		= 2;
		НомерСтраницыПред	= НомерСтраницы;
		
		// Если выбран авто - то “Сумма продажи” включает опции,
		// если выбрана “Модель+Вариант комплектации” - то “Сумма продажи” не включает сумму опций
		ОпцииБезЦен	= Истина;	
		Если (НЕ обЗначениеНеЗаполнено(Модель)) И (НЕ обЗначениеНеЗаполнено(ВариантКомплектации)) Тогда
			ОпцииБезЦен	= Ложь;
		КонецЕсли;	
		
		//готовим области строки
		ОбластьМакета = Макет.ПолучитьОбласть("Строка"+?(ОпцииБезЦен,"БезЦены",""));
		
		ОбластьМакетаИтогоПоСтранице = Макет.ПолучитьОбласть("ИтогоПоСтранице");
		СтруктураИтоговПоСтранице = Новый Структура("ВалютаДокумента,СуммаНДС,СуммаВсего",ВалютаПечатногоДокумента,0,0);
		
		//пересчитаем ТЧ
		ЭтотОбъектОпции = Опции.Выгрузить();
		зфПерерасчетТаблицыТоваров(ЭтотОбъектОпции, ЭтотОбъект, ВалютаПечатногоДокумента);
		
		//дополнительные колонки для того чтобы замаскировать ТЧ Опции под ТЧ Товары
		ЭтотОбъектОпции.Колонки.Добавить("Номенклатура");
		ЭтотОбъектОпции.Колонки.Добавить("ЕдиницаИзмерения");
		ЭтотОбъектОпции.Колонки.Добавить("Коэффициент");
		
		//перебор строк
		ВыборкаТабличнойЧасти = ЭтотОбъектОпции;
		
		//теперь запишем параметры шапки
		ОбластьШапкаТаблицы = Макет.ПолучитьОбласть("ШапкаТаблицы"+?(ОпцииБезЦен,"БезЦены",""));
		Если ЕстьКод Тогда
			КолонкаКода = дкПолучитьПараметрыРежимаВыводаКодаВДокументах(,ЭтотОбъект);
			ОбластьШапкаТаблицы.Параметры.ИмяКолонкиКод = КолонкаКода.Синоним;
		КонецЕсли;
		
		Если НЕ ОпцииБезЦен Тогда
			//заполняем заголовок колонки НДС по типу цен
			ОбластьШапкаТаблицы.Параметры.НДС = "НДС";
			Если ТипЦен.ЦенаВключаетНДС Тогда	// Если НДС включен
				Если НЕ (ПодразделениеКомпании.ОсвобожденОтНДС ИЛИ Организация.ОсвобожденОтНДС) Тогда	// Однако не все организации - плательщики НДС
					ОбластьШапкаТаблицы.Параметры.НДС = "в т.ч. НДС";
				КонецЕсли; 
			КонецЕсли;
		КонецЕсли;
		
		Если ВыборкаТабличнойЧасти.Количество() > 0 Тогда 
			// ПЕЧАТЬ ТАБЛИЦЫ ОПЦИЙ
			//теперь выводим шапку
			ОбластьЗаголовокТаблицы.Параметры.ЗаголовокТаблицы = "Опции";
			ТабДокумент.Вывести(ОбластьЗаголовокТаблицы);
			ОбластьШапкаТаблицы.Параметры.ИмяКолонкиТовара = "Опции";
			ТабДокумент.Вывести(ОбластьШапкаТаблицы);
		КонецЕсли;
		
		ОбластьШапкаТаблицы.Параметры.НомерСтраницы = "Страница: " + НомерСтраницы;
		ОбластьШапкаТаблицы.Параметры.ТекстЗаголовка = ТекстЗаголовка;
		
		Для Каждого СтрокаТабличнойЧасти Из ВыборкаТабличнойЧасти Цикл
			//предварительная обработка
			СтрокаТабличнойЧасти.Номенклатура		= СтрокаТабличнойЧасти.Опция;
			СтрокаТабличнойЧасти.ЕдиницаИзмерения	= "";
			СтрокаТабличнойЧасти.Коэффициент		= 1;
			//заполняем данные строки
			СтруктураСтроки = дкПолучитьПредставлениеДанныхТоварнойСтроки(СтрокаТабличнойЧасти,ЭтотОбъект);
			ОбластьМакета.Параметры.Заполнить(СтруктураСтроки);
			
			//выводим строку, делая проверку попадания на лист
			НомерСтраницы = дкВывестиГоризонтальнуюОбласть(ТабДокумент, ОбластьМакета, ОбластьШапкаТаблицы, ОбластьМакетаИтогоПоСтранице, НомерСтраницы, СтруктураИтоговПоСтранице,ЭтотОбъект);
			
			//инициализация итогов по странице
			Если НомерСтраницы <> НомерСтраницыПред Тогда
				СтруктураИтоговПоСтранице = Новый Структура("ВалютаДокумента,СуммаСкидки,СуммаНДС,СуммаВсего",ВалютаПечатногоДокумента,0,0,0);
				НомерСтраницыПред							= НомерСтраницы;
				ОбластьШапкаТаблицы.Параметры.НомерСтраницы	= "Страница: " + НомерСтраницы; 
			КонецЕсли;
			
			Если НЕ ОпцииБезЦен Тогда
				//добавляем итоги
				дкДобавитьИтогиПоСтранице(СтрокаТабличнойЧасти,СтруктураИтоговПоСтранице);
			КонецЕсли;
		КонецЦикла;
		
		Если (ВыборкаТабличнойЧасти.Количество() > 0) И (НЕ ОпцииБезЦен) Тогда
			//довыводим последний подвал, если страниц больше единицы
			Если НомерСтраницы > 2 Тогда
				дкВывестиИтогиПоСтранице(ТабДокумент,ОбластьМакетаИтогоПоСтранице,СтруктураИтоговПоСтранице,ЭтотОбъект);
			КонецЕсли;
			
			//итоги
			ОбластьМакета							= Макет.ПолучитьОбласть("Подвал");
			ОбластьМакета.Параметры.ВалютаДокумента	= ВалютаПечатногоДокумента;
			СуммаВсего								= ВыборкаТабличнойЧасти.Итог("СуммаВсего");
			ОбластьМакета.Параметры.СуммаВсего		= Формат(СуммаВсего,ФорматВыводаСуммы);
			НДСВсего								= ВыборкаТабличнойЧасти.Итог("СуммаНДС");
			ОбластьМакета.Параметры.НДСВсего		= Формат(НДСВсего,ФорматВыводаСуммы);
			ОбластьМакета.Параметры.СуммаПрописью	= "Всего наименований "+ВыборкаТабличнойЧасти.Количество()+" на сумму " + НРег(обЧислоПрописью(СуммаВсего,ВалютаПечатногоДокумента));
			
			НомерСтраницы	= дкВывестиГоризонтальнуюОбласть(ТабДокумент, ОбластьМакета, , , НомерСтраницы,,ЭтотОбъект);
		КонецЕсли;
		
		// Выводим представления и расшифровки подписей
		ОбластьМакета = Макет.ПолучитьОбласть("Подписи");
		
		Если НЕ обЗначениеНеЗаполнено(Менеджер) Тогда
			ОбластьМакета.Параметры.МенеджерПредставление		= "/ " + Строка(Менеджер) + " /";
		КонецЕсли;
		Если ТипЗнч(Контрагент) = Тип("СправочникСсылка.Контрагенты") Тогда
			Если НЕ обЗначениеНеЗаполнено(Контрагент.Наименование) Тогда
				ОбластьМакета.Параметры.НаименованиеКлиента		= "/ " + СокрЛП(Контрагент.Наименование) + " /";
			КонецЕсли;
		ИначеЕсли ТипЗнч(Контрагент) = Тип("Строка") Тогда
			Если НЕ обЗначениеНеЗаполнено(Контрагент) Тогда
				ОбластьМакета.Параметры.НаименованиеКлиента		= "/ " + СокрЛП(Контрагент) + " /";
			КонецЕсли;
		КонецЕсли;
		
		ТабДокумент.Вывести(ОбластьМакета);
		
		Возврат ТабДокумент;
	КонецФункции
	
	// Функция осуществляет печать произвольного документа.
	// Можно направить печать на экран или принтер, а также распечатать необходмое количество копий.
	//
	// Параметры:
	//	ЭтотОбъект							- ДокументОбъект	- Документ для печати
	//	НазваниеПечатнойФормы 				- Строка			- Название печатной формы, если пусто, то по умолчанию
	//	КоличествоЭкземпляров				- Число				- Количество экземпляров документа
	//	НаПринтер							- Булево			- Признак отправки документа на принтер без отображения его на экране
	//  Документ 	  						- ТабличныйДокумент	- Макет печатной формы
	//
	// Возвращаемое значение:
	//   ТабличныйДокумент	- Сформированная печатная форма
	//
	Функция Печать(НазваниеПечатнойФормы="", КоличествоЭкземпляров=0, НаПринтер=Ложь, Документ=Неопределено) Экспорт
		Возврат дкПечать(ЭтотОбъект, НазваниеПечатнойФормы, КоличествоЭкземпляров, НаПринтер, Документ);
	КонецФункции // Печать()
	
	Функция КонтактнаяИнформация(Объект, Вид)
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		|	КонтактнаяИнформация.Представление
		|ИЗ
		|	РегистрСведений.КонтактнаяИнформация КАК КонтактнаяИнформация
		|ГДЕ
		|	КонтактнаяИнформация.Вид = &Вид
		|	И КонтактнаяИнформация.Объект = &Объект";
		Запрос.УстановитьПараметр("Объект", Объект);
		Запрос.УстановитьПараметр("Вид", Вид);
		Выборка = Запрос.Выполнить().Выбрать();
		Если Выборка.Следующий() Тогда
			Возврат Выборка.Представление;
		Иначе
			Возврат "";
		КонецЕсли;
	КонецФункции
	
	Функция ПечатьЧекМенеджера(ТабДокумент)Экспорт
		
		//Бондаренко++ 20230830
		Если ТипЗНЧ(Контрагент) <> Тип("СправочникСсылка.Контрагенты") Тогда
			СМГ_Сообщить("Ошибка! Печать выполняется только для контрагента из одноимённого справочника, а не типа 'Текст'.",СтатусСообщения.ОченьВажное);
			Возврат Новый ТабличныйДокумент;
		КонецЕсли; 
		
		
		//Бондаренко++ 20240312
		//Если НЕ Контрагент.ФормаСобственности = Перечисления.ФормыСобственности.ЧастноеЛицо Тогда
		//	СМГ_Сообщить("Ошибка! Печать выполняется только для контрагента типа 'Частное лицо' или 'Прочее'.",СтатусСообщения.ОченьВажное);
		//	Возврат Новый ТабличныйДокумент;
		//КонецЕсли;
		//Бондаренко-- 20240312
		
		Если ТипЗНЧ(Автомобиль) <> Тип("СправочникСсылка.Автомобили") Тогда
			СМГ_Сообщить("Ошибка! Печать выполняется только для заполненного автомобиля из одноимённого справочника.",СтатусСообщения.ОченьВажное);
			Возврат Новый ТабличныйДокумент;
		КонецЕсли;
		
		Если ВидОплаты <> Перечисления.ВидыОплаты.ПроизвольнаяОплата Тогда
			Макет = ПолучитьМакет("ЧекМенеджера"); 
		Иначе
			СМГ_Сообщить("Ошибка! Печатная форма не формируется для вида оплаты 'Произвольный расчет'.",СтатусСообщения.ОченьВажное);
			Возврат Новый ТабличныйДокумент;
		КонецЕсли;	
		//Бондаренко-- 20230830
		
		//Бондаренко++ 20250816
		Если НЕ обЗначениеНеЗаполнено(Автомобиль) Тогда
			Если ЕстьНезакрытыеДокументы(Автомобиль,ДатаПоследнегоПоступления) Тогда
				Сообщить("Ошибка! Печать не выполняется при наличии незакрытых негарантийный заказ-нарядов и незакрытых комплектаций.", СтатусСообщения.Важное);
				Возврат Новый ТабличныйДокумент;
			КонецЕсли;
		КонецЕсли;
		//Бондаренко-- 20250816
		
		// Холышевская ++ 17.03.2026 
		// убираем подставление ДатыКП при печати чека менеджера, согласовано с Ксенией Русак
		//Бондаренко++ 20231228
		//Отказ = СМГ_ОбновитьДатуКПДоговораЗаказаНаАвтомобиль();
		//Если Отказ Тогда
		//	СМГ_Сообщить("Ошибка! Печать Чек-менеджера отменена из-за невозможности обновить дату КП в договоре.",СтатусСообщения.ОченьВажное);
		//	Возврат Новый ТабличныйДокумент;
		//КонецЕсли;
		//Бондаренко-- 20231228
		// Холышевская -- 17.03.2026
		
		Шапка = Макет.ПолучитьОбласть("Шапка");
		ТаблСумм = Макет.ПолучитьОбласть("ТаблСумм");
		
		Если ВидОплаты  = Перечисления.ВидыОплаты.НаличныйРасчет Тогда
			Шапка.Параметры.Нал = "да";
		ИначеЕсли ВидОплаты  = Перечисления.ВидыОплаты.БанковскаяКарта ИЛИ ВидОплаты  = Перечисления.ВидыОплаты.БезналичныйРасчет Тогда
			Шапка.Параметры.БезНал = "да";
		ИначеЕсли ВидОплаты  = Перечисления.ВидыОплаты.Кредит Тогда
			Шапка.Параметры.Кредит = "да";
		ИначеЕсли ВидОплаты  = Перечисления.ВидыОплаты.Обмен Тогда
			Шапка.Параметры.Обмен = "да";
		ИначеЕсли ВидОплаты  = Перечисления.ВидыОплаты.Лизинг Тогда
			Шапка.Параметры.Лизинг = "да";
		КонецЕсли;
		
		Если ТрейдИн Тогда
			Шапка.Параметры.Обмен = "да";
		КонецЕсли;
		
		Шапка.Параметры.Дата = Формат(ТекущаяДата(),"ДФ=dd.MM.yyyy");
		Если НЕ обЗначениеНеЗаполнено(ВладелецАвто) Тогда 
			ОрганизацияВладелец = Справочники.Организации.НайтиПоРеквизиту("КонтрагентОрганизации",ВладелецАвто);
			Шапка.Параметры.СобственникАвтомобиля = ОрганизацияВладелец.НаименованиеДляПечати;
		КонецЕсли;
		
		Шапка.Параметры.ПодразделениеКомпании = ПодразделениеКомпании.Наименование;
		Шапка.Параметры.Номер = СокрЛП(Номер);
		
		ТаблСумм.Параметры.ЭлПочта = КонтактнаяИнформация(Контрагент, Справочники.ВидыКонтактнойИнформации.АдресЭлектроннойПочтыРабочий);
		
		//Бондаренко++ 20250905
		ДокРЛКО = НайтиРЛКО(Ссылка); 
		Если НЕ обЗначениеНеЗаполнено(ДокРЛКО) Тогда
			ТаблСумм.Параметры.НомерРЛКО = ДокРЛКО.Номер;
			ТаблСумм.Параметры.ДатаРЛКО  = Формат(ДокРЛКО.Дата,"ДЛФ=D");
			ТаблСумм.Параметры.СтатусРЛКО = ДокРЛКО.Статус;
		КонецЕсли;
		//Бондаренко-- 20250905
		
		ФорматВыводаСумм = "ЧДЦ=2; ЧН=0,00";
		ФорматВыводаДат = "ДФ=dd.MM.yyyy"; 
		
		Если ЗначениеЗаполнено(ПредоплатаЗаАМ) Тогда
			Шапка.Параметры.ПредоплатаЗаАМ = Формат(ПредоплатаЗаАМ,ФорматВыводаСумм);
			Шапка.Параметры.ДатаПредоплатыЗаАМ = Формат(ДатаПредоплатыЗаАМ,ФорматВыводаДат);
		КонецЕсли;	
		
		Покупатель = Контрагент;
		Если ТипЗнч(Покупатель) = Тип("СправочникСсылка.Контрагенты") Тогда
			//Шапка.Параметры.Покупатель = Покупатель;
			Шапка.Параметры.ПокупательФИО = Покупатель.НаименованиеПолное;
		Иначе
			Шапка.Параметры.ПокупательФИО = Покупатель;
		КонецЕсли;
		
		Попытка
			Шапка.Параметры.ПокупательТелефон = ПредставлениеТелефона;
		Исключение
		КонецПопытки;	
		
		// Данные автомобиля
		
		Если Автомобиль <> Неопределено И Не Автомобиль.Пустая() Тогда
			Шапка.Параметры.Модель = Автомобиль.Модель;
			Шапка.Параметры.ВариантКомплектации = Автомобиль.ВариантКомплектации;
			Шапка.Параметры.Цвет = Автомобиль.Цвет;
			Шапка.Параметры.ВИН = Автомобиль.VIN;
			//Бондаренко++ 20240316
			//ТаблСумм.Параметры.РРЦ = Формат(ПолучитьРРЦ(Автомобиль),ФорматВыводаСумм);
			ТаблСумм.Параметры.РРЦ = Формат(РРЦ,ФорматВыводаСумм);
			//Бондаренко-- 20240316
		Иначе
			Шапка.Параметры.Модель = Модель;
			Шапка.Параметры.ВариантКомплектации = ВариантКомплектации;
			Шапка.Параметры.Цвет = Цвет;
		КонецЕсли;
		
		//Иванченко 20260126 ++		
		ЗапросНовыеАвто = Новый Запрос(
		"ВЫБРАТЬ
		|	МАКСИМУМ(ПоступлениеАвтомобилейАвтомобили.Ссылка) КАК Ссылка,
		|	ПоступлениеАвтомобилейАвтомобили.Автомобиль КАК Автомобиль,
		|	ПоступлениеАвтомобилейАвтомобили.СтавкаНДС КАК СтавкаНДС
		|ИЗ
		|	Документ.ПоступлениеАвтомобилей.Автомобили КАК ПоступлениеАвтомобилейАвтомобили
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.Автомобили.СрезПоследних(, ВидЗначения = ЗНАЧЕНИЕ(Перечисление.ДополнительнаяИнформацияАвтомобилей.ВидАвтомобиля)) КАК АвтомобилиСрезПоследних
		|		ПО ПоступлениеАвтомобилейАвтомобили.Автомобиль = АвтомобилиСрезПоследних.Автомобиль
		|ГДЕ
		|	НЕ ПоступлениеАвтомобилейАвтомобили.Ссылка.ПометкаУдаления
		|	И ПоступлениеАвтомобилейАвтомобили.Ссылка.Проведен  
		//Иванченко 20260130 ++		
		//|	И АвтомобилиСрезПоследних.Значение = ЗНАЧЕНИЕ(Перечисление.ВидАвтомобиля.АвтомобильСПробегом)
		|	И АвтомобилиСрезПоследних.Значение В (&ВидыАвто)
		//Иванченко 20260130 --		
		|	И НЕ ПоступлениеАвтомобилейАвтомобили.Ссылка.Контрагент.НашаФирма
		|	И НЕ ПоступлениеАвтомобилейАвтомобили.СтавкаНДС = ЗНАЧЕНИЕ(Справочник.СтавкиНДС.ПустаяСсылка)
		|	И НЕ ПоступлениеАвтомобилейАвтомобили.СтавкаНДС = ЗНАЧЕНИЕ(Справочник.СтавкиНДС.БезНДС)
		|	И ПоступлениеАвтомобилейАвтомобили.Автомобиль = &Автомобиль  
		//Иванченко 20260130 ++
		//|	И ПоступлениеАвтомобилейАвтомобили.Ссылка.ХозОперация = ЗНАЧЕНИЕ(Справочник.ХозОперации.ПоступлениеАвтомобилейКомиссия) 
		|	И ПоступлениеАвтомобилейАвтомобили.Ссылка.ХозОперация <> ЗНАЧЕНИЕ(Справочник.ХозОперации.ПоступлениеАвтомобилейКомиссия) 
		//Иванченко 20260130 --		
		|
		|СГРУППИРОВАТЬ ПО
		|	ПоступлениеАвтомобилейАвтомобили.Автомобиль,
		|	ПоступлениеАвтомобилейАвтомобили.СтавкаНДС");     
		//Иванченко 20260130 ++
		СписокВидыАвто = Новый СписокЗначений;
		СписокВидыАвто.Добавить(Перечисления.ВидАвтомобиля.Новый);  
		СписокВидыАвто.Добавить(Перечисления.ВидАвтомобиля.ПараллельныйИмпорт);  
		СписокВидыАвто.Добавить(Перечисления.ВидАвтомобиля.ПодменныйАвтомобиль);  
		СписокВидыАвто.Добавить(Перечисления.ВидАвтомобиля.ТестовыйАвтомобиль);  
		СписокВидыАвто.Добавить(Перечисления.ВидАвтомобиля.АвтомобильСПробегом);  
		ЗапросНовыеАвто.УстановитьПараметр("ВидыАвто", СписокВидыАвто);		
		//Иванченко 20260130 --		
		ЗапросНовыеАвто.Параметры.Вставить("Автомобиль", Автомобиль); 
		ВыгрузкаНовыеАвто = ЗапросНовыеАвто.Выполнить().Выгрузить();
		
		Если ВыгрузкаНовыеАвто.Количество() = 0 Тогда  
			ЭтоНовыйАвто = Ложь;			
		Иначе
			ЭтоНовыйАвто = Истина;		
		КонецЕсли;
				
		Если ЭтоНовыйАвто Тогда
			Параметр_ПроцентКИнвойсу = Год(ПоступлениеАвтомобиля.Дата) < 2026 И (обЗначениеНеЗаполнено(РеализацияАвтомобиля) ИЛИ Год(РеализацияАвтомобиля.Дата) = 2026);
		Иначе
			Параметр_ПроцентКИнвойсу = Ложь;
		КонецЕсли;
		//Иванченко 20260126 --		
		
		//Бондаренко++ 20240312
		//СтруктураЦены = ПолучитьСтруктуруЗакупкиАвтомобиля(Автомобиль,Дата);
		//Если СтруктураЦены = Неопределено Тогда
		//	ИНВОЙС_ = 0;
		//Иначе          
		//	ИНВОЙС_ = СтруктураЦены.Цена;
		//КонецЕсли;           
		//Бондаренко-- 20240312
		//Иванченко 20260126 ++		
		//ТаблСумм.Параметры.ИНВОЙС = Формат(Инвойс,ФорматВыводаСумм); 
		ТаблСумм.Параметры.ИНВОЙС = Формат(?(Параметр_ПроцентКИнвойсу, Инвойс * 1.02, Инвойс), ФорматВыводаСумм); 
		//Иванченко 20260126 --		
		//Бондаренко++ 20250827
		ТаблСумм.Параметры.СуммаПредпродажнойПодготовки = Формат(СуммаПредпродажнойПодготовки,ФорматВыводаСумм);
		//Бондаренко++ 20250827
		
		ТаблСумм.Параметры.ЦенаДопПоПрайсу = Формат(СтоимостьДОФакт,ФорматВыводаСумм); 
		ТаблСумм.Параметры.СкидкаПоСпецПрограмме = Формат(СкидкаАвтоЦентра,ФорматВыводаСумм);
		//Бондаренко++ 20240904
		ТаблСумм.Параметры.СкидкаДополнительная = Формат(СкидкаДополнительная,ФорматВыводаСумм);
		//Бондаренко-- 20240904
		ТаблСумм.Параметры.СкидкаТрейдИнФакт = Формат(СкидкаТрейдИнФакт,ФорматВыводаСумм);	
		//Бондаренко++ 20250205
		ТаблСумм.Параметры.СкидкаТрейдИн2Факт = Формат(СкидкаТрейдИн2Факт,ФорматВыводаСумм);	
		//Бондаренко-- 20250205
		ТаблСумм.Параметры.СкидкаСубсидияКредитФакт = Формат(СкидкаСубсидияКредитФакт,ФорматВыводаСумм);							
		ТаблСумм.Параметры.СкидкаПрЛояльности = Формат(СкидкаПоПрограммамЛояльности,ФорматВыводаСумм);
		ТаблСумм.Параметры.СебестоимостьДО = Формат(СебестоимостьДО,ФорматВыводаСумм);
		ТаблСумм.Параметры.ПредоплатаТО = Формат(ПредоплатаТО,ФорматВыводаСумм);
		
		//Бондаренко++ 20250619
		//КомпенсацияРетроспективнаяИтого = КомпенсацияТрейдИНРетроспективная + КомпенсацияСубсидияКредитРетроспективная + 
		//КомпенсацияПоПрограммамЛояльностиРетроспективная + КомпенсацияРозничнаяРетроспективная;
		КомпенсацияРетроспективнаяИтого = КомпенсацияТрейдИНРетроспективная + КомпенсацияСубсидияКредитРетроспективная + 
		КомпенсацияПоПрограммамЛояльностиРетроспективная + КомпенсацияРозничнаяРетроспективная + КомпенсацияТрейдИН2Ретроспективная;
		//Бондаренко-- 20250619
		
		ТаблСумм.Параметры.КомпенсацияРетроспективная = Формат(КомпенсацияРетроспективнаяИтого,ФорматВыводаСумм);							
		
		//Бондаренко++ 20250618
		ТаблСумм.Параметры.КомпенсацияПоПрограммамЛояльностиВИнВойсеТекущегоАвтомобиля = Формат(КомпенсацияПоПрограммамЛояльностиВИнВойсеТекущегоАвтомобиля,ФорматВыводаСумм);										
		//Бондаренко-- 20250618
		
		//Бондаренко++ 20231209
		//Бондаренко++ 20250205
		//ТаблСумм.Параметры.КомпенсацияВИнвойсе = Формат(КомпенсацияРозничнаяВИнВойсеСледующегоАвтомобиля,ФорматВыводаСумм);
		//Бондаренко-- 20250205
		ТаблСумм.Параметры.СуммаКомпенсации = Формат(СуммаКомпенсации,ФорматВыводаСумм);
		//Бондаренко++ 20231209
		
		//Бондаренко++ 20250205
		//КомпенсацияВИнвойсе =  КомпенсацияТрейдИНВИнВойсеСледующегоАвтомобиля + КомпенсацияСубсидияКредитВИнВойсеСледующегоАвтомобиля + 
		//КомпенсацияПоПрограммамЛояльностиВИнВойсеСледующегоАвтомобиля + КомпенсацияРозничнаяВИнВойсеСледующегоАвтомобиля;
		КомпенсацияВИнвойсе =  КомпенсацияТрейдИНВИнВойсеСледующегоАвтомобиля + 
		КомпенсацияТрейдИН2ВИнВойсеСледующегоАвтомобиля + 
		КомпенсацияСубсидияКредитВИнВойсеСледующегоАвтомобиля + 
		КомпенсацияПоПрограммамЛояльностиВИнВойсеСледующегоАвтомобиля + 
		КомпенсацияРозничнаяВИнВойсеСледующегоАвтомобиля;
		//Бондаренко-- 20250205
		
		ТаблСумм.Параметры.КомпенсацияВИнвойсе = Формат(КомпенсацияВИнвойсе,ФорматВыводаСумм);
		
		//Бондаренко++ 20250822
		ТаблСумм.Параметры.УдержаниеКомпенсации = Формат(УдержаниеКомпенсации,ФорматВыводаСумм);
		//Бондаренко-- 20250822
		
		//Бондаренко++ 20231230
		//ТаблСумм.Параметры.ДефектовочныйАкт = Формат(СуммаПродажи-ИНВОЙС,ФорматВыводаСумм);	
		//Бондаренко-- 20231230
		
		ТаблСумм.Параметры.СкидкаРозничная = Формат(СкидкаРозничная,ФорматВыводаСумм);
		
		//Бондаренко++ 20230901
		ТаблСумм.Параметры.СуммаКаско = Формат(СуммаКаско,ФорматВыводаСумм);
		Если СуммаКаско > 0 Тогда
			Если НаличныеПрограммаКАСКО Тогда
				ТаблСумм.Параметры.КаскоНал = "да";                     
			Иначе	
				ТаблСумм.Параметры.КаскоБн  = "да";                     
			КонецЕсли;
		КонецЕсли;	
		
		ТаблСумм.Параметры.СуммаОсаго = Формат(СуммаОсаго,ФорматВыводаСумм);
		Если СуммаОсаго > 0 Тогда
			Если НаличныеПрограммаОСАГО Тогда
				ТаблСумм.Параметры.ОсагоНал = "да";                     
			Иначе	
				ТаблСумм.Параметры.ОсагоБн  = "да";                     
			КонецЕсли;
		КонецЕсли;	
		
		ТаблСумм.Параметры.СуммаСтрахованиеЖизни = Формат(СуммаСтрахованиеЖизни,ФорматВыводаСумм);
		Если СуммаСтрахованиеЖизни > 0 Тогда
			Если НаличныеПрограммаСЖ Тогда
				ТаблСумм.Параметры.СжНал = "да";                     
			Иначе	
				ТаблСумм.Параметры.СжБн  = "да";                     
			КонецЕсли;
		КонецЕсли;
		
		Для каждого Стр Из ИныеСтраховыеПродукты Цикл
			
			Если обЗначениеНеЗаполнено(Стр.ПрограммаСтрахования) Тогда
				Продолжить;
			КонецЕсли;
			
			Если Стр.СуммаСтрахования = 0 Тогда
				Продолжить;
			КонецЕсли;
			
			Если Стр.НомерСтроки > 5 Тогда
				Прервать;
			КонецЕсли;
			
			Если Стр.НомерСтроки = 1 Тогда
				ТаблСумм.Параметры.ИСП1 = Стр.ПрограммаСтрахования;
				ТаблСумм.Параметры.СуммаИСП1 = Формат(Стр.СуммаСтрахования,ФорматВыводаСумм);
				Если Стр.Наличные Тогда
					ТаблСумм.Параметры.ИСП1Нал = "да";
				Иначе	
					ТаблСумм.Параметры.ИСП1Бн = "да";
				КонецЕсли;
			ИначеЕсли Стр.НомерСтроки = 2 Тогда
				ТаблСумм.Параметры.ИСП2 = Стр.ПрограммаСтрахования;
				ТаблСумм.Параметры.СуммаИСП2 = Формат(Стр.СуммаСтрахования,ФорматВыводаСумм);
				Если Стр.Наличные Тогда
					ТаблСумм.Параметры.ИСП2Нал = "да";
				Иначе	
					ТаблСумм.Параметры.ИСП2Бн = "да";
				КонецЕсли;
			ИначеЕсли Стр.НомерСтроки = 3 Тогда
				ТаблСумм.Параметры.ИСП3 = Стр.ПрограммаСтрахования;
				ТаблСумм.Параметры.СуммаИСП3 = Формат(Стр.СуммаСтрахования,ФорматВыводаСумм);
				Если Стр.Наличные Тогда
					ТаблСумм.Параметры.ИСП3Нал = "да";
				Иначе	
					ТаблСумм.Параметры.ИСП3Бн = "да";
				КонецЕсли;
			ИначеЕсли Стр.НомерСтроки = 4 Тогда
				ТаблСумм.Параметры.ИСП4 = Стр.ПрограммаСтрахования;
				ТаблСумм.Параметры.СуммаИСП4 = Формат(Стр.СуммаСтрахования,ФорматВыводаСумм);
				Если Стр.Наличные Тогда
					ТаблСумм.Параметры.ИСП4Нал = "да";
				Иначе	
					ТаблСумм.Параметры.ИСП4Бн = "да";
				КонецЕсли;
			КонецЕсли;
			
		КонецЦикла;
		//Бондаренко-- 20230901
		
		ТаблСумм.Параметры.ЦенаФакт      = Формат(СуммаПродажи,ФорматВыводаСумм);							
		ТаблСумм.Параметры.ЦенаДоговора  = Формат(ДКПАвто,ФорматВыводаСумм);		
		//Бондаренко++ 20231117
		//Шапка.Параметры.СтоимостьЗНДО = СебестоимостьДО;
		//Бондаренко-- 20231117
		//Иванченко 20251127 ++    
		СтруктураОтбораНА = Новый Структура("Автомобиль, ВидЗначения", Автомобиль, Перечисления.ВидАвтомобиля.Новый);
		РезультатНА = РегистрыСведений.Автомобили.ПолучитьПоследнее(Дата, СтруктураОтбораНА).Количество();
		
		Если РезультатНА > 0 
			И ЕстьДиректоваяПрограмма И (Автомобиль.Модель.Марка = Справочники.Марка.HAVAL
			ИЛИ Автомобиль.Модель.Марка = Справочники.Марка.CHERY
			ИЛИ Автомобиль.Модель.Марка = Справочники.Марка.TENET
			ИЛИ Автомобиль.Модель.Марка = Справочники.Марка.EXEED
			ИЛИ Автомобиль.Модель.Марка = Справочники.Марка.OMODA
			ИЛИ Автомобиль.Модель.Марка = Справочники.Марка.JAECOO)Тогда
			//Иванченко 20251209 ++
			//Параметр_ЗННаДО = ?(СтоимостьДОФакт < СкидкаРозничная, 0, СтоимостьДОФакт - СкидкаРозничная);  
			Параметр_ЗННаДО = ?(СтоимостьДОФакт < СкидкаРозничная + СкидкаДополнительная, 0, СтоимостьДОФакт - СкидкаРозничная - СкидкаДополнительная); 					
			//Иванченко 20251209 --					
		Иначе
			Параметр_ЗННаДО = 0 
		КонецЕсли;
		
		ТаблСумм.Параметры.ЗННаДО = Формат(Параметр_ЗННаДО, ФорматВыводаСумм);  
		//Иванченко 20251127 --	

		//Иванченко 20260226 ++		
		Параметр_СебестоимостьДОКоммерция = СМГ_ПолучитьСебестоимостьДОКоммерции(Автомобиль, ДатаПоследнегоПоступления, ДатаРеализацииАвтомобиля); 
		ТаблСумм.Параметры.СебестоимостьДОКоммерция = Формат(Параметр_СебестоимостьДОКоммерция, ФорматВыводаСумм);  
		//Иванченко 20260226 --
		
		ТаблСумм.Параметры.ПервоначальныйВзнос = Формат(СуммаПредоплаты,ФорматВыводаСумм);
		ТаблСумм.Параметры.ДатаПервоначальногоВзноса = Формат(ДатаПервоначальногоВзноса,ФорматВыводаДат);
		
		Шапка.Параметры.БанкЛК = БанкЛК; 
		Если Кредит ИЛИ ВидОплаты = Перечисления.ВидыОплаты.Кредит Тогда
			Шапка.Параметры.КредитнаяСтоимость = Формат(СчетИлиАвтоВКредит,ФорматВыводаСумм);
		Иначе
			Шапка.Параметры.КредитнаяСтоимость = "";
		КонецЕсли; 
		
		//Бондаренко++ 20250522  
		ГодВыпуска = Автомобиль.ГодВыпуска;
		Если ГодВыпуска <> Дата(1,1,1) Тогда
			Шапка.Параметры.ГодВыпуска = Формат(ГодВыпуска, "ДФ='гггг'");
		КонецЕсли;
		//Бондаренко-- 20250522
		
		ШапкаДопОборудованиеДилер = Макет.ПолучитьОбласть("ШапкаДопОборудованиеДилер");
		СтрокаДопОборудованиеДилер = Макет.ПолучитьОбласть("СтрокаДопОборудованиеДилер"); 
		//Иванченко 20250925 ++
		//ШапкаДопОборудованиеИмпортер = Макет.ПолучитьОбласть("ШапкаДопОборудованиеИмпортер");
		//СтрокаДопОборудованиеИмпортер = Макет.ПолучитьОбласть("СтрокаДопОборудованиеИмпортер"); 
		//Иванченко 20250925 --	 
		
		ШапкаДолг = Макет.ПолучитьОбласть("ШапкаДолг");
		СтрокаДолг = Макет.ПолучитьОбласть("СтрокаДолг");
		Подвал = Макет.ПолучитьОбласть("Подвал");
		
		ТрейдИнОбласть = Макет.ПолучитьОбласть("ТрейдИн");
		
		//Бондаренко++ 20250715
		РитейлОбласть = Макет.ПолучитьОбласть("Ритейл");
		//Бондаренко-- 20250715
		
		//Бондаренко++ 20240329
		//Если ТрейдИн Тогда
		Если ТрейдИн ИЛИ ТолькоВыкуп Тогда
			//Бондаренко-- 20240329		
			
			ТрейдИнОбласть.Параметры.СобственникФИО = СобственникТрейдИн.НаименованиеПолное;
			
			Попытка
				ТрейдИнОбласть.Параметры.СобственникТелефон = СобственникТрейдИн.ОсновнойТелефон;
			Исключение
			КонецПопытки;			
			
			ТрейдИнОбласть.Параметры.МодельТрейдИн                       = МодельТрейдИн;
			ТрейдИнОбласть.Параметры.ТрейдИнVIN                          = ТрейдИнVIN;
			
			ТрейдИнОбласть.Параметры.ЦенаМинРыночнаяТрейдИн              = Формат(ЦенаМинРыночнаяТрейдИн, ФорматВыводаСумм);
			ТрейдИнОбласть.Параметры.ПланируемаяЦенаПродажиТрейдИн       = Формат(ПланируемаяЦенаПродажиТрейдИн,ФорматВыводаСумм);
			ТрейдИнОбласть.Параметры.ЦенаДКПТрейдИн                      = Формат(ЦенаДКПТрейдИн,ФорматВыводаСумм);
			
			ТрейдИнОбласть.Параметры.ГодВыпускаТрейдИн                   = Формат( ГодВыпускаТрейдИн, "ДФ='гггг'");
			ТрейдИнОбласть.Параметры.ПробегТрейдИн                       = ПробегТрейдИн;
			ТрейдИнОбласть.Параметры.Менеджер                            = ФамилияИО(Менеджер.Наименование);
			
			//Бондаренко++ 20240327
			//ТрейдИнОбласть.Параметры.РуководительМенеджера               = ФамилияИО(РуководительМенеджера.Наименование);
			//Бондаренко-- 20240327
			
			ТрейдИнОбласть.Параметры.ТрейдИнКоличествоВладельцев         = ТрейдИнКоличествоВладельцев; 
			ТрейдИнОбласть.Параметры.ТрейдИнОригиналПТС                  = ТрейдИнОригиналПТС;
			ТрейдИнОбласть.Параметры.ПредпочтенияПоКоробкеПередачTradeIn = ПредпочтенияПоКоробкеПередачTradeIn;  
			ТрейдИнОбласть.Параметры.ТрейдИнТипДвигателя                 = ТрейдИнТипДвигателя;
			ТрейдИнОбласть.Параметры.ТрейдИнОбъемДвигателя               = ТрейдИнОбъемДвигателя;
			ТрейдИнОбласть.Параметры.ТрейдИнМощностьДвигателяЛС          = ТрейдИнМощностьДвигателяЛС; 
			ТрейдИнОбласть.Параметры.ТрейдИнТипКузова                    = ТрейдИнТипКузова;
			
		КонецЕсли; 
		
		ТабДокумент.Вывести(Шапка);  
		
		ТабДокумент.Вывести(ТаблСумм);
		
		ТабДокумент.Вывести(ШапкаДопОборудованиеДилер);
		
		//Бондаренко++ 20240804
		Если НЕ обЗначениеНезаполнено(Автомобиль) Тогда
			//Бондаренко-- 20240804
			
			Запрос = Новый Запрос; 
			Запрос.УстановитьПараметр("Автомобиль", Автомобиль);
			Запрос.УстановитьПараметр("ДатаПоследнегоПоступления", ДатаПоследнегоПоступления);
			
			//Бондаренко++ 20240702
			//Запрос.Текст ="ВЫБРАТЬ
			//              |	КомплектацияАвтомобиляТовары.Номенклатура.Наименование КАК Номенклатура,
			//              |	СУММА(КомплектацияАвтомобиляТовары.СуммаВсего) КАК Сумма
			//              |ИЗ
			//              |	Документ.КомплектацияАвтомобиля.Товары КАК КомплектацияАвтомобиляТовары
			//              |ГДЕ
			//              |	КомплектацияАвтомобиляТовары.Ссылка.Автомобиль = &Автомобиль
			//              |	И КомплектацияАвтомобиляТовары.Ссылка.Состояние = ЗНАЧЕНИЕ(Справочник.ВидыСостоянийЗаказНарядов.Закрыт)
			//              |	И КомплектацияАвтомобиляТовары.Ссылка.Дата > &ДатаПоследнегоПоступления
			//              |
			//              |СГРУППИРОВАТЬ ПО
			//              |	КомплектацияАвтомобиляТовары.Номенклатура.Наименование";
			
			Запрос.Текст ="ВЫБРАТЬ
			|	КомплектацияАвтомобиляТовары.Номенклатура.Наименование КАК Номенклатура,
			|	СУММА(КомплектацияАвтомобиляТовары.СуммаВсего) КАК Сумма,
			|	СУММА(КомплектацияАвтомобиляТовары.Количество * КомплектацияАвтомобиляТовары.Коэффициент) КАК Кол
			|ИЗ
			|	Документ.КомплектацияАвтомобиля.Товары КАК КомплектацияАвтомобиляТовары
			|ГДЕ
			|	КомплектацияАвтомобиляТовары.Ссылка.Автомобиль = &Автомобиль
			|	И КомплектацияАвтомобиляТовары.Ссылка.Состояние = ЗНАЧЕНИЕ(Справочник.ВидыСостоянийЗаказНарядов.Закрыт)
			|	И КомплектацияАвтомобиляТовары.Ссылка.Дата > &ДатаПоследнегоПоступления
			|
			|СГРУППИРОВАТЬ ПО
			|	КомплектацияАвтомобиляТовары.Номенклатура.Наименование
			|
			|ОБЪЕДИНИТЬ ВСЕ
			|
			|ВЫБРАТЬ
			|	РазукомплектацияАвтомобиляТовары.Номенклатура.Наименование,
			|	-СУММА(РазукомплектацияАвтомобиляТовары.СуммаВсего),
			|	-СУММА(РазукомплектацияАвтомобиляТовары.Количество * РазукомплектацияАвтомобиляТовары.Коэффициент)
			|ИЗ
			|	Документ.РазукомплектацияАвтомобилей.Товары КАК РазукомплектацияАвтомобиляТовары
			|ГДЕ
			|	РазукомплектацияАвтомобиляТовары.Ссылка.Автомобиль = &Автомобиль
			|	И РазукомплектацияАвтомобиляТовары.Ссылка.Состояние = ЗНАЧЕНИЕ(Справочник.ВидыСостоянийЗаказНарядов.Закрыт)
			|	И РазукомплектацияАвтомобиляТовары.Ссылка.Дата > &ДатаПоследнегоПоступления
			|
			|СГРУППИРОВАТЬ ПО
			|	РазукомплектацияАвтомобиляТовары.Номенклатура.Наименование";	
			//Бондаренко-- 20240702
			
			ТЗ_ДО = Запрос.Выполнить().Выгрузить();
			
			//Бондаренко++ 20240702
			ТЗ_ДО.Свернуть("Номенклатура","Сумма,Кол");
			
			ПарОтбора = Новый Структура;
			ПарОтбора.Вставить("Кол",0);
			НайдСтрокиСНулевымКоличеством = ТЗ_ДО.НайтиСтроки(ПарОтбора);
			Для каждого Стр Из НайдСтрокиСНулевымКоличеством Цикл
				ТЗ_ДО.Удалить(Стр);
			КонецЦикла;
			//Бондаренко-- 20240702
			
			Счетчик = 0; 
			НПП = 0;
			
			РазмерТаблицыДО = ТЗ_ДО.Количество();
			
			Если РазмерТаблицыДО > 0 Тогда
				
				Для каждого Стр Из ТЗ_ДО Цикл                       
					
					Счетчик = Счетчик + 1;
					НПП = НПП + 1;
					
					Если Счетчик = 1 Тогда                                                                     
						СтрокаДопОборудованиеДилер.Параметры.НПП_1 = СокрЛП(НПП);
						СтрокаДопОборудованиеДилер.Параметры.ДО_1 = СокрЛП(Стр.Номенклатура);
						СтрокаДопОборудованиеДилер.Параметры.Цена_ДО_1 = Формат(Стр.Сумма,"ЧЦ=15; ЧДЦ=2");
						
					ИначеЕсли Счетчик = 2 Тогда 	                            
						СтрокаДопОборудованиеДилер.Параметры.НПП_2 = СокрЛП(НПП);
						СтрокаДопОборудованиеДилер.Параметры.ДО_2 = СокрЛП(Стр.Номенклатура);
						СтрокаДопОборудованиеДилер.Параметры.Цена_ДО_2 = Формат(Стр.Сумма,"ЧЦ=15; ЧДЦ=2");
						
					ИначеЕсли Счетчик = 3 Тогда 	                            
						СтрокаДопОборудованиеДилер.Параметры.НПП_3 = СокрЛП(НПП);
						СтрокаДопОборудованиеДилер.Параметры.ДО_3 = СокрЛП(Стр.Номенклатура);
						СтрокаДопОборудованиеДилер.Параметры.Цена_ДО_3 = Формат(Стр.Сумма,"ЧЦ=15; ЧДЦ=2");
						
						ТабДокумент.Вывести(СтрокаДопОборудованиеДилер);
						
						СтрокаДопОборудованиеДилер.Параметры.НПП_1 = "";
						СтрокаДопОборудованиеДилер.Параметры.ДО_1 = "";
						СтрокаДопОборудованиеДилер.Параметры.Цена_ДО_1 = "";
						СтрокаДопОборудованиеДилер.Параметры.НПП_2 = "";
						СтрокаДопОборудованиеДилер.Параметры.ДО_2 = "";
						СтрокаДопОборудованиеДилер.Параметры.Цена_ДО_2 = "";
						СтрокаДопОборудованиеДилер.Параметры.НПП_3 = "";
						СтрокаДопОборудованиеДилер.Параметры.ДО_3 = "";
						СтрокаДопОборудованиеДилер.Параметры.Цена_ДО_3 = "";
						Счетчик = 0;
					КонецЕсли;
					
					Если Счетчик > 0 И НПП = РазмерТаблицыДО Тогда
						ТабДокумент.Вывести(СтрокаДопОборудованиеДилер);
						Прервать;
					КонецЕсли;
					
				КонецЦикла; 
				
			КонецЕсли;
			
			//Бондаренко++ 20240804
		КонецЕсли;
		//Бондаренко-- 20240804
		
		//Иванченко 20250923 ++
		//ТабДокумент.Вывести(ШапкаДопОборудованиеИмпортер);
		//ТабДокумент.Вывести(СтрокаДопОборудованиеИмпортер); 
		//Иванченко 20250923 --	
		
		//Бондаренко++ 20231128
		Счетчик = 0;
		НПП = 0;
		ТабДокумент.Вывести(ШапкаДолг);
		
		Таблица_Долг = ДолгОтделаПродаж.Выгрузить();
		РазмерТаблицыДолг = Таблица_Долг.Количество();
		
		Если РазмерТаблицыДолг > 0 Тогда
			
			Для каждого Стр Из Таблица_Долг Цикл                       
				
				Счетчик = Счетчик + 1;
				НПП = НПП + 1;
				
				Если Счетчик = 1 Тогда                                                                     
					СтрокаДолг.Параметры.НПП_1 = СокрЛП(НПП);
					СтрокаДолг.Параметры.ДО_1 = СокрЛП(Стр.Наименование);
					СтрокаДолг.Параметры.Кол_ДО_1 = СокрЛП(Формат(Стр.Количество,"ЧЦ=2; ЧДЦ=0"))+" "+СокрЛП(Стр.ЕдиницаИзмерения);
				ИначеЕсли Счетчик = 2 Тогда 	                            
					СтрокаДолг.Параметры.НПП_2 = СокрЛП(НПП);
					СтрокаДолг.Параметры.ДО_2 = СокрЛП(Стр.Наименование);
					СтрокаДолг.Параметры.Кол_ДО_2 = СокрЛП(Формат(Стр.Количество,"ЧЦ=2; ЧДЦ=0"))+" "+СокрЛП(Стр.ЕдиницаИзмерения);
				ИначеЕсли Счетчик = 3 Тогда 	                            
					СтрокаДолг.Параметры.НПП_3 = СокрЛП(НПП);
					СтрокаДолг.Параметры.ДО_3 = СокрЛП(Стр.Наименование);
					СтрокаДолг.Параметры.Кол_ДО_3 = СокрЛП(Формат(Стр.Количество,"ЧЦ=2; ЧДЦ=0"))+" "+СокрЛП(Стр.ЕдиницаИзмерения);
				КонецЕсли;
				
				Если ( ( Счетчик / 3 ) - Цел( ( Счетчик / 3 ) ) ) = 0 Тогда
					ТабДокумент.Вывести(СтрокаДолг);
					СтрокаДолг.Параметры.НПП_1 = "";
					СтрокаДолг.Параметры.ДО_1 = "";
					СтрокаДолг.Параметры.Кол_ДО_1 = "";
					СтрокаДолг.Параметры.НПП_2 = "";
					СтрокаДолг.Параметры.ДО_2 = "";
					СтрокаДолг.Параметры.Кол_ДО_2 = "";
					СтрокаДолг.Параметры.НПП_3 = "";
					СтрокаДолг.Параметры.ДО_3 = "";
					СтрокаДолг.Параметры.Кол_ДО_3 = "";
					Счетчик = 0;
				ИначеЕсли НПП = РазмерТаблицыДолг Тогда
					ТабДокумент.Вывести(СтрокаДолг);;
					Прервать;
				КонецЕсли;
				
			КонецЦикла; 
			
		КонецЕсли;
		//Бондаренко++ 20231128
		
		ТабДокумент.Вывести(Подвал);                 
		ТабДокумент.Вывести(ТрейдИнОбласть);     
		
		//Иванченко 20250923 ++
		Если ЗначениеЗаполнено(Автомобиль) Тогда
			ОбластьРасчетGM1 = Макет.ПолучитьОбласть("РасчетGM1"); 
			
			//Иванченко 20251024 ++			
			//ОбластьРасчетGM1.Параметры.ПланGM1 = 0;
			//СуммаКомпенсаций = КомпенсацияТрейдИНРетроспективная + КомпенсацияСубсидияКредитРетроспективная + КомпенсацияПоПрограммамЛояльностиРетроспективная + КомпенсацияРозничнаяРетроспективная + КомпенсацияТрейдИН2Ретроспективная + КомпенсацияТрейдИНВИнВойсеСледующегоАвтомобиля + КомпенсацияТрейдИН2ВИнВойсеСледующегоАвтомобиля + КомпенсацияСубсидияКредитВИнВойсеСледующегоАвтомобиля + КомпенсацияПоПрограммамЛояльностиВИнВойсеСледующегоАвтомобиля + КомпенсацияРозничнаяВИнВойсеСледующегоАвтомобиля; 		
			////Иванченко 20251024 ++			
			//Параметр_ЖелезнаяМаржа = СуммаПродажи - Инвойс - СебестоимостьДО - СуммаПредпродажнойПодготовки - УдержаниеКомпенсации + ?(Автомобиль.Модель.Марка.КомпенсацияБезНДС, СуммаКомпенсаций * 1.2, СуммаКомпенсаций) + СкидкаДополнительная; 
			////Иванченко 20251020 ++
			////ОбластьРасчетGM1.Параметры.ЖелезнаяМаржа = Формат(Окр(Параметр_ЖелезнаяМаржа, 2), "ЧДЦ=2; ЧН=0");   
			////ОбластьРасчетGM1.Параметры.ЖелезнаяМаржа = Формат(Окр(Параметр_ЖелезнаяМаржа + СкидкаДополнительная, 2), "ЧДЦ=2; ЧН=0"); 
			//ОбластьРасчетGM1.Параметры.ЖелезнаяМаржа = Формат(Окр(Параметр_ЖелезнаяМаржа, 2), "ЧДЦ=2; ЧН=0"); 
			////Иванченко 20251024 --			
			////Иванченко 20251020 --			
			//Параметр_СуммаКВ = КВКаско + КВОсаго + КВСЖ + КВКредит + ИныеСтраховыеПродукты.Итог("КВ");
			//ОбластьРасчетGM1.Параметры.СуммаКВ = Формат(Окр(Параметр_СуммаКВ, 2), "ЧДЦ=2; ЧН=0");  
			//Параметр_ФактGM1 = Параметр_ЖелезнаяМаржа + ОбластьРасчетGM1.Параметры.СуммаКВ;	
			//ОбластьРасчетGM1.Параметры.ФактGM1 = Формат(Окр(Параметр_ФактGM1, 2), "ЧДЦ=2; ЧН=0");  
			////Иванченко 20251024 ++						
			////Параметр_GM1БезНДС = Параметр_ФактGM1 * 5 / 6;  
			//Параметр_GM1БезНДС = (Параметр_ФактGM1 - СкидкаДополнительная) * 5 / 6 + СкидкаДополнительная;  
			////Иванченко 20251020 ++
			////ОбластьРасчетGM1.Параметры.GM1БезНДС = Формат(Окр(Параметр_GM1БезНДС, 2), "ЧДЦ=2; ЧН=0"); 			
			////ОбластьРасчетGM1.Параметры.GM1БезНДС = Формат(Окр(Параметр_GM1БезНДС + СкидкаДополнительная, 2), "ЧДЦ=2; ЧН=0");  
			//ОбластьРасчетGM1.Параметры.GM1БезНДС = Формат(Окр(Параметр_GM1БезНДС, 2), "ЧДЦ=2; ЧН=0");  
			////Иванченко 20251024 --			
			////Иванченко 20251020 --
			//Отбор = Новый Структура;
			//Отбор.Вставить("Модель", ?(ЗначениеЗаполнено(Автомобиль), Автомобиль.Модель, Модель));
			//Рег_ППД = РегистрыСведений.ПлановыеПоказателиДоходаПоПродажамАМ; 
			//Рег_ППД_СП = Рег_ППД.СрезПоследних(Дата, Отбор);
			//
			//Если Рег_ППД_СП.Количество() > 0 Тогда 
			//	Параметр_ПланGM1 = Рег_ППД_СП.ВыгрузитьКолонку("ПланУдельныйДоходПоМоделиБезНДС")[0];
			//Иначе
			//	Параметр_ПланGM1 = 0;	
			//КонецЕсли;
			//
			//ПланGM1 = Формат(Окр(Параметр_ПланGM1, 2), "ЧДЦ=2; ЧН=0");  
			////Иванченко 20251020 ++
			////Параметр_Рентабельность = Параметр_ФактGM1 * 5 / 6 / ?(ДКПавто=0, 1, ДКПавто) * 100;    
			////Иванченко 20251024 ++
			////Параметр_Рентабельность = Параметр_GM1БезНДС + СкидкаДополнительная * 5 / 6 / ?(ДКПавто=0, 1, ДКПавто) * 100;  
			//Параметр_Рентабельность = Параметр_GM1БезНДС / ?(ДКПавто=0, 1, ДКПавто) * 100;  
			////Иванченко 20251024 --			
			////Иванченко 20251020 --
			//ОбластьРасчетGM1.Параметры.Рентабельность = Формат(Окр(Параметр_Рентабельность, 1), "ЧДЦ=1; ЧН=0%; ЧФ=Ч%");     
			
			//Иванченко 20260506 ++  
			КомпенсацияБезНДС = Ложь;
			ЗапросВариантКомпенсации = Новый Запрос(
			//Иванченко 20260619 ++			
			//"ВЫБРАТЬ ПЕРВЫЕ 1
			//|	ВариантыКомпенсацийПоМаркамСрезПоследних.КомпенсацияБезНДС КАК КомпенсацияБезНДС
			//|ИЗ
			//|	РегистрСведений.ВариантыКомпенсацийПоМаркам.СрезПоследних(
			//|			,
			//|			Период <= &Дата
			//|				И Марка = &Марка
			//|				И (&МаркетинговаяПрограммаСкидкаПоПрограммамЛояльности = МаркетинговаяПрограмма
			//|					ИЛИ &МаркетинговаяПрограммаСкидкаПоПрограммамЛояльностиДополнительно = МаркетинговаяПрограмма
			//|					ИЛИ &МаркетинговаяПрограммаСкидкаСубсидияКредит = МаркетинговаяПрограмма
			//|					ИЛИ &МаркетинговаяПрограммаСкидкаТрейдИн = МаркетинговаяПрограмма)) КАК ВариантыКомпенсацийПоМаркамСрезПоследних");  
			//ЗапросВариантКомпенсации.УстановитьПараметр("Дата", ТекущаяДата());     			
			//ЗапросВариантКомпенсации.УстановитьПараметр("Марка", Автомобиль.Модель.Марка);     
			//ЗапросВариантКомпенсации.УстановитьПараметр("МаркетинговаяПрограммаСкидкаПоПрограммамЛояльности", МаркетинговаяПрограммаСкидкаПоПрограммамЛояльности);
			//ЗапросВариантКомпенсации.УстановитьПараметр("МаркетинговаяПрограммаСкидкаПоПрограммамЛояльностиДополнительно", МаркетинговаяПрограммаСкидкаПоПрограммамЛояльностиДополнительно);
			//ЗапросВариантКомпенсации.УстановитьПараметр("МаркетинговаяПрограммаСкидкаСубсидияКредит", МаркетинговаяПрограммаСкидкаСубсидияКредит);
			//ЗапросВариантКомпенсации.УстановитьПараметр("МаркетинговаяПрограммаСкидкаТрейдИн", МаркетинговаяПрограммаСкидкаТрейдИн);
			"ВЫБРАТЬ
			|	ВариантыКомпенсацийПоМаркамСрезПоследних.Период КАК Период,
			|	ВариантыКомпенсацийПоМаркамСрезПоследних.Марка КАК Марка,
			|	ВариантыКомпенсацийПоМаркамСрезПоследних.МаркетинговаяПрограмма КАК МаркетинговаяПрограмма,
			|	ВариантыКомпенсацийПоМаркамСрезПоследних.КомпенсацияБезНДС КАК КомпенсацияБезНДС
			|ИЗ
			|	РегистрСведений.ВариантыКомпенсацийПоМаркам.СрезПоследних(&Дата, ) КАК ВариантыКомпенсацийПоМаркамСрезПоследних
			|ГДЕ
			|	ВариантыКомпенсацийПоМаркамСрезПоследних.Период <= &Дата
			|	И ВариантыКомпенсацийПоМаркамСрезПоследних.Марка = &Марка
			|	И ВариантыКомпенсацийПоМаркамСрезПоследних.МаркетинговаяПрограмма В(&МаркетинговыеПрограммы)");  
			ЗапросВариантКомпенсации.УстановитьПараметр("Дата", ТекущаяДата());     			
			ЗапросВариантКомпенсации.УстановитьПараметр("Марка", Автомобиль.Модель.Марка);         
			
			МаркетинговыеПрограммы = Новый СписокЗначений;  
			МаркетинговыеПрограммы.Добавить(Справочники.МаркетинговыеПрограммы.ПустаяСсылка());
			
			Если Не обЗначениеНеЗаполнено(МаркетинговаяПрограммаСкидкаПоПрограммамЛояльности) Тогда
				МаркетинговыеПрограммы.Добавить(МаркетинговаяПрограммаСкидкаПоПрограммамЛояльности);
			КонецЕсли;
			
			Если Не обЗначениеНеЗаполнено(МаркетинговаяПрограммаСкидкаПоПрограммамЛояльностиДополнительно) Тогда
				МаркетинговыеПрограммы.Добавить(МаркетинговаяПрограммаСкидкаПоПрограммамЛояльностиДополнительно);
			КонецЕсли;

			Если Не обЗначениеНеЗаполнено(МаркетинговаяПрограммаСкидкаСубсидияКредит) Тогда
				МаркетинговыеПрограммы.Добавить(МаркетинговаяПрограммаСкидкаСубсидияКредит);
			КонецЕсли;

			Если Не обЗначениеНеЗаполнено(МаркетинговаяПрограммаСкидкаТрейдИн) Тогда
				МаркетинговыеПрограммы.Добавить(МаркетинговаяПрограммаСкидкаТрейдИн);
			КонецЕсли;
			
			ЗапросВариантКомпенсации.УстановитьПараметр("МаркетинговыеПрограммы", МаркетинговыеПрограммы); 
			//Иванченко 20260619 --
			ВыборкаВариантКомпенсации = ЗапросВариантКомпенсации.Выполнить().Выбрать();   
			
			Пока ВыборкаВариантКомпенсации.Следующий() Цикл
				КомпенсацияБезНДС = ВыборкаВариантКомпенсации.КомпенсацияБезНДС;	
			КонецЦикла;	
			//Иванченко 20260506 --
			
			ВыборкаВариантКомпенсации = ЗапросВариантКомпенсации.Выполнить().Выбрать();   
			
			Пока ВыборкаВариантКомпенсации.Следующий() Цикл
				КомпенсацияБезНДС = ВыборкаВариантКомпенсации.КомпенсацияБезНДС;	
			КонецЦикла;	
			//Иванченко 20260506 --
			
			Отбор = Новый Структура;
			Отбор.Вставить("Модель", ?(ЗначениеЗаполнено(Автомобиль), Автомобиль.Модель, Модель));
			Рег_ППД = РегистрыСведений.ПлановыеПоказателиДоходаПоПродажамАМ; 
			Рег_ППД_СП = Рег_ППД.СрезПоследних(Дата, Отбор);
			
			Если Рег_ППД_СП.Количество() > 0 Тогда 
				Параметр_ПланGM1 = Рег_ППД_СП.ВыгрузитьКолонку("ПланУдельныйДоходПоМоделиБезНДС")[0];
			Иначе
				Параметр_ПланGM1 = 0;	
			КонецЕсли;
			
			Параметр_СуммаКВ = КВКаско + КВОсаго + КВСЖ + КВКредит + ИныеСтраховыеПродукты.Итог("КВ");			
			//Иванченко 20251101 ++
			//СуммаКомпенсаций = КомпенсацияТрейдИНРетроспективная + КомпенсацияСубсидияКредитРетроспективная + КомпенсацияПоПрограммамЛояльностиРетроспективная + КомпенсацияРозничнаяРетроспективная + КомпенсацияТрейдИН2Ретроспективная + КомпенсацияТрейдИНВИнВойсеСледующегоАвтомобиля + КомпенсацияТрейдИН2ВИнВойсеСледующегоАвтомобиля + КомпенсацияСубсидияКредитВИнВойсеСледующегоАвтомобиля + КомпенсацияПоПрограммамЛояльностиВИнВойсеСледующегоАвтомобиля + КомпенсацияРозничнаяВИнВойсеСледующегоАвтомобиля; 		
			//Иванченко 20251229 ++
			//СуммаОферты = ПоступлениеАвтомобиля.СуммаОферты;   
			
			Если ПоступлениеАвтомобиля.ХозОперация = Справочники.ХозОперации.ПоступлениеАвтомобилейКомиссия Тогда  
				СуммаОферты = 0;
			Иначе   
				СуммаОферты = ПоступлениеАвтомобиля.СуммаОферты;
			КонецЕсли;
			//Иванченко 20251229 -- 
			
			//Иванченко 20251101 --	
			
			//Иванченко 20260109 ++	
			//НалоговаяСтавка = РегистрыСведений.УпрощеннаяСистемаНалогообложения.СрезПоследних(РабочаяДата, Новый Структура("Организация", Организация));
			//Иванченко 20260110 ++	
			НалоговаяСтавка = 1 + СМГ_ПолучитьСтавкуНДС(Организация, РабочаяДата).Ставка / 100;
			//Иванченко 20260110 --
			//Иванченко 20260109 --				

			Если ВидАвтомобиля = Перечисления.ВидАвтомобиля.Новый Или ВидАвтомобиля = Перечисления.ВидАвтомобиля.ПараллельныйИмпорт Или ВидАвтомобиля = Перечисления.ВидАвтомобиля.КорпоративнаяКвота Тогда
				//Иванченко 20251101 ++
				//	Параметр_ЖелезнаяМаржа = СуммаПродажи - Инвойс - СебестоимостьДО - СуммаПредпродажнойПодготовки - УдержаниеКомпенсации + ?(Автомобиль.Модель.Марка.КомпенсацияБезНДС, СуммаКомпенсаций * 1.2, СуммаКомпенсаций) + СкидкаДополнительная; 		
				//	Параметр_ФактGM1 = Параметр_ЖелезнаяМаржа + Параметр_СуммаКВ;
				//	Параметр_GM1БезНДС = ?(Параметр_ЖелезнаяМаржа - СкидкаДополнительная > 0, (Параметр_ЖелезнаяМаржа - СкидкаДополнительная) / 1.2, Параметр_ЖелезнаяМаржа - СкидкаДополнительная) + Параметр_СуммаКВ / 1.2 + СкидкаДополнительная;  			
				//Иначе 
				//	Параметр_ЖелезнаяМаржа = РРЦ - Инвойс - СебестоимостьДО - СуммаПредпродажнойПодготовки - СкидкаДополнительная - СкидкаРозничная; 		
				//	Параметр_ФактGM1 = Параметр_ЖелезнаяМаржа + Параметр_СуммаКВ;
				//	Параметр_GM1БезНДС = (Параметр_ФактGM1 - СкидкаДополнительная) / 1.2 + ?(ПоступлениеАвтомобиля.СуммаОферты = 0, 0, Инвойс - ПоступлениеАвтомобиля.СуммаОферты) + СкидкаДополнительная;       
			//	Параметр_ЖелезнаяМаржа = (РРЦ + СтоимостьДОФакт - СкидкаТрейдИнФакт - СкидкаТрейдИн2Факт - СкидкаРозничная - СкидкаАвтоЦентра - СкидкаДополнительная - СкидкаСубсидияКредитФакт - СкидкаПоПрограммамЛояльности - Инвойс - СуммаПредпродажнойПодготовки - СебестоимостьДО - ПредоплатаТО + ?(Автомобиль.Модель.Марка.КомпенсацияБезНДС, (КомпенсацияРетроспективная + КомпенсацияПоПрограммамЛояльностиВИнВойсеТекущегоАвтомобиля + КомпенсацияВИнвойсе - УдержаниеКомпенсации) * 1.2, КомпенсацияРетроспективная + КомпенсацияПоПрограммамЛояльностиВИнВойсеТекущегоАвтомобиля + КомпенсацияВИнвойсе - УдержаниеКомпенсации)) + СкидкаДополнительная + ?(СуммаОферты = 0, СуммаОферты, Инвойс - СуммаОферты);        
			//	Параметр_ФактGM1 = Параметр_ЖелезнаяМаржа + Параметр_СуммаКВ;
			//	Параметр_GM1БезНДС = ?((РРЦ + СтоимостьДОФакт - СкидкаТрейдИнФакт - СкидкаТрейдИн2Факт - СкидкаРозничная - СкидкаАвтоЦентра - СкидкаДополнительная - СкидкаСубсидияКредитФакт - СкидкаПоПрограммамЛояльности - Инвойс - СуммаПредпродажнойПодготовки - СебестоимостьДО - ПредоплатаТО + ?(Автомобиль.Модель.Марка.КомпенсацияБезНДС, (КомпенсацияРетроспективная + КомпенсацияПоПрограммамЛояльностиВИнВойсеТекущегоАвтомобиля + КомпенсацияВИнвойсе - УдержаниеКомпенсации) * 1.2, КомпенсацияРетроспективная + КомпенсацияПоПрограммамЛояльностиВИнВойсеТекущегоАвтомобиля + КомпенсацияВИнвойсе - УдержаниеКомпенсации)) < 0, РРЦ + СтоимостьДОФакт - СкидкаТрейдИнФакт - СкидкаТрейдИн2Факт - СкидкаРозничная - СкидкаАвтоЦентра - СкидкаДополнительная - СкидкаСубсидияКредитФакт - СкидкаПоПрограммамЛояльности - Инвойс - СуммаПредпродажнойПодготовки - СебестоимостьДО - ПредоплатаТО + ?(Автомобиль.Модель.Марка.КомпенсацияБезНДС, (КомпенсацияРетроспективная + КомпенсацияПоПрограммамЛояльностиВИнВойсеТекущегоАвтомобиля + КомпенсацияВИнвойсе - УдержаниеКомпенсации) * 1.2, КомпенсацияРетроспективная + КомпенсацияПоПрограммамЛояльностиВИнВойсеТекущегоАвтомобиля + КомпенсацияВИнвойсе - УдержаниеКомпенсации) - УдержаниеКомпенсации, (РРЦ + СтоимостьДОФакт - СкидкаТрейдИнФакт - СкидкаТрейдИн2Факт - СкидкаРозничная - СкидкаАвтоЦентра - СкидкаДополнительная - СкидкаСубсидияКредитФакт - СкидкаПоПрограммамЛояльности - Инвойс - СуммаПредпродажнойПодготовки - СебестоимостьДО - ПредоплатаТО + КомпенсацияРетроспективная + КомпенсацияПоПрограммамЛояльностиВИнВойсеТекущегоАвтомобиля + КомпенсацияВИнвойсе - УдержаниеКомпенсации) / 1.2) + СкидкаДополнительная + ?(СуммаОферты = 0, СуммаОферты, Инвойс - СуммаОферты) + Параметр_СуммаКВ / 1.2;  
			//Иначе
			//	Параметр_ЖелезнаяМаржа = (РРЦ + СтоимостьДОФакт - СкидкаТрейдИнФакт - СкидкаТрейдИн2Факт - СкидкаРозничная - СкидкаАвтоЦентра - СкидкаДополнительная - СкидкаСубсидияКредитФакт - СкидкаПоПрограммамЛояльности - Инвойс - СуммаПредпродажнойПодготовки - СебестоимостьДО - ПредоплатаТО + КомпенсацияРетроспективная + КомпенсацияПоПрограммамЛояльностиВИнВойсеТекущегоАвтомобиля + КомпенсацияВИнвойсе - УдержаниеКомпенсации) + СкидкаДополнительная + ?(СуммаОферты = 0, СуммаОферты, Инвойс - СуммаОферты);        
			//	Параметр_ФактGM1 = Параметр_ЖелезнаяМаржа + Параметр_СуммаКВ;
			//	Параметр_GM1БезНДС = ?((РРЦ + СтоимостьДОФакт - СкидкаТрейдИнФакт - СкидкаТрейдИн2Факт - СкидкаРозничная - СкидкаАвтоЦентра - СкидкаДополнительная - СкидкаСубсидияКредитФакт - СкидкаПоПрограммамЛояльности - Инвойс - СуммаПредпродажнойПодготовки - СебестоимостьДО - ПредоплатаТО + КомпенсацияРетроспективная + КомпенсацияПоПрограммамЛояльностиВИнВойсеТекущегоАвтомобиля + КомпенсацияВИнвойсе - УдержаниеКомпенсации) < 0, РРЦ + СтоимостьДОФакт - СкидкаТрейдИнФакт - СкидкаТрейдИн2Факт - СкидкаРозничная - СкидкаАвтоЦентра - СкидкаДополнительная - СкидкаСубсидияКредитФакт - СкидкаПоПрограммамЛояльности - Инвойс - СуммаПредпродажнойПодготовки - СебестоимостьДО - ПредоплатаТО + КомпенсацияРетроспективная + КомпенсацияПоПрограммамЛояльностиВИнВойсеТекущегоАвтомобиля + КомпенсацияВИнвойсе - УдержаниеКомпенсации, (РРЦ + СтоимостьДОФакт - СкидкаТрейдИнФакт - СкидкаТрейдИн2Факт - СкидкаРозничная - СкидкаАвтоЦентра - СкидкаДополнительная - СкидкаСубсидияКредитФакт - СкидкаПоПрограммамЛояльности - Инвойс - СуммаПредпродажнойПодготовки - СебестоимостьДО - ПредоплатаТО + КомпенсацияРетроспективная + КомпенсацияПоПрограммамЛояльностиВИнВойсеТекущегоАвтомобиля + КомпенсацияВИнвойсе - УдержаниеКомпенсации) / 1.2) + СкидкаДополнительная + ?(СуммаОферты = 0, СуммаОферты, Инвойс - СуммаОферты) + Параметр_СуммаКВ / 1.2;  
			//Иванченко 20251102 ++
			//	Параметр_ЖелезнаяМаржа = (РРЦ + СтоимостьДОФакт - СкидкаТрейдИнФакт - СкидкаТрейдИн2Факт - СкидкаРозничная - СкидкаАвтоЦентра - СкидкаДополнительная - СкидкаСубсидияКредитФакт - СкидкаПоПрограммамЛояльности - Инвойс - СуммаПредпродажнойПодготовки - СебестоимостьДО - ПредоплатаТО + ?(Автомобиль.Модель.Марка.КомпенсацияБезНДС, (КомпенсацияРетроспективнаяИтого + КомпенсацияПоПрограммамЛояльностиВИнВойсеТекущегоАвтомобиля + КомпенсацияВИнвойсе - УдержаниеКомпенсации) * 1.2, КомпенсацияРетроспективнаяИтого + КомпенсацияПоПрограммамЛояльностиВИнВойсеТекущегоАвтомобиля + КомпенсацияВИнвойсе - УдержаниеКомпенсации)) + СкидкаДополнительная + ?(СуммаОферты = 0, СуммаОферты, Инвойс - СуммаОферты);        
			//	Параметр_ФактGM1 = Параметр_ЖелезнаяМаржа + Параметр_СуммаКВ;
			//	Параметр_GM1БезНДС = ?((РРЦ + СтоимостьДОФакт - СкидкаТрейдИнФакт - СкидкаТрейдИн2Факт - СкидкаРозничная - СкидкаАвтоЦентра - СкидкаДополнительная - СкидкаСубсидияКредитФакт - СкидкаПоПрограммамЛояльности - Инвойс - СуммаПредпродажнойПодготовки - СебестоимостьДО - ПредоплатаТО + ?(Автомобиль.Модель.Марка.КомпенсацияБезНДС, (КомпенсацияРетроспективнаяИтого + КомпенсацияПоПрограммамЛояльностиВИнВойсеТекущегоАвтомобиля + КомпенсацияВИнвойсе - УдержаниеКомпенсации) * 1.2, КомпенсацияРетроспективнаяИтого + КомпенсацияПоПрограммамЛояльностиВИнВойсеТекущегоАвтомобиля + КомпенсацияВИнвойсе - УдержаниеКомпенсации)) < 0, РРЦ + СтоимостьДОФакт - СкидкаТрейдИнФакт - СкидкаТрейдИн2Факт - СкидкаРозничная - СкидкаАвтоЦентра - СкидкаДополнительная - СкидкаСубсидияКредитФакт - СкидкаПоПрограммамЛояльности - Инвойс - СуммаПредпродажнойПодготовки - СебестоимостьДО - ПредоплатаТО + ?(Автомобиль.Модель.Марка.КомпенсацияБезНДС, (КомпенсацияРетроспективнаяИтого + КомпенсацияПоПрограммамЛояльностиВИнВойсеТекущегоАвтомобиля + КомпенсацияВИнвойсе - УдержаниеКомпенсации) * 1.2, КомпенсацияРетроспективнаяИтого + КомпенсацияПоПрограммамЛояльностиВИнВойсеТекущегоАвтомобиля + КомпенсацияВИнвойсе - УдержаниеКомпенсации) - УдержаниеКомпенсации, (РРЦ + СтоимостьДОФакт - СкидкаТрейдИнФакт - СкидкаТрейдИн2Факт - СкидкаРозничная - СкидкаАвтоЦентра - СкидкаДополнительная - СкидкаСубсидияКредитФакт - СкидкаПоПрограммамЛояльности - Инвойс - СуммаПредпродажнойПодготовки - СебестоимостьДО - ПредоплатаТО + КомпенсацияРетроспективнаяИтого + КомпенсацияПоПрограммамЛояльностиВИнВойсеТекущегоАвтомобиля + КомпенсацияВИнвойсе - УдержаниеКомпенсации) / 1.2) + СкидкаДополнительная + ?(СуммаОферты = 0, СуммаОферты, Инвойс - СуммаОферты) + Параметр_СуммаКВ / 1.2;  
			//Иначе
			//	Параметр_ЖелезнаяМаржа = (РРЦ + СтоимостьДОФакт - СкидкаТрейдИнФакт - СкидкаТрейдИн2Факт - СкидкаРозничная - СкидкаАвтоЦентра - СкидкаДополнительная - СкидкаСубсидияКредитФакт - СкидкаПоПрограммамЛояльности - Инвойс - СуммаПредпродажнойПодготовки - СебестоимостьДО - ПредоплатаТО + КомпенсацияРетроспективнаяИтого + КомпенсацияПоПрограммамЛояльностиВИнВойсеТекущегоАвтомобиля + КомпенсацияВИнвойсе - УдержаниеКомпенсации) + СкидкаДополнительная + ?(СуммаОферты = 0, СуммаОферты, Инвойс - СуммаОферты);        
			//	Параметр_ФактGM1 = Параметр_ЖелезнаяМаржа + Параметр_СуммаКВ;
			//	Параметр_GM1БезНДС = ?((РРЦ + СтоимостьДОФакт - СкидкаТрейдИнФакт - СкидкаТрейдИн2Факт - СкидкаРозничная - СкидкаАвтоЦентра - СкидкаДополнительная - СкидкаСубсидияКредитФакт - СкидкаПоПрограммамЛояльности - Инвойс - СуммаПредпродажнойПодготовки - СебестоимостьДО - ПредоплатаТО + КомпенсацияРетроспективнаяИтого + КомпенсацияПоПрограммамЛояльностиВИнВойсеТекущегоАвтомобиля + КомпенсацияВИнвойсе - УдержаниеКомпенсации) < 0, РРЦ + СтоимостьДОФакт - СкидкаТрейдИнФакт - СкидкаТрейдИн2Факт - СкидкаРозничная - СкидкаАвтоЦентра - СкидкаДополнительная - СкидкаСубсидияКредитФакт - СкидкаПоПрограммамЛояльности - Инвойс - СуммаПредпродажнойПодготовки - СебестоимостьДО - ПредоплатаТО + КомпенсацияРетроспективнаяИтого + КомпенсацияПоПрограммамЛояльностиВИнВойсеТекущегоАвтомобиля + КомпенсацияВИнвойсе - УдержаниеКомпенсации, (РРЦ + СтоимостьДОФакт - СкидкаТрейдИнФакт - СкидкаТрейдИн2Факт - СкидкаРозничная - СкидкаАвтоЦентра - СкидкаДополнительная - СкидкаСубсидияКредитФакт - СкидкаПоПрограммамЛояльности - Инвойс - СуммаПредпродажнойПодготовки - СебестоимостьДО - ПредоплатаТО + КомпенсацияРетроспективнаяИтого + КомпенсацияПоПрограммамЛояльностиВИнВойсеТекущегоАвтомобиля + КомпенсацияВИнвойсе - УдержаниеКомпенсации) / 1.2) + СкидкаДополнительная + ?(СуммаОферты = 0, СуммаОферты, Инвойс - СуммаОферты) + Параметр_СуммаКВ / 1.2;  
			//
			//Иванченко 20260126 ++	
			// Получение новых авто перенесено выше
			//Иванченко 20251107 ++
			//ЗапросНовыеАвто = новый Запрос(
			//"ВЫБРАТЬ
			//|	МАКСИМУМ(ПоступлениеАвтомобилейАвтомобили.Ссылка) КАК Ссылка,
			//|	ПоступлениеАвтомобилейАвтомобили.Автомобиль КАК Автомобиль,
			//|	ПоступлениеАвтомобилейАвтомобили.СтавкаНДС КАК СтавкаНДС
			//|ИЗ
			//|	Документ.ПоступлениеАвтомобилей.Автомобили КАК ПоступлениеАвтомобилейАвтомобили
			//|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.Автомобили.СрезПоследних(, ВидЗначения = ЗНАЧЕНИЕ(Перечисление.ДополнительнаяИнформацияАвтомобилей.ВидАвтомобиля)) КАК АвтомобилиСрезПоследних
			//|		ПО ПоступлениеАвтомобилейАвтомобили.Автомобиль = АвтомобилиСрезПоследних.Автомобиль
			//|ГДЕ
			//|	НЕ ПоступлениеАвтомобилейАвтомобили.Ссылка.ПометкаУдаления
			//|	И ПоступлениеАвтомобилейАвтомобили.Ссылка.Проведен
			//|	И АвтомобилиСрезПоследних.Значение = ЗНАЧЕНИЕ(Перечисление.ВидАвтомобиля.АвтомобильСПробегом)
			//|	И НЕ ПоступлениеАвтомобилейАвтомобили.Ссылка.Контрагент.НашаФирма
			//|	И НЕ ПоступлениеАвтомобилейАвтомобили.СтавкаНДС = ЗНАЧЕНИЕ(Справочник.СтавкиНДС.ПустаяСсылка)
			//|	И НЕ ПоступлениеАвтомобилейАвтомобили.СтавкаНДС = ЗНАЧЕНИЕ(Справочник.СтавкиНДС.БезНДС)
			//|	И ПоступлениеАвтомобилейАвтомобили.Автомобиль = &Автомобиль
			//|
			//|СГРУППИРОВАТЬ ПО
			//|	ПоступлениеАвтомобилейАвтомобили.Автомобиль,
			//|	ПоступлениеАвтомобилейАвтомобили.СтавкаНДС");
			//ЗапросНовыеАвто.Параметры.Вставить("Автомобиль", Автомобиль); 
			//ВыгрузкаНовыеАвто = ЗапросНовыеАвто.Выполнить().Выгрузить();
			//
			//Если ВыгрузкаНовыеАвто.Количество() = 0 Тогда  
			//	ЭтоНовыйАвто = Истина;			
			//Иначе
			//	ЭтоНовыйАвто = Ложь;		
			//КонецЕсли;	
			//
			//Если ЭтоНовыйАвто Тогда
			//	Параметр_ПроцентКИнвойсу = Год(ПоступлениеАвтомобиля.Дата) < 2026 И (обЗначениеНеЗаполнено(РеализацияАвтомобиля) ИЛИ Год(РеализацияАвтомобиля.Дата) = 2026);
			//Иначе
			//	Параметр_ПроцентКИнвойсу = Ложь;
			//КонецЕсли;
			//Иванченко 20260126 --			
			
				//Иванченко 20260506 ++
				//Если Автомобиль.Модель.Марка.КомпенсацияБезНДС Тогда 
				Если КомпенсацияБезНДС Тогда	
				//Иванченко 20260506 --
					//Иванченко 20260109 ++	
					//Параметр_ЖелезнаяМаржа = РРЦ + СтоимостьДОФакт - СкидкаТрейдИнФакт - СкидкаТрейдИн2Факт - СкидкаРозничная - СкидкаАвтоЦентра - СкидкаДополнительная - СкидкаСубсидияКредитФакт - СкидкаПоПрограммамЛояльности - Инвойс - СуммаПредпродажнойПодготовки - СебестоимостьДО - ПредоплатаТО + (КомпенсацияРетроспективнаяИтого + КомпенсацияВИнвойсе) * 1.2 + СкидкаДополнительная;  
					//Параметр_ЖелезнаяМаржа = РРЦ + СтоимостьДОФакт - СкидкаТрейдИнФакт - СкидкаТрейдИн2Факт - СкидкаРозничная - СкидкаАвтоЦентра - СкидкаДополнительная - СкидкаСубсидияКредитФакт - СкидкаПоПрограммамЛояльности - Инвойс - СуммаПредпродажнойПодготовки - СебестоимостьДО - ПредоплатаТО + (КомпенсацияРетроспективнаяИтого + КомпенсацияВИнвойсе) * НалоговаяСтавка + СкидкаДополнительная;  					
					//Параметр_ФактGM1 = Параметр_ЖелезнаяМаржа + Параметр_СуммаКВ; 
					////Параметр_GM1БезНДС = ?(РРЦ + СтоимостьДОФакт - СкидкаТрейдИнФакт - СкидкаТрейдИн2Факт - СкидкаРозничная - СкидкаАвтоЦентра - СкидкаДополнительная - СкидкаСубсидияКредитФакт - СкидкаПоПрограммамЛояльности - Инвойс - СуммаПредпродажнойПодготовки - СебестоимостьДО - ПредоплатаТО + (КомпенсацияРетроспективнаяИтого + КомпенсацияВИнвойсе) * 1.2 <= 0, РРЦ + СтоимостьДОФакт - СкидкаТрейдИнФакт - СкидкаТрейдИн2Факт - СкидкаРозничная - СкидкаАвтоЦентра - СкидкаДополнительная - СкидкаСубсидияКредитФакт - СкидкаПоПрограммамЛояльности - Инвойс - СуммаПредпродажнойПодготовки - СебестоимостьДО - ПредоплатаТО + (КомпенсацияРетроспективнаяИтого + КомпенсацияВИнвойсе) * 1.2 + СкидкаДополнительная + Параметр_СуммаКВ / 1.2, (РРЦ + СтоимостьДОФакт - СкидкаТрейдИнФакт - СкидкаТрейдИн2Факт - СкидкаРозничная - СкидкаАвтоЦентра - СкидкаДополнительная - СкидкаСубсидияКредитФакт - СкидкаПоПрограммамЛояльности - Инвойс - СуммаПредпродажнойПодготовки - СебестоимостьДО - ПредоплатаТО + (КомпенсацияРетроспективнаяИтого + КомпенсацияВИнвойсе) * 1.2) / 1.2 + СкидкаДополнительная + Параметр_СуммаКВ / 1.2);   
					//Параметр_GM1БезНДС = ?(РРЦ + СтоимостьДОФакт - СкидкаТрейдИнФакт - СкидкаТрейдИн2Факт - СкидкаРозничная - СкидкаАвтоЦентра - СкидкаДополнительная - СкидкаСубсидияКредитФакт - СкидкаПоПрограммамЛояльности - Инвойс - СуммаПредпродажнойПодготовки - СебестоимостьДО - ПредоплатаТО + (КомпенсацияРетроспективнаяИтого + КомпенсацияВИнвойсе) * НалоговаяСтавка <= 0, РРЦ + СтоимостьДОФакт - СкидкаТрейдИнФакт - СкидкаТрейдИн2Факт - СкидкаРозничная - СкидкаАвтоЦентра - СкидкаДополнительная - СкидкаСубсидияКредитФакт - СкидкаПоПрограммамЛояльности - Инвойс - СуммаПредпродажнойПодготовки - СебестоимостьДО - ПредоплатаТО + (КомпенсацияРетроспективнаяИтого + КомпенсацияВИнвойсе) * НалоговаяСтавка + СкидкаДополнительная + Параметр_СуммаКВ / НалоговаяСтавка, (РРЦ + СтоимостьДОФакт - СкидкаТрейдИнФакт - СкидкаТрейдИн2Факт - СкидкаРозничная - СкидкаАвтоЦентра - СкидкаДополнительная - СкидкаСубсидияКредитФакт - СкидкаПоПрограммамЛояльности - Инвойс - СуммаПредпродажнойПодготовки - СебестоимостьДО - ПредоплатаТО + (КомпенсацияРетроспективнаяИтого + КомпенсацияВИнвойсе) * НалоговаяСтавка) / НалоговаяСтавка + СкидкаДополнительная + Параметр_СуммаКВ / НалоговаяСтавка);   										
					//Иванченко 20260114 ++  
					//Иванченко 20260301 ++	
					//Параметр_ЖелезнаяМаржа = РРЦ + СтоимостьДОФакт - СкидкаТрейдИнФакт - СкидкаТрейдИн2Факт - СкидкаРозничная - СкидкаАвтоЦентра - СкидкаДополнительная - СкидкаСубсидияКредитФакт - СкидкаПоПрограммамЛояльности - ?(Параметр_ПроцентКИнвойсу, Инвойс * 1.02, Инвойс) - СуммаПредпродажнойПодготовки - СебестоимостьДО - ПредоплатаТО + (КомпенсацияРетроспективнаяИтого + КомпенсацияВИнвойсе) * НалоговаяСтавка + СкидкаДополнительная;  					
					//Параметр_ФактGM1 = Параметр_ЖелезнаяМаржа + Параметр_СуммаКВ; 
					//Параметр_GM1БезНДС = ?(РРЦ + СтоимостьДОФакт - СкидкаТрейдИнФакт - СкидкаТрейдИн2Факт - СкидкаРозничная - СкидкаАвтоЦентра - СкидкаДополнительная - СкидкаСубсидияКредитФакт - СкидкаПоПрограммамЛояльности - ?(Параметр_ПроцентКИнвойсу, Инвойс * 1.02, Инвойс) - СуммаПредпродажнойПодготовки - СебестоимостьДО - ПредоплатаТО + (КомпенсацияРетроспективнаяИтого + КомпенсацияВИнвойсе) * НалоговаяСтавка <= 0, РРЦ + СтоимостьДОФакт - СкидкаТрейдИнФакт - СкидкаТрейдИн2Факт - СкидкаРозничная - СкидкаАвтоЦентра - СкидкаДополнительная - СкидкаСубсидияКредитФакт - СкидкаПоПрограммамЛояльности - ?(Параметр_ПроцентКИнвойсу, Инвойс * 1.02, Инвойс) - СуммаПредпродажнойПодготовки - СебестоимостьДО - ПредоплатаТО + (КомпенсацияРетроспективнаяИтого + КомпенсацияВИнвойсе) * НалоговаяСтавка + СкидкаДополнительная + Параметр_СуммаКВ / НалоговаяСтавка, (РРЦ + СтоимостьДОФакт - СкидкаТрейдИнФакт - СкидкаТрейдИн2Факт - СкидкаРозничная - СкидкаАвтоЦентра - СкидкаДополнительная - СкидкаСубсидияКредитФакт - СкидкаПоПрограммамЛояльности - ?(Параметр_ПроцентКИнвойсу, Инвойс * 1.02, Инвойс) - СуммаПредпродажнойПодготовки - СебестоимостьДО - ПредоплатаТО + (КомпенсацияРетроспективнаяИтого + КомпенсацияВИнвойсе) * НалоговаяСтавка) / НалоговаяСтавка + СкидкаДополнительная + Параметр_СуммаКВ / НалоговаяСтавка);   										
					//Иванченко 20260330 ++	
					//Параметр_ЖелезнаяМаржа = РРЦ + СтоимостьДОФакт - СкидкаТрейдИнФакт - СкидкаТрейдИн2Факт - СкидкаРозничная - СкидкаАвтоЦентра - СкидкаДополнительная - СкидкаСубсидияКредитФакт - СкидкаПоПрограммамЛояльности - ?(Параметр_ПроцентКИнвойсу, Инвойс * 1.02, Инвойс) - СуммаПредпродажнойПодготовки - СебестоимостьДО - ПредоплатаТО + (КомпенсацияРетроспективнаяИтого + КомпенсацияВИнвойсе) * НалоговаяСтавка + СкидкаДополнительная;  					
					//Параметр_ФактGM1 = Параметр_ЖелезнаяМаржа + Параметр_СуммаКВ; 
					//Параметр_GM1БезНДС = ?(РРЦ + СтоимостьДОФакт - СкидкаТрейдИнФакт - СкидкаТрейдИн2Факт - СкидкаРозничная - СкидкаАвтоЦентра - СкидкаДополнительная - СкидкаСубсидияКредитФакт - СкидкаПоПрограммамЛояльности - ?(Параметр_ПроцентКИнвойсу, Инвойс * 1.02, Инвойс) - СуммаПредпродажнойПодготовки - СебестоимостьДО - ПредоплатаТО + (КомпенсацияРетроспективнаяИтого + КомпенсацияВИнвойсе) * НалоговаяСтавка <= 0, РРЦ + СтоимостьДОФакт - СкидкаТрейдИнФакт - СкидкаТрейдИн2Факт - СкидкаРозничная - СкидкаАвтоЦентра - СкидкаДополнительная - СкидкаСубсидияКредитФакт - СкидкаПоПрограммамЛояльности - ?(Параметр_ПроцентКИнвойсу, Инвойс * 1.02, Инвойс) - СуммаПредпродажнойПодготовки - СебестоимостьДО - ПредоплатаТО + (КомпенсацияРетроспективнаяИтого + КомпенсацияВИнвойсе) * НалоговаяСтавка + СкидкаДополнительная + Параметр_СуммаКВ / НалоговаяСтавка, (РРЦ + СтоимостьДОФакт - СкидкаТрейдИнФакт - СкидкаТрейдИн2Факт - СкидкаРозничная - СкидкаАвтоЦентра - СкидкаДополнительная - СкидкаСубсидияКредитФакт - СкидкаПоПрограммамЛояльности - ?(Параметр_ПроцентКИнвойсу, Инвойс * 1.02, Инвойс) - СуммаПредпродажнойПодготовки - СебестоимостьДО - ПредоплатаТО + (КомпенсацияРетроспективнаяИтого + КомпенсацияВИнвойсе) * НалоговаяСтавка) / НалоговаяСтавка + СкидкаДополнительная + Параметр_СуммаКВ / НалоговаяСтавка);   										
					//Параметр_ЖелезнаяМаржа = РРЦ + СтоимостьДОФакт - Параметр_ЗННаДО + Параметр_СебестоимостьДОКоммерция - СкидкаТрейдИнФакт - СкидкаТрейдИн2Факт - СкидкаРозничная - СкидкаАвтоЦентра - СкидкаДополнительная - СкидкаСубсидияКредитФакт - СкидкаПоПрограммамЛояльности - ?(Параметр_ПроцентКИнвойсу, Инвойс * 1.02, Инвойс) - СуммаПредпродажнойПодготовки - СебестоимостьДО - ПредоплатаТО + (КомпенсацияРетроспективнаяИтого + КомпенсацияВИнвойсе) * НалоговаяСтавка + СкидкаДополнительная;  					
					//Параметр_ФактGM1 = Параметр_ЖелезнаяМаржа + Параметр_СуммаКВ; 
					//Параметр_GM1БезНДС = ?(РРЦ + Параметр_СебестоимостьДОКоммерция - СкидкаТрейдИнФакт - СкидкаТрейдИн2Факт - СкидкаРозничная - СкидкаАвтоЦентра - СкидкаДополнительная - СкидкаСубсидияКредитФакт - СкидкаПоПрограммамЛояльности - ?(Параметр_ПроцентКИнвойсу, Инвойс * 1.02, Инвойс) - СуммаПредпродажнойПодготовки - СебестоимостьДО - ПредоплатаТО + (КомпенсацияРетроспективнаяИтого + КомпенсацияВИнвойсе) * НалоговаяСтавка <= 0, 
					//РРЦ + СтоимостьДОФакт - Параметр_ЗННаДО + Параметр_СебестоимостьДОКоммерция - СкидкаТрейдИнФакт - СкидкаТрейдИн2Факт - СкидкаРозничная - СкидкаАвтоЦентра - СкидкаДополнительная - СкидкаСубсидияКредитФакт - СкидкаПоПрограммамЛояльности - ?(Параметр_ПроцентКИнвойсу, Инвойс * 1.02, Инвойс) - СуммаПредпродажнойПодготовки - СебестоимостьДО - ПредоплатаТО + (КомпенсацияРетроспективнаяИтого + КомпенсацияВИнвойсе) * НалоговаяСтавка + СкидкаДополнительная + Параметр_СуммаКВ / НалоговаяСтавка, 
					//(РРЦ + СтоимостьДОФакт - Параметр_ЗННаДО + Параметр_СебестоимостьДОКоммерция - СкидкаТрейдИнФакт - СкидкаТрейдИн2Факт - СкидкаРозничная - СкидкаАвтоЦентра - СкидкаДополнительная - СкидкаСубсидияКредитФакт - СкидкаПоПрограммамЛояльности - ?(Параметр_ПроцентКИнвойсу, Инвойс * 1.02, Инвойс) - СуммаПредпродажнойПодготовки - СебестоимостьДО - ПредоплатаТО + (КомпенсацияРетроспективнаяИтого + КомпенсацияВИнвойсе) * НалоговаяСтавка) / НалоговаяСтавка + СкидкаДополнительная + Параметр_СуммаКВ / НалоговаяСтавка);   										
					Параметр_ЖелезнаяМаржа = РРЦ + СтоимостьДОФакт + Параметр_СебестоимостьДОКоммерция - СкидкаТрейдИнФакт - СкидкаТрейдИн2Факт - СкидкаРозничная - СкидкаАвтоЦентра - СкидкаДополнительная - СкидкаСубсидияКредитФакт - СкидкаПоПрограммамЛояльности - ?(Параметр_ПроцентКИнвойсу, Инвойс * 1.02, Инвойс) - СуммаПредпродажнойПодготовки - СебестоимостьДО - ПредоплатаТО + (КомпенсацияРетроспективнаяИтого + КомпенсацияВИнвойсе) * НалоговаяСтавка + СкидкаДополнительная;  					
					Параметр_ФактGM1 = Параметр_ЖелезнаяМаржа + Параметр_СуммаКВ; 
					Параметр_GM1БезНДС = ?(РРЦ + Параметр_СебестоимостьДОКоммерция - СкидкаТрейдИнФакт - СкидкаТрейдИн2Факт - СкидкаРозничная - СкидкаАвтоЦентра - СкидкаДополнительная - СкидкаСубсидияКредитФакт - СкидкаПоПрограммамЛояльности - ?(Параметр_ПроцентКИнвойсу, Инвойс * 1.02, Инвойс) - СуммаПредпродажнойПодготовки - СебестоимостьДО - ПредоплатаТО + (КомпенсацияРетроспективнаяИтого + КомпенсацияВИнвойсе) * НалоговаяСтавка <= 0, 
					РРЦ + СтоимостьДОФакт + Параметр_СебестоимостьДОКоммерция - СкидкаТрейдИнФакт - СкидкаТрейдИн2Факт - СкидкаРозничная - СкидкаАвтоЦентра - СкидкаДополнительная - СкидкаСубсидияКредитФакт - СкидкаПоПрограммамЛояльности - ?(Параметр_ПроцентКИнвойсу, Инвойс * 1.02, Инвойс) - СуммаПредпродажнойПодготовки - СебестоимостьДО - ПредоплатаТО + (КомпенсацияРетроспективнаяИтого + КомпенсацияВИнвойсе) * НалоговаяСтавка + СкидкаДополнительная + Параметр_СуммаКВ / НалоговаяСтавка, 
					(РРЦ + СтоимостьДОФакт + Параметр_СебестоимостьДОКоммерция - СкидкаТрейдИнФакт - СкидкаТрейдИн2Факт - СкидкаРозничная - СкидкаАвтоЦентра - СкидкаДополнительная - СкидкаСубсидияКредитФакт - СкидкаПоПрограммамЛояльности - ?(Параметр_ПроцентКИнвойсу, Инвойс * 1.02, Инвойс) - СуммаПредпродажнойПодготовки - СебестоимостьДО - ПредоплатаТО + (КомпенсацияРетроспективнаяИтого + КомпенсацияВИнвойсе) * НалоговаяСтавка) / НалоговаяСтавка + СкидкаДополнительная + Параметр_СуммаКВ / НалоговаяСтавка);   										
					//Иванченко 20260330 --
					//Иванченко 20260301 --
					//Иванченко 20260114 --															
					//Иванченко 20260109 --					
				Иначе
					//Иванченко 20260114 ++
					//Параметр_ЖелезнаяМаржа = РРЦ + СтоимостьДОФакт - СкидкаТрейдИнФакт - СкидкаТрейдИн2Факт - СкидкаРозничная - СкидкаАвтоЦентра - СкидкаДополнительная - СкидкаСубсидияКредитФакт - СкидкаПоПрограммамЛояльности - Инвойс - СуммаПредпродажнойПодготовки - СебестоимостьДО - ПредоплатаТО + КомпенсацияРетроспективнаяИтого + КомпенсацияВИнвойсе - УдержаниеКомпенсации + СкидкаДополнительная; 
					//Параметр_ФактGM1 = Параметр_ЖелезнаяМаржа + Параметр_СуммаКВ; 
					////Иванченко 20260109 ++											
					////Параметр_GM1БезНДС = ?(РРЦ + СтоимостьДОФакт - СкидкаТрейдИнФакт - СкидкаТрейдИн2Факт - СкидкаРозничная - СкидкаАвтоЦентра - СкидкаДополнительная - СкидкаСубсидияКредитФакт - СкидкаПоПрограммамЛояльности - Инвойс - СуммаПредпродажнойПодготовки - СебестоимостьДО - ПредоплатаТО + КомпенсацияРетроспективнаяИтого + КомпенсацияВИнвойсе - УдержаниеКомпенсации <= 0, РРЦ + СтоимостьДОФакт - СкидкаТрейдИнФакт - СкидкаТрейдИн2Факт - СкидкаРозничная - СкидкаАвтоЦентра - СкидкаДополнительная - СкидкаСубсидияКредитФакт - СкидкаПоПрограммамЛояльности - Инвойс - СуммаПредпродажнойПодготовки - СебестоимостьДО - ПредоплатаТО + КомпенсацияРетроспективнаяИтого + КомпенсацияВИнвойсе - УдержаниеКомпенсации + СкидкаДополнительная + Параметр_СуммаКВ / 1.2, (РРЦ + СтоимостьДОФакт - СкидкаТрейдИнФакт - СкидкаТрейдИн2Факт - СкидкаРозничная - СкидкаАвтоЦентра - СкидкаДополнительная - СкидкаСубсидияКредитФакт - СкидкаПоПрограммамЛояльности - Инвойс - СуммаПредпродажнойПодготовки - СебестоимостьДО - ПредоплатаТО + КомпенсацияРетроспективнаяИтого + КомпенсацияВИнвойсе - УдержаниеКомпенсации) / 1.2 + СкидкаДополнительная + Параметр_СуммаКВ / 1.2);
					//Параметр_GM1БезНДС = ?(РРЦ + СтоимостьДОФакт - СкидкаТрейдИнФакт - СкидкаТрейдИн2Факт - СкидкаРозничная - СкидкаАвтоЦентра - СкидкаДополнительная - СкидкаСубсидияКредитФакт - СкидкаПоПрограммамЛояльности - Инвойс - СуммаПредпродажнойПодготовки - СебестоимостьДО - ПредоплатаТО + КомпенсацияРетроспективнаяИтого + КомпенсацияВИнвойсе - УдержаниеКомпенсации <= 0, РРЦ + СтоимостьДОФакт - СкидкаТрейдИнФакт - СкидкаТрейдИн2Факт - СкидкаРозничная - СкидкаАвтоЦентра - СкидкаДополнительная - СкидкаСубсидияКредитФакт - СкидкаПоПрограммамЛояльности - Инвойс - СуммаПредпродажнойПодготовки - СебестоимостьДО - ПредоплатаТО + КомпенсацияРетроспективнаяИтого + КомпенсацияВИнвойсе - УдержаниеКомпенсации + СкидкаДополнительная + Параметр_СуммаКВ / НалоговаяСтавка, (РРЦ + СтоимостьДОФакт - СкидкаТрейдИнФакт - СкидкаТрейдИн2Факт - СкидкаРозничная - СкидкаАвтоЦентра - СкидкаДополнительная - СкидкаСубсидияКредитФакт - СкидкаПоПрограммамЛояльности - Инвойс - СуммаПредпродажнойПодготовки - СебестоимостьДО - ПредоплатаТО + КомпенсацияРетроспективнаяИтого + КомпенсацияВИнвойсе - УдержаниеКомпенсации) / НалоговаяСтавка + СкидкаДополнительная + Параметр_СуммаКВ / НалоговаяСтавка);
					////Иванченко 20260109 --
					//Иванченко 20260301 ++	
					//Параметр_ЖелезнаяМаржа = РРЦ + СтоимостьДОФакт - СкидкаТрейдИнФакт - СкидкаТрейдИн2Факт - СкидкаРозничная - СкидкаАвтоЦентра - СкидкаДополнительная - СкидкаСубсидияКредитФакт - СкидкаПоПрограммамЛояльности - ?(Параметр_ПроцентКИнвойсу, Инвойс * 1.02, Инвойс) - СуммаПредпродажнойПодготовки - СебестоимостьДО - ПредоплатаТО + КомпенсацияРетроспективнаяИтого + КомпенсацияВИнвойсе - УдержаниеКомпенсации + СкидкаДополнительная; 
					//Параметр_ФактGM1 = Параметр_ЖелезнаяМаржа + Параметр_СуммаКВ; 
					//Параметр_GM1БезНДС = ?(РРЦ + СтоимостьДОФакт - СкидкаТрейдИнФакт - СкидкаТрейдИн2Факт - СкидкаРозничная - СкидкаАвтоЦентра - СкидкаДополнительная - СкидкаСубсидияКредитФакт - СкидкаПоПрограммамЛояльности - ?(Параметр_ПроцентКИнвойсу, Инвойс * 1.02, Инвойс) - СуммаПредпродажнойПодготовки - СебестоимостьДО - ПредоплатаТО + КомпенсацияРетроспективнаяИтого + КомпенсацияВИнвойсе - УдержаниеКомпенсации <= 0, РРЦ + СтоимостьДОФакт - СкидкаТрейдИнФакт - СкидкаТрейдИн2Факт - СкидкаРозничная - СкидкаАвтоЦентра - СкидкаДополнительная - СкидкаСубсидияКредитФакт - СкидкаПоПрограммамЛояльности - ?(Параметр_ПроцентКИнвойсу, Инвойс * 1.02, Инвойс) - СуммаПредпродажнойПодготовки - СебестоимостьДО - ПредоплатаТО + КомпенсацияРетроспективнаяИтого + КомпенсацияВИнвойсе - УдержаниеКомпенсации + СкидкаДополнительная + Параметр_СуммаКВ / НалоговаяСтавка, (РРЦ + СтоимостьДОФакт - СкидкаТрейдИнФакт - СкидкаТрейдИн2Факт - СкидкаРозничная - СкидкаАвтоЦентра - СкидкаДополнительная - СкидкаСубсидияКредитФакт - СкидкаПоПрограммамЛояльности - ?(Параметр_ПроцентКИнвойсу, Инвойс * 1.02, Инвойс) - СуммаПредпродажнойПодготовки - СебестоимостьДО - ПредоплатаТО + КомпенсацияРетроспективнаяИтого + КомпенсацияВИнвойсе - УдержаниеКомпенсации) / НалоговаяСтавка + СкидкаДополнительная + Параметр_СуммаКВ / НалоговаяСтавка);					
					//Иванченко 20260330 ++					
					//Параметр_ЖелезнаяМаржа = РРЦ + СтоимостьДОФакт - Параметр_ЗННаДО + Параметр_СебестоимостьДОКоммерция - СкидкаТрейдИнФакт - СкидкаТрейдИн2Факт - СкидкаРозничная - СкидкаАвтоЦентра - СкидкаДополнительная - СкидкаСубсидияКредитФакт - СкидкаПоПрограммамЛояльности - ?(Параметр_ПроцентКИнвойсу, Инвойс * 1.02, Инвойс) - СуммаПредпродажнойПодготовки - СебестоимостьДО - ПредоплатаТО + КомпенсацияРетроспективнаяИтого + КомпенсацияВИнвойсе - УдержаниеКомпенсации + СкидкаДополнительная; 
					//Параметр_ФактGM1 = Параметр_ЖелезнаяМаржа + Параметр_СуммаКВ; 
					//Параметр_GM1БезНДС = ?(РРЦ + СтоимостьДОФакт - Параметр_ЗННаДО + Параметр_СебестоимостьДОКоммерция - СкидкаТрейдИнФакт - СкидкаТрейдИн2Факт - СкидкаРозничная - СкидкаАвтоЦентра - СкидкаДополнительная - СкидкаСубсидияКредитФакт - СкидкаПоПрограммамЛояльности - ?(Параметр_ПроцентКИнвойсу, Инвойс * 1.02, Инвойс) - СуммаПредпродажнойПодготовки - СебестоимостьДО - ПредоплатаТО + КомпенсацияРетроспективнаяИтого + КомпенсацияВИнвойсе - УдержаниеКомпенсации <= 0, 
					//РРЦ + СтоимостьДОФакт - Параметр_ЗННаДО + Параметр_СебестоимостьДОКоммерция - СкидкаТрейдИнФакт - СкидкаТрейдИн2Факт - СкидкаРозничная - СкидкаАвтоЦентра - СкидкаДополнительная - СкидкаСубсидияКредитФакт - СкидкаПоПрограммамЛояльности - ?(Параметр_ПроцентКИнвойсу, Инвойс * 1.02, Инвойс) - СуммаПредпродажнойПодготовки - СебестоимостьДО - ПредоплатаТО + КомпенсацияРетроспективнаяИтого + КомпенсацияВИнвойсе - УдержаниеКомпенсации + СкидкаДополнительная + Параметр_СуммаКВ / НалоговаяСтавка, 
					//(РРЦ + СтоимостьДОФакт - Параметр_ЗННаДО + Параметр_СебестоимостьДОКоммерция - СкидкаТрейдИнФакт - СкидкаТрейдИн2Факт - СкидкаРозничная - СкидкаАвтоЦентра - СкидкаДополнительная - СкидкаСубсидияКредитФакт - СкидкаПоПрограммамЛояльности - ?(Параметр_ПроцентКИнвойсу, Инвойс * 1.02, Инвойс) - СуммаПредпродажнойПодготовки - СебестоимостьДО - ПредоплатаТО + КомпенсацияРетроспективнаяИтого + КомпенсацияВИнвойсе - УдержаниеКомпенсации) / НалоговаяСтавка + СкидкаДополнительная + Параметр_СуммаКВ / НалоговаяСтавка);										
					Параметр_ЖелезнаяМаржа = РРЦ + СтоимостьДОФакт + Параметр_СебестоимостьДОКоммерция - СкидкаТрейдИнФакт - СкидкаТрейдИн2Факт - СкидкаРозничная - СкидкаАвтоЦентра - СкидкаДополнительная - СкидкаСубсидияКредитФакт - СкидкаПоПрограммамЛояльности - ?(Параметр_ПроцентКИнвойсу, Инвойс * 1.02, Инвойс) - СуммаПредпродажнойПодготовки - СебестоимостьДО - ПредоплатаТО + КомпенсацияРетроспективнаяИтого + КомпенсацияВИнвойсе - УдержаниеКомпенсации + СкидкаДополнительная; 
					Параметр_ФактGM1 = Параметр_ЖелезнаяМаржа + Параметр_СуммаКВ; 
					Параметр_GM1БезНДС = ?(РРЦ + СтоимостьДОФакт + Параметр_СебестоимостьДОКоммерция - СкидкаТрейдИнФакт - СкидкаТрейдИн2Факт - СкидкаРозничная - СкидкаАвтоЦентра - СкидкаДополнительная - СкидкаСубсидияКредитФакт - СкидкаПоПрограммамЛояльности - ?(Параметр_ПроцентКИнвойсу, Инвойс * 1.02, Инвойс) - СуммаПредпродажнойПодготовки - СебестоимостьДО - ПредоплатаТО + КомпенсацияРетроспективнаяИтого + КомпенсацияВИнвойсе - УдержаниеКомпенсации <= 0, 
					РРЦ + СтоимостьДОФакт + Параметр_СебестоимостьДОКоммерция - СкидкаТрейдИнФакт - СкидкаТрейдИн2Факт - СкидкаРозничная - СкидкаАвтоЦентра - СкидкаДополнительная - СкидкаСубсидияКредитФакт - СкидкаПоПрограммамЛояльности - ?(Параметр_ПроцентКИнвойсу, Инвойс * 1.02, Инвойс) - СуммаПредпродажнойПодготовки - СебестоимостьДО - ПредоплатаТО + КомпенсацияРетроспективнаяИтого + КомпенсацияВИнвойсе - УдержаниеКомпенсации + СкидкаДополнительная + Параметр_СуммаКВ / НалоговаяСтавка, 
					(РРЦ + СтоимостьДОФакт + Параметр_СебестоимостьДОКоммерция - СкидкаТрейдИнФакт - СкидкаТрейдИн2Факт - СкидкаРозничная - СкидкаАвтоЦентра - СкидкаДополнительная - СкидкаСубсидияКредитФакт - СкидкаПоПрограммамЛояльности - ?(Параметр_ПроцентКИнвойсу, Инвойс * 1.02, Инвойс) - СуммаПредпродажнойПодготовки - СебестоимостьДО - ПредоплатаТО + КомпенсацияРетроспективнаяИтого + КомпенсацияВИнвойсе - УдержаниеКомпенсации) / НалоговаяСтавка + СкидкаДополнительная + Параметр_СуммаКВ / НалоговаяСтавка);										
					//Иванченко 20260330 --										
					//Иванченко 20260301 --	
					//Иванченко 20260114 --										
				КонецЕсли;
				
			Иначе
				//Иванченко 20260301 ++	
				//Параметр_ЖелезнаяМаржа = РРЦ + СтоимостьДОФакт - СкидкаТрейдИнФакт - СкидкаТрейдИн2Факт - СкидкаРозничная - СкидкаАвтоЦентра - СкидкаДополнительная - СкидкаСубсидияКредитФакт - СкидкаПоПрограммамЛояльности - ?(Параметр_ПроцентКИнвойсу, Инвойс * 1.02, Инвойс) - СуммаПредпродажнойПодготовки - СебестоимостьДО - ПредоплатаТО - УдержаниеКомпенсации + СкидкаДополнительная + ?(СуммаОферты = 0, СуммаОферты, ?(Параметр_ПроцентКИнвойсу, Инвойс * 1.02, Инвойс) - СуммаОферты);
				//Параметр_ФактGM1 = Параметр_ЖелезнаяМаржа + Параметр_СуммаКВ;
				////Иванченко 20260109 ++									
				////Иванченко 20251217 ++							
				////Параметр_GM1БезНДС = ?(РРЦ + СтоимостьДОФакт - СкидкаТрейдИнФакт - СкидкаТрейдИн2Факт - СкидкаРозничная - СкидкаАвтоЦентра - СкидкаДополнительная - СкидкаСубсидияКредитФакт - СкидкаПоПрограммамЛояльности - Инвойс - СуммаПредпродажнойПодготовки - СебестоимостьДО - ПредоплатаТО - УдержаниеКомпенсации <= 0, РРЦ + СтоимостьДОФакт - СкидкаТрейдИнФакт - СкидкаТрейдИн2Факт - СкидкаРозничная - СкидкаАвтоЦентра - СкидкаДополнительная - СкидкаСубсидияКредитФакт - СкидкаПоПрограммамЛояльности - Инвойс - СуммаПредпродажнойПодготовки - СебестоимостьДО - ПредоплатаТО - УдержаниеКомпенсации + СкидкаДополнительная + ?(СуммаОферты = 0, СуммаОферты, Инвойс - СуммаОферты) + Параметр_СуммаКВ / 1.2, (РРЦ + СтоимостьДОФакт - СкидкаТрейдИнФакт - СкидкаТрейдИн2Факт - СкидкаРозничная - СкидкаАвтоЦентра - СкидкаДополнительная - СкидкаСубсидияКредитФакт - СкидкаПоПрограммамЛояльности - Инвойс - СуммаПредпродажнойПодготовки - СебестоимостьДО - ПредоплатаТО - УдержаниеКомпенсации + СкидкаДополнительная + ?(СуммаОферты = 0, СуммаОферты, Инвойс - СуммаОферты)) / 1.2) + Параметр_СуммаКВ / 1.2; 	
				////Параметр_GM1БезНДС = ?(РРЦ + СтоимостьДОФакт - СкидкаТрейдИнФакт - СкидкаТрейдИн2Факт - СкидкаРозничная - СкидкаАвтоЦентра - СкидкаДополнительная - СкидкаСубсидияКредитФакт - СкидкаПоПрограммамЛояльности - Инвойс - СуммаПредпродажнойПодготовки - СебестоимостьДО - ПредоплатаТО - УдержаниеКомпенсации <= 0, РРЦ + СтоимостьДОФакт - СкидкаТрейдИнФакт - СкидкаТрейдИн2Факт - СкидкаРозничная - СкидкаАвтоЦентра - СкидкаДополнительная - СкидкаСубсидияКредитФакт - СкидкаПоПрограммамЛояльности - Инвойс - СуммаПредпродажнойПодготовки - СебестоимостьДО - ПредоплатаТО - УдержаниеКомпенсации + СкидкаДополнительная + ?(СуммаОферты = 0, СуммаОферты, Инвойс - СуммаОферты) + Параметр_СуммаКВ / 1.2, (РРЦ + СтоимостьДОФакт - СкидкаТрейдИнФакт - СкидкаТрейдИн2Факт - СкидкаРозничная - СкидкаАвтоЦентра - СкидкаДополнительная - СкидкаСубсидияКредитФакт - СкидкаПоПрограммамЛояльности - Инвойс - СуммаПредпродажнойПодготовки - СебестоимостьДО - ПредоплатаТО - УдержаниеКомпенсации + СкидкаДополнительная) / 1.2 + ?(СуммаОферты = 0, СуммаОферты, Инвойс - СуммаОферты) + Параметр_СуммаКВ / 1.2);				
				//Параметр_GM1БезНДС = ?(РРЦ + СтоимостьДОФакт - СкидкаТрейдИнФакт - СкидкаТрейдИн2Факт - СкидкаРозничная - СкидкаАвтоЦентра - СкидкаДополнительная - СкидкаСубсидияКредитФакт - СкидкаПоПрограммамЛояльности - ?(Параметр_ПроцентКИнвойсу, Инвойс * 1.02, Инвойс) - СуммаПредпродажнойПодготовки - СебестоимостьДО - ПредоплатаТО - УдержаниеКомпенсации <= 0, РРЦ + СтоимостьДОФакт - СкидкаТрейдИнФакт - СкидкаТрейдИн2Факт - СкидкаРозничная - СкидкаАвтоЦентра - СкидкаДополнительная - СкидкаСубсидияКредитФакт - СкидкаПоПрограммамЛояльности - ?(Параметр_ПроцентКИнвойсу, Инвойс * 1.02, Инвойс) - СуммаПредпродажнойПодготовки - СебестоимостьДО - ПредоплатаТО - УдержаниеКомпенсации + СкидкаДополнительная + ?(СуммаОферты = 0, СуммаОферты, ?(Параметр_ПроцентКИнвойсу, Инвойс * 1.02, Инвойс) - СуммаОферты) + Параметр_СуммаКВ / НалоговаяСтавка, (РРЦ + СтоимостьДОФакт - СкидкаТрейдИнФакт - СкидкаТрейдИн2Факт - СкидкаРозничная - СкидкаАвтоЦентра - СкидкаДополнительная - СкидкаСубсидияКредитФакт - СкидкаПоПрограммамЛояльности - ?(Параметр_ПроцентКИнвойсу, Инвойс * 1.02, Инвойс) - СуммаПредпродажнойПодготовки - СебестоимостьДО - ПредоплатаТО - УдержаниеКомпенсации + СкидкаДополнительная) / НалоговаяСтавка + ?(СуммаОферты = 0, СуммаОферты, ?(Параметр_ПроцентКИнвойсу, Инвойс * 1.02, Инвойс) - СуммаОферты) + Параметр_СуммаКВ / НалоговаяСтавка);				
				Параметр_ЖелезнаяМаржа = РРЦ + СтоимостьДОФакт - СкидкаТрейдИнФакт - СкидкаТрейдИн2Факт - СкидкаРозничная - СкидкаАвтоЦентра - СкидкаДополнительная - СкидкаСубсидияКредитФакт - СкидкаПоПрограммамЛояльности - ?(Параметр_ПроцентКИнвойсу, Инвойс * 1.02, Инвойс) - СуммаПредпродажнойПодготовки - СебестоимостьДО - ПредоплатаТО - УдержаниеКомпенсации + СкидкаДополнительная + ?(СуммаОферты = 0, СуммаОферты, ?(Параметр_ПроцентКИнвойсу, Инвойс * 1.02, Инвойс) - СуммаОферты);
				Параметр_ФактGM1 = Параметр_ЖелезнаяМаржа + Параметр_СуммаКВ;
				Параметр_GM1БезНДС = ?(РРЦ + СтоимостьДОФакт - СкидкаТрейдИнФакт - СкидкаТрейдИн2Факт - СкидкаРозничная - СкидкаАвтоЦентра - СкидкаДополнительная - СкидкаСубсидияКредитФакт - СкидкаПоПрограммамЛояльности - ?(Параметр_ПроцентКИнвойсу, Инвойс * 1.02, Инвойс) - СуммаПредпродажнойПодготовки - СебестоимостьДО - ПредоплатаТО - УдержаниеКомпенсации <= 0, РРЦ + СтоимостьДОФакт - СкидкаТрейдИнФакт - СкидкаТрейдИн2Факт - СкидкаРозничная - СкидкаАвтоЦентра - СкидкаДополнительная - СкидкаСубсидияКредитФакт - СкидкаПоПрограммамЛояльности - ?(Параметр_ПроцентКИнвойсу, Инвойс * 1.02, Инвойс) - СуммаПредпродажнойПодготовки - СебестоимостьДО - ПредоплатаТО - УдержаниеКомпенсации + СкидкаДополнительная + ?(СуммаОферты = 0, СуммаОферты, ?(Параметр_ПроцентКИнвойсу, Инвойс * 1.02, Инвойс) - СуммаОферты) + Параметр_СуммаКВ / НалоговаяСтавка, (РРЦ + СтоимостьДОФакт - СкидкаТрейдИнФакт - СкидкаТрейдИн2Факт - СкидкаРозничная - СкидкаАвтоЦентра - СкидкаДополнительная - СкидкаСубсидияКредитФакт - СкидкаПоПрограммамЛояльности - ?(Параметр_ПроцентКИнвойсу, Инвойс * 1.02, Инвойс) - СуммаПредпродажнойПодготовки - СебестоимостьДО - ПредоплатаТО - УдержаниеКомпенсации + СкидкаДополнительная) / НалоговаяСтавка + ?(СуммаОферты = 0, СуммаОферты, ?(Параметр_ПроцентКИнвойсу, Инвойс * 1.02, Инвойс) - СуммаОферты) + Параметр_СуммаКВ / НалоговаяСтавка);				
				//Иванченко 20260301 --	
				//Иванченко 20260109 --				
			//Иванченко 20251107 --
			//Иванченко 20251102 --
			//Иванченко 20251101 --
			КонецЕсли;	 	 
			
			//Иванченко 20260330 ++
			// Исключение
			//Если Автомобиль.VIN = "EDEFB32B2TE009916" Тогда
			//	Параметр_ЖелезнаяМаржа = Параметр_ЖелезнаяМаржа + 50000;
			//	Параметр_ФактGM1 = Параметр_ФактGM1 + 50000; 
			//	Параметр_GM1БезНДС = Параметр_GM1БезНДС + 50000;  
			//КонецЕсли;
			//Иванченко 20260330 --
			
			Параметр_Рентабельность = Параметр_GM1БезНДС / ?(ДКПавто=0, 1, ДКПавто) * 100;  
			
			ОбластьРасчетGM1.Параметры.ПланGM1 = Формат(Окр(Параметр_ПланGM1, 2), "ЧДЦ=2; ЧН=0");    			
			ОбластьРасчетGM1.Параметры.ЖелезнаяМаржа = Формат(Окр(Параметр_ЖелезнаяМаржа, 2), "ЧДЦ=2; ЧН=0"); 
			ОбластьРасчетGM1.Параметры.ФактGM1 = Формат(Окр(Параметр_ФактGM1, 2), "ЧДЦ=2; ЧН=0");    
			ОбластьРасчетGM1.Параметры.GM1БезНДС = Формат(Окр(Параметр_GM1БезНДС, 2), "ЧДЦ=2; ЧН=0");  
			ОбластьРасчетGM1.Параметры.СуммаКВ = Формат(Окр(Параметр_СуммаКВ, 2), "ЧДЦ=2; ЧН=0");
			ОбластьРасчетGM1.Параметры.Рентабельность = Формат(Окр(Параметр_Рентабельность, 1), "ЧДЦ=1; ЧН=0%; ЧФ=Ч%");     			
			//Иванченко 20251024 --			
			
			ЗапросХранение = Новый Запрос;
			ЗапросХранение.Текст = "ВЫБРАТЬ
			|	ОстаткиАвтомобилейОбороты.Автомобиль КАК Автомобиль,
			|	МАКСИМУМ(ВЫБОР
			|			КОГДА ВЫБОР
			|					КОГДА ОстаткиАвтомобилейОбороты.Регистратор.ХозОперация = ЗНАЧЕНИЕ(Справочник.ХозОперации.ПоступлениеАвтомобилейОтветственноеХранение)
			|							ИЛИ ОстаткиАвтомобилейОбороты.Регистратор.ХозОперация = ЗНАЧЕНИЕ(Справочник.ХозОперации.ВводОстатковАвтомобилейНаОтветственномХранении)
			|						ТОГДА ОстаткиАвтомобилейОбороты.Регистратор
			|				КОНЕЦ = ОстаткиАвтомобилейОбороты.Партия
			|				ТОГДА ОстаткиАвтомобилейОбороты.Партия.Дата
			|		КОНЕЦ) КАК ПоступлениеОХ,
			|	МАКСИМУМ(ОстаткиАвтомобилейОбороты.Партия.Дата) КАК Поступление
			|ПОМЕСТИТЬ ВТ_Соответствие
			|ИЗ
			|	РегистрНакопления.ОстаткиАвтомобилей.Обороты(, , Регистратор, Автомобиль = &Автомобиль) КАК ОстаткиАвтомобилейОбороты
			|
			|СГРУППИРОВАТЬ ПО
			|	ОстаткиАвтомобилейОбороты.Автомобиль
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	ВТ_Соответствие.Автомобиль КАК Автомобиль,
			|	ЕСТЬNULL(ВТ_Соответствие.ПоступлениеОХ, ВТ_Соответствие.Поступление) КАК ДатаПоступления,
			|	NULL КАК ДатаИнвентаризации,
			|	NULL КАК ДатаРеализации
			|ПОМЕСТИТЬ ВТ_Объединение
			|ИЗ
			|	ВТ_Соответствие КАК ВТ_Соответствие
			|
			|ОБЪЕДИНИТЬ ВСЕ
			|
			|ВЫБРАТЬ
			|	ОстаткиАвтомобилейОбороты.Автомобиль,
			|	NULL,
			|	NULL,
			|	МАКСИМУМ(ОстаткиАвтомобилейОбороты.Регистратор.Дата)
			|ИЗ
			|	РегистрНакопления.ОстаткиАвтомобилей.Обороты(, , Регистратор, Автомобиль = &Автомобиль) КАК ОстаткиАвтомобилейОбороты
			|ГДЕ
			|	(ОстаткиАвтомобилейОбороты.Регистратор ССЫЛКА Документ.РеализацияАвтомобилей
			|			ИЛИ ОстаткиАвтомобилейОбороты.Регистратор ССЫЛКА Документ.ОтгрузкаАвтомобиляБезРеализации)
			|
			|СГРУППИРОВАТЬ ПО
			|	ОстаткиАвтомобилейОбороты.Автомобиль
			|
			|ОБЪЕДИНИТЬ ВСЕ
			|
			|ВЫБРАТЬ
			|	ИнвентаризацияАвтомобилейАвтомобили.Автомобиль,
			|	NULL,
			|	МИНИМУМ(ИнвентаризацияАвтомобилейАвтомобили.Ссылка.Дата),
			|	NULL
			|ИЗ
			|	Документ.ИнвентаризацияАвтомобилей.Автомобили КАК ИнвентаризацияАвтомобилейАвтомобили
			|ГДЕ
			|	ИнвентаризацияАвтомобилейАвтомобили.Автомобиль = &Автомобиль
			|
			|СГРУППИРОВАТЬ ПО
			|	ИнвентаризацияАвтомобилейАвтомобили.Автомобиль
			|
			|ОБЪЕДИНИТЬ ВСЕ
			|
			|ВЫБРАТЬ
			|	ИнвентаризацияАвтомобилейОбщаяАвтомобили.Автомобиль,
			|	NULL,
			|	МИНИМУМ(ИнвентаризацияАвтомобилейОбщаяАвтомобили.Ссылка.Дата),
			|	NULL
			|ИЗ
			|	Документ.ИнвентаризацияАвтомобилейОбщая.Автомобили КАК ИнвентаризацияАвтомобилейОбщаяАвтомобили
			|ГДЕ
			|	ИнвентаризацияАвтомобилейОбщаяАвтомобили.Автомобиль = &Автомобиль
			|
			|СГРУППИРОВАТЬ ПО
			|	ИнвентаризацияАвтомобилейОбщаяАвтомобили.Автомобиль
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	ВТ_Объединение.Автомобиль КАК Автомобиль,
			|	МАКСИМУМ(ВТ_Объединение.ДатаПоступления) КАК ДатаПоступления,
			|	МАКСИМУМ(ВТ_Объединение.ДатаИнвентаризации) КАК ДатаИнвентаризации,
			|	МАКСИМУМ(ВТ_Объединение.ДатаРеализации) КАК ДатаРеализации
			|ПОМЕСТИТЬ ВТ
			|ИЗ
			|	ВТ_Объединение КАК ВТ_Объединение
			|
			|СГРУППИРОВАТЬ ПО
			|	ВТ_Объединение.Автомобиль
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	ВТ.Автомобиль КАК Автомобиль,
			|	РАЗНОСТЬДАТ(ЕСТЬNULL(ЕСТЬNULL(ВТ.ДатаПоступления, ВТ.ДатаИнвентаризации), ДАТАВРЕМЯ(2016, 1, 1)), ЕСТЬNULL(ВТ.ДатаРеализации, &Дата), ДЕНЬ) КАК ДнейВГК
			|ИЗ
			|	ВТ КАК ВТ"; 
			
			//Иванченко 20251020 ++			
			//ЗапросХранение.Параметры.Вставить("Дата", Дата);     
			ЗапросХранение.Параметры.Вставить("Дата", ТекущаяДата());  			
			//Иванченко 20251020 --			
			ЗапросХранение.Параметры.Вставить("Автомобиль", Автомобиль);
			
			//Иванченко 20251020 ++
			//Попытка	ОбластьРасчетGM1.Параметры.ДнейВГК = Формат(ЗапросХранение.Выполнить().Выгрузить()[0].ДнейВГК, "ЧН='0 (1)'"); Исключение КонецПопытки; 
			РезультатХранение = ЗапросХранение.Выполнить().Выгрузить();
			
			Если РезультатХранение.Количество() = 0 Тогда
				Параметр_ДнейВГК = "В ПУТИ"; 
			Иначе
				Параметр_ДнейВГК = РезультатХранение[0].ДнейВГК;
			КонецЕсли;	
			
			Если Параметр_ДнейВГК = "В ПУТИ" Тогда	
				ОбластьРасчетGM1.Параметры.ДнейВГК = Параметр_ДнейВГК; 
			Иначе 
				ОбластьРасчетGM1.Параметры.ДнейВГК = Формат(Параметр_ДнейВГК, "ЧН='0 (1)'"); 
			КонецЕсли;
			//Иванченко 20251020 --
			
			//Иванченко 20251122 ++
			//ОбластьРасчетGM1.Параметры.Оплачен = Автомобиль.Оплачен;  
			
			Если Автомобиль.ДатаОплаты <> Дата(1,1,1) Тогда 
				ОбластьРасчетGM1.Параметры.ДатаОплаты = "Оплачен: "+Формат(Автомобиль.ДатаОплаты,"ДФ=dd.MM.yyyy");		
			Иначе
				ОбластьРасчетGM1.Параметры.ДатаОплаты = "Оплачен: НЕТ.";
			КонецЕсли;      
		//Иванченко 20251122 --
		
			ТабДокумент.Вывести(ОбластьРасчетGM1);  
		КонецЕсли;
		//Иванченко 20250923 --
		
		//Бондаренко++ 20250715
		Если Автомобиль.ДатаРитейла <> Дата(1,1,1) Тогда
			РитейлОбласть.Параметры.ДатаРитейла = "Дата рапорта: "+Формат(Автомобиль.ДатаРитейла,"ДФ=dd.MM.yyyy");		
		Иначе
			РитейлОбласть.Параметры.ДатаРитейла = "Дата рапорта: НЕТ.";		
		КонецЕсли; 
		
		//Иванченко 20251110 ++
		Если Автомобиль.Модель.Марка = Справочники.Марка.HAVAL И Автомобиль.ДатаФинансирования <> Дата(1,1,1) Тогда
			РитейлОбласть.Параметры.ДатаФинансирования = "Дата финансирования: "+Формат(Автомобиль.ДатаФинансирования,"ДФ=dd.MM.yyyy");		
		КонецЕсли; 
		//Иванченко 20251110 --		
		
		//Иванченко 20251127 ++
		Если ЕстьДиректоваяПрограмма И (Автомобиль.Модель.Марка = Справочники.Марка.HAVAL
				ИЛИ Автомобиль.Модель.Марка = Справочники.Марка.CHERY
				ИЛИ Автомобиль.Модель.Марка = Справочники.Марка.TENET
				ИЛИ Автомобиль.Модель.Марка = Справочники.Марка.EXEED
				ИЛИ Автомобиль.Модель.Марка = Справочники.Марка.OMODA
				ИЛИ Автомобиль.Модель.Марка = Справочники.Марка.JAECOO)Тогда
			РитейлОбласть.Параметры.ЕстьДиректоваяПрограмма = "Директовая программа: ДА.";
		Иначе
			РитейлОбласть.Параметры.ЕстьДиректоваяПрограмма = "Директовая программа: НЕТ.";					
		КонецЕсли; 
		//Иванченко 20251127 --				
		
		//Иванченко 20251011 ++
		//Иванченко 20251122 ++
		//Если Автомобиль.ДатаОплаты <> Дата(1,1,1) Тогда 
		//	РитейлОбласть.Параметры.ДатаОплаты = "Дата оплаты: "+Формат(Автомобиль.ДатаОплаты,"ДФ=dd.MM.yyyy");		
		//Иначе
		//	РитейлОбласть.Параметры.ДатаОплаты = "Дата оплаты: НЕТ.";
		//КонецЕсли;      
		//Иванченко 20251122 --				
		//Иванченко 20251011 --
		
		ТабДокумент.Вывести(РитейлОбласть);
		//Бондаренко-- 20250715
		
		ТабДокумент.АвтоМасштаб = Истина;
		ТабДокумент.ОтображатьСетку = Ложь;
		ТабДокумент.ПолеСверху = 5;
		ТабДокумент.ПолеСлева = 5;
		ТабДокумент.ПолеСнизу = 5;
		ТабДокумент.ПолеСправа = 5; 
		
		ТабДокумент.РазмерКолонтитулаСверху = 10;
		ТабДокумент.ВерхнийКолонтитул.ВертикальноеПоложение = ВертикальноеПоложение.Верх;
		ТабДокумент.ВерхнийКолонтитул.НачальнаяСтраница = 1;
		ТабДокумент.ВерхнийКолонтитул.Выводить = Истина;	
		
		ТабДокумент.РазмерКолонтитулаСнизу = 10;
		ТабДокумент.НижнийКолонтитул.ВертикальноеПоложение = ВертикальноеПоложение.Верх;
		ТабДокумент.НижнийКолонтитул.НачальнаяСтраница = 1;
		ТабДокумент.НижнийКолонтитул.Выводить = Истина;	
		
		//Галактионов++ 15062026  
		Если Статус = Справочники.СтатусыРабочегоЛиста.Сделка ИЛИ Статус = Справочники.СтатусыРабочегоЛиста.Продажа Тогда
			РегистрыСведений.SM_ФиксацияРабочихЛистов.ДобавитьЗапись(Ссылка);
		КонецЕсли;
		//Галактионов-- 15062026
		Возврат ТабДокумент
		
	КонецФункции 
	
	//Бондаренко++ 20250905
	Функция НайтиРЛКО(СсылкаНаРЛ)
		
		РЛКО_ = "";
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	РабочийЛистКредитногоОтдела.Ссылка КАК РЛКО,
		|	РабочийЛистКредитногоОтдела.ПометкаУдаления КАК ПометкаУдаления,
		|	РабочийЛистКредитногоОтдела.ДокументОснование КАК ДокументОснование
		|ИЗ
		|	Документ.РабочийЛистКредитногоОтдела КАК РабочийЛистКредитногоОтдела
		|ГДЕ
		|	РабочийЛистКредитногоОтдела.ДокументОснование = &СсылкаНаРЛ
		|	И НЕ РабочийЛистКредитногоОтдела.ПометкаУдаления
		|	И РабочийЛистКредитногоОтдела.Статус <> ЗНАЧЕНИЕ(Справочник.СтатусыРабочегоЛиста.Отказ)";
		
		Запрос.УстановитьПараметр("СсылкаНаРЛ", СсылкаНаРЛ);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			РЛКО_ = ВыборкаДетальныеЗаписи.РЛКО
		КонецЦикла;
		
		Возврат РЛКО_;
		
	КонецФункции // ДокРЛКО(Ссылка)
	//Бондаренко-- 20250905
	
	Функция ФамилияИО(Знач ФИО) Экспорт
		Если ТипЗнч(ФИО)<>Тип("Строка") Тогда
			Сообщить("Неверная строка передана в ""ФамилияИО(...)!"""); Возврат ФИО;
		КонецЕсли;
		
		// уберем множественные пробелы
		Пока 1=1 Цикл
			ФИО=СокрЛП(СтрЗаменить(ФИО,"  "," "));
			Если Найти(ФИО,"  ")=0 Тогда Прервать КонецЕсли;
		КонецЦикла;
		//ФИО=СокрЛП(НРег(ФИО)); // так удобнее
		
		Фамилия = "";
		Для й = 1 По СтрДлина(ФИО) Цикл
			символс = Сред(ФИО, й, 1);
			Если символс = " " Тогда Прервать КонецЕсли;
			Фамилия = Фамилия + символс;
		КонецЦикла;
		
		ы=й + 1; // перешли пробел
		Имя = "";
		Для й = ы По СтрДлина(ФИО) Цикл
			символс = Сред(ФИО, й, 1);
			Если символс=" " Тогда Прервать КонецЕсли;
			Имя = Имя + символс;
		КонецЦикла;
		
		Если Прав(Имя, 1) = "." Тогда
			Возврат ФИО;
		КонецЕсли;
		
		ы = й + 1; // перешли второй пробел
		Отчество = "";
		Для й = ы По СтрДлина(ФИО) Цикл
			символс = Сред(ФИО, й, 1);
			Если символс = " " Тогда Прервать КонецЕсли;
			Отчество = Отчество + символс;
		КонецЦикла;
		
		Фамилия = ВРег(Лев(Фамилия, 1)) + Сред(Фамилия, 2);
		Возврат Фамилия + " " + ВРег(Лев(Имя, 1)) + "." + ВРег(Лев(Отчество, 1)) + ".";
	КонецФункции
	
	Функция ПадежФИО(Знач ФИО,Падеж = 2, ТолькоИнициалы = Ложь) Экспорт
		Если ТипЗнч(ФИО)<>Тип("Строка") Тогда
			Сообщить("Неверная строка передана ""падежу ФИО!"""); Возврат ФИО;
		КонецЕсли;
		
		// уберем множественные пробелы
		Пока 1=1 Цикл
			ФИО=СокрЛП(СтрЗаменить(ФИО,"  "," "));
			Если Найти(ФИО,"  ")=0 Тогда Прервать КонецЕсли;
		КонецЦикла;
		
		// вернем, если сам именительный
		Если (Лев(Падеж,1)="И") или (Падеж=1) Тогда Возврат ФИО КонецЕсли;
		
		Если ТипЗнч(Падеж)=Тип("Строка") Тогда
			пад=СокрЛП(НРег(Лев(Падеж,1))); 
			Если Найти("рдвтп",пад)=0 Тогда
				Сообщить("Неверный падеж передан ""падежу ФИО""!"); Возврат ФИО;
			КонецЕсли;
		ИначеЕсли ТипЗнч(Падеж)=Тип("Число") Тогда
			Если (Падеж<1) или (Падеж>6) Тогда
				Сообщить("Неверный падеж передан ""падежу ФИО""!"); Возврат ФИО;
			КонецЕсли;			
			пад=Падеж-1;
		КонецЕсли;
		
		ФИО=СокрЛП(НРег(ФИО)); // так удобнее
		
		// свой анализатор состава
		Фамилия="";
		Для й=1 По СтрДлина(ФИО) Цикл
			символс=Сред(ФИО,й,1);
			Если символс=" " Тогда Прервать КонецЕсли;
			Фамилия=Фамилия+символс;
		КонецЦикла;
		ы=й+1; // перешли пробел
		Имя="";
		Для й=ы По СтрДлина(ФИО) Цикл
			символс=Сред(ФИО,й,1);
			Если символс=" " Тогда Прервать КонецЕсли;
			Имя=Имя+символс;
		КонецЦикла;
		ы=й+1; // перешли второй пробел
		Отчество="";
		Для й=ы По СтрДлина(ФИО) Цикл
			символс=Сред(ФИО,й,1);
			Если символс=" " Тогда Прервать КонецЕсли;
			Отчество=Отчество+символс;
		КонецЦикла;
		
		// теперь имеем раздельно Фамилию, Имя и Отчество.	
		// начинается собственно блок анализа содержания и падежей
		
		// проанализируем пол М/Ж
		Если Прав(Отчество,1)="а" Тогда Пол="Ж" Иначе Пол="М" КонецЕсли;
		
		// создадим структуру таблицы, хранящей окончания слов
		ток = Новый ТаблицаЗначений ();
		ТипСтроки=Новый ОписаниеТипов("Строка",Новый КвалификаторыСтроки(2));
		ТипЧисла=Новый ОписаниеТипов("Число",Новый КвалификаторыЧисла(1,0));
		ток.Колонки.Добавить("СтарОк",ТипСтроки); // старое окончание 2 символа
		// колонки, хранящие новые окончания слов
		ток.Колонки.Добавить("р"); // родительный
		ток.Колонки.Добавить("д"); // дательный
		ток.Колонки.Добавить("в"); // винительный
		ток.Колонки.Добавить("т"); // творительный
		ток.Колонки.Добавить("п"); // предложный
		// для указания, сколько букв с конца слова отсечь,
		ток.Колонки.Добавить("КолвоСрез",ТипЧисла); // кол-во срезаемых букв
		
		Гласные="аеэоуиыяюьъ"; // список гласных букв в виде строки
		
		// ======== обработаем фамилию ==========
		// заполним таблицу данными для фамилии
		
		Если пол="М" Тогда
			строток=ток.Добавить(); // иванов
			строток.СтарОк="*s";
			строток.р="а"; строток.д="у"; строток.в="а"; строток.т="ым"; строток.п="е";
			строток.КолвоСрез=0;
			
			строток=ток.Добавить(); // красинский
			строток.СтарОк="*й"; 
			строток.р="ого"; строток.д="ому"; строток.в="ого"; строток.т="им"; строток.п="ом";
			строток.КолвоСрез=2;		
			
			строток=ток.Добавить(); // белый
			строток.СтарОк="ый";
			строток.р="ого"; строток.д="ому"; строток.в="ого"; строток.т="ым"; строток.п="ом";
			строток.КолвоСрез=2;
			
			строток=ток.Добавить(); // палей
			строток.СтарОк="*й";
			строток.р="я"; строток.д="ю"; строток.в="я"; строток.т="ем"; строток.п="е";
			строток.КолвоСрез=1;
			
			строток=ток.Добавить(); // рабинович
			строток.СтарОк="*ч";
			строток.р="а"; строток.д="у"; строток.в="а"; строток.т="ем"; строток.п="е";
			строток.КолвоСрез=0;
			
			строток=ток.Добавить(); // починок, зализняк
			строток.СтарОк="*к";
			строток.р="ка"; строток.д="ку"; строток.в="ка"; строток.т="ком"; строток.п="ке";
			строток.КолвоСрез=2;
			
			строток=ток.Добавить(); // шинкарь
			строток.СтарОк="*ь";
			строток.р="я"; строток.д="ю"; строток.в="я"; строток.т="ем"; строток.п="е";
			строток.КолвоСрез=1;
			
			строток=ток.Добавить(); // перельман, оганесян
			строток.СтарОк="*н";
			строток.р="а"; строток.д="у"; строток.в="а"; строток.т="ом"; строток.п="е";
			строток.КолвоСрез=0;
			
			строток=ток.Добавить(); // баранкин
			строток.СтарОк="ин";
			строток.р="а"; строток.д="у"; строток.в="а"; строток.т="ым"; строток.п="е";
			строток.КолвоСрез=0;
			
		ИначеЕсли Пол="Ж" Тогда		
			строток=ток.Добавить(); // склодовская
			строток.СтарОк="ая";
			строток.р="ой"; строток.д="ой"; строток.в="ую"; строток.т="ой"; строток.п="ой";
			строток.КолвоСрез=2;
			
			строток=ток.Добавить(); // иванова
			строток.СтарОк="*а"; 
			строток.р="ой"; строток.д="ой"; строток.в="у"; строток.т="ой"; строток.п="ой";
			строток.КолвоСрез=1;
		КонецЕсли;
		
		// таблица заполнена. считаем 2 последних буквы и поищем их
		Если не ПустаяСтрока(Фамилия) Тогда
			пб=Прав(Фамилия,2); кол="СтарОк"; // ищем по ней
			новФамилия=Фамилия; // если ничего не изменится, так и будет
			стро=ток.Найти(пб,кол);
			Если стро<>Неопределено Тогда // нашли строгое сразу
				Основа=Лев(Фамилия,СтрДлина(Фамилия)-стро.КолвоСрез);
				новФамилия=Основа+СокрЛП(стро[пад]);
			Иначе // строго не нашли, ищем только по последней
				пб="*"+Прав(пб,1); 
				стро=ток.Найти(пб,кол);
				Если стро<>Неопределено Тогда // нашли по последней
					Основа=Лев(Фамилия,СтрДлина(Фамилия)-стро.КолвоСрез);
					новФамилия=Основа+СокрЛП(стро[пад]);
				Иначе // по последней не нашли, ищем по виду буквы
					пб="*"+?(Найти(Гласные,Прав(пб,1))=0,"s","g");
					стро=ток.Найти(пб,кол);
					Если стро<>Неопределено Тогда // нашли по виду
						Основа=Лев(Фамилия,СтрДлина(Фамилия)-стро.КолвоСрез);
						новФамилия=Основа+СокрЛП(стро[пад]);
					КонецЕсли;
				КонецЕсли;
			КонецЕсли;
		Иначе
			новФамилия="";
		КонецЕсли;
		
		// ======== обработаем имя ==========
		// заполним таблицу данными для имени
		ток.Очистить();
		
		Если Пол="М" Тогда
			// обработаем исключения
			Если Имя="лев" Тогда Имя="льв" КонецЕсли;
			Если Имя="павел" Тогда Имя="павл" КонецЕсли;
			
			строток=ток.Добавить(); // сергей
			строток.старок="*й";
			строток.р="я"; строток.д="ю"; строток.в="я"; строток.т="ем"; строток.п="е";
			строток.колвосрез=1;
			
			строток=ток.Добавить(); // иван + лев + павел
			строток.старок="*s";
			строток.р="а"; строток.д="у"; строток.в="а"; строток.т="ом"; строток.п="е";
			строток.колвосрез=0;
			
			строток=ток.Добавить(); // никита
			строток.старок="*а";
			строток.р="ы"; строток.д="е"; строток.в="у"; строток.т="ой"; строток.п="е";
			строток.колвосрез=1;
			
			строток=ток.Добавить(); // лука
			строток.старок="ка";
			строток.р="и"; строток.д="е"; строток.в="у"; строток.т="ой"; строток.п="е";
			строток.колвосрез=1;
			
			строток=ток.Добавить(); // иеремия
			строток.старок="ия";
			строток.р="и"; строток.д="и"; строток.в="ю"; строток.т="ей"; строток.п="и";
			строток.колвосрез=1;
			
			строток=ток.Добавить(); // илья
			строток.старок="*я";
			строток.р="и"; строток.д="е"; строток.в="ю"; строток.т="ей"; строток.п="е";
			строток.колвосрез=1;
			
			строток=ток.Добавить(); // игорь
			строток.старок="*ь";
			строток.р="я"; строток.д="ю"; строток.в="я"; строток.т="ем"; строток.п="е";
			строток.колвосрез=1;
			
		ИначеЕсли Пол="Ж" Тогда
			// обработаем исключения
			//Если Имя="ольга" Тогда Имя="ольгь" КонецЕсли;
			
			строток=ток.Добавить(); // ирина
			строток.старок="*а";
			строток.р="ы"; строток.д="е"; строток.в="у"; строток.т="ой"; строток.п="е";
			строток.колвосрез=1;
			
			строток=ток.Добавить(); // инга, ольга
			строток.старок="га";
			строток.р="и"; строток.д="е"; строток.в="у"; строток.т="ой"; строток.п="е";
			строток.колвосрез=1;
			
			строток=ток.Добавить(); // эсфирь
			строток.старок="*ь";
			строток.р="и"; строток.д="и"; строток.в="ь"; строток.т="ью"; строток.п="и";
			строток.колвосрез=1;
			
			строток=ток.Добавить(); // мария
			строток.старок="ия";
			строток.р="и"; строток.д="и"; строток.в="ю"; строток.т="ей"; строток.п="и";
			строток.колвосрез=1;
			
			строток=ток.Добавить(); // софья
			строток.старок="*я";
			строток.р="и"; строток.д="е"; строток.в="ю"; строток.т="ей"; строток.п="е";
			строток.колвосрез=1;
		КонецЕсли;
		
		// таблица заполнена. считаем 2 последних буквы и поищем их
		Если не ПустаяСтрока(Имя) Тогда
			пб=Прав(Имя,2); кол="СтарОк"; // ищем по ней
			новИмя=Имя; // если ничего не изменится, так и будет
			стро=ток.Найти(пб,кол);
			Если стро<>Неопределено Тогда // нашли строгое сразу
				Основа=Лев(Имя,СтрДлина(Имя)-стро.КолвоСрез);
				новИмя=Основа+СокрЛП(стро[пад]);
			Иначе // строго не нашли, ищем только по последней
				пб="*"+Прав(пб,1); 
				стро=ток.Найти(пб,кол);
				Если стро<>Неопределено Тогда // нашли по последней
					Основа=Лев(Имя,СтрДлина(Имя)-стро.КолвоСрез);
					новИмя=Основа+СокрЛП(стро[пад]);
				Иначе // по последней не нашли, ищем по виду буквы
					пб="*"+?(Найти(Гласные,Прав(пб,1))=0,"s","g");
					стро=ток.Найти(пб,кол);
					Если стро<>Неопределено=1 Тогда // нашли по виду
						Основа=Лев(Имя,СтрДлина(Имя)-стро.КолвоСрез);
						новИмя=Основа+СокрЛП(стро[пад]);
					КонецЕсли;
				КонецЕсли;
			КонецЕсли;
		Иначе
			новИмя="";
		КонецЕсли;
		
		// ======== обработаем отчество, тут проще ==========
		ток.Очистить();
		
		Если Пол="М" Тогда
			строток=ток.Добавить();
			строток.р="а"; строток.д="у"; строток.в="а"; строток.т="ем"; строток.п="е";
			строток.колвосрез=0;
		ИначеЕсли Пол="Ж" Тогда
			строток=ток.Добавить();
			строток.р="ы"; строток.д="е"; строток.в="у"; строток.т="ой"; строток.п="е";
			строток.колвосрез=1;
		КонецЕсли;
		Если не ПустаяСтрока(Отчество) Тогда
			Основа=Лев(Отчество,СтрДлина(Отчество)-ток[0].КолвоСрез);	
			новОтчество=Основа+СокрЛП(ток[0][пад]);
		Иначе
			новОтчество="";
		КонецЕсли;	
		
		Если ТолькоИнициалы Тогда
			новИмя=Лев(новИмя,1); новОтчество=Лев(новОтчество,1);
		КонецЕсли;
		
		// установим первые буквы верхним регистром
		новФамилия=ВРег(Лев(новФамилия,1))+Сред(новФамилия,2);
		новИмя=ВРег(Лев(новИмя,1))+Сред(новИмя,2);
		новОтчество=ВРег(Лев(новОтчество,1))+Сред(новОтчество,2);
		
		// и теперь всё вместе	
		новФИО=новФамилия+" "+новИмя+" "+новОтчество;
		Возврат новФИО;
	КонецФункции
	
	
	Функция ПечатьСлужебнаяЗаписка(ТабДокумент)Экспорт
		
		//Бондаренко++ 20230830
		Если ТипЗНЧ(Контрагент) <> Тип("СправочникСсылка.Контрагенты") Тогда
			СМГ_Сообщить("Ошибка! Печать выполняется только для контрагента из одноимённого справочника, а не типа 'Текст'.",СтатусСообщения.ОченьВажное);
			Возврат Новый ТабличныйДокумент;
		КонецЕсли;
		
		//Бондаренко++ 20240312
		//Если НЕ Контрагент.ФормаСобственности = Перечисления.ФормыСобственности.ЧастноеЛицо Тогда
		//	СМГ_Сообщить("Ошибка! Печать выполняется только для контрагента типа 'Частное лицо' или 'Прочее'.",СтатусСообщения.ОченьВажное);
		//	Возврат Новый ТабличныйДокумент;
		//КонецЕсли;
		//Бондаренко-- 20240312
		
		Если ТипЗНЧ(Автомобиль) <> Тип("СправочникСсылка.Автомобили") Тогда
			СМГ_Сообщить("Ошибка! Печать служебной записки выполняется только для заполненного автомобиля из справочника.",СтатусСообщения.ОченьВажное);
			Возврат Новый ТабличныйДокумент;
		КонецЕсли;
		
		Если ВидОплаты <> Перечисления.ВидыОплаты.ПроизвольнаяОплата Тогда
			Макет = ПолучитьМакет("СлужебнаяЗаписка"); 
		Иначе
			СМГ_Сообщить("Ошибка! Печатная форма не формируется для вида оплаты 'Произвольный расчет'.",СтатусСообщения.ОченьВажное);
			Возврат Новый ТабличныйДокумент;
		КонецЕсли;	
		//Бондаренко-- 20230830
		
		Шапка = Макет.ПолучитьОбласть("Шапка");
		ТаблСумм = Макет.ПолучитьОбласть("ТаблСумм");
		
		Если ВидОплаты  = Перечисления.ВидыОплаты.НаличныйРасчет Тогда
			Шапка.Параметры.Нал = "да";
		ИначеЕсли ВидОплаты  = Перечисления.ВидыОплаты.БанковскаяКарта ИЛИ ВидОплаты  = Перечисления.ВидыОплаты.БезналичныйРасчет Тогда
			Шапка.Параметры.БезНал = "да";
		ИначеЕсли ВидОплаты  = Перечисления.ВидыОплаты.Кредит Тогда
			Шапка.Параметры.Кредит = "да";
		ИначеЕсли ВидОплаты  = Перечисления.ВидыОплаты.Обмен Тогда
			Шапка.Параметры.Обмен = "да";
		ИначеЕсли ВидОплаты  = Перечисления.ВидыОплаты.Лизинг Тогда
			Шапка.Параметры.Лизинг = "да";
		КонецЕсли;
		
		Если ТрейдИн Тогда
			Шапка.Параметры.Обмен = "да";
		КонецЕсли;
		
		Шапка.Параметры.Дата = Формат(ТекущаяДата(),"ДФ=dd.MM.yyyy");
		Если НЕ обЗначениеНеЗаполнено(ВладелецАвто) Тогда 
			ОрганизацияВладелец = Справочники.Организации.НайтиПоРеквизиту("КонтрагентОрганизации",ВладелецАвто);
			Шапка.Параметры.СобственникАвтомобиля = ОрганизацияВладелец.НаименованиеДляПечати;
		КонецЕсли;
		
		Шапка.Параметры.ПодразделениеКомпании = ПодразделениеКомпании.Наименование;
		Шапка.Параметры.Номер = СокрЛП(Номер);
		
		//ТаблСумм.Параметры.ЭлПочта = КонтактнаяИнформация(Контрагент, Справочники.ВидыКонтактнойИнформации.АдресЭлектроннойПочтыРабочий);
		
		ФорматВыводаСумм = "ЧДЦ=2; ЧН=0,00";
		ФорматВыводаДат = "ДФ=dd.MM.yyyy"; 
		
		//Бондаренко++ 20241112
		//Если ЗначениеЗаполнено(ПредоплатаЗаАМ) Тогда
		//	Шапка.Параметры.ПредоплатаЗаАМ = Формат(ПредоплатаЗаАМ,ФорматВыводаСумм);
		//	Шапка.Параметры.ДатаПредоплатыЗаАМ = Формат(ДатаПредоплатыЗаАМ,ФорматВыводаДат);
		//КонецЕсли;
		//Бондаренко-- 20241112
		
		Покупатель = Контрагент;
		Если ТипЗнч(Покупатель) = Тип("СправочникСсылка.Контрагенты") Тогда
			//Шапка.Параметры.Покупатель = Покупатель;
			Шапка.Параметры.ПокупательФИО = Покупатель.НаименованиеПолное;
		Иначе
			Шапка.Параметры.ПокупательФИО = Покупатель;
		КонецЕсли;
		
		Попытка
			Шапка.Параметры.ПокупательТелефон = ПредставлениеТелефона;
		Исключение
		КонецПопытки;	
		
		// Данные автомобиля
		
		Если Автомобиль <> Неопределено И Не Автомобиль.Пустая() Тогда
			Шапка.Параметры.Модель = Автомобиль.Модель;
			Шапка.Параметры.ВариантКомплектации = Автомобиль.ВариантКомплектации;
			Шапка.Параметры.Цвет = Автомобиль.Цвет;
			Шапка.Параметры.ВИН = Автомобиль.VIN;
			//Бондаренко++ 20240316
			//ТаблСумм.Параметры.РРЦ = Формат(ПолучитьРРЦ(Автомобиль),ФорматВыводаСумм);
			ТаблСумм.Параметры.РРЦ = Формат(РРЦ,ФорматВыводаСумм);
			//Бондаренко-- 20240316
		Иначе
			Шапка.Параметры.Модель = Модель;
			Шапка.Параметры.ВариантКомплектации = ВариантКомплектации;
			Шапка.Параметры.Цвет = Цвет;
		КонецЕсли; 
		
		//Бондаренко++ 20250522  
		ГодВыпуска = Автомобиль.ГодВыпуска;
		Если ГодВыпуска <> Дата(1,1,1) Тогда
			Шапка.Параметры.ГодВыпуска = Формат(ГодВыпуска, "ДФ='гггг'");
		КонецЕсли;
		//Бондаренко-- 20250522
		
		ТаблСумм.Параметры.ИНВОЙС = Формат(Инвойс,ФорматВыводаСумм);
		//Бондаренко++ 20250827
		ТаблСумм.Параметры.СуммаПредпродажнойПодготовки = Формат(СуммаПредпродажнойПодготовки,ФорматВыводаСумм);
		//Бондаренко++ 20250827
		
		ТаблСумм.Параметры.ЦенаДопПоПрайсу = Формат(СтоимостьДОФакт,ФорматВыводаСумм); 
		ТаблСумм.Параметры.СкидкаПоСпецПрограмме = Формат(СкидкаАвтоЦентра,ФорматВыводаСумм);
		//Бондаренко++ 20240904
		ТаблСумм.Параметры.СкидкаДополнительная = Формат(СкидкаДополнительная,ФорматВыводаСумм);
		//Бондаренко-- 20240904
		ТаблСумм.Параметры.СкидкаТрейдИнФакт = Формат(СкидкаТрейдИнФакт,ФорматВыводаСумм);	
		
		//Бондаренко++ 20250205
		ТаблСумм.Параметры.СкидкаТрейдИн2Факт = Формат(СкидкаТрейдИн2Факт,ФорматВыводаСумм);	
		//Бондаренко-- 20250205
		
		ТаблСумм.Параметры.СкидкаСубсидияКредитФакт = Формат(СкидкаСубсидияКредитФакт,ФорматВыводаСумм);							
		ТаблСумм.Параметры.СкидкаПрЛояльности = Формат(СкидкаПоПрограммамЛояльности,ФорматВыводаСумм);
		ТаблСумм.Параметры.СебестоимостьДО = Формат(СебестоимостьДО,ФорматВыводаСумм);
		ТаблСумм.Параметры.ПредоплатаТО = Формат(ПредоплатаТО,ФорматВыводаСумм);
		
		//Бондаренко++ 20241112
		ТаблСумм.Параметры.КомпенсацияТрейдИнФакт = Формат(КомпенсацияТрейдИНВИнВойсеСледующегоАвтомобиля,ФорматВыводаСумм);
		
		//Бондаренко++ 20250205
		ТаблСумм.Параметры.КомпенсацияТрейдИн2Факт = Формат(КомпенсацияТрейдИН2ВИнВойсеСледующегоАвтомобиля,ФорматВыводаСумм);	
		//Бондаренко-- 20250205
		
		ТаблСумм.Параметры.КомпенсацияСубсидияКредитФакт = Формат(КомпенсацияСубсидияКредитВИнВойсеСледующегоАвтомобиля,ФорматВыводаСумм);				
		ТаблСумм.Параметры.КомпенсацияПрЛояльности = Формат(КомпенсацияПоПрограммамЛояльностиВИнВойсеСледующегоАвтомобиля,ФорматВыводаСумм);				
		ТаблСумм.Параметры.КомпенсацияПоСпецпрограмме= Формат(КомпенсацияРозничнаяВИнВойсеСледующегоАвтомобиля,ФорматВыводаСумм);
		
		ТаблСумм.Параметры.ПредоплатаТО = Формат(ПредоплатаТО,ФорматВыводаСумм);
		ТаблСумм.Параметры.СкидкаРозничная = Формат(СкидкаРозничная,ФорматВыводаСумм);
		ТаблСумм.Параметры.СкидкаДополнительная = Формат(СкидкаДополнительная,ФорматВыводаСумм);
		
		//Бондаренко++ 20250829
		ДоходЖелезо_ = РРЦ - Инвойс - 
		СкидкаТрейдИнФакт + КомпенсацияТрейдИНВИнВойсеСледующегоАвтомобиля -
		СкидкаСубсидияКредитФакт + КомпенсацияСубсидияКредитВИнВойсеСледующегоАвтомобиля -
		СкидкаПоПрограммамЛояльности + КомпенсацияПоПрограммамЛояльностиВИнВойсеСледующегоАвтомобиля -
		СкидкаАвтоцентра + КомпенсацияРозничнаяВИнВойсеСледующегоАвтомобиля - 
		СкидкаРозничная - СкидкаДополнительная;
		//ДоходЖелезо_ = РРЦ - Инвойс - СуммаПредпродажнойПодготовки - 
		//               СкидкаТрейдИнФакт + СкидкаТрейдИн2Факт + КомпенсацияТрейдИНВИнВойсеСледующегоАвтомобиля -
		//			   СкидкаСубсидияКредитФакт + КомпенсацияСубсидияКредитВИнВойсеСледующегоАвтомобиля -
		//			   СкидкаПоПрограммамЛояльности + КомпенсацияПоПрограммамЛояльностиВИнВойсеСледующегоАвтомобиля -
		//			   СкидкаАвтоцентра + КомпенсацияРозничнаяВИнВойсеСледующегоАвтомобиля - 
		//			   СкидкаРозничная - СкидкаДополнительная;
		//Бондаренко-- 20250829				   
		
		ТаблСумм.Параметры.ДоходЖелезо = Формат(ДоходЖелезо_,ФорматВыводаСумм);
		
		ДоходДопОпции_ = СтоимостьДОФакт - СебестоимостьДО;  
		ТаблСумм.Параметры.ДоходДоп = Формат(ДоходДопОпции_,ФорматВыводаСумм);
		
		ДоходКредит_ = КВКредит + КВКаско + КВОсаго + КВСЖ;
		Для каждого Стр Из ИныеСтраховыеПродукты Цикл
			ДоходКредит_ = ДоходКредит_ +Стр.КВ;
		КонецЦикла;
		ТаблСумм.Параметры.ДоходКредит = Формат(ДоходКредит_,ФорматВыводаСумм);
		
		ДоходЖОК_ = ДоходЖелезо_ + ДоходДопОпции_ + ДоходКредит_;
		ТаблСумм.Параметры.ДоходЖОК = Формат(ДоходЖОК_,ФорматВыводаСумм);
		//Бондаренко-- 20241112
		
		//Бондаренко++ 20241114
		ПланЖОК_ = Справочники.Автомобили.ЧтениеЗначенияРегистраСведенияПлановаяДоходностьПродажиАвтомобилей(Автомобиль);
		ТаблСумм.Параметры.ПланЖОК = Формат(ПланЖОК_,ФорматВыводаСумм); 
		//Бондаренко-- 20241114
		
		//Бондаренко++ 20241113
		ТаблСумм.Параметры.КВКредит = КВКредит;
		ТаблСумм.Параметры.КВКаско  = КВКаско;
		ТаблСумм.Параметры.КВОсаго  = КВОсаго;
		ТаблСумм.Параметры.КВСЖ     = КВСЖ; 
		Для каждого Стр Из ИныеСтраховыеПродукты Цикл
			Если Стр.НомерСтроки = 1 Тогда
				ТаблСумм.Параметры.КВИСП1 = Стр.КВ;
			ИначеЕсли Стр.НомерСтроки = 2 Тогда
				ТаблСумм.Параметры.КВИСП2 = Стр.КВ;
			ИначеЕсли Стр.НомерСтроки = 3 Тогда
				ТаблСумм.Параметры.КВИСП3 = Стр.КВ;
			ИначеЕсли Стр.НомерСтроки = 4 Тогда
				ТаблСумм.Параметры.КВИСП4 = Стр.КВ;
			ИначеЕсли Стр.НомерСтроки = 5 Тогда
				ТаблСумм.Параметры.КВИСП5 = Стр.КВ;
			КонецЕсли;
		КонецЦикла;
		
		СрокХраненияВДнях = СрокХранения(Автомобиль);
		
		ТаблСумм.Параметры.КоличествоДнейНаСкладе = СрокХраненияВДнях;
		//Бондаренко++ 20250827
		//ЗатратыНаХранение_ = ( Константы.СтавкаЗаКредит.Получить() * Инвойс * СрокХраненияВДнях  ) /  36500;
		ЗатратыНаХранение_ = ( Константы.СтавкаЗаКредит.Получить() * ( Инвойс + СуммаПредпродажнойПодготовки ) * СрокХраненияВДнях  ) /  36500;
		//Бондаренко++ 20250827
		ТаблСумм.Параметры.ЗатратыНаХранение = Формат(ЗатратыНаХранение_,ФорматВыводаСумм);	
		ТаблСумм.Параметры.ГдеПроживаетКлиент = ГдеПроживает;
		ТаблСумм.Параметры.ЧемЗанимается = ВидДеятельности;
		
		//Бондаренко-- 20241113
		
		//КомпенсацияРетроспективная_ = КомпенсацияТрейдИНРетроспективная + КомпенсацияСубсидияКредитРетроспективная + 
		//КомпенсацияПоПрограммамЛояльностиРетроспективная + КомпенсацияРозничнаяРетроспективная;
		//ТаблСумм.Параметры.КомпенсацияРетроспективная = Формат(КомпенсацияРетроспективная_,ФорматВыводаСумм);							
		
		//Бондаренко++ 20231209
		//ТаблСумм.Параметры.КомпенсацияВИнвойсе = Формат(КомпенсацияРозничнаяВИнВойсеСледующегоАвтомобиля,ФорматВыводаСумм);
		ТаблСумм.Параметры.СуммаКомпенсации = Формат(СуммаКомпенсации,ФорматВыводаСумм);
		//Бондаренко++ 20231209
		
		КомпенсацияВИнвойсе =  КомпенсацияТрейдИНВИнВойсеСледующегоАвтомобиля + КомпенсацияСубсидияКредитВИнВойсеСледующегоАвтомобиля + 
		КомпенсацияПоПрограммамЛояльностиВИнВойсеСледующегоАвтомобиля + КомпенсацияРозничнаяВИнВойсеСледующегоАвтомобиля;
		//ТаблСумм.Параметры.КомпенсацияВИнвойсе = Формат(КомпенсацияВИнвойсе,ФорматВыводаСумм);;
		
		//Бондаренко++ 20231230
		//ТаблСумм.Параметры.ДефектовочныйАкт = Формат(СуммаПродажи-ИНВОЙС,ФорматВыводаСумм);	
		//Бондаренко-- 20231230
		
		ТаблСумм.Параметры.СкидкаРозничная = Формат(СкидкаРозничная,ФорматВыводаСумм);
		
		//Бондаренко++ 20230901
		ТаблСумм.Параметры.СуммаКаско = Формат(СуммаКаско,ФорматВыводаСумм);
		Если СуммаКаско > 0 Тогда
			Если НаличныеПрограммаКАСКО Тогда
				ТаблСумм.Параметры.КаскоНал = "да";                     
			Иначе	
				ТаблСумм.Параметры.КаскоБн  = "да";                     
			КонецЕсли;
		КонецЕсли;	
		
		ТаблСумм.Параметры.СуммаОсаго = Формат(СуммаОсаго,ФорматВыводаСумм);
		Если СуммаОсаго > 0 Тогда
			Если НаличныеПрограммаОСАГО Тогда
				ТаблСумм.Параметры.ОсагоНал = "да";                     
			Иначе	
				ТаблСумм.Параметры.ОсагоБн  = "да";                     
			КонецЕсли;
		КонецЕсли;	
		
		ТаблСумм.Параметры.СуммаСтрахованиеЖизни = Формат(СуммаСтрахованиеЖизни,ФорматВыводаСумм);
		Если СуммаСтрахованиеЖизни > 0 Тогда
			Если НаличныеПрограммаСЖ Тогда
				ТаблСумм.Параметры.СжНал = "да";                     
			Иначе	
				ТаблСумм.Параметры.СжБн  = "да";                     
			КонецЕсли;
		КонецЕсли;
		
		Для каждого Стр Из ИныеСтраховыеПродукты Цикл
			
			Если обЗначениеНеЗаполнено(Стр.ПрограммаСтрахования) Тогда
				Продолжить;
			КонецЕсли;
			
			Если Стр.СуммаСтрахования = 0 Тогда
				Продолжить;
			КонецЕсли;
			
			Если Стр.НомерСтроки > 5 Тогда
				Прервать;
			КонецЕсли;
			
			Если Стр.НомерСтроки = 1 Тогда
				ТаблСумм.Параметры.ИСП1 = Стр.ПрограммаСтрахования;
				ТаблСумм.Параметры.СуммаИСП1 = Формат(Стр.СуммаСтрахования,ФорматВыводаСумм);
				Если Стр.Наличные Тогда
					ТаблСумм.Параметры.ИСП1Нал = "да";
				Иначе	
					ТаблСумм.Параметры.ИСП1Бн = "да";
				КонецЕсли;
			ИначеЕсли Стр.НомерСтроки = 2 Тогда
				ТаблСумм.Параметры.ИСП2 = Стр.ПрограммаСтрахования;
				ТаблСумм.Параметры.СуммаИСП2 = Формат(Стр.СуммаСтрахования,ФорматВыводаСумм);
				Если Стр.Наличные Тогда
					ТаблСумм.Параметры.ИСП2Нал = "да";
				Иначе	
					ТаблСумм.Параметры.ИСП2Бн = "да";
				КонецЕсли;
			ИначеЕсли Стр.НомерСтроки = 3 Тогда
				ТаблСумм.Параметры.ИСП3 = Стр.ПрограммаСтрахования;
				ТаблСумм.Параметры.СуммаИСП3 = Формат(Стр.СуммаСтрахования,ФорматВыводаСумм);
				Если Стр.Наличные Тогда
					ТаблСумм.Параметры.ИСП3Нал = "да";
				Иначе	
					ТаблСумм.Параметры.ИСП3Бн = "да";
				КонецЕсли;
			ИначеЕсли Стр.НомерСтроки = 4 Тогда
				ТаблСумм.Параметры.ИСП4 = Стр.ПрограммаСтрахования;
				ТаблСумм.Параметры.СуммаИСП4 = Формат(Стр.СуммаСтрахования,ФорматВыводаСумм);
				Если Стр.Наличные Тогда
					ТаблСумм.Параметры.ИСП4Нал = "да";
				Иначе	
					ТаблСумм.Параметры.ИСП4Бн = "да";
				КонецЕсли;
				//Бондаренко++ 20241113	
			ИначеЕсли Стр.НомерСтроки = 5 Тогда
				ТаблСумм.Параметры.ИСП5 = Стр.ПрограммаСтрахования;
				ТаблСумм.Параметры.СуммаИСП5 = Формат(Стр.СуммаСтрахования,ФорматВыводаСумм);
				Если Стр.Наличные Тогда
					ТаблСумм.Параметры.ИСП5Нал = "да";
				Иначе	
					ТаблСумм.Параметры.ИСП5Бн = "да";
				КонецЕсли;
				//Бондаренко-- 20241113		
			КонецЕсли;
			
		КонецЦикла;
		//Бондаренко-- 20230901
		
		ТаблСумм.Параметры.ЦенаФакт      = Формат(СуммаПродажи,ФорматВыводаСумм);							
		ТаблСумм.Параметры.ЦенаДоговора  = Формат(ДКПАвто,ФорматВыводаСумм);							
		//Бондаренко++ 20231117
		//Шапка.Параметры.СтоимостьЗНДО = СебестоимостьДО;
		//Бондаренко-- 20231117
		
		//ТаблСумм.Параметры.ПервоначальныйВзнос = Формат(СуммаПредоплаты,ФорматВыводаСумм);
		//ТаблСумм.Параметры.ДатаПервоначальногоВзноса = Формат(ДатаПервоначальногоВзноса,ФорматВыводаДат);
		
		//Шапка.Параметры.БанкЛК = БанкЛК; 
		
		Если Кредит ИЛИ ВидОплаты = Перечисления.ВидыОплаты.Кредит Тогда
			ТаблСумм.Параметры.КредитнаяСтоимость = Формат(СчетИлиАвтоВКредит,ФорматВыводаСумм);
		Иначе
			ТаблСумм.Параметры.КредитнаяСтоимость = "";
		КонецЕсли;
		
		ТрейдИнОбласть = Макет.ПолучитьОбласть("ТрейдИн");
		
		//Бондаренко++ 20250715
		РитейлОбласть = Макет.ПолучитьОбласть("Ритейл");
		//Бондаренко-- 20250715
		
		ТрейдИнОбласть.Параметры.СсылкаНаОбъявление = ЭтотОбъект.СсылкаНаОбъявление;
		
		ТрейдИнОбласть.Параметры.МодельТрейдИн                       = МодельТрейдИн;
		ТрейдИнОбласть.Параметры.ТрейдИнVIN                          = ТрейдИнVIN;
		
		ТрейдИнОбласть.Параметры.ПредполагаемаяЦенаЗакупкиТрейдИн	 = Формат(ЦенаМинРыночнаяТрейдИн, ФорматВыводаСумм);
		ТрейдИнОбласть.Параметры.ПредполагаемаяЦенаПродажиТрейдИн	 = Формат(ПланируемаяЦенаПродажиТрейдИн,ФорматВыводаСумм);
		ТрейдИнОбласть.Параметры.ПредполагаемыйДоходТрейдИн          = Формат(ПланируемаяЦенаПродажиТрейдИн-ЦенаМинРыночнаяТрейдИн,ФорматВыводаСумм);
		
		ТрейдИнОбласть.Параметры.ГодВыпускаТрейдИн                   = Формат( ГодВыпускаТрейдИн, "ДФ='гггг'");
		ТрейдИнОбласть.Параметры.ПробегТрейдИн                       = ПробегТрейдИн;
		
		ТабДокумент.Вывести(Шапка);  
		
		ТабДокумент.Вывести(ТаблСумм);
		
		ТабДокумент.Вывести(ТрейдИнОбласть); 
		
		//Бондаренко++ 20250715
		Если Автомобиль.ДатаРитейла <> Дата(1,1,1) Тогда
			РитейлОбласть.Параметры.ДатаРитейла = "Дата рапорта: "+Формат(Автомобиль.ДатаРитейла,"ДФ=dd.MM.yyyy");		
		Иначе
			РитейлОбласть.Параметры.ДатаРитейла = "Дата рапорта: НЕТ.";		
		КонецЕсли;
		ТабДокумент.Вывести(РитейлОбласть);
		//Бондаренко-- 20250715
		
		ТабДокумент.АвтоМасштаб = Истина;
		ТабДокумент.ОтображатьСетку = Ложь;
		ТабДокумент.ПолеСверху = 5;
		ТабДокумент.ПолеСлева = 5;
		ТабДокумент.ПолеСнизу = 5;
		ТабДокумент.ПолеСправа = 5; 
		
		ТабДокумент.РазмерКолонтитулаСверху = 10;
		ТабДокумент.ВерхнийКолонтитул.ВертикальноеПоложение = ВертикальноеПоложение.Верх;
		ТабДокумент.ВерхнийКолонтитул.НачальнаяСтраница = 1;
		ТабДокумент.ВерхнийКолонтитул.Выводить = Истина;	
		
		ТабДокумент.РазмерКолонтитулаСнизу = 10;
		ТабДокумент.НижнийКолонтитул.ВертикальноеПоложение = ВертикальноеПоложение.Верх;
		ТабДокумент.НижнийКолонтитул.НачальнаяСтраница = 1;
		ТабДокумент.НижнийКолонтитул.Выводить = Истина;	
		
		Возврат ТабДокумент;
		
	КонецФункции // ПечатьСлужебнаяЗаписка
	
	//Бондаренко++ 20241113
	Функция СрокХранения(Авто)
		
		Дней = 0; 
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПоступлениеАвтомобилейАвтомобили.Ссылка,
		|	ПоступлениеАвтомобилейАвтомобили.Автомобиль,
		|	ПоступлениеАвтомобилейАвтомобили.Ссылка.Дата КАК Дата,
		|	ПоступлениеАвтомобилейАвтомобили.Ссылка.Проведен
		|ИЗ
		|	Документ.ПоступлениеАвтомобилей.Автомобили КАК ПоступлениеАвтомобилейАвтомобили
		|ГДЕ
		|	ПоступлениеАвтомобилейАвтомобили.Ссылка.Проведен
		|	И ПоступлениеАвтомобилейАвтомобили.Автомобиль = &Автомобиль
		|
		|УПОРЯДОЧИТЬ ПО
		|	Дата УБЫВ";
		
		Запрос.УстановитьПараметр("Автомобиль",Авто);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			Дней = Цел ( ( НачалоДня(ТекущаяДата()) - НачалоДня(ВыборкаДетальныеЗаписи.Дата) ) / 86400 );
			Прервать;
		КонецЦикла;
		
		Возврат Дней;
		
	КонецФункции // СрокХранения(Авто) 
	//Бондаренко++ 20241113
	
	// Возвращает доступные варианты печати документа
	// Вовращаемое значение: 
	//  Струткура, каждая строка которой
	//  соответствует одному из вариантов печати
	//  Первый элемент структуры - форма по умолчанию
	Функция ПолучитьСписокПечатныхФорм() Экспорт
		СтруктураМакетов=Новый Структура();
		СтруктураМакетов.Вставить("РабочийЛист",			"Рабочий лист");
		СтруктураМакетов.Вставить("РабочийЛистЗвонка",		"Рабочий лист звонка");
		СтруктураМакетов.Вставить("РабочийЛистВстречи",		"Рабочий лист встречи");
		СтруктураМакетов.Вставить("КоммерческоеПредложение","Коммерческое предложение"); 
		//Бондаренко++ 20240123
		СтруктураМакетов.Вставить("ЧекМенеджера","Чек менеджера"); 
		//Бондаренко-- 20240123
		//Бондаренко-- 20241107
		Если РольДоступна("ПолныеПрава") Тогда
			СтруктураМакетов.Вставить("СлужебнаяЗаписка","Служебная записка"); 
		КонецЕсли;
		//Бондаренко-- 20241107
		Возврат СтруктураМакетов;
	КонецФункции // ПолучитьСписокПечатныхФорм()
	
	//////////////////////////////////////////////////////////////////////////
#КонецЕсли
// КОНЕЦ кода модуля клиента	

// Процедура заполнения табличной части по комплектации
Процедура ЗаполнитьКомплектациюАвтомобиля() Экспорт
	// таблица комплектации
	Перем табКомплектация;
	
	Если НЕ ЗначениеЗаполнено(Автомобиль) Тогда
		Возврат;
	КонецЕсли;
	
	#Если Клиент Тогда
		Если (Опции.Количество() <> 0) Тогда
			// зададим вопрос
			Ответ = Вопрос("Очищать табличные части опции?",РежимДиалогаВопрос.ДаНетОтмена,,КодВозвратаДиалога.Да);
			Если Ответ = КодВозвратаДиалога.Отмена Тогда
				Возврат;
			ИначеЕсли Ответ = КодВозвратаДиалога.Да Тогда
				Опции.Очистить();
			КонецЕсли;
		КонецЕсли;
	#КонецЕсли
	
	// получим таблицу комплектации
	НайденыйАвтомобильОбъект = Автомобиль.ПолучитьОбъект();
	Рез = НайденыйАвтомобильОбъект.ПолучитьОпцииИОборудованиеАвтомобиля(табКомплектация);
	
	//если нет данных выйдем
	Если НЕ Рез Тогда
		Возврат;
	КонецЕсли;
	
	// заполнияем ТЧ
	Для Каждого стрКомплектации Из табКомплектация Цикл
		Если ТипЗнч(стрКомплектации.Номенклатура) = Тип("СправочникСсылка.Опции") Тогда
			// добавление в опции
			НоваяСтрока				= Опции.Добавить();
			НоваяСтрока.Опция		= стрКомплектации.Номенклатура;
			ОбработкаРеквизита("Опции.Опция", НоваяСтрока);
			НоваяСтрока.Количество	= стрКомплектации.КоличествоОстаток;
			НоваяСтрока.СуммаВсего	= обПересчет(стрКомплектации.СуммаУпрОстаток, Константы.ВалютаУправленческогоУчетаКомпании.Получить(), ?(обЗначениеНеЗаполнено(КурсВалютыУпр), Дата, КурсВалютыУпр),ВалютаДокумента,Дата,РежимОкругления.Окр15как20);
			ОбработкаРеквизита("Опции.СуммаВсего", НоваяСтрока);
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

//Бондаренко++ 20230722
Функция ПолучитьСтруктуруЗакупкиАвтомобиля(Автомобиль,ДатаДок)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	|	ПоступлениеАвтомобилейАвтомобили.Ссылка,
	|	ПоступлениеАвтомобилейАвтомобили.Автомобиль,
	|	ПоступлениеАвтомобилейАвтомобили.Цена,
	|	ПоступлениеАвтомобилейАвтомобили.Сумма,
	|	ПоступлениеАвтомобилейАвтомобили.СтавкаНДС,
	|	ПоступлениеАвтомобилейАвтомобили.СуммаНДС,
	|	ПоступлениеАвтомобилейАвтомобили.Ссылка.Дата КАК Дата
	|ИЗ
	|	Документ.ПоступлениеАвтомобилей.Автомобили КАК ПоступлениеАвтомобилейАвтомобили
	|ГДЕ
	|	ПоступлениеАвтомобилейАвтомобили.Автомобиль = &Автомобиль
	|	И ПоступлениеАвтомобилейАвтомобили.Ссылка.Проведен
	|	И ПоступлениеАвтомобилейАвтомобили.Ссылка.Дата < &Дата
	|
	|УПОРЯДОЧИТЬ ПО
	|	Дата УБЫВ";
	Запрос.УстановитьПараметр("Автомобиль",Автомобиль);
	Запрос.УстановитьПараметр("Дата",КонецДня(ДатаДок));
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		СтруктураЦеныАвто = Новый Структура;
		СтруктураЦеныАвто.Вставить("Цена",Выборка.Цена);
		СтруктураЦеныАвто.Вставить("СуммаНДС",Выборка.СуммаНДС);
		Возврат СтруктураЦеныАвто;
	Иначе
		Возврат Неопределено;
	КонецЕсли;	
	
КонецФункции	

Функция ПолучитьЦенуАвто(Автомобиль,ВариантКомплектации,ТипЦен,ДатаДок)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	ЦеныАвтомобилейСрезПоследних.Цена
	|ИЗ
	|	РегистрСведений.ЦеныАвтомобилей.СрезПоследних(
	|			&Дата,
	|			Автомобиль = &Автомобиль
	|				И ВариантКомплектации = &ВариантКомплектации
	|				И ТипЦен = &ТипЦен) КАК ЦеныАвтомобилейСрезПоследних";
	Запрос.УстановитьПараметр("Автомобиль",Автомобиль);
	Запрос.УстановитьПараметр("ВариантКомплектации", ВариантКомплектации);
	Запрос.УстановитьПараметр("ТипЦен",ТипЦен);
	Запрос.УстановитьПараметр("Дата",ДатаДок);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Цена;
	Иначе
		Возврат 0;
	КонецЕсли;	
	
КонецФункции

Функция ПолучитьРРЦ(Авто)
	
	ЦенаНайденная = 0;
	
	Запрос = Новый Запрос; 
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ЦеныАвтомобилейСрезПоследних.ТипЦен,
	|	ЦеныАвтомобилейСрезПоследних.Автомобиль,
	|	ЦеныАвтомобилейСрезПоследних.Цена
	|ИЗ
	|	РегистрСведений.ЦеныАвтомобилей.СрезПоследних КАК ЦеныАвтомобилейСрезПоследних
	|ГДЕ
	|	ЦеныАвтомобилейСрезПоследних.Автомобиль = &Автомобиль
	|	И ЦеныАвтомобилейСрезПоследних.ТипЦен = &ТипЦен";
	
	Запрос.УстановитьПараметр("Автомобиль", Авто);
	Запрос.УстановитьПараметр("ТипЦен", Справочники.ТипыЦен.ОсновнойТипЦенПродажи);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		ЦенаНайденная  = Выборка.Цена;
	Иначе
		ЦенаНайденная = ПолучитьЦенуПродажиИзПоступленияАвто(Авто);
	КонецЕсли;
	
	Возврат ЦенаНайденная; 	
	
КонецФункции // ПолучитьРРЦ(Авто) 

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ
// Обработчик события при установке новго номера
//
Процедура ПриУстановкеНовогоНомера(СтандартнаяОбработка, Префикс)
	Если НЕ дкПриУстановкеНовогоНомера(ЭтотОбъект, СтандартнаяОбработка, Префикс) Тогда Возврат; КонецЕсли;
КонецПроцедуры // ПриУстановкеНовогоНомера()

// Обработчик события заполнения
//
Процедура ОбработкаЗаполнения(Основание) Экспорт
	Если ТипЗнч(Основание)=Тип("Структура") Тогда	
		ИмяСтруктуры = Неопределено;
		Основание.Свойство("Имя", ИмяСтруктуры);
		Если ИмяСтруктуры="РегистрацияЗвонковИКонтактов" Тогда				
			ВводИзАРМРесепшен = Истина;			
			ВидКонтакта						= Основание.ВидКонтакта;
			ДатаПоследнегоКонтакта			= Основание.ДатаДень;
			СодержаниеПоследнегоКонтакта	= Основание.Примечание;
			//Гэндальф+++
			Менеджер						= Основание.Участник;
			// Семенихин 03.04.2019 +++++
			Если ЗначениеЗаполнено(Менеджер) Тогда
				ПодразделениеКомпании = Менеджер.Подразделение;
				Организация = ПодразделениеКомпании.Организация;
			КонецЕсли;
			// Семенихин 03.04.2019 -----
			КлиентСервиса                   = Основание.КлиентСервиса;
			ТипРабочегоЛиста                = Основание.ТипСообщения;
			//Гэндальф---
			
			Модель							= Основание.Модель;
			Контрагент						= Основание.Контрагент;
			КодРегиона 						= Основание.КодРегиона;
			КодГорода 						= Основание.КодГорода;
			НомерТелефона		 			= Основание.НомерТелефона;
			ВнутреннийНомер 				= Основание.ВнутреннийНомер;
			ПредставлениеТелефона 			= Основание.ПредставлениеТелефона;
			ВидТелефона 					= Основание.ВидТелефона;
			ВыкупКомиссия                   = Основание.ВыкупКомиссия;
			//Бондаренко++ 20200520
			ТолькоБУ                        = Основание.ТолькоБУ;  
			//Бондаренко-- 20200520  
			
			Если ЗначениеЗаполнено(Основание.Участник) Тогда
				СтрокаПользователь				= Пользователи.Добавить();
				СтрокаПользователь.Пользователь	= Справочники.Пользователи.НайтиПоРеквизиту("Сотрудник",Основание.Участник); 			
			КонецЕсли;
			
			Если НЕ обЗначениеНеЗаполнено(Контрагент) Тогда
				Если ТипЗнч(Контрагент) = Тип("СправочникСсылка.Контрагенты") Тогда
					НаименованиеКлиента			= Контрагент.Наименование;
				ИначеЕсли ТипЗнч(Контрагент) = Тип("Строка") Тогда
					НаименованиеКлиента = Контрагент;	
				КонецЕсли;
			КонецЕсли;
			
			// Семенихин 12.04.2021 +++++
			Если обЗначениеНеЗаполнено(Пол) Тогда
				Пол = Перечисления.ПолФизическихЛиц.НеУказан;
			КонецЕсли;
			
			Если Не Основание.Свойство("ВидАвтомобиля", ВидАвтомобиля) Тогда
				Если ТолькоБУ Тогда
					ВидАвтомобиля = Перечисления.ВидАвтомобиля.АвтомобильСПробегом;
				Иначе
					ВидАвтомобиля = Перечисления.ВидАвтомобиля.Новый;
				КонецЕсли;
			КонецЕсли;
			// Семенихин 13.01.2026 -----
			
			//Гэндальф+++
			РегистрацияЗвонковИКонтактов = Основание;
			//Гэндальф---
			
		ИначеЕсли ИмяСтруктуры="Автомобиль" Тогда
			ЗаполнитьЗначенияСвойств(ЭтотОбъект, Основание);
		КонецЕсли;
		Возврат;
	КонецЕсли;
	
	Попытка
		УжеВводилось = ЭтотОбъект.ДополнительныеСвойства.УжеВводилось;
	Исключение
		УжеВводилось = Ложь;
	КонецПопытки;
	
	Если НЕ УжеВводилось Тогда
		Если НЕ дкОбработкаЗаполнения(ЭтотОбъект, Основание) Тогда Возврат; КонецЕсли;
		
		Если ТипЗнч(Основание)=Тип("ДокументСсылка.Событие") Тогда 	
			Пользователи.Загрузить(Основание.Пользователи.Выгрузить());
		КонецЕсли;
		
		#Если Клиент Тогда
			зфРабочийЛистОбработкаЗаполнения(ЭтотОбъект,Основание);
		#Иначе
			зфЗащищенныеФункцииСервер.РабочийЛистОбработкаЗаполнения(ЭтотОбъект,Основание);
		#КонецЕсли
		
		Если обЗначениеНеЗаполнено(Менеджер) Тогда
			ТекущийСотрудник = ПолучитьСотрудникаПоПользователю(ПараметрыСеанса.Пользователь);
			Менеджер = ТекущийСотрудник;
			ОбработкаРеквизита("Менеджер");
		КонецЕсли;
		
		Если НЕ ВводИзАРМРесепшен И Пользователи.Количество() = 0 Тогда
			СтрокаПользователь = Пользователи.Добавить();
			СтрокаПользователь.Пользователь = ПараметрыСеанса.Пользователь;
		КонецЕсли;
		
	КонецЕсли;
	
	//Гэндальф+++
	Если ТипРабочегоЛиста = Перечисления.ТипыСообщений.ПустаяСсылка() и ЭтоНовый() и НЕ ВводИзАРМРесепшен тогда
		ТипРабочегоЛиста = Перечисления.ТипыСообщений.Исходящее;
		ВидКонтакта = Перечисления.ВидыСобытий.ТелефонныйЗвонок;
	КонецЕсли;	
	//Гэндальф--- 
	
	//Бондаренко++ 20240307
	Если ЭтоНовый() Тогда
		ГотовКВыгодномуПредложению = Перечисления.ВариантыОтветов.Спрашивать;
		Альтернативы = Справочники.Модели.НЕТ;
		ГодВыпускаАльтернативы = Перечисления.ВариантыОтветов.Спрашивать;
		ГодПокупкиАльтернативы = Перечисления.ВариантыОтветов.Спрашивать;
	КонецЕсли;
	//Бондаренко-- 20240307
	
КонецПроцедуры // ОбработкаЗаполнения()

// Обработчик события при копировании
//
Процедура ПриКопировании(ОбъектКопирования)
	Если НЕ дкПриКопировании(ЭтотОбъект, ОбъектКопирования) Тогда Возврат; КонецЕсли;
	//Бондаренко++ 20240411
	СМГ_ПриКопировании(ЭтотОбъект,ОбъектКопирования);
	//Бондаренко-- 20240411
КонецПроцедуры // ПриКопировании()

//Бондаренко++ 20251015
Функция СМГ_ПолучитьДатуПоследнегоПоступленияИзРегистраОстатков(Авто,ДатаРеализации)
	
	Дата_ = Дата(1,1,1);
	
	Запрос = Новый Запрос;
	
	Если ДатаРеализации = Дата(1,1,1) Тогда
		
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ОстаткиАвтомобилейОбороты.Регистратор КАК Регистратор,
		|	ОстаткиАвтомобилейОбороты.Период КАК Период,
		|	ОстаткиАвтомобилейОбороты.Автомобиль КАК Автомобиль,
		|	ОстаткиАвтомобилейОбороты.КоличествоПриход КАК КоличествоПриход,
		|	ОстаткиАвтомобилейОбороты.Регистратор.Контрагент КАК РегистраторКонтрагент,
		|	ОстаткиАвтомобилейОбороты.Регистратор.Контрагент.НашаФирма КАК РегистраторКонтрагентНашаФирма,
		|	ОстаткиАвтомобилейОбороты.Регистратор.ХозОперация КАК РегистраторХозОперация
		|ИЗ
		|	РегистрНакопления.ОстаткиАвтомобилей.Обороты(, , Регистратор, ) КАК ОстаткиАвтомобилейОбороты
		|ГДЕ
		|	ОстаткиАвтомобилейОбороты.КоличествоПриход = 1
		|	И НЕ ОстаткиАвтомобилейОбороты.Регистратор.Контрагент.НашаФирма
		|	И НЕ ОстаткиАвтомобилейОбороты.Регистратор.ХозОперация = &ПереходВСобственность
		//Иванченко 20260129 ++
		|	И ОстаткиАвтомобилейОбороты.Регистратор = ОстаткиАвтомобилейОбороты.Партия
		//Иванченко 20260129 --
		|	И ОстаткиАвтомобилейОбороты.Автомобиль = &Автомобиль
		|
		|УПОРЯДОЧИТЬ ПО
		|	Период УБЫВ"; 
		
	Иначе	
		
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ОстаткиАвтомобилейОбороты.Регистратор КАК Регистратор,
		|	ОстаткиАвтомобилейОбороты.Период КАК Период,
		|	ОстаткиАвтомобилейОбороты.Автомобиль КАК Автомобиль,
		|	ОстаткиАвтомобилейОбороты.КоличествоПриход КАК КоличествоПриход,
		|	ОстаткиАвтомобилейОбороты.Регистратор.Контрагент КАК РегистраторКонтрагент,
		|	ОстаткиАвтомобилейОбороты.Регистратор.Контрагент.НашаФирма КАК РегистраторКонтрагентНашаФирма,
		|	ОстаткиАвтомобилейОбороты.Регистратор.ХозОперация КАК РегистраторХозОперация
		|ИЗ
		|	РегистрНакопления.ОстаткиАвтомобилей.Обороты(, , Регистратор, ) КАК ОстаткиАвтомобилейОбороты
		|ГДЕ
		|	ОстаткиАвтомобилейОбороты.КоличествоПриход = 1
		|	И НЕ ОстаткиАвтомобилейОбороты.Регистратор.Контрагент.НашаФирма
		|	И НЕ ОстаткиАвтомобилейОбороты.Регистратор.ХозОперация = &ПереходВСобственность
		//Иванченко 20260129 ++
		|	И ОстаткиАвтомобилейОбороты.Регистратор = ОстаткиАвтомобилейОбороты.Партия
		//Иванченко 20260129 --		
		|	И ОстаткиАвтомобилейОбороты.Автомобиль = &Автомобиль
		|	И ОстаткиАвтомобилейОбороты.Период < &ДатаРеализации
		|
		|УПОРЯДОЧИТЬ ПО
		|	Период УБЫВ"; 
		
		Запрос.УстановитьПараметр("ДатаРеализации",ДатаРеализации);
		
	КонецЕсли;
	
	Запрос.УстановитьПараметр("Автомобиль",Авто);
	Запрос.УстановитьПараметр("ПереходВСобственность",Справочники.ХозОперации.ПереходВСобственностьАвтомобилей);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Дата_ = ВыборкаДетальныеЗаписи.Период;
		//Бондаренко++ 20251016
		ПоступлениеАвтомобиля_ = ВыборкаДетальныеЗаписи.Регистратор;
		Если ПоступлениеАвтомобиля <> ПоступлениеАвтомобиля_ Тогда
			ПоступлениеАвтомобиля = ПоступлениеАвтомобиля_;
		КонецЕсли;
		//Бондаренко++ 20251016
		Прервать;
	КонецЦикла;
	
	Возврат Дата_;
	
КонецФункции // СМГ_ПолучитьДатуПоследнегоПоступленияИзРегистраОстатков(Авто,ДатаРеализации)
//Бондаренко++ 20251015

// Обработчик события перед записью
//
Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	//Бондаренко++ 20250902
	Если Не обЗначениеНеЗаполнено(Автомобиль) Тогда
		//Бондаренко++ 20251015
		//Если ДатаПоследнегоПоступления = Дата(1,1,1) Тогда
		//ДатаПоследнегоПоступления = СМГ_ПолучитьДатуПоследнегоПоступленияИзРегистраОстатков(Автомобиль);
		//КонецЕсли;	
		//Бондаренко-- 20251015
		Инвойс_ = СМГ_ПолучитьИнвойсИзПоступленияИКорректировок(Автомобиль,ДатаПоследнегоПоступления);
		Если Инвойс <> Инвойс_ Тогда
			Инвойс = Инвойс_;
			Инвойс1 = Инвойс_;
		КонецЕсли;
		
		//Бондаренко++ 20251015
		ДатаРеализацииАвтомобиля_ = Дата(1,1,1);
		ДатаРеализацииАвтомобиля_ = СМГ_ПолучитьДатуРеализации(Автомобиль,Ссылка);
		Если ДатаРеализацииАвтомобиля <> ДатаРеализацииАвтомобиля_ Тогда
			ДатаРеализацииАвтомобиля = ДатаРеализацииАвтомобиля_;
		КонецЕсли;
		//Бондаренко-- 20251015
		
		//Бондаренко++ 20251017
		ДатаПоследнегоПоступления_ = Дата(1,1,1);
		ДатаПоследнегоПоступления_ = СМГ_ПолучитьДатуПоследнегоПоступленияИзРегистраОстатков(Автомобиль,ДатаРеализацииАвтомобиля);
		Если ДатаПоследнегоПоступления_ <> Дата(1,1,1) Тогда
			Если ДатаПоследнегоПоступления <> ДатаПоследнегоПоступления_ Тогда
				ДатаПоследнегоПоступления = ДатаПоследнегоПоступления_;
			КонецЕсли;
		КонецЕсли;
		//Бондаренко-- 20251017
		
		СуммаПредпродажнойПодготовки_ = СМГ_ПолучитьСуммуПредпродажнойПодготовки(Автомобиль,ДатаПоследнегоПоступления,ДатаРеализацииАвтомобиля);
		Если СуммаПредпродажнойПодготовки <> СуммаПредпродажнойПодготовки_ Тогда
			СуммаПредпродажнойПодготовки = СуммаПредпродажнойПодготовки_;
		КонецЕсли;
		
	КонецЕсли;
	//Бондаренко-- 20250902
	
	//Бондаренко++ 20240314
	Если Не обЗначениеНеЗаполнено(ПодразделениеКомпании) Тогда
		Если Не обЗначениеНеЗаполнено(Организация) Тогда
			Если Организация <> ПодразделениеКомпании.Организация Тогда	
				Организация = ПодразделениеКомпании.Организация;
				Комментарий = СокрЛП(Комментарий)+" / "+СокрЛП(Организация)+" / "+СокрЛП(Номер);
				Попытка
					УстановитьНовыйНомер("");
				Исключение
				КонецПопытки;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	Если ОбПраво("НеКорректироватьЛишнееПриЗаписиРЛилиСобытия") Тогда
		Возврат;
	КонецЕсли;
	//Бондаренко-- 20240314
	
	Если НЕ дкПередЗаписью(ЭтотОбъект, Отказ, РежимЗаписи, РежимПроведения) Тогда Возврат; КонецЕсли;
	
	//Бондаренко++ 20240308
	Если Не обЗначениеНеЗаполнено(ГодВыпускаАльтернативы) Тогда
		Если ТипЗНЧ(ГодВыпускаАльтернативы) = Тип("Дата") Тогда
			Если Не обЗначениеНеЗаполнено(ГодПокупкиАльтернативы) Тогда
				Если ТипЗНЧ(ГодПокупкиАльтернативы) = Тип("Дата") Тогда
					Если НачалоГода(ГодВыпускаАльтернативы) > НачалоГода(ГодПокупкиАльтернативы) Тогда
						СМГ_Сообщить("ОШИБКА! ""Год выпуска второго авто"" = "+Формат(ГодВыпускаАльтернативы,"ДФ=гггг")+" и больше, чем ""Год покупки второго авто"" = "+Формат(ГодПокупкиАльтернативы,"ДФ=гггг")+".",СтатусСообщения.ОченьВажное);
						Отказ = Истина;		
					КонецЕсли;	
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	//Бондаренко-- 20240308
	
	//Бондаренко++ 20240308
	Если Не обЗначениеНеЗаполнено(ГодВыпускаАвтомобиляКлиента) Тогда
		Если ТипЗНЧ(ГодВыпускаАвтомобиляКлиента) = Тип("Дата") Тогда
			Если Не обЗначениеНеЗаполнено(ГодПокупкиАвтомобиляКлиента) Тогда
				Если ТипЗНЧ(ГодПокупкиАвтомобиляКлиента) = Тип("Дата") Тогда
					Если НачалоГода(ГодВыпускаАвтомобиляКлиента) > НачалоГода(ГодПокупкиАвтомобиляКлиента) Тогда
						СМГ_Сообщить("ОШИБКА! ""Год выпуска автомобиля клиента"" = "+Формат(ГодВыпускаАвтомобиляКлиента,"ДФ=гггг")+" и больше, чем ""Год покупки автомобиля клиента"" = "+Формат(ГодПокупкиАвтомобиляКлиента,"ДФ=гггг")+".",СтатусСообщения.ОченьВажное);
						Отказ = Истина;		
					КонецЕсли;	
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	//Бондаренко-- 20240308 
	
	//Бондаренко++ 20250816
	
	Если ИныеСтраховыеПродукты.Количество() > 0 Тогда
		Для каждого Стр Из ИныеСтраховыеПродукты Цикл
			Если Не обЗначениеНеЗаполнено(Стр.ПрограммаСтрахования) Тогда
				Если Не Стр.ПрограммаСтрахования.КомиссионноеВознаграждениеНеПредусмотрено Тогда
					Если Стр.КВ = 0 Тогда
						СМГ_Сообщить("ОШИБКА! В строке = "+Стр.НомерСтроки+" КВ  = "+Стр.КВ+". А должно быть больше нуля.",СтатусСообщения.ОченьВажное);
						Отказ = Истина;		
					КонецЕсли;				
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	//Бондаренко-- 20250816
	
	//Гэндальф+++
	Если ЭтоНовый() Тогда
		СоздательДокумента = Автор;
		ДатаСоздания = ТекущаяДата();
		//Бондаренко++ 20231215	
	ИначеЕсли ЮридическоеЛицо Тогда
		Если НЕ ( (СтрДлина(СокрЛП(ЮЛинн))= 10) ИЛИ (СтрДлина(СокрЛП(ЮЛинн))= 12) ) Тогда
			СМГ_Сообщить("ОШИБКА! Реквизит ""ЮЛ ИНН"" должен состоять из десяти или двенадцати символов.",СтатусСообщения.ОченьВажное); 
			//Отказ = Истина;
		КонецЕсли;
		Если СтрДлина(СокрЛП(ЮЛимя))<5  Тогда
			СМГ_Сообщить("ОШИБКА! Реквизит ""ЮЛ имя"" должен быть заполнен корректно.",СтатусСообщения.ОченьВажное); 
			//Отказ = Истина;
		КонецЕсли;
		//Бондаренко++ 20231215		
	КонецЕсли;	
	//Гэндальф---
	
	// + КМ
	Если ЭтотОбъект.ПометкаУдаления И ВидКонтакта = Перечисления.ВидыСобытий.ТелефонныйЗвонок И ТипРабочегоЛиста = Перечисления.ТипыСообщений.Исходящее Тогда
		Сообщить("Нельзя помечать на удаления рабочие листы с видом контакта исходящий телефонный звонок!");
		Отказ = Истина;		
	КонецЕсли;
	// - КМ
	
	//Бондаренко++ 20230624
	Если НЕ ( РольДоступна("ПолныеПрава") ИЛИ РольДоступна("СМ_РуководительОтделаПродаж") ) Тогда
		Если РольДоступна("СМ_МенеджерОтделаПродаж") Тогда
			Если ( ( ЭтотОбъект.Статус = Справочники.СтатусыРабочегоЛиста.Отказ )      И ( Ссылка.Статус <> Справочники.СтатусыРабочегоЛиста.Отказ )       ) ИЛИ
				( ( ЭтотОбъект.Статус = Справочники.СтатусыРабочегоЛиста.СделкаОтказ ) И ( Ссылка.Статус <> Справочники.СтатусыРабочегоЛиста.СделкаОтказ ) ) Тогда
				СМГ_Сообщить("ОШИБКА! Менеджер отдела продаж не имеет права переводить рабочий лист с состояние ""Отказ"".",СтатусСообщения.ОченьВажное); 
				СМГ_Сообщить("Вам необходимо обратиться к своему руководителю отдела продаж.",СтатусСообщения.ОченьВажное);
				Отказ = Истина;		
			КонецЕсли;
		КонецЕсли;	
	КонецЕсли;
	//Бондаренко-- 20230624
	
	//Бондаренко++ 20200226
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Событие.Ссылка,
	|	Событие.Дата КАК Дата,
	|	Событие.ДокументОснование,
	|	Событие.ТипСообщения
	|ИЗ
	|	Документ.Событие КАК Событие
	|ГДЕ
	|	Событие.ДокументОснование = &ДокументОснование
	|
	|УПОРЯДОЧИТЬ ПО
	|	Дата";
	
	Если НЕ обЗначениеНеЗаполнено(Ссылка) Тогда
		Запрос.УстановитьПараметр("ДокументОснование", Ссылка);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			Если ВыборкаДетальныеЗаписи.ТипСообщения <> Ссылка.ТипРабочегоЛиста Тогда
				ЭтотОбъект.ТипРабочегоЛиста = ВыборкаДетальныеЗаписи.ТипСообщения;
			КонецЕсли;  
			Прервать;
		КонецЦикла;
	КонецЕсли;
	//Бондаренко-- 20200226
	
	//Бондаренко++ 20201126
	ЭтоИсходящийЗвонок = ВидКонтакта = Перечисления.ВидыСобытий.ТелефонныйЗвонок И ТипРабочегоЛиста = Перечисления.ТипыСообщений.Исходящее;
	Если Не ЭтоИсходящийЗвонок Тогда
		ИсточникОбзвона = Неопределено;
	КонецЕсли;
	//Бондаренко++ 20201126
	
	// Холышевская ++ 28.02.2026
	ЭтоАвтоСП = Ложь; 
	// Холышевская -- 28.02.2026
	// Семенихин 04.03.2021 +++++
	Если ЭтоНовый() Тогда
		Если Пользователи.Количество() > 0 Тогда
			НайденнаяСтрока = Пользователи.Найти(Автор, "Пользователь");
			Если НайденнаяСтрока = Неопределено Тогда
				НоваяСтрока = Пользователи.Добавить();
				НоваяСтрока.Пользователь = Автор;
			КонецЕсли;		
		Иначе
			НоваяСтрока = Пользователи.Добавить();
			НоваяСтрока.Пользователь = Автор;
		КонецЕсли;	
		Если обЗначениеНеЗаполнено(РуководительМенеджера) Тогда
			РуководительМенеджера = Менеджер.Подразделение.РуководительОП;
		КонецЕсли;
		
		Если обЗначениеНеЗаполнено(ВидАвтомобиля) Тогда
			Если ТолькоБУ Тогда
				ВидАвтомобиля = Перечисления.ВидАвтомобиля.АвтомобильСПробегом;
			Иначе
				ВидАвтомобиля = Перечисления.ВидАвтомобиля.Новый;
			КонецЕсли;
		КонецЕсли;
		
		Если Не ТолькоБУ И (ЗначениеЗаполнено(Автомобиль) И ВидАвтомобиля = Перечисления.ВидАвтомобиля.АвтомобильСПробегом
			Или Модель = Справочники.Модели.АвтоСПробегом) Тогда
			Сообщить("В этом рабочем листе нельзя указывать автомобиль с пробегом!", СтатусСообщения.Важное);
			Автомобиль = Справочники.Автомобили.ПустаяСсылка();
			Модель = Справочники.Модели.ПустаяСсылка();
			Отказ = Истина;
		КонецЕсли; 
		
		//Иванченко 20260127 ++     
		//Иванченко 20260128 ++		
		//Если Не ТолькоСП И (ЗначениеЗаполнено(Автомобиль) И ВидАвтомобиля = Перечисления.ВидАвтомобиля.СобственныйПарк) Тогда      
		//Иванченко 20260130 ++
		Если ЗначениеЗаполнено(Автомобиль) И обЗначениеНеЗаполнено(Инфотек_Идентификатор_CRM) Тогда
			//Иванченко 20260130 --		
			Структура_ОтборВидАвто = Новый Структура("Автомобиль, ВидЗначения", Автомобиль, Перечисления.ДополнительнаяИнформацияАвтомобилей.ВидАвтомобиля);
			ВидАвто = РегистрыСведений.Автомобили.СрезПоследних(, Структура_ОтборВидАвто).ВыгрузитьКолонку("Значение")[0]; 
			ЭтоАвтоСП = ?(ВидАвто = Перечисления.ВидАвтомобиля.СобственныйПарк, Истина, Ложь);   
			
			//Иванченко 20260130 ++			
			//Если ВидАвтомобиля = Перечисления.ВидАвтомобиля.СобственныйПарк И ЗначениеЗаполнено(Автомобиль) И ЭтоАвтоСП Тогда   
			Если ВидАвтомобиля <> Перечисления.ВидАвтомобиля.СобственныйПарк И ЗначениеЗаполнено(Автомобиль) И ЭтоАвтоСП Тогда   
			//Иванченко 20260130 --				
				//Иванченко 20260127 --					
				Сообщить("В этом рабочем листе нельзя указывать автомобиль собственного парка!", СтатусСообщения.Важное);
				Автомобиль = Справочники.Автомобили.ПустаяСсылка();
				Модель = Справочники.Модели.ПустаяСсылка();
				Отказ = Истина;
			КонецЕсли; 
			//Иванченко 20260127 --	
			//Иванченко 20260130 ++
		КонецЕсли; 
		//Иванченко 20260130 --		
		
	Иначе
		СтараяМодель = Ссылка.Модель;
		СтараяМарка = СтараяМодель.Марка;
		БУИлиСобствПарк = (ТолькоБУ Или ВидАвтомобиля = Перечисления.ВидАвтомобиля.СобственныйПарк);
		Если Не БУИлиСобствПарк И ЗначениеЗаполнено(СтараяМодель) И 
			СтараяМарка <> Модель.Марка И Не РольДоступна("ПолныеПрава") Тогда
			мВыгружаемыеМарки = Новый Массив();
			мВыгружаемыеМарки.Добавить(Справочники.Марка.BELGEE);
			мВыгружаемыеМарки.Добавить(Справочники.Марка.CHANGAN);
			мВыгружаемыеМарки.Добавить(Справочники.Марка.EXEED);
			мВыгружаемыеМарки.Добавить(Справочники.Марка.GAC);
			мВыгружаемыеМарки.Добавить(Справочники.Марка.GEELY);
			мВыгружаемыеМарки.Добавить(Справочники.Марка.JAECOO);
			мВыгружаемыеМарки.Добавить(Справочники.Марка.LADA_ВАЗ);
			мВыгружаемыеМарки.Добавить(Справочники.Марка.OMODA);
			мВыгружаемыеМарки.Добавить(Справочники.Марка.UAZ);
			мВыгружаемыеМарки.Добавить(Справочники.Марка.VGV);
			мВыгружаемыеМарки.Добавить(Справочники.Марка.CHERY);
			мВыгружаемыеМарки.Добавить(Справочники.Марка.TENET);
			мВыгружаемыеМарки.Добавить(Справочники.Марка.HAVAL);
			мВыгружаемыеМарки.Добавить(Справочники.Марка.GREAT_WALL);
			мВыгружаемыеМарки.Добавить(Справочники.Марка.SOLLERS);
			
			Если мВыгружаемыеМарки.Найти(СтараяМарка) <> Неопределено Тогда
				Сообщение = "Изменять марку автомобиля ("+СокрЛП(СтараяМарка)+") в рабочем листе запрещено!" +
				Символы.ПС + "1. Необходимо оформить Отказ от автомобиля для данного рабочего листа." +
				Символы.ПС + "2. Затем для другой марки создать новый рабочий лист.";
				Сообщить(Сообщение, СтатусСообщения.Важное);
				Модель = СтараяМодель;
				Отказ = Истина;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	Если ТолькоБУ Тогда
		Если ЗначениеЗаполнено(Автомобиль) И ВидАвтомобиля <> Перечисления.ВидАвтомобиля.АвтомобильСПробегом Тогда		
			Сообщение = "В этом рабочем листе можно указать только автомобиль с пробегом!";
			Если ЭтоНовый() Тогда
				Автомобиль = Справочники.Автомобили.ПустаяСсылка();
			Иначе
				Автомобиль = Ссылка.Автомобиль;
				Сообщение = Сообщение + Символы.ПС + "1. Необходимо оформить отказ от автомобиля." +
				Символы.ПС + "2. Для нового автомобиля необходимо создать новый рабочий лист.";
			КонецЕсли;
			Сообщить(Сообщение, СтатусСообщения.Важное);
			Отказ = Истина;
			
		ИначеЕсли ЗначениеЗаполнено(Модель) И Модель <> Справочники.Модели.АвтоСПробегом Тогда
			Модель = Справочники.Модели.АвтоСПробегом
		КонецЕсли;
	КонецЕсли;
	
	//Иванченко 20260130 ++
	Если ЗначениеЗаполнено(Автомобиль) Тогда	
		//Иванченко 20260128 ++
		//Структура_ОтборСП = Новый Структура("Автомобиль, ВидЗначения, Значение", Автомобиль, Перечисления.ДополнительнаяИнформацияАвтомобилей.ВидАвтомобиля, Перечисления.ВидАвтомобиля.СобственныйПарк);
		//ЭтоАвтоСП = РегистрыСведений.Автомобили.ПолучитьПоследнее(, Структура_ОтборСП);  
		Структура_ОтборВидАвто = Новый Структура("Автомобиль, ВидЗначения", Автомобиль, Перечисления.ДополнительнаяИнформацияАвтомобилей.ВидАвтомобиля);
		ВидАвто = РегистрыСведений.Автомобили.СрезПоследних(, Структура_ОтборВидАвто).ВыгрузитьКолонку("Значение");
		Если ВидАвто.Количество() <> 0 Тогда
			ВидАвто = ВидАвто[0];
			ЭтоАвтоСП = ?(ВидАвто = Перечисления.ВидАвтомобиля.СобственныйПарк, Истина, Ложь);
		КонецЕсли;   		
	КонецЕсли;
	//Иванченко 20260130 --	
	
	Если ВидАвтомобиля = Перечисления.ВидАвтомобиля.СобственныйПарк И НЕ ЭтоАвтоСП Тогда
		
		Если ЗначениеЗаполнено(Автомобиль) И Не ЭтоАвтоСП Тогда  
			Сообщение = "В этом рабочем листе можно указывать только автомобиль вида ""Собственный парк""!";
			Автомобиль = Ссылка.Автомобиль;
			Сообщение = Сообщение + Символы.ПС + "1. По этому РЛ необходимо оформить отказ от автомобиля." +
			Символы.ПС + "2. Затем для автомобиля другого вида необходимо создать новый рабочий лист.";
			Сообщить(Сообщение, СтатусСообщения.Важное);
			Отказ = Истина;
		КонецЕсли;
		
	КонецЕсли;
	//Иванченко 20260128 --

	
	Если обЗначениеНеЗаполнено(КонтактныйТелефон) Тогда
		КонтактныйТелефон = ПредставлениеТелефона;
	КонецЕсли;
	// Семенихин 13.01.2026 -----  
	
	//Иванченко 20260313 ++ 	
	////Иванченко 20260102 ++ 
	////Иванченко 20260104 ++ 
	////НалоговаяНаценка = Окр(ДКПавто * (5/6 - 50/61), -3, РежимОкругления.Окр15как20);
	//НалоговаяНаценка = Окр(ДКПавто * (5/6 - 50/61), -2, РежимОкругления.Окр15как20); 
	////Иванченко 20260104 --	
	//
	//Если СтоимостьДОФакт < НалоговаяНаценка И           
	//	//Иванченко 20260104 ++
	//	(ПолучитьФорму().Открыта() ИЛИ ПолучитьФорму("ФормаСписка").Открыта()) И
	//	//Иванченко 20260104 --
	//	(ВидАвтомобиля = Перечисления.ВидАвтомобиля.Новый ИЛИ 
	//	 ВидАвтомобиля = Перечисления.ВидАвтомобиля.КорпоративнаяКвота ИЛИ
	//	 ВидАвтомобиля = Перечисления.ВидАвтомобиля.ПараллельныйИмпорт) Тогда 
	//	СМГ_Сообщить("ОШИБКА! Цена ДОП по прайсу должна быть не меньше " + Формат(НалоговаяНаценка, "ЧФ=Ч") + ".", СтатусСообщения.ОченьВажное);			 
	//	Отказ = Истина;		
	//КонецЕсли;
	////Иванченко 20260102 --
	//Иванченко 20260313 --	
	
КонецПроцедуры // ПередЗаписью()

// Обработчик события при записи
//
Процедура ПриЗаписи(Отказ)
	Если НЕ дкПриЗаписи(ЭтотОбъект, Отказ) Тогда Возврат; КонецЕсли;
	
	//Бондаренко++ 20240314
	Если ОбПраво("НеКорректироватьЛишнееПриЗаписиРЛилиСобытия") Тогда
		Возврат;
	КонецЕсли;
	//Бондаренко-- 20240314
	
	// Синхронизация реквизита «Контрагент» в подчиненных документах
	// РабочийЛистОтделаСтрахования и РабочийЛистКредитногоОтдела
	
	ЗапросПодчиненныхЛистов			= Новый Запрос();
	ЗапросПодчиненныхЛистов.УстановитьПараметр("Ссылка", Ссылка);
	ЗапросПодчиненныхЛистов.УстановитьПараметр("Контрагент", Контрагент);
	ЗапросПодчиненныхЛистов.УстановитьПараметр("Выдача", Перечисления.ВидыСобытий.ВыдачаАвтомобиля);
	ЗапросПодчиненныхЛистов.Текст	= "ВЫБРАТЬ
	|	РабочийЛистКредитногоОтдела.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.РабочийЛистКредитногоОтдела КАК РабочийЛистКредитногоОтдела
	|ГДЕ
	|	РабочийЛистКредитногоОтдела.ДокументОснование = &Ссылка
	|	И РабочийЛистКредитногоОтдела.Клиент <> &Контрагент
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	РабочийЛистОтделаСтрахования.Ссылка
	|ИЗ
	|	Документ.РабочийЛистОтделаСтрахования КАК РабочийЛистОтделаСтрахования
	|ГДЕ
	|	РабочийЛистОтделаСтрахования.ДокументОснование = &Ссылка
	|	И РабочийЛистОтделаСтрахования.Страхователь <> &Контрагент
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Событие.Ссылка
	|ИЗ
	|	Документ.Событие КАК Событие
	|ГДЕ
	|	Событие.ДокументОснование = &Ссылка
	|	И Событие.Контрагент <> &Контрагент
	|	И Событие.ВидСобытия <> &Выдача";
	
	тзПодчиненныхДокументов	= ЗапросПодчиненныхЛистов.Выполнить().Выгрузить();
	ОбновлятьКонтрагента	= Ложь;
	
	#Если Клиент Тогда
		Если (НЕ МонопольныйРежим()) И тзПодчиненныхДокументов.Количество()>0 
			//Гэндальф+++	
			// И Вопрос("Синхронизировать контрагента в подчиненных документах?", РежимДиалогаВопрос.ДаНет)=КодВозвратаДиалога.Да 
			Тогда
			ОбновлятьКонтрагента	= Истина;
		КонецЕсли;
	#КонецЕсли
	
	Если ОбновлятьКонтрагента Тогда
		Для Каждого ТекСтрока Из тзПодчиненныхДокументов Цикл
			Подчиненный	= ТекСтрока.Ссылка.ПолучитьОбъект();
			Если Подчиненный<>Неопределено Тогда
				Если ТипЗнч(Подчиненный)=Тип("ДокументОбъект.РабочийЛистКредитногоОтдела") Тогда
					Подчиненный.Клиент	= Контрагент;
				ИначеЕсли ТипЗнч(Подчиненный)=Тип("ДокументОбъект.РабочийЛистОтделаСтрахования") Тогда
					Подчиненный.Страхователь	= Контрагент;
				ИначеЕсли ТипЗнч(Подчиненный)=Тип("ДокументОбъект.Событие") Тогда
					Подчиненный.Контрагент	= Контрагент;
				Иначе
					Продолжить;
				КонецЕсли;
				Попытка
					//Гэндальф+++
					//Подчиненный.Записать();
					Подчиненный.ЭтотОбъект.ОбменДанными.Загрузка = Истина;
					Подчиненный.Записать();
					//Гэндальф---
				Исключение КонецПопытки;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	//Гэндальф+++
	Если РегистрацияЗвонковИКонтактов <> Неопределено И РегистрацияЗвонковИКонтактов.Имя = "РегистрацияЗвонковИКонтактов" Тогда
		Попытка
			НаборЗаписей = РегистрыСведений.РегистрацияЗвонковИКонтактов.СоздатьНаборЗаписей(); 
			НаборЗаписей.Отбор.Автор.Установить(РегистрацияЗвонковИКонтактов.Автор);
			НаборЗаписей.Отбор.ДатаДень.Установить(РегистрацияЗвонковИКонтактов.ДатаДень); 
			НаборЗаписей.Отбор.ДатаВремя.Установить(РегистрацияЗвонковИКонтактов.ДатаВремя); 
			НаборЗаписей.Отбор.Сотрудник.Установить(РегистрацияЗвонковИКонтактов.Сотрудник);
			НаборЗаписей.Прочитать();
			НаборЗаписей[0].РабочийЛист = Ссылка;
			НаборЗаписей.Записать();
		Исключение
		КонецПопытки;	
	КонецЕсли;
	НоваяЗапись = РегистрыСведений.ИсторияСостоянияРабочегоЛиста.СоздатьМенеджерЗаписи();
	НоваяЗапись.Период = ТекущаяДата();
	НоваяЗапись.РабочийЛист = Ссылка;
	НоваяЗапись.Статус = Статус;
	НоваяЗапись.Документ = Ссылка;
	НоваяЗапись.Значение = Комментарий;
	
	НоваяЗапись.Записать(Истина);
	
	//Гэндальф---
	
	//Бондаренко++ 20200602
	ПоследнийСтатус = Справочники.СтатусыРабочегоЛиста.ПустаяСсылка();
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ИзмененияСтатусаРабочегоЛистаСрезПоследних.РабочийЛист,
	|	ИзмененияСтатусаРабочегоЛистаСрезПоследних.СтатусРабочегоЛиста
	|ИЗ
	|	РегистрСведений.ИзмененияСтатусаРабочегоЛиста.СрезПоследних КАК ИзмененияСтатусаРабочегоЛистаСрезПоследних
	|ГДЕ
	|	ИзмененияСтатусаРабочегоЛистаСрезПоследних.РабочийЛист = &РабочийЛист";
	Запрос.УстановитьПараметр("РабочийЛист", Ссылка);
	РезультатЗапроса = Запрос.Выполнить();
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		ПоследнийСтатус = ВыборкаДетальныеЗаписи.СтатусРабочегоЛиста;
	КонецЦикла;
	Если Ссылка.Статус <> ПоследнийСтатус Тогда
		НоваяЗапись = РегистрыСведений.ИзмененияСтатусаРабочегоЛиста.СоздатьМенеджерЗаписи();
		НоваяЗапись.Период = ТекущаяДата();
		НоваяЗапись.РабочийЛист = Ссылка;
		НоваяЗапись.СтатусРабочегоЛиста = Статус;
		НоваяЗапись.Записать(Истина);
	КонецЕсли; 
	//Бондаренко-- 20200602
	
	// + КМ
	Если Статус = Справочники.СтатусыРабочегоЛиста._г_База Тогда
		
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("Ссылка", Ссылка);
		Запрос.Текст = "ВЫБРАТЬ
		|	Событие.Ссылка
		|ИЗ
		|	Документ.Событие КАК Событие
		|ГДЕ
		|	Событие.ДокументОснование = &Ссылка
		|	И НЕ Событие.ПометкаУдаления
		|	И Событие.ВидСобытия = ЗНАЧЕНИЕ(Перечисление.ВидыСобытий.ТелефонныйЗвонок)
		|	И Событие.ТипСообщения = ЗНАЧЕНИЕ(Перечисление.ТипыСообщений.Исходящее)";
		
		Результат = Запрос.Выполнить();
		
		Если Результат.Пустой() Тогда
			
			ДокументСобытие = Документы.Событие.СоздатьДокумент();
			ДокументСобытие.Заполнить(Ссылка);
			ДокументСобытие.ВидСобытия = Перечисления.ВидыСобытий.ТелефонныйЗвонок;
			ДокументСобытие.ТипСообщения = Перечисления.ТипыСообщений.Исходящее;
			ДокументСобытие.Состояние = Перечисления.СостоянияСобытий.Завершено;
			ДокументСобытие.Приоритет = Перечисления.Важность.Средняя;
			ДокументСобытие.Записать();
			
		КонецЕсли;
		
	КонецЕсли;
	// - КМ
	
	///////// Эта проверка должна быть последней!
	// Семенихин 23.03.2021 +++++
	Если Не Отказ Тогда
		ЗаменитьМенеджераВСобытиях();
		СМ_ПроцедурыДляNissanAftersales.ОбновитьСтатусЛидаПоРЛ(Ссылка);
		
		Если ПредставлениеТелефона <> Ссылка.ПредставлениеТелефона Тогда
			ЗаменитьТелефонВСобытиях();
		КонецЕсли;
	КонецЕсли;	
	// Семенихин 04.11.2021 ----- 
	
	Если Не Отказ Тогда
		//РегистрыСведений.МаркетинговыеЛиды.ДобавитьЗапись(Ссылка);
	КонецЕсли;
КонецПроцедуры // ПриЗаписи()

// Обработчик события перед удалением
//
Процедура ПередУдалением(Отказ)
	Если НЕ дкПередУдалением(ЭтотОбъект, Отказ) Тогда Возврат; КонецЕсли;
КонецПроцедуры // ПередУдалением()

// Обработчик события удаления проведения
//
Процедура ОбработкаУдаленияПроведения(Отказ)
	Если НЕ дкОбработкаУдаленияПроведения(ЭтотОбъект, Отказ) Тогда Возврат; КонецЕсли;
КонецПроцедуры // ОбработкаУдаленияПроведения()

// Обработчик события проведения
//
Процедура ОбработкаПроведения(Отказ, Режим)
	
	//Бондаренко++ 20240314
	Если ОбПраво("НеКорректироватьЛишнееПриЗаписиРЛилиСобытия") Тогда
		Возврат;
	КонецЕсли;
	//Бондаренко-- 20240314
	
	Если НЕ дкОбработкаПроведения(ЭтотОбъект, Отказ, Режим) Тогда Возврат; КонецЕсли;
	
	//Бондаренко++ 20250625
	//СМГ_ОбработкаПроведения(Отказ, Режим);
	//Бондаренко-- 20250625
	
	// Проведение по регистру сведений Журнал событий
	Если НЕ Отказ Тогда
		Если НЕ орЖурналСостояний(Ссылка, Статус) Тогда
			Отказ=Истина;
			Возврат;
		КонецЕсли; 
	КонецЕсли;	
	
	// выведем сообщения об ошибках и предупреждениях
	дкВыводРезультатовОбработки(ЭтотОбъект,Отказ);
	
КонецПроцедуры // ОбработкаПроведения()

//Гэндальф+++
//Проверка на дубли
Функция  ПроверкаНаДубли (Форма) Экспорт
	ЕСЛИ не ВводИзАРМРесепшен  тогда
		Если ПредставлениеТелефона <>"" и  ПредставлениеТелефона <>"+7"  и  ПредставлениеТелефона <>"0" и СтрДлина(ПредставлениеТелефона) > 6  тогда
			
			СписокРЛ =г_Функции.г_ПоискРЛСТакимЖеНомером(ПредставлениеТелефона,Ссылка);
			
			Если СписокРЛ.КОличество() > 0 тогда
				//Текст = "Обнаружены Рабочие листы с таким же телефоным номером.Продолжить? ";
				//
				//для Каждого стр из СписокРЛ цикл
				//	Текст = Текст +Символы.ПС + Строка(стр)+" "+СТрока(стр.Контрагент)+" "+СТрока(стр.ПредставлениеТелефона)+" "+СТрока(стр.Статус);
				//КонецЦикла;	
				//
				//
				//Режим = РежимДиалогаВопрос.ДаНет;
				//
				//Ответ = Вопрос(Текст, Режим, 0);
				//Если Ответ = КодВозвратаДиалога.Нет Тогда
				//	Отказ = истина
				//КонецЕсли; 
				//&НаКлиенте
				//ФормаРЛ = ПолучитьФорму("ФормаСуществующихРабочихЛистов", Форма,Строка(НомерТелефона));
				//Если РодительДляОбъединения = Документы.РабочийЛист.ПустаяСсылка() тогда
				//	
				//КонецЕсли;	
				ФормаРЛ = ПолучитьФорму("ФормаСуществующихРабочихЛистов" );
				
				Если Не ФормаРЛ.Открыта() тогда
					ФормаРЛ.СписокРабочихЛистов.Отбор.Ссылка.Использование = Истина;
					ФормаРЛ.СписокРабочихЛистов.Отбор.Ссылка.ВидСравнения = ВидСравнения.ВСписке;
					ФормаРЛ.СписокРабочихЛистов.Отбор.Ссылка.Значение =  СписокРЛ;
					ФормаРЛ.ТекРЛ = Ссылка;
					
					Открыта = ФормаРЛ.ОткрытьМодально()   ;
					Если Открыта <> Документы.РабочийЛист.ПустаяСсылка() и Открыта<>Неопределено тогда
						Если Открыта[0] <>Документы.РабочийЛист.ПустаяСсылка() и Открыта.Количество()>1 тогда
							Объект = Открыта[0].ПолучитьОбъект();
							Объект.УстановитьПометкуУдаления(Истина);
							Объект.Записать();
							
							Запрос = Новый Запрос;
							Запрос.Текст = "ВЫБРАТЬ
							|	Событие.Ссылка
							|ИЗ
							|	Документ.Событие КАК Событие
							|ГДЕ
							|	Событие.ПометкаУдаления = ЛОжь
							|	И Событие.ДокументОснование = &ДокументОснование";
							Запрос.УстановитьПараметр("ДокументОснование",Открыта[0])	;		  
							
							Результат = Запрос.Выполнить().Выбрать();
							
							Пока Результат.Следующий() цикл
								ОбъектСобытие = Результат.Ссылка.ПолучитьОбъект();
								ОбъектСобытие.ДокументОснование = Открыта[1];
								ОбъектСобытие.дата = ТекущаяДата();
								Попытка
									ОбъектСобытие.Записать(РежимЗаписиДокумента.Проведение);
									
								Исключение
									
								КонецПопытки;	
								
							КонецЦикла;
							Возврат Истина;
						КонецЕсли;	
					КонецЕсли;
				КонецЕсли;
			КонецЕсли;	
		КонецЕсли;
	КонецЕсли;
	Возврат Ложь;
КонецФункции	

Процедура ПроверитьВыдачу() Экспорт
	Если Статус = Справочники.СтатусыРабочегоЛиста.Продажа тогда	
		Флаг = Ложь;
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	Событие.Ссылка
		|ИЗ
		|	Документ.Событие КАК Событие
		|ГДЕ
		|	Событие.ДокументОснование = &ДокументОснование
		|	И Событие.ВидСобытия = &ВидСобытия
		|	И Событие.Состояние = &Состояние";
		
		Запрос.УстановитьПараметр("ВидСобытия", Перечисления.ВидыСобытий.ВыдачаАвтомобиля);
		Запрос.УстановитьПараметр("ДокументОснование", Ссылка);
		Запрос.УстановитьПараметр("Состояние", Перечисления.СостоянияСобытий.Завершено);
		
		Результат = Запрос.Выполнить();
		
		ВыборкаДетальныеЗаписи = Результат.Выбрать();
		
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			Флаг= Истина;
		КонецЦикла;
		
		Если Флаг тогда
			МашинаВыдана = Истина;
		КонецЕсли;	
	КонецЕсли;	
КонецПроцедуры		

Процедура СоздатьСобытияВежливости () Экспорт 
	//Запрос = Новый Запрос;
КонецПроцедуры	
//Гэндальф---

// Семенихин 06.04.2021 +++++
Процедура ДобавитьКонтрагентаВПодчиненные() Экспорт
	Если обЗначениеНеЗаполнено(Ссылка) Тогда
		Возврат;
	КонецЕсли;	
	Если ТипЗнч(Контрагент) <> Тип("СправочникСсылка.Контрагенты") Тогда
		Возврат;
	КонецЕсли;
	
	СписокПодчиненных = КритерииОтбора.ПодчиненныеДокументы.Найти(Ссылка);
	Для Каждого ПодчиненныйДокумент Из СписокПодчиненных Цикл
		ДокументМетаданные = ПодчиненныйДокумент.Метаданные();
		Если ДокументМетаданные.Реквизиты.Найти("Контрагент") = Неопределено Тогда
			Продолжить;
		ИначеЕсли ДокументМетаданные.Имя = "ЗаказНаАвтомобиль" Тогда
			Продолжить;
		Иначе
			ПодчиненныйДокументОбъект = ПодчиненныйДокумент.ПолучитьОбъект();
			Если ПодчиненныйДокументОбъект.Контрагент = Контрагент Тогда
				Продолжить;
			КонецЕсли;
			ПодчиненныйДокументОбъект.Контрагент = Контрагент;
			ПодчиненныйДокументОбъект.ОбменДанными.Загрузка = Истина;
			ПодчиненныйДокументОбъект.Записать();
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

Процедура ЗаменитьМенеджераВСобытиях()
	ЗапросСобытия = Новый Запрос();
	ЗапросСобытия.УстановитьПараметр("Запланировано", Перечисления.СостоянияСобытий.Запланировано);
	ЗапросСобытия.УстановитьПараметр("РабочийЛист", Ссылка);
	ЗапросСобытия.УстановитьПараметр("Менеджер", Менеджер);
	ЗапросСобытия.Текст =
	"ВЫБРАТЬ
	|	Событие.Ссылка
	|ИЗ
	|	Документ.Событие КАК Событие
	|ГДЕ
	|	Событие.Состояние = &Запланировано
	|	И Событие.ДокументОснование = &РабочийЛист
	|	И Событие.Продавец <> &Менеджер";
	
	РезультатСобытия = ЗапросСобытия.Выполнить().Выбрать();
	Пока РезультатСобытия.Следующий() Цикл
		СобытиеОбъект = РезультатСобытия.Ссылка.ПолучитьОбъект();
		СобытиеОбъект.Продавец = Менеджер;
		СобытиеОбъект.ПодразделениеКомпании = ПодразделениеКомпании;
		СобытиеОбъект.Организация = ПодразделениеКомпании.Организация;
		Попытка
			СобытиеОбъект.ОбменДанными.Загрузка = Истина;
			СобытиеОбъект.Записать();
		Исключение
			Сообщить("Ошибка замены менеджера в " + Строка(РезультатСобытия.Ссылка) + Символы.ПС + ОписаниеОшибки(), СтатусСообщения.Важное);
			Продолжить;
		КонецПопытки;
	КонецЦикла;
КонецПроцедуры

Функция ПолучитьПодчиненныеСобытия() Экспорт
	ЗапросСобытия = Новый Запрос();
	ЗапросСобытия.УстановитьПараметр("РабочийЛист", Ссылка);
	ЗапросСобытия.Текст =
	"ВЫБРАТЬ
	|	Событие.Ссылка,
	|	Событие.Номер,
	|	Событие.Дата КАК Дата,
	|	Событие.Автомобиль,
	|	Событие.Автор,
	|	Событие.ВидСобытия,
	|	Событие.ВидТелефона,
	|	Событие.ДатаНачала,
	|	Событие.ДатаОкончания,
	|	Событие.ДатаФактическогоЗавершения,
	|	Событие.ЗаказНаАвтомобиль,
	|	Событие.ИсточникИнформации,
	|	Событие.Комментарий,
	|	Событие.Контрагент,
	|	Событие.Продавец,
	|	Событие.Организация,
	|	Событие.ПодразделениеКомпании,
	|	Событие.ПредставлениеТелефона,
	|	Событие.Примечание,
	|	Событие.Продолжительность,
	|	Событие.Результат,
	|	Событие.Содержание,
	|	Событие.Состояние,
	|	Событие.ТипСообщения,
	|	Событие.ФактическаяДатаВыдачиАвтомобиля,
	|	Событие.ПовторныйРемонт,
	|	Событие.ВторичныйКонтакт,
	|	Событие.ПредметОбращения,
	|	Событие.КомментарийКоллЦентра
	|ИЗ
	|	Документ.Событие КАК Событие
	|ГДЕ
	|	НЕ Событие.ПометкаУдаления
	|	И Событие.ДокументОснование = &РабочийЛист
	|
	|УПОРЯДОЧИТЬ ПО
	|	Дата";
	
	Возврат ЗапросСобытия.Выполнить().Выгрузить();
КонецФункции

Процедура ЗаменитьТелефонВСобытиях()	
	ЗапросСобытия = Новый Запрос();
	ЗапросСобытия.УстановитьПараметр("ДокументОснование", Ссылка);
	ЗапросСобытия.Текст =
	"ВЫБРАТЬ
	|	Событие.Ссылка
	|ИЗ
	|	Документ.Событие КАК Событие
	|ГДЕ
	|	Событие.ДокументОснование = &ДокументОснование
	|	И Событие.Состояние = ЗНАЧЕНИЕ(Перечисление.СостоянияСобытий.Запланировано)";
	
	РезультатСобытия = ЗапросСобытия.Выполнить();
	Если РезультатСобытия.Пустой() Тогда
		Возврат;
	КонецЕсли;
	
	ВыборкаСобытия = РезультатСобытия.Выбрать();
	ОбработкаРедактированиеКИ = Обработки.РедактированиеКонтактнойИнформации.Создать();
	СтруктураТелефона = ОбработкаРедактированиеКИ.СМГ_СформироватьСтруктуруТелефона(ПредставлениеТелефона);
	Пока ВыборкаСобытия.Следующий() Цикл
		СобытиеОбъект = ВыборкаСобытия.Ссылка.ПолучитьОбъект();
		ЗаполнитьЗначенияСвойств(СобытиеОбъект, СтруктураТелефона);
		СобытиеОбъект.ОбменДанными.Загрузка = Истина;
		СобытиеОбъект.Записать();
	КонецЦикла;
КонецПроцедуры
// Семенихин 12.04.2023 -----

//Бондаренко++ 20230804
Процедура СМГ_ЗаполнитьДанныеПоАвтомобилюИКлиенту(Автомобиль,ЭтаФорма,ИзФормы) Экспорт
	
	//Бондаренко++ 20260115
	Если обЗначениеНеЗаполнено(Автомобиль) Тогда
		#Если Клиент Тогда
			СМГ_Сообщить("ОШИБКА! На Закладке <<Рабочий лист>> не выбран Автомобиль",СтатусСообщения.ОченьВажное);			 
		#КонецЕсли		
 	    Возврат;
	КонецЕсли;
	//Бондаренко-- 20260115
	
	//Бондаренко++ 20230905
	ТребуетсяПересчетПоказателей = Ложь;
	//Бондаренко++ 20240123
	Если ИзФормы Тогда
		ТребуетсяПересчетПоказателей = Истина;
	КонецЕсли;
	//Бондаренко-- 20240123
	
	// Семенихин 10.05.2024 +++++
	РРЦ_ = 0;
	Если ВидАвтомобиля = Перечисления.ВидАвтомобиля.АвтомобильСПробегом
		Или ВидАвтомобиля = Перечисления.ВидАвтомобиля.ТестовыйАвтомобиль
		Или ВидАвтомобиля = Перечисления.ВидАвтомобиля.ПодменныйАвтомобиль Тогда
		#Если Клиент Тогда
			Состояние("Идет запрос РРЦ в Автохаб ...");
		#КонецЕсли
		Попытка
			стОтвет = СМ_ВыгрузкаВАвтохаб.ПолучитьРРЦ(Автомобиль.VIN);
			Если стОтвет.status = "success" Тогда
				РРЦ_ = стОтвет.price;
				
			ИначеЕсли стОтвет.status = "error" И Статус <> Справочники.СтатусыРабочегоЛиста.Продажа Тогда
				Сообщить(стОтвет.message, СтатусСообщения.Информация);
			КонецЕсли;
		Исключение
			Сообщить("Не удалось получить РРЦ с Автохаб, следует повторить попытку.", СтатусСообщения.Внимание);
		КонецПопытки;
		#Если Клиент Тогда
			Состояние();
		#КонецЕсли
	КонецЕсли;
	// Семенихин 13.05.2026 -----
	
	//Бондаренко++ 20241203
	Если РРЦ_ = 0 Тогда
		РРЦ_ = ПолучитьЦенуПродажиИзПоступленияАвто(Автомобиль);
	КонецЕсли;
	
	Если РРЦ_ = 0 Тогда    
		//Бондаренко++ 20240315
		//РРЦ_ = ПолучитьЦенуПродажиИзПоступленияАвто(Автомобиль);
		РРЦ_ = СМГ_ПолучитьРРЦ(Автомобиль);
		//Бондаренко-- 20240315
	КонецЕсли;
	//Бондаренко++ 20241203
	
	Если РРЦ <> РРЦ_ Тогда
		//Бондаренко++ 20240312
		Если РРЦ_ > 0 Тогда    
			//Бондаренко-- 20240312	
			РРЦ = РРЦ_; 
			ТребуетсяПересчетПоказателей = Истина;
			//Бондаренко++ 20240312	
		КонецЕсли;
		//Бондаренко-- 20240312
	КонецЕсли;
	
	Инвойс_ = СМГ_ПолучитьИнвойсПоОстаткуНаСкладе(Автомобиль);
	
	//Бондаренко++ 20251015
	ДатаРеализацииАвтомобиля_ = Дата(1,1,1);
	ДатаРеализацииАвтомобиля_ = СМГ_ПолучитьДатуРеализации(Автомобиль,Ссылка);
	Если ДатаРеализацииАвтомобиля <> ДатаРеализацииАвтомобиля_ Тогда
		ДатаРеализацииАвтомобиля = ДатаРеализацииАвтомобиля_;
		ТребуетсяПересчетПоказателей = Истина;
	КонецЕсли;
	
	ДатаПоследнегоПоступления_ = СМГ_ПолучитьДатуПоследнегоПоступленияИзРегистраОстатков(Автомобиль,ДатаРеализацииАвтомобиля);
	
	Если ДатаПоследнегоПоступления <> ДатаПоследнегоПоступления_ Тогда
		ДатаПоследнегоПоступления = ДатаПоследнегоПоступления_;
		ТребуетсяПересчетПоказателей = Истина; 
	КонецЕсли;
	//Бондаренко-- 20251015
	
	//Бондаренко++ 20250902
	Инвойс_ = СМГ_ПолучитьИнвойсИзПоступленияИКорректировок(Автомобиль,ДатаПоследнегоПоступления_);
	//Бондаренко-- 20250902 

	//Иванченко 20251024 ++
	Если обЗначениеНеЗаполнено(Инвойс_) Тогда
		Инвойс_ = СМГ_ПолучитьИнвойсИзЗаказаПоставщику(Автомобиль);	
	КонецЕсли;
	//Иванченко 20251024 --	
	
	Если Инвойс <> Инвойс_ Тогда
		Инвойс = Инвойс_; 
		ТребуетсяПересчетПоказателей = Истина;
	КонецЕсли;
	//Бондаренко++ 20251118
	Если Не обЗначениеНеЗаполнено(ДатаРеализацииАвтомобиля) Тогда
		ДатаРеализацииАвтомобиля_ = ДатаРеализацииАвтомобиля;
	Иначе	
		ДатаРеализацииАвтомобиля_ = КонецДня(ТекущаяДата());
 	КонецЕсли;
	//Бондаренко++ 20251118
	//Бондаренко++ 20250829
	СуммаПредпродажнойПодготовки_ = СМГ_ПолучитьСуммуПредпродажнойПодготовки(Автомобиль,ДатаПоследнегоПоступления,ДатаРеализацииАвтомобиля_);
	Если СуммаПредпродажнойПодготовки <> СуммаПредпродажнойПодготовки_ Тогда
		СуммаПредпродажнойПодготовки = СуммаПредпродажнойПодготовки_;
		ТребуетсяПересчетПоказателей = Истина;
	КонецЕсли;
	//Бондаренко-- 20250829
	//Если обЗначениеНеЗаполнено(ДатаРеализацииАвтомобиля) Тогда ДатаРеализацииАвтомобиля = КонецДня(ТекущаяДата()) КонецЕсли; //Бондаренко++-- 20251118
	СебестоимостьДО_ = СМГ_ПолучитьСебестоимостьДО(Автомобиль,ДатаПОследнегоПоступления,ДатаРеализацииАвтомобиля_);
	Если СебестоимостьДО <> СебестоимостьДО_ Тогда
		СебестоимостьДО = СебестоимостьДО_; 
		ТребуетсяПересчетПоказателей = Истина;
	КонецЕсли;
	
	//Бондаренко++ 20231117
	//СтоимостьЗНДО_ = СебестоимостьДО;
	//Если СтоимостьЗНДО <> СтоимостьЗНДО_ Тогда
	//	СтоимостьЗНДО = СтоимостьЗНДО_; 
	//	ТребуетсяПересчетПоказателей = Истина;
	//КонецЕсли;
	//Бондаренко-- 20231117
	
	//Бондаренко++ 20250607
	//Бондаренко++ 20240123
	//Если ТрейдИн Тогда
	//	СкидкаТрейдИн_ = Автомобиль.СкидаПриПокупкеВТрейдИн;
	//Иначе
	//	СкидкаТрейдИн_  = 0;
	//  //  Если МаркетинговаяПрограммаСкидкаТрейдИн <> "" Тогда
	//  //  	МаркетинговаяПрограммаСкидкаТрейдИн = "";
	//  //КонецЕсли;
	// КонецЕсли;
	
	// Если СкидкаТрейдИн <> СкидкаТрейдИн_ Тогда
	//	СкидкаТрейдИн = СкидкаТрейдИн_; 
	//	ТребуетсяПересчетПоказателей = Истина;
	//КонецЕсли;
	//Бондаренко-- 20240123
	//Бондаренко-- 20250607
	
	СтоимостьДО_ = Автомобиль.СтоимостьДопОборудования;
	Если СтоимостьДО <> СтоимостьДО_ Тогда
		СтоимостьДО = СтоимостьДО_; 
		ТребуетсяПересчетПоказателей = Истина;
	КонецЕсли;
	
	//Бондаренко++ 20250607
	//Бондаренко++ 20240123
	//Если Кредит Тогда
	//	СкидкаСубсидияКредит_ = Автомобиль.СкидкаПриПокупкеВКредит; 
	//Иначе
	//	СкидкаСубсидияКредит_ = 0; 
	//  //  Если МаркетинговаяПрограммаСкидкаСубсидияКредит <> "" Тогда
	//  //  	МаркетинговаяПрограммаСкидкаСубсидияКредит = "";
	//  //КонецЕсли;
	// КонецЕсли;
	////Бондаренко-- 20240123
	// 
	//Если СкидкаСубсидияКредит <> СкидкаСубсидияКредит_ Тогда
	//	СкидкаСубсидияКредит = СкидкаСубсидияКредит_; 
	//	ТребуетсяПересчетПоказателей = Истина;
	//КонецЕсли;
	
	//Бондаренко++ 20240302
	//КомпенсацияТрейдИНРетроспективная_ = Автомобиль.КомпенсацияТрейдИНРетроспективная;
	//Если КомпенсацияТрейдИНРетроспективная <> КомпенсацияТрейдИНРетроспективная_ Тогда
	//	КомпенсацияТрейдИНРетроспективная = КомпенсацияТрейдИНРетроспективная_;
	// КонецЕсли;
	
	//КомпенсацияСубсидияКредитРетроспективная_ = Автомобиль.КомпенсацияСубсидияКредитРетроспективная;
	//Если КомпенсацияСубсидияКредитРетроспективная <> КомпенсацияСубсидияКредитРетроспективная_ Тогда
	//	КомпенсацияСубсидияКредитРетроспективная = КомпенсацияСубсидияКредитРетроспективная_;
	// КонецЕсли;
	
	//КомпенсацияПоПрограммамЛояльностиРетроспективная_ = Автомобиль.КомпенсацияПоПрограммамЛояльностиРетроспективная;
	//Если КомпенсацияПоПрограммамЛояльностиРетроспективная <> КомпенсацияПоПрограммамЛояльностиРетроспективная_ Тогда
	//	КомпенсацияПоПрограммамЛояльностиРетроспективная = КомпенсацияПоПрограммамЛояльностиРетроспективная_;
	// КонецЕсли;
	// 
	//КомпенсацияРозничнаяРетроспективная_ = Автомобиль.КомпенсацияРозничнаяРетроспективная;
	//Если КомпенсацияРозничнаяРетроспективная <> КомпенсацияРозничнаяРетроспективная_ Тогда
	//	КомпенсацияРозничнаяРетроспективная = КомпенсацияРозничнаяРетроспективная_;
	//КонецЕсли;
	//
	//КомпенсацияРетроспективнаяИтого = КомпенсацияТрейдИНРетроспективная+
	//							  КомпенсацияСубсидияКредитРетроспективная+
	//                              КомпенсацияПоПрограммамЛояльностиРетроспективная+            
	//                              КомпенсацияРозничнаяРетроспективная;
	//Если КомпенсацияРетроспективная <> КомпенсацияРетроспективнаяИтого Тогда
	//	КомпенсацияРетроспективная = КомпенсацияРетроспективнаяИтого;
	//КонецЕсли;
	//Бондаренко-- 20240302
	//Бондаренко-- 20250607
	
	Попытка
		//Бондаренко++ 20240312
		//ЭтаФорма.ЭлементыФормы.РРЦ.ТолькоПросмотр = Истина;
		//Бондаренко-- 20240312
		ЭтаФорма.ЭлементыФормы.Инвойс.ТолькоПросмотр = Истина;
		ЭтаФорма.ЭлементыФормы.СобственникАвтомобиля.ТолькоПросмотр = Истина;
		ЭтаФорма.ЭлементыФормы.СебестоимостьДО.ТолькоПросмотр = Истина;
		ЭтаФорма.ЭлементыФормы.СкидкаТрейдИн.ТолькоПросмотр = Истина;   
		//Бондаренко++ 20250207
		ЭтаФорма.ЭлементыФормы.СкидкаТрейдИн2.ТолькоПросмотр = Истина;   
		//Бондаренко-- 20250207
		ЭтаФорма.ЭлементыФормы.СтоимостьДО.ТолькоПросмотр = Истина;
		ЭтаФорма.ЭлементыФормы.СкидкаСубсидияКредит.ТолькоПросмотр = Истина;
		//Бондаренко++ 20250827
		ЭтаФорма.ЭлементыФормы.СуммаПредпродажнойПодготовки.ТолькоПросмотр = Истина;
		//Бондаренко++ 20250827
	Исключение
	КонецПопытки;
	
	//Бондаренко++ 20240917
	Если обПраво("УчитыватьАвтомобильОтчитанВРабочемЛисте") Тогда
		Если НЕ обЗначениеНеЗаполнено(Автомобиль) Тогда
			Если Автомобиль.Отчитан Тогда 
				АвтомобильДатаРитейла = Автомобиль.ДатаРитейла;
				#Если Клиент Тогда
					СМГ_Сообщить("Автомобиль отчитан. Дата ритейла: "+Формат(АвтомобильДатаРитейла,"ДЛФ=DD"));			 
				#КонецЕсли
				Если (Автомобиль.Модель.Марка = Справочники.Марка.GEELY ) ИЛИ ( Автомобиль.Модель.Марка = Справочники.Марка.BELGEE ) Тогда 
					Если ( ДобавитьМесяц(АвтомобильДатаРитейла,1) < ТекущаяДата() ) Тогда
						МаркетинговаяПрограммаСкидкаТрейдИн = "";
						МаркетинговаяПрограммаСкидкаСубсидияКредит = "";
						МаркетинговаяПрограммаСкидкаПоПрограммамЛояльности = "";
						МаркетинговаяПрограммаСкидкаПоПрограммамЛояльностиДополнительно = "";
						СкидкаТрейдИнФакт = "";
						//Бондаренко++ 20250205
						СкидкаТрейдИн2Факт = "";
						//Бондаренко-- 20250205
						СкидкаСубсидияКредитФакт = "";
						СкидкаПоПрограммамЛояльности = "";
						СкидкаАвтоЦентра = "";
						КомпенсацияТрейдИНВИнВойсеСледующегоАвтомобиля = "";
						//Бондаренко++ 20250205
						КомпенсацияТрейдИН2ВИнВойсеСледующегоАвтомобиля = "";
						//Бондаренко-- 20250205
						КомпенсацияСубсидияКредитВИнВойсеСледующегоАвтомобиля = "";				
						КомпенсацияПоПрограммамЛояльностиВИнВойсеСледующегоАвтомобиля = "";
						КомпенсацияРозничнаяВИнВойсеСледующегоАвтомобиля = "";
					Иначе
						ЗаполнитьПрограммыСкидкиИКомпенсации();
					КонецЕсли;
				Иначе
					ЗаполнитьПрограммыСкидкиИКомпенсации();
				КонецЕсли;
				Попытка ЭтаФорма.ЭлементыФормы.МаркетинговаяПрограммаСкидкаТрейдИн.ТолькоПросмотр = Истина; Исключение КонецПопытки;
				Попытка ЭтаФорма.ЭлементыФормы.МаркетинговаяПрограммаСкидкаСубсидияКредит.ТолькоПросмотр = Истина; Исключение КонецПопытки;
				Попытка ЭтаФорма.ЭлементыФормы.МаркетинговаяПрограммаСкидкаПоПрограммамЛояльности.ТолькоПросмотр = Истина; Исключение КонецПопытки;
				Попытка ЭтаФорма.ЭлементыФормы.МаркетинговаяПрограммаСкидкаПоПрограммамЛояльностиДополнительно.ТолькоПросмотр = Истина; Исключение КонецПопытки;
				Попытка ЭтаФорма.ЭлементыФормы.СкидкаТрейдИнФакт.Доступность = Ложь; Исключение КонецПопытки;
				//Бондаренко++ 20250205
				Попытка ЭтаФорма.ЭлементыФормы.СкидкаТрейдИн2Факт.Доступность = Ложь; Исключение КонецПопытки;
				//Бондаренко-- 20250205
				Попытка ЭтаФорма.ЭлементыФормы.СкидкаСубсидияКредитФакт.Доступность = Ложь; Исключение КонецПопытки;
				Попытка ЭтаФорма.ЭлементыФормы.СкидкаПоПрограммамЛояльности.Доступность = Ложь; Исключение КонецПопытки;
				Попытка ЭтаФорма.ЭлементыФормы.СкидкаАвтоЦентра.Доступность = Ложь; Исключение КонецПопытки;
				Попытка ЭтаФорма.ЭлементыФормы.КомпенсацияТрейдИНВИнВойсеСледующегоАвтомобиля.Доступность = Ложь; Исключение КонецПопытки;
				//Бондаренко++ 20250205
				Попытка ЭтаФорма.ЭлементыФормы.КомпенсацияТрейдИН2ВИнВойсеСледующегоАвтомобиля.Доступность = Ложь; Исключение КонецПопытки;
				//Бондаренко-- 20250205
				Попытка ЭтаФорма.ЭлементыФормы.КомпенсацияСубсидияКредитВИнВойсеСледующегоАвтомобиля.Доступность = Ложь; Исключение КонецПопытки;
				Попытка ЭтаФорма.ЭлементыФормы.КомпенсацияПоПрограммамЛояльностиВИнВойсеСледующегоАвтомобиля.Доступность = Ложь; Исключение КонецПопытки;
				Попытка ЭтаФорма.ЭлементыФормы.КомпенсацияРозничнаяВИнВойсеСледующегоАвтомобиля.Доступность = Ложь; Исключение КонецПопытки;
				Попытка
					//ЭтаФорма.ЭлементыФормы.КомпенсацияРетроспективная.Значение = Формат(КомпенсацияТрейдИНРетроспективная + КомпенсацияСубсидияКредитРетроспективная + 
					//КомпенсацияПоПрограммамЛояльностиРетроспективная + КомпенсацияРозничнаяРетроспективная,"ЧЦ=15; ЧДЦ=2");
					ЭтаФорма.ЭлементыФормы.КомпенсацияВИнвойсе.Значение = Формат(КомпенсацияТрейдИНВИнВойсеСледующегоАвтомобиля + КомпенсацияСубсидияКредитВИнВойсеСледующегоАвтомобиля + 
					КомпенсацияПоПрограммамЛояльностиВИнВойсеСледующегоАвтомобиля + КомпенсацияРозничнаяВИнВойсеСледующегоАвтомобиля,"ЧЦ=15; ЧДЦ=2");
				Исключение
				КонецПопытки;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	//Бондаренко-- 20240917
	
	Если ТребуетсяПересчетПоказателей Тогда
		СМГ_ПересчетПоказателей(ЭтаФорма);
	КонецЕсли;             
	//Бондаренко-- 20230905
	
	//Бондаренко++ 20231117
	Если Автомобиль.Модель.Марка = Справочники.Марка.CHERY ИЛИ Автомобиль.Модель.Марка = Справочники.Марка.CHANGAN Тогда
		Если Не РеализацияПоОдномуДоговору Тогда
			РеализацияПоОдномуДоговору = Истина;
		КонецЕсли;
	КонецЕсли;
	//Бондаренко-- 20231117
	
КонецПроцедуры //СМГ_ЗаполнитьДанныеПоАвтомобилюИКлиенту(Автомобиль,ЭтаФорма)        

//Бондаренко++ 20240914
Процедура ЗаполнитьПрограммыСкидкиИКомпенсации()
	
	МаркетинговаяПрограммаСкидкаТрейдИн_ = Автомобиль.МаркетинговаяПрограммаСкидкаТрейдИн;
	Если МаркетинговаяПрограммаСкидкаТрейдИн <> МаркетинговаяПрограммаСкидкаТрейдИн_ Тогда
		МаркетинговаяПрограммаСкидкаТрейдИн = МаркетинговаяПрограммаСкидкаТрейдИн_;
	КонецЕсли;
	МаркетинговаяПрограммаСкидкаСубсидияКредит_ = Автомобиль.МаркетинговаяПрограммаСкидкаСубсидияКредит;
	Если МаркетинговаяПрограммаСкидкаСубсидияКредит <> МаркетинговаяПрограммаСкидкаСубсидияКредит_ Тогда
		МаркетинговаяПрограммаСкидкаСубсидияКредит = МаркетинговаяПрограммаСкидкаСубсидияКредит_;
	КонецЕсли;
	
	//Бондаренко++ 20260128
	Если Не обЗначениеНеЗаполнено(Автомобиль.МаркетинговаяПрограммаСкидкаПоПрограммамЛояльности) Тогда
		Если МаркетинговаяПрограммаСкидкаПоПрограммамЛояльности <> Автомобиль.МаркетинговаяПрограммаСкидкаПоПрограммамЛояльности Тогда
			МаркетинговаяПрограммаСкидкаПоПрограммамЛояльности = Автомобиль.МаркетинговаяПрограммаСкидкаПоПрограммамЛояльности;
		КонецЕсли;
 		Если СкидкаПоПрограммамЛояльности <> Автомобиль.СкидкаПоПрограммамЛояльности Тогда
			СкидкаПоПрограммамЛояльности = Автомобиль.СкидкаПоПрограммамЛояльности;
		КонецЕсли;
 		Если КомпенсацияПоПрограммамЛояльностиВИнВойсеСледующегоАвтомобиля <> Автомобиль.КомпенсацияПоПрограммамЛояльностиВИнВойсеСледующегоАвтомобиля Тогда
			КомпенсацияПоПрограммамЛояльностиВИнВойсеСледующегоАвтомобиля = Автомобиль.КомпенсацияПоПрограммамЛояльностиВИнВойсеСледующегоАвтомобиля;
		КонецЕсли;
	ИначеЕсли Не обЗначениеНеЗаполнено(Автомобиль.МаркетинговаяПрограммаСкидкаКорпоративная) Тогда
		Если МаркетинговаяПрограммаСкидкаПоПрограммамЛояльности <> Автомобиль.МаркетинговаяПрограммаСкидкаКорпоративная Тогда
			МаркетинговаяПрограммаСкидкаПоПрограммамЛояльности = Автомобиль.МаркетинговаяПрограммаСкидкаКорпоративная;
		КонецЕсли;
 		Если СкидкаПоПрограммамЛояльности <> Автомобиль.СкидкаКорпоративная Тогда
			СкидкаПоПрограммамЛояльности = Автомобиль.СкидкаКорпоративная;
		КонецЕсли;
 		Если КомпенсацияПоПрограммамЛояльностиВИнВойсеСледующегоАвтомобиля <> Автомобиль.КомпенсацияКорпоративная Тогда
			КомпенсацияПоПрограммамЛояльностиВИнВойсеСледующегоАвтомобиля = Автомобиль.КомпенсацияКорпоративная;
		КонецЕсли;
	КонецЕсли;
	//Бондаренко-- 20260128
  	
	МаркетинговаяПрограммаСкидкаПоПрограммамЛояльностиДополнительно_ = Автомобиль.МаркетинговаяПрограммаСкидкаПоПрограммамЛояльностиДополнительно;
	Если МаркетинговаяПрограммаСкидкаПоПрограммамЛояльностиДополнительно <> МаркетинговаяПрограммаСкидкаПоПрограммамЛояльностиДополнительно_ Тогда
		МаркетинговаяПрограммаСкидкаПоПрограммамЛояльностиДополнительно = МаркетинговаяПрограммаСкидкаПоПрограммамЛояльностиДополнительно_;
	КонецЕсли;
  	
	СкидкаТрейдИнФакт_ = Автомобиль.СкидкаТрейдИнФакт;
	Если СкидкаТрейдИнФакт <> СкидкаТрейдИнФакт_ Тогда
		СкидкаТрейдИнФакт = СкидкаТрейдИнФакт_;
	КонецЕсли;
	СкидкаСубсидияКредитФакт_ = Автомобиль.СкидкаСубсидияКредитФакт;
	Если СкидкаСубсидияКредитФакт <> СкидкаСубсидияКредитФакт_ Тогда
		СкидкаСубсидияКредитФакт = СкидкаСубсидияКредитФакт_;
	КонецЕсли;
 
	СкидкаАвтоЦентра_ = Автомобиль.СкидкаАвтоЦентра;
	Если СкидкаАвтоЦентра <> СкидкаАвтоЦентра_ Тогда
		СкидкаАвтоЦентра = СкидкаАвтоЦентра_;
	КонецЕсли;             
 	
 	КомпенсацияТрейдИНВИнВойсеСледующегоАвтомобиля_ = Автомобиль.КомпенсацияТрейдИНВИнВойсеСледующегоАвтомобиля;
	Если КомпенсацияТрейдИНВИнВойсеСледующегоАвтомобиля <> КомпенсацияТрейдИНВИнВойсеСледующегоАвтомобиля_ Тогда
		КомпенсацияТрейдИНВИнВойсеСледующегоАвтомобиля = КомпенсацияТрейдИНВИнВойсеСледующегоАвтомобиля_;
	КонецЕсли;
	КомпенсацияСубсидияКредитВИнВойсеСледующегоАвтомобиля_ = Автомобиль.КомпенсацияСубсидияКредитВИнВойсеСледующегоАвтомобиля;
	Если КомпенсацияСубсидияКредитВИнВойсеСледующегоАвтомобиля <> КомпенсацияСубсидияКредитВИнВойсеСледующегоАвтомобиля_ Тогда
		КомпенсацияСубсидияКредитВИнВойсеСледующегоАвтомобиля = КомпенсацияСубсидияКредитВИнВойсеСледующегоАвтомобиля_;
	КонецЕсли;
 
	КомпенсацияРозничнаяВИнВойсеСледующегоАвтомобиля_ = Автомобиль.КомпенсацияРозничнаяВИнВойсеСледующегоАвтомобиля;
	Если КомпенсацияРозничнаяВИнВойсеСледующегоАвтомобиля <> КомпенсацияРозничнаяВИнВойсеСледующегоАвтомобиля_ Тогда
		КомпенсацияРозничнаяВИнВойсеСледующегоАвтомобиля = КомпенсацияРозничнаяВИнВойсеСледующегоАвтомобиля_;
	КонецЕсли;
  	
КонецПроцедуры //ЗаполнитьПрограммыСкидкиИКомпенсации()
//Бондаренко-- 20240914

//Бондаренко++ 20240312
Функция ПолучитьЦенуПродажиИзПоступленияАвто(Авто)
	
	ЦенаНайденная = 0;
	
	Запрос = Новый Запрос; 
	
	Запрос.Текст = "ВЫБРАТЬ
	|	ПоступлениеАвтомобилейАвтомобили.Автомобиль КАК Автомобиль,
	|	ПоступлениеАвтомобилейАвтомобили.Ссылка.Проведен КАК Проведен,
	|	ПоступлениеАвтомобилейАвтомобили.Ссылка.Дата КАК Дата,
	|	ПоступлениеАвтомобилейАвтомобили.СуммаПродажи КАК СуммаПродажи
	|ИЗ
	|	Документ.ПоступлениеАвтомобилей.Автомобили КАК ПоступлениеАвтомобилейАвтомобили
	|ГДЕ
	|	ПоступлениеАвтомобилейАвтомобили.Ссылка.Проведен
	|	И ПоступлениеАвтомобилейАвтомобили.Автомобиль = &Авто
	|
	|УПОРЯДОЧИТЬ ПО
	|	Дата УБЫВ";
	
	Запрос.УстановитьПараметр("Авто", Авто);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Если Выборка.СуммаПродажи = 0 Тогда
			Продолжить;
		КонецЕсли;
		ЦенаНайденная  = Выборка.СуммаПродажи;
		Прервать;
	КонецЦикла;
	
	Возврат ЦенаНайденная;	
	
КонецФункции // ПолучитьЦенуПродажиИзПоступленияАвто(Авто)
//Бондаренко-- 20240312

Функция СМГ_ПолучитьРРЦ(Автомобиль);
	
	РРЦена = 0;
	
	Запрос = Новый Запрос; 
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ЦеныАвтомобилейСрезПоследних.ТипЦен,
	|	ЦеныАвтомобилейСрезПоследних.Автомобиль,
	|	ЦеныАвтомобилейСрезПоследних.Цена
	|ИЗ
	|	РегистрСведений.ЦеныАвтомобилей.СрезПоследних КАК ЦеныАвтомобилейСрезПоследних
	|ГДЕ
	|	ЦеныАвтомобилейСрезПоследних.Автомобиль = &Автомобиль
	|	И ЦеныАвтомобилейСрезПоследних.ТипЦен = &ТипЦен";
	
	Запрос.УстановитьПараметр("Автомобиль", Автомобиль);
	Запрос.УстановитьПараметр("ТипЦен", Справочники.ТипыЦен.ОсновнойТипЦенПродажи);
	
	ВыборкаРРЦ = Запрос.Выполнить().Выбрать();
	
	Пока ВыборкаРРЦ.Следующий() Цикл
		РРЦена = ВыборкаРРЦ.Цена;
		Прервать;
	КонецЦикла;
	
	Возврат РРЦена;
	
КонецФункции // СМГ_ПолучитьРРЦ(Автомобиль)

Функция СМГ_ПолучитьИнвойсПоОстаткуНаСкладе(Автомобиль)
	
	//СобственникАвтомобиля = Справочники.Организации.ПустаяСсылка();
	
	ИнвойсОст = 0;
	
	//Бондаренко++ 20240319
	ДатаПоступления_ = Дата(1,1,1);
	//Бондаренко-- 20240319
	
	Запрос = Новый Запрос;  
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ОстаткиАвтомобилей.Автомобиль КАК Автомобиль,
	|	ОстаткиАвтомобилей.Партия КАК Партия,
	|	ОстаткиАвтомобилей.СкладКомпании КАК СкладКомпании,
	|	ОстаткиАвтомобилей.КоличествоОстаток КАК КоличествоОстаток,
	|	ВложенныйЗапрос.СуммаВсего КАК Инвойс,
	|	ВложенныйЗапрос.Ссылка.Дата КАК ДатаПоступления,
	|	ВложенныйЗапрос1.СуммаВсего КАК Инвойс2,
	|	ВложенныйЗапрос1.Ссылка.Дата КАК ДатаПоступления2,
	|	ОстаткиАвтомобилей.Партия.Организация.КонтрагентОрганизации КАК Контрагент,
	|	ОстаткиАвтомобилей.Партия.ХозОперация КАК ПартияХозОперация,
	|	ОстаткиАвтомобилей.СтатусПартии КАК СтатусПартии
	|ИЗ
	|	РегистрНакопления.ОстаткиАвтомобилей.Остатки КАК ОстаткиАвтомобилей
	|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|			ПоступлениеАвтомобилейАвтомобили.Автомобиль КАК Автомобиль,
	|			ПоступлениеАвтомобилейАвтомобили.СуммаВсего КАК СуммаВсего,
	|			ПоступлениеАвтомобилейАвтомобили.Ссылка КАК Ссылка
	|		ИЗ
	|			Документ.ПоступлениеАвтомобилей.Автомобили КАК ПоступлениеАвтомобилейАвтомобили) КАК ВложенныйЗапрос
	|		ПО ОстаткиАвтомобилей.Автомобиль = ВложенныйЗапрос.Автомобиль
	|			И ОстаткиАвтомобилей.Партия = ВложенныйЗапрос.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|			ПоступлениеАвтомобилейАвтомобили.Автомобиль КАК Автомобиль,
	|			ПоступлениеАвтомобилейАвтомобили.СуммаВсего КАК СуммаВсего,
	|			ПоступлениеАвтомобилейАвтомобили.Ссылка КАК Ссылка
	|		ИЗ
	|			Документ.ВводОстатковАвтомобилей.Автомобили КАК ПоступлениеАвтомобилейАвтомобили) КАК ВложенныйЗапрос1
	|		ПО ОстаткиАвтомобилей.Автомобиль = ВложенныйЗапрос1.Автомобиль
	|			И ОстаткиАвтомобилей.Партия = ВложенныйЗапрос1.Ссылка
	|ГДЕ
	|	ОстаткиАвтомобилей.КоличествоОстаток > 0
	|	И ОстаткиАвтомобилей.Автомобиль = &Автомобиль"; 
	
	Запрос.УстановитьПараметр("Автомобиль", Автомобиль);
	
	Запрос.УстановитьПараметр("ТипЦен", Справочники.ТипыЦен.ОсновнойТипЦенПродажи);
	
	ВыборкаИнвойс = Запрос.Выполнить().Выбрать();
	
	//Бондаренко++ 20240402
	АвтоНаОстатках = Ложь; 
	//Бондаренко-- 20240402
	
	Попытка
		Пока ВыборкаИнвойс.Следующий() Цикл
			Если ВыборкаИнвойс.Инвойс > 0 Тогда
				ИнвойсОст = ВыборкаИнвойс.Инвойс;
				//Бондаренко++ 20240319
				Если ВыборкаИнвойс.ПартияХозОперация = Справочники.ХозОперации.ПереходВСобственностьАвтомобилей Тогда
					//Бондаренко++ 20250404
					//ДатаПоступления_ = НачалоДня(НайтиДатуПоступленияНаОтветХранение());
					ДатаПоступления_ = НайтиДатуПоступленияНаОтветХранение();
					//Бондаренко-- 20250404
				Иначе	
					//Бондаренко++ 20250404
					//ДатаПоступления_ = НачалоДня(ВыборкаИнвойс.ДатаПоступления);
					ДатаПоступления_ = ВыборкаИнвойс.ДатаПоступления;
					//Бондаренко-- 20250404
				КонецЕсли;
				Если ДатаПоступления_ <> Дата(1,1,1) Тогда
					Если ДатаПоследнегоПоступления <> ДатаПоступления_ Тогда
						//Бондаренко++ 20251018
						//ДатаПоследнегоПоступления = ДатаПоступления_;
						//Бондаренко-- 20251018
					КонецЕсли;
				КонецЕсли;
				//Бондаренко-- 20240319
				Если ВладелецАвто <> ВыборкаИнвойс.Контрагент Тогда
					ВладелецАвто = ВыборкаИнвойс.Контрагент;
					Если РольДоступна("ПолныеПрава") Тогда
						СМГ_Сообщить("1.Найден Владелец авто: "+ВладелецАвто);
					КонецЕсли;
				КонецЕсли;
				//Бондаренко++ 20240402
				Если СкладВладельцаАвто <> ВыборкаИнвойс.СкладКомпании Тогда
					//Бондаренко++ 20250228
					Если НЕ БезПерепродаж Тогда
						//Бондаренко-- 20250228	
						СкладВладельцаАвто = ВыборкаИнвойс.СкладКомпании;
						Если РольДоступна("ПолныеПрава") Тогда
							СМГ_Сообщить("1.Определён склад Владельца авто: "+СкладВладельцаАвто);
						КонецЕсли;
						//Бондаренко++ 20250228	
					КонецЕсли;
					//Бондаренко-- 20250228
				КонецЕсли;
				АвтоНаОстатках = Истина; 
				//Бондаренко++ 20240402
				//Бондаренко++ 20240413
				Если СтатусПартии <> ВыборкаИнвойс.СтатусПартии Тогда
					СтатусПартии = ВыборкаИнвойс.СтатусПартии;
					Если РольДоступна("ПолныеПрава") Тогда
						СМГ_Сообщить("1.Определён статус партии: "+СтатусПартии);
					КонецЕсли;
				КонецЕсли;
				//Бондаренко-- 20240413
			ИначеЕсли ВыборкаИнвойс.Инвойс2 > 0 Тогда
				ИнвойсОст = ВыборкаИнвойс.Инвойс2;
				//Бондаренко++ 20240319
				ДатаПоступления_ = НачалоДня(ВыборкаИнвойс.ДатаПоступления2);
				Если ДатаПоступления_ <> Дата(1,1,1) Тогда
					Если ДатаПоследнегоПоступления <> ДатаПоступления_ Тогда
						//Бондаренко++ 20251018
						//ДатаПоследнегоПоступления = ДатаПоступления_;
						//Бондаренко-- 20251018
					КонецЕсли;
				КонецЕсли;
				//Бондаренко-- 20240319
				Если ВладелецАвто <> ВыборкаИнвойс.Контрагент Тогда
					ВладелецАвто = ВыборкаИнвойс.Контрагент;
					Если РольДоступна("ПолныеПрава") Тогда
						СМГ_Сообщить("2.Найден Владелец авто: "+ВладелецАвто);
					КонецЕсли;
				КонецЕсли;
				//Бондаренко++ 20240402
				Если СкладВладельцаАвто <> ВыборкаИнвойс.СкладКомпании Тогда
					СкладВладельцаАвто = ВыборкаИнвойс.СкладКомпании;
					Если РольДоступна("ПолныеПрава") Тогда
						СМГ_Сообщить("2.Определён склад Владельца авто: "+СкладВладельцаАвто);
					КонецЕсли;
				КонецЕсли;
				АвтоНаОстатках = Истина; 
				//Бондаренко++ 20240402
				//Бондаренко++ 20240413
				Если СтатусПартии <> ВыборкаИнвойс.СтатусПартии Тогда
					СтатусПартии = ВыборкаИнвойс.СтатусПартии;
					Если РольДоступна("ПолныеПрава") Тогда
						СМГ_Сообщить("2.Определён статус партии: "+СтатусПартии);
					КонецЕсли;
				КонецЕсли;
				//Бондаренко-- 20240413
			КонецЕсли;
			//Бондаренко++ 20231209                
			Если РольДоступна("ПолныеПрава") Тогда
				СМГ_Сообщить("Авто находится на складе: "+ВыборкаИнвойс.СкладКомпании);				
			КонецЕсли;
			
			//Иванченко 20260701 ++ 
			Если ВидАвтомобиля = Перечисления.ВидАвтомобиля.Новый Тогда
			//Иванченко 20260701 -- 	
				СМГ_ЗаполнитьОчиститьАгента(ВыборкаИнвойс.СкладКомпании,ВладелецАвто);     
			//Иванченко 20260701 ++				
			КонецЕсли;
			//Иванченко 20260701 -- 
			
			//Бондаренко-- 20231209
			Прервать;
		КонецЦикла;
	Исключение
	КонецПопытки;
	
	//Бондаренко++ 20240406
	Если Не АвтоНаОстатках Тогда
		Если Не обЗначениеНеЗаполнено(СкладВладельцаАвто) Тогда
			СкладДляПоступленияАвто = "";
			СкладВладельцаАвто = "";
			//Бондаренко++ 20240412
			СтатусПартии = "";      
			//Бондаренко-- 20240412
			СМГ_Сообщить("Склад владельца авто и склад для поступления авто - очищены.");				
		КонецЕсли;
	Иначе
		//Бондаренко++ 20250228
		Если Не БезПерепродаж Тогда
			//Бондаренко-- 20250228	
			СкладДляПоступленияАвто_ = НайтиСкладПоступленияАвто();
			Если СкладДляПоступленияАвто <> СкладДляПоступленияАвто_ Тогда
				СкладДляПоступленияАвто = СкладДляПоступленияАвто_;
			КонецЕсли;
			//Бондаренко++ 20250228	
		Иначе
			Если Не обЗначениеНеЗаполнено(СкладВладельцаАвто) Тогда
				СкладВладельцаАвто = "";
			КонецЕсли;
			Если Не обЗначениеНеЗаполнено(СкладДляПоступленияАвто) Тогда
				СкладДляПоступленияАвто = "";
			КонецЕсли;	
			СМГ_Сообщить("Включен флаг ""Без перепродаж"", поэтому склад владельца авто и склад для поступления авто - очищены.");				
		КонецЕсли;
		//Бондаренко-- 20250228
	КонецЕсли;
	//Бондаренко-- 20240406
	
	//Бондаренко++ 20240318
	Если обЗначениеНеЗаполнено(ВладелецАвто) ИЛИ ВладелецАвто = Справочники.Контрагенты.ПустаяСсылка() Тогда
		Если СокрЛП(НайтиВладельцаПоЗаказуНаАвтомобиль(Автомобиль)) <> СокрЛП(ВладелецАвто) Тогда
			ВладелецАвто = НайтиВладельцаПоЗаказуНаАвтомобиль(Автомобиль);	
		КонецЕсли;
	КонецЕсли;
	//Бондаренко-- 20240318
	
	//Бондаренко++ 20240319
	ВидАвтомобиля_ = Справочники.Автомобили.ЧтениеЗначенияРегистраСведения(Автомобиль, Перечисления.ДополнительнаяИнформацияАвтомобилей.ВидАвтомобиля, ТекущаяДата());
	Если НЕ обЗначениеНеЗаполнено(ВидАвтомобиля_) Тогда
		Если ВидАвтомобиля <> ВидАвтомобиля_ Тогда
			ВидАвтомобиля = ВидАвтомобиля_;
		КонецЕсли;	
	КонецЕсли; 
	//Бондаренко-- 20240319
	
	//Если ДатаПоступления_ = Дата(1,1,1) Тогда
	//	Если ДатаПоследнегоПоступления <> Дата(1,1,1) Тогда
	//		ДатаПоследнегоПоступления = Дата(1,1,1);		
	//	КонецЕсли;
	//КонецЕсли;
	Если ДатаПоступления_ <> Дата(1,1,1) Тогда
		Если ДатаПоследнегоПоступления <> ДатаПоступления_ Тогда
			//Бондаренко++ 20251018
			//ДатаПоследнегоПоступления = ДатаПоступления_;		
			//Бондаренко-- 20251018
		КонецЕсли;
	КонецЕсли;
	//Бондаренко++ 20240319
	
	//Бондаренко++ 20240523
	Если ИнвойсОст > 0 Тогда
		СписокАвто = Новый СписокЗначений;
		СписокАвто.Добавить(Автомобиль);
		ТаблицаКорректировокПоступленияАвто = ПолучитьТаблицуКорректировокПоступленияАвто(СписокАвто);
		Если ТаблицаКорректировокПоступленияАвто.Количество() > 0 Тогда
			Для каждого Эл Из ТаблицаКорректировокПоступленияАвто Цикл
				//Бондаренко++ 20251018
				//Если Эл.Дата < ДатаПоследнегоПоступления Тогда
				Если Эл.Дата < ДатаПоступления_ Тогда
					//Бондаренко-- 20251018	
					Продолжить;
				КонецЕсли;
				ИнвойсОст = ИнвойсОст + Эл.СуммаРазница;	
			КонецЦикла;
		КонецЕсли;
	КонецЕсли;
	//Бондаренко-- 20240523
	
	//Бондаренко++ 20240321
	Если ИнвойсОст = 0 Тогда
		//Автомобиль продан	
		ИнвойсОст = ОпределитьИнвойсПоДокПродажи();
		//Бондаренко++ 20250830
		//Автомобиль уже продан и в инвойс входит, в том числе, и сумма предпродажной подготовки
		//СуммаПредпродажнойПодготовки_ = СМГ_ПолучитьСуммуПредпродажнойПодготовки(Автомобиль,ДатаПоследнегоПоступления);
		//Если СуммаПредпродажнойПодготовки_ > 0  Тогда
		//	ИнвойсОст = ИнвойсОст - СуммаПредпродажнойПодготовки_;
		//КонецЕсли;
		//Бондаренко-- 20250830
	КонецЕсли;
	//Бондаренко-- 20240321
	
	//Бондаренко++ 20240907
	//Бондаренко++ 20250826
	//Если Автомобиль.Модель.Марка = Справочники.Марка.CHANGAN Тогда
	Если Автомобиль.Модель.Марка = Справочники.Марка.GAC ИЛИ
		Автомобиль.VIN = "LS4ASE2A5RJ104624" ИЛИ
		Автомобиль.VIN = "LS4ASE2A7RA707123" ИЛИ
		Автомобиль.VIN = "LS4ASE2A5RJ106714" ИЛИ
		Автомобиль.VIN = "LS5A2DKR7RA016010" Тогда
		//Бондаренко-- 20250826
		Если ВидАвтомобиля = Перечисления.ВидАвтомобиля.Новый Тогда
			ИнвойсЧанган = 0;
			ИнвойсЧанган = ПолучитьИнвойсЧанган(Автомобиль);				
			Если ИнвойсЧанган > 0 Тогда
				ИнвойсОст = ИнвойсЧанган;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	//Бондаренко-- 20240907
	
	Возврат ИнвойсОст;
	
КонецФункции // СМГ_ПолучитьИнвойсПоОстаткуНаСкладе(Автомобиль)       

//Бондаренко++ 20040907
Функция ПолучитьИнвойсЧанган(Авто)
	
	ИнвойсРассчетный_ = 0;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	РассчетныйИнвойсСрезПоследних.Автомобиль КАК Автомобиль,
	|	РассчетныйИнвойсСрезПоследних.ИнвойсРассчетный КАК ИнвойсРассчетный
	|ИЗ
	|	РегистрСведений.РассчетныйИнвойс.СрезПоследних КАК РассчетныйИнвойсСрезПоследних
	|ГДЕ
	|	РассчетныйИнвойсСрезПоследних.Автомобиль = &Авто";
	
	Запрос.УстановитьПараметр("Авто", Авто);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		ИнвойсРассчетный_ = ВыборкаДетальныеЗаписи.ИнвойсРассчетный;
	КонецЦикла;
	
	Возврат ИнвойсРассчетный_;
	
КонецФункции // ПолучитьИнвойсЧанган(Авто)
//Бондаренко-- 20040907

//Бондаренко++ 20240313
Функция НайтиВладельцаПоЗаказуНаАвтомобиль(Автомобиль) 
	
	ВладАвто = Справочники.Организации.ПустаяСсылка(); 
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ЗаказПоставщикуНаАвтомобиль.Ссылка КАК Ссылка,
	|	ЗаказПоставщикуНаАвтомобиль.Проведен КАК Проведен,
	|	ЗаказПоставщикуНаАвтомобиль.Дата КАК Дата,
	|	ЗаказПоставщикуНаАвтомобиль.Автомобиль КАК Автомобиль,
	|	ЗаказПоставщикуНаАвтомобиль.Организация.КонтрагентОрганизации КАК КонтрагентОрганизации
	|ИЗ
	|	Документ.ЗаказПоставщикуНаАвтомобиль КАК ЗаказПоставщикуНаАвтомобиль
	|ГДЕ
	|	ЗаказПоставщикуНаАвтомобиль.Автомобиль = &Автомобиль
	|	И ЗаказПоставщикуНаАвтомобиль.Проведен
	|
	|УПОРЯДОЧИТЬ ПО
	|	Дата УБЫВ";
	
	Запрос.УстановитьПараметр("Автомобиль", Автомобиль);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		ВладАвто = ВыборкаДетальныеЗаписи.КонтрагентОрганизации;
		Если РольДоступна("ПолныеПрава") Тогда
			СМГ_Сообщить("3.Найден Владелец авто по заказу поставщику на автомобиль: "+ВладАвто);
		КонецЕсли;
	КонецЦикла;
	
	Возврат ВладАвто;
	
КонецФункции // НайтиВладельцаПоЗаказуНаАвтомобиль(Автомобиль)
//Бондаренко-- 20240313

Функция СМГ_ПолучитьСебестоимостьДО(Автомобиль,ДатаПослПост,ДатаРеалАвто);  
	//Иванченко 20251001 ++ 
	//Бондаренко++ 20251015
	//ЗапросДаты = Новый Запрос;
	//ЗапросДаты.Текст = "ВЫБРАТЬ
	//|	ОстаткиАвтомобилейОбороты.Автомобиль КАК Автомобиль,
	//|	ОстаткиАвтомобилейОбороты.Партия КАК ДатаПоступления,
	//|	ОстаткиАвтомобилейОбороты.Регистратор КАК ДатаРеализации
	//|ПОМЕСТИТЬ ВТ_Реализация
	//|ИЗ
	//|	РегистрНакопления.ОстаткиАвтомобилей.Обороты(, , Регистратор, ) КАК ОстаткиАвтомобилейОбороты
	//|ГДЕ
	//|	ОстаткиАвтомобилейОбороты.Регистратор.ДокументОснование.ДокументОснование = &Ссылка
	//|	И ОстаткиАвтомобилейОбороты.Регистратор ССЫЛКА Документ.РеализацияАвтомобилей
	//|;
	//|
	//|////////////////////////////////////////////////////////////////////////////////
	//|ВЫБРАТЬ
	//|	ОстаткиАвтомобилейОбороты.Автомобиль КАК Автомобиль,
	//|	ЕСТЬNULL(ВТ_Реализация.ДатаПоступления, МАКСИМУМ(ОстаткиАвтомобилейОбороты.Партия)) КАК ДатаПоступления,
	//|	ЕСТЬNULL(ВТ_Реализация.ДатаРеализации, &ТекущаяДата) КАК ДатаРеализации
	//|ИЗ
	//|	РегистрНакопления.ОстаткиАвтомобилей.Обороты КАК ОстаткиАвтомобилейОбороты
	//|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Реализация КАК ВТ_Реализация
	//|		ПО ОстаткиАвтомобилейОбороты.Автомобиль = ВТ_Реализация.Автомобиль
	//|ГДЕ
	//|	ОстаткиАвтомобилейОбороты.Автомобиль = &Автомобиль
	//|
	//|СГРУППИРОВАТЬ ПО
	//|	ОстаткиАвтомобилейОбороты.Автомобиль,
	//|	ВТ_Реализация.ДатаПоступления,
	//|	ЕСТЬNULL(ВТ_Реализация.ДатаРеализации, &ТекущаяДата)";
	//ЗапросДаты.УстановитьПараметр("Ссылка", Ссылка);
	//ЗапросДаты.УстановитьПараметр("ТекущаяДата", ТекущаяДата());	
	//ЗапросДаты.УстановитьПараметр("Автомобиль", Автомобиль);
	//Бондаренко-- 20251015
	
	//ДатаПоступления = ЗапросДаты.Выполнить().Выгрузить()[0].ДатаПоступления; 	
	//ДатаРеализации = ЗапросДаты.Выполнить().Выгрузить()[0].ДатаРеализации; 	
	//Иванченко 20251001 --	
	
	Если ДатаРеалАвто = Дата(1,1,1) Тогда
		ДатаРеалАвто_ = КонецДня(ТекущаяДата());
	Иначе
		ДатаРеалАвто_ = ДатаРеалАвто;
	КонецЕсли;
	
	Если ДатаПослПост = Дата(1,1,1) Тогда
		ДатаПослПост_ = Дата(2017,1,1);
	Иначе
		ДатаПослПост_ = ДатаПослПост;
	КонецЕсли;
	
	ЗапросКомплектация = Новый Запрос;
	ЗапросКомплектация.УстановитьПараметр("Автомобиль", Автомобиль); 
	//Бондаренко++ 20251015
	ЗапросКомплектация.УстановитьПараметр("ДатаПоступления", ДатаПослПост_); 	
	ЗапросКомплектация.УстановитьПараметр("ДатаРеализации", ДатаРеалАвто_);	
	//Бондаренко-- 20251015
	ЗапросКомплектация.Текст = 
	"ВЫБРАТЬ
	|	КомплектацияАвтомобиля.Автомобиль КАК Автомобиль,
	|	СУММА(КомплектацияАвтомобиля.СуммаДокумента) КАК СуммаКомплектации
	|ИЗ
	|	Документ.КомплектацияАвтомобиля КАК КомплектацияАвтомобиля
	|ГДЕ
	|	КомплектацияАвтомобиля.Автомобиль = &Автомобиль
	|	И КомплектацияАвтомобиля.Состояние = ЗНАЧЕНИЕ(Справочник.ВидыСостоянийЗаказНарядов.Закрыт)
	|	И КомплектацияАвтомобиля.Дата Между &ДатаПоступления И &ДатаРеализации	
	|	И КомплектацияАвтомобиля.Проведен
	|
	|СГРУППИРОВАТЬ ПО
	|	КомплектацияАвтомобиля.Автомобиль";
	
	РезультатКомплектация = ЗапросКомплектация.Выполнить();
	Если РезультатКомплектация.Пустой() Тогда      
		СуммаВложений = СМГ_ПолучитьСебестоимостьВложений(Автомобиль,ДатаПослПост, ДатаРеалАвто);	
		Возврат СуммаВложений;
	Иначе
		ВыборкаКомплектация = РезультатКомплектация.Выбрать();
		ВыборкаКомплектация.Следующий();
		СуммаКомплектации = ВыборкаКомплектация.СуммаКомплектации;
	КонецЕсли;
	
	ЗапросРазукомплектация = Новый Запрос;
	ЗапросРазукомплектация.УстановитьПараметр("Автомобиль", Автомобиль);
	ЗапросРазукомплектация.УстановитьПараметр("ДатаПоступления", ДатаПослПост_); 
	ЗапросРазукомплектация.УстановитьПараметр("ДатаРеализации", ДатаРеалАвто_);	
	//Иванченко 20251001 --		
	ЗапросРазукомплектация.Текст = 
	"ВЫБРАТЬ
	|	РазукомплектацияАвтомобилей.Автомобиль КАК Автомобиль,
	|	СУММА(РазукомплектацияАвтомобилей.СуммаДокумента) КАК СуммаРазукомплектации
	|ИЗ
	|	Документ.РазукомплектацияАвтомобилей КАК РазукомплектацияАвтомобилей
	|ГДЕ
	|	РазукомплектацияАвтомобилей.Автомобиль = &Автомобиль
	|	И РазукомплектацияАвтомобилей.Состояние = ЗНАЧЕНИЕ(Справочник.ВидыСостоянийЗаказНарядов.Закрыт)
	|	И РазукомплектацияАвтомобилей.Дата Между &ДатаПоступления И &ДатаРеализации	
	|	И РазукомплектацияАвтомобилей.Проведен
	|
	|СГРУППИРОВАТЬ ПО
	|	РазукомплектацияАвтомобилей.Автомобиль";
	
	РезультатРазукомплектация = ЗапросРазукомплектация.Выполнить();
	Если РезультатРазукомплектация.Пустой() Тогда
		Возврат СуммаКомплектации;
	Иначе
		ВыборкаРазукомплектация = РезультатРазукомплектация.Выбрать();
		ВыборкаРазукомплектация.Следующий();
		Возврат СуммаКомплектации - ВыборкаРазукомплектация.СуммаРазукомплектации;
	КонецЕсли;
	
КонецФункции // СМГ_ПолучитьСебестоимостьДО(Автомобиль) 

//Бондаренко++ 20250819
Функция СМГ_ПолучитьСебестоимостьВложений(Автомобиль,ДатаПослПост,ДатаРеалАвто)
	
	ЗапросЗН = Новый Запрос; 
	//Иванченко 20251122 ++
	//ЗапросЗН.УстановитьПараметр("Автомобиль", Автомобиль); 
	//ЗапросЗН.УстановитьПараметр("ДатаПоступления", ДатаПослПост); 
	//ЗапросЗН.УстановитьПараметр("ДатаРеализации", ДатаРеалАвто);	
	//ЗапросЗН.УстановитьПараметр("ВидРемонтаПредпродажка",Справочники.ВидыРемонта.ПредпродажнаяПодготовка);
	//ЗапросЗН.Текст = 
	//"ВЫБРАТЬ
	//|	ЗаказНаряд.Автомобиль КАК Автомобиль,
	//|	СУММА(ЗаказНаряд.СуммаДокумента) КАК СуммаЗН
	//|ИЗ
	//|	Документ.ЗаказНаряд КАК ЗаказНаряд
	//|ГДЕ
	//|	ЗаказНаряд.Автомобиль = &Автомобиль
	//|	И ЗаказНаряд.Состояние = ЗНАЧЕНИЕ(Справочник.ВидыСостоянийЗаказНарядов.Закрыт)  
	//|	И ЗаказНаряд.Дата Между &ДатаПоступления И &ДатаРеализации	
	//|	И ЗаказНаряд.Проведен
	//|	И НЕ ЗаказНаряд.ВидРемонта = &ВидРемонтаПредпродажка
	//|
	//|СГРУППИРОВАТЬ ПО
	//|	ЗаказНаряд.Автомобиль"; 
	ЗапросЗН.УстановитьПараметр("Автомобиль", Автомобиль); 
	ЗапросЗН.УстановитьПараметр("ДатаПоступления", ДатаПослПост); 
	ЗапросЗН.УстановитьПараметр("ДатаРеализации", ДатаРеалАвто);		
	ЗапросЗН.Текст =
	//Иванченко 20260301 ++
	//"ВЫБРАТЬ
	//|	ЗаказНаряд.Автомобиль КАК Автомобиль,
	//|	СУММА(ЗаказНаряд.СуммаДокумента) КАК СуммаЗН
	//|ИЗ
	//|	Документ.ЗаказНаряд КАК ЗаказНаряд
	//|ГДЕ
	//|	ЗаказНаряд.Автомобиль = &Автомобиль
	//|	И ЗаказНаряд.Состояние = ЗНАЧЕНИЕ(Справочник.ВидыСостоянийЗаказНарядов.Закрыт)
	//|	И ЗаказНаряд.Дата МЕЖДУ &ДатаПоступления И &ДатаРеализации
	//|	И ЗаказНаряд.Проведен
	//|	И НЕ ЗаказНаряд.ПометкаУдаления
	//|	И ЗаказНаряд.Состояние = ЗНАЧЕНИЕ(Справочник.ВидыСостоянийЗаказНарядов.Закрыт)
	//|	И ЗаказНаряд.ВидРемонта <> ЗНАЧЕНИЕ(Справочник.ВидыРемонта.ПредпродажнаяПодготовка)
	//|	И ЗаказНаряд.ВидРемонта <> ЗНАЧЕНИЕ(Справочник.ВидыРемонта.ГарантияHPromise)
	//|	И ЗаказНаряд.ВидРемонта <> ЗНАЧЕНИЕ(Справочник.ВидыРемонта.ГарантияДистирибьютера)
	//|	И ЗаказНаряд.ВидРемонта <> ЗНАЧЕНИЕ(Справочник.ВидыРемонта.ГарантияПроизводителяЛКП)
	//|	И ЗаказНаряд.ВидРемонта <> ЗНАЧЕНИЕ(Справочник.ВидыРемонта.ГарантияПроизводителя)
	//|
	//|СГРУППИРОВАТЬ ПО
	//|	ЗаказНаряд.Автомобиль";
	"ВЫБРАТЬ
	|	ЗаказНаряд.Автомобиль КАК Автомобиль,
	|	СУММА(ЗаказНаряд.СуммаДокумента) КАК СуммаЗН
	|ИЗ
	|	Документ.ЗаказНаряд КАК ЗаказНаряд
	|ГДЕ
	|	ЗаказНаряд.Автомобиль = &Автомобиль
	|	И ЗаказНаряд.Состояние = ЗНАЧЕНИЕ(Справочник.ВидыСостоянийЗаказНарядов.Закрыт)
	|	И ЗаказНаряд.Дата МЕЖДУ &ДатаПоступления И &ДатаРеализации
	|	И ЗаказНаряд.Проведен
	|	И НЕ ЗаказНаряд.ПометкаУдаления
	|	И ЗаказНаряд.Состояние = ЗНАЧЕНИЕ(Справочник.ВидыСостоянийЗаказНарядов.Закрыт)
	|	И ЗаказНаряд.ВидРемонта <> ЗНАЧЕНИЕ(Справочник.ВидыРемонта.ПредпродажнаяПодготовка)
	|	И ЗаказНаряд.ВидРемонта <> ЗНАЧЕНИЕ(Справочник.ВидыРемонта.ГарантияHPromise)
	|	И ЗаказНаряд.ВидРемонта <> ЗНАЧЕНИЕ(Справочник.ВидыРемонта.ГарантияДистирибьютера)
	|	И ЗаказНаряд.ВидРемонта <> ЗНАЧЕНИЕ(Справочник.ВидыРемонта.ГарантияПроизводителяЛКП)
	|	И ЗаказНаряд.ВидРемонта <> ЗНАЧЕНИЕ(Справочник.ВидыРемонта.ГарантияПроизводителя) 
	|	И ЗаказНаряд.ВидРемонта <> ЗНАЧЕНИЕ(Справочник.ВидыРемонта.КоммерческоеДопоборудование)	
	|
	|СГРУППИРОВАТЬ ПО
	|	ЗаказНаряд.Автомобиль"; 
	//Иванченко 20260301 --
	//Иванченко 20251122 --
	РезультатЗаказНаряд = ЗапросЗН.Выполнить();
	Если РезультатЗаказНаряд.Пустой() Тогда
		Возврат 0;
	Иначе
		ВыборкаЗаказНаряд = РезультатЗаказНаряд.Выбрать();
		ВыборкаЗаказНаряд.Следующий();
		Возврат ВыборкаЗаказНаряд.СуммаЗН;
	КонецЕсли;
	
КонецФункции // СМГ_ПолучитьСебестоимостьВложений(Автомобиль)
//Бондаренко-- 20250819

Функция ПолучитьСуммуФактическиОплачено(ДоговорВзаиморасчетов)
	
	Рез = 0;
	
	Запрос = Новый Запрос; 
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	-Взаиморасчеты.СуммаОстаток КАК ФактическиОплачено
	|ИЗ
	|	(ВЫБРАТЬ
	|		СУММА(ВзаиморасчетыКомпанииОстатки.СуммаОстаток) КАК СуммаОстаток,
	|		ВзаиморасчетыКомпанииОстатки.ДоговорВзаиморасчетов КАК ДоговорВзаиморасчетов
	|	ИЗ
	|		РегистрНакопления.ВзаиморасчетыКомпании.Остатки КАК ВзаиморасчетыКомпанииОстатки
	|	
	|	СГРУППИРОВАТЬ ПО
	|		ВзаиморасчетыКомпанииОстатки.ДоговорВзаиморасчетов) КАК Взаиморасчеты
	|ГДЕ
	|	Взаиморасчеты.ДоговорВзаиморасчетов = &ДоговорВзаиморасчетов";
	
	Запрос.УстановитьПараметр("ДоговорВзаиморасчетов", ДоговорВзаиморасчетов); 
	
	Результат = Запрос.Выполнить();
	
	Выборка = Результат.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Рез = Рез + Выборка.ФактическиОплачено;	
	КонецЦикла;
	
	Возврат Рез;                                           
	
КонецФункции // ПолучитьСуммуФактическиОплачено(СпАвто)
//Бондаренко-- 20230804 

//Бондаренко++ 20231209
Процедура СМГ_ЗаполнитьОчиститьАгента(СкладОстаткаАвто,ВладелецАвто)
	
	//Бондаренко++ 20240319
	Если ГосПрограмма Тогда
		СМГ_Сообщить("1).Включена Госпрограмма -> Продажа без агента.");
		Возврат;
	КонецЕсли;
	//Бондаренко-- 20240319
	
	//Бондаренко++ 20240504
	Если ОплатаПоQRCode Тогда
		СМГ_Сообщить("2).Включена Оплата по QR-Code -> Продажа без агента.");
		Возврат;
	КонецЕсли;
	//Бондаренко-- 20240504
	
	//Бондаренко++ 20240507
	Если ВидОплаты = Перечисления.ВидыОплаты.Кредит Тогда
		Если СкидкаСубсидияКредитФакт > 0 Тогда
			Если ЕстьСтраховыеПродуктыКромеКаскоИОсаго() Тогда
				Если НЕ обЗначениеНеЗаполнено(ВидАвтомобиля) Тогда
					Если ВидАвтомобиля = Перечисления.ВидАвтомобиля.Новый Тогда
						СМГ_Сообщить("3).Кредит на новый автомобиль, есть скидка по кредиту, а также - иные страховые продукты (за исключением КАСКО и ОСАГО) -> Продажа без агента.");
						Возврат;
					КонецЕсли;
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;             
	
	Если ВидОплаты = Перечисления.ВидыОплаты.Кредит Тогда
		Если СуммаПредоплаты = 0 Тогда //Первоначальный взнос
			Если НЕ обЗначениеНеЗаполнено(ВидАвтомобиля) Тогда
				Если ВидАвтомобиля = Перечисления.ВидАвтомобиля.Новый Тогда
					СМГ_Сообщить("4).Кредит на новый автомобиль без первоначального взноса -> Продажа без агента.");
					Возврат;
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;             
	//Бондаренко-- 20240507
	
	//Бондаренко++ 20250527
	Если обЗначениеНеЗаполнено(СкладОстаткаАвто) Тогда
		Если РольДоступна("ПолныеПрава") Тогда
			СМГ_Сообщить("Склад остатка авто не заполнен, агент не ищется");
		КонецЕсли;	
		Возврат;
	КонецЕсли;
	//Бондаренко-- 20250527
	
	//Бондаренко++ 202400313
	//ПодразделениеПродажиАвто = СМ_ФормированиеНовыхОбъектов.СМГ_НайтиПодразделениеПоРодителю(СкладОстаткаАвто.Подразделение.Организация,СкладОстаткаАвто.Подразделение.Родитель);
	ПодразделениеПродажиАвто = СМ_ФормированиеНовыхОбъектов.СМГ_НайтиПодразделениеПоРодителю(СкладОстаткаАвто.Подразделение.Организация,ПодразделениеКомпании);
	//Бондаренко-- 202400313
	
	ИскатьАгента = Ложь;
	
	Если обЗначениеНеЗаполнено(ПодразделениеПродажиАвто) Тогда
		ИскатьАгента = Истина;
		Если РольДоступна("ПолныеПрава") Тогда
			СМГ_Сообщить("Подходящее подразделение продажи авто не найдено. Нужен агент.");
		КонецЕсли;	
	ИначеЕсли Не ПодразделениеПродажиАвто.ОПЗарегистрировано Тогда	
		ИскатьАгента = Истина;
		Если РольДоступна("ПолныеПрава") Тогда
			СМГ_Сообщить("Подразделение продажи авто "+ПодразделениеПродажиАвто+" - НЕ зарегистрировано.Нужен агент.");
		КонецЕсли;
	Иначе
		ИскатьАгента = Ложь; 
		// Холышевская ++ 27.06.2026 убыточные организации
		//Если РольДоступна("ПолныеПрава") Тогда
		//	СМГ_Сообщить("Подразделение продажи авто "+ПодразделениеПродажиАвто+" - Зарегистрировано.Агент не нужен.");
		//КонецЕсли;
		Если обПраво("ВключениеОтключениеМеханизмаУбыточныхОрганизаций",Права,,ЭтотОбъект)
			И НЕ обЗначениеНеЗаполнено(Автомобиль) И НЕ обЗначениеНеЗаполнено(СкладВладельцаАвто)
			И НЕ ПроверкаЗаказНаАвтоЕсть()
			// Холышевская ++ 09.07.2026
			// БЫЛО
			//И ВидАвтомобиля = Перечисления.ВидАвтомобиля.АвтомобильСПробегом
			И ПроверитьВидАвтоДляУбыточныхОрганизаций(Автомобиль)
			// Холышевская -- 09.07.2026
			И ПроверкаПоследнееПоступлениеНеКомиссия(Автомобиль) Тогда
			ОрганизацияНеУбыточная = ПроверкаОрганизацияНеУбыточная(ВладелецАвто); 
			//Если ОрганизацияНеУбыточная Тогда 
			//	ИскатьАгента = Истина;
			//	СМГ_Сообщить("Подразделение продажи б/у авто "+ПодразделениеПродажиАвто+" - неубыточное. Агент нужен (убыточная организация).");
			//КонецЕсли;
			//(обход продажи по неубыточным на время отсутсвтия касс)
			Если ОрганизацияНеУбыточная И СкладВладельцаАвто.Организация <> СкладВладельцаАвто.Подразделение.ПерепродажаАвто Тогда 
				ИскатьАгента = Истина;
				СМГ_Сообщить("Подразделение продажи б/у авто "+ПодразделениеПродажиАвто+" - неубыточное. Агент нужен (убыточная организация).");
			КонецЕсли;
			//(обход продажи по неубыточным на время отсутсвтия касс)
		КонецЕсли; 
		Если НЕ ИскатьАгента И РольДоступна("ПолныеПрава") Тогда
			СМГ_Сообщить("Подразделение продажи авто "+ПодразделениеПродажиАвто+" - Зарегистрировано.Агент не нужен.");
		КонецЕсли;
		// Холышевская -- 27.06.2026
	КонецЕсли;
	//Бондаренко-- 20240117
	
	Если Не ИскатьАгента Тогда
		Если НЕ обЗначениеНеЗаполнено(АгентПодразделение) Тогда
			АгентПодразделение = "";
		КонецЕсли;
		Если НЕ обЗначениеНеЗаполнено(Агент) Тогда
			Агент = "";
		КонецЕсли;
	Иначе                                                                                     
		//Бондаренко++ 20240313
		//АгентПодразделениеТекущее = НайтиЗарегистрированноеПодразделение(Подразделение.Родитель);
		АгентПодразделениеТекущее = НайтиЗарегистрированноеПодразделение(ПодразделениеКомпании);
		//Бондаренко-- 20240313
		Если АгентПодразделение <> АгентПодразделениеТекущее Тогда
			АгентПодразделение = АгентПодразделениеТекущее;
		КонецЕсли;
		Если Агент <> АгентПодразделениеТекущее.Организация Тогда
			Агент = АгентПодразделениеТекущее.Организация;
		КонецЕсли;
	КонецЕсли;
	Если Не обЗначениеНеЗаполнено(Агент) Тогда
		Если СуммаКомпенсации <> 30000 Тогда
			СуммаКомпенсации = 30000;
		КонецЕсли;
	Иначе	
		Если СуммаКомпенсации <> 0 Тогда
			СуммаКомпенсации = 0; 
		КонецЕсли;	
	КонецЕсли;
КонецПроцедуры //СМГ_ЗаполнитьОчиститьАгента(СкладОстаткаАвто,ВладелецАвто)

// Холышевская ++ 27.06.2026 убыточные организации
Функция ПроверкаПоследнееПоступлениеНеКомиссия(Автомобиль) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	ПоступлениеАвтомобилейАвтомобили.Ссылка КАК Ссылка,
		|	ПоступлениеАвтомобилейАвтомобили.Ссылка.ХозОперация КАК ХозОперация
		|ИЗ
		|	Документ.ПоступлениеАвтомобилей.Автомобили КАК ПоступлениеАвтомобилейАвтомобили
		|ГДЕ
		|	ПоступлениеАвтомобилейАвтомобили.Автомобиль = &Автомобиль
		|	И ПоступлениеАвтомобилейАвтомобили.Ссылка.Проведен
		|
		|УПОРЯДОЧИТЬ ПО
		|	ПоступлениеАвтомобилейАвтомобили.Ссылка.Дата УБЫВ";
	
	Запрос.УстановитьПараметр("Автомобиль", Автомобиль);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Если Выборка.ХозОперация = Справочники.ХозОперации.ПоступлениеАвтомобилейКомиссия Тогда
			Возврат Ложь;
		Иначе
			Возврат Истина;
		КонецЕсли;
	КонецЦикла; 
	
	Возврат Истина; // если не нашлось поступлений??
			
КонецФункции
// Холышевская -- 27.06.2026  

// Холышевская ++ 27.06.2026 убыточные организации
Функция ПроверкаОрганизацияНеУбыточная(КонтрагентВладелецАвто) Экспорт 
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	УбыточныеОрганизации.УбыточнаяОрганизация КАК УбыточнаяОрганизация
		|ИЗ
		|	РегистрСведений.УбыточныеОрганизации КАК УбыточныеОрганизации
		|ГДЕ
		|	УбыточныеОрганизации.УбыточнаяОрганизация.КонтрагентОрганизации = &Контрагент";
	
	Запрос.УстановитьПараметр("Контрагент", КонтрагентВладелецАвто);
	ОрганизацияНеУбыточная = Запрос.Выполнить().Пустой();
	
	Возврат ОрганизацияНеУбыточная;
	
КонецФункции
// Холышевская -- 27.06.2026

// Овечкин ++ 20.07.2026
Функция ПоискУбыточных(ДЦ) Экспорт
Запрос = Новый Запрос;
Запрос.Текст = 
"ВЫБРАТЬ
|	ПодразделенияКомпании.ДилерскийЦентр КАК ДилерскийЦентр,
|	УбыточныеОрганизации.УбыточнаяОрганизация КАК УбыточнаяОрганизация,
|	ПодразделенияКомпании.Организация КАК Организация,
|	ПодразделенияКомпании.Ссылка КАК Ссылка
|ИЗ
|	РегистрСведений.УбыточныеОрганизации КАК УбыточныеОрганизации,
|	Справочник.ПодразделенияКомпании КАК ПодразделенияКомпании
|ГДЕ
|	ПодразделенияКомпании.ДилерскийЦентр = &ДилерскийЦентр
|	И УбыточныеОрганизации.УбыточнаяОрганизация = ПодразделенияКомпании.Организация";

Запрос.УстановитьПараметр ("ДилерскийЦентр",ДЦ);
ОрганизацияНеУбыточная = Запрос.Выполнить().Пустой();
	
	Возврат ОрганизацияНеУбыточная;

КонецФункции // ПоискУбыточных()
// Овечкин -- 20.07.2026

// Холышевская ++ 27.06.2026 убыточные организации
Функция ПроверкаЗаказНаАвтоЕсть() Экспорт 
	// получим имеющуйся заказ на автомобиль
	ВидЗакНаАвто = "ЗаказНаАвтомобиль";
	МассивВидов = Новый Массив(1);
	МассивВидов[0] = ВидЗакНаАвто;
	МассивПодчиненных = дкПолучитьМассивПодчиненных(Ссылка,МассивВидов, Истина);
	Если НЕ МассивПодчиненных = Неопределено И МассивПодчиненных.Количество() > 0 Тогда
		//Бондаренко++ 20231229
		Для каждого Эл Из МассивПодчиненных Цикл
			ЗаказОтменен = ПроверитьОтменуЗаказа(Эл.Ссылка);
			Если ЗаказОтменен Тогда
				Продолжить;
			КонецЕсли;             
			// заказ на автомобиль найден, откроем его      
			Возврат Истина;	
		КонецЦикла;
			Возврат Ложь;
 	Иначе
		// заказ на автомобиль НЕ найден, введем новый
		Возврат Ложь;
  	КонецЕсли;
КонецФункции
// Холышевская -- 27.06.2026 

// Холышевская ++ 27.06.2026 убыточные организации
Функция ПроверитьОтменуЗаказа(ДокументОснование) Экспорт
	
	Фл = Ложь;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЗаказНаАвтомобиль.Ссылка,
		|	ЗаказНаАвтомобиль.Проведен,
		|	ЗаказНаАвтомобиль.ДокументОснование,
		|	ЗаказНаАвтомобиль.ХозОперация
		|ИЗ
		|	Документ.ЗаказНаАвтомобиль КАК ЗаказНаАвтомобиль
		|ГДЕ
		|	ЗаказНаАвтомобиль.Проведен
		|	И ЗаказНаАвтомобиль.ДокументОснование = &ДокументОснование
		|	И ЗаказНаАвтомобиль.ХозОперация = &ХозОперацияОтмена";
	
	Запрос.УстановитьПараметр("ДокументОснование", ДокументОснование);
	Запрос.УстановитьПараметр("ХозОперацияОтмена", Справочники.ХозОперации.ЗаказНаАвтомобильОтмена);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Фл = Истина;
	КонецЦикла;
	
	Возврат Фл
 
КонецФункции // ПроверитьОтменуЗаказа(ДокументОснование)
// Холышевская -- 27.06.2026

// Холышевская ++ 09.07.2026 убыточные организации
Функция ПроверитьВидАвтоДляУбыточныхОрганизаций(АвтомобильСсылка) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	АвтомобилиСрезПоследних.Значение КАК Значение
		|ИЗ
		|	РегистрСведений.Автомобили.СрезПоследних КАК АвтомобилиСрезПоследних
		|ГДЕ
		|	АвтомобилиСрезПоследних.Значение В(&СписокДляСрезаПоследних)
		|	И АвтомобилиСрезПоследних.Автомобиль = &Автомобиль
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	Автомобили.Значение
		|ИЗ
		|	РегистрСведений.Автомобили КАК Автомобили
		|ГДЕ
		|	Автомобили.Значение В(&СписокДляВсегоРегистра)
		|	И Автомобили.Автомобиль = &Автомобиль";
	
	// авто никогда не должен был быть подменным и тестовым
	СписокДляВсегоРегистра = Новый СписокЗначений;
	СписокДляВсегоРегистра.Добавить(Перечисления.ВидАвтомобиля.ТестовыйАвтомобиль);
	СписокДляВсегоРегистра.Добавить(Перечисления.ВидАвтомобиля.ПодменныйАвтомобиль);
	
	// авто на данный момент не должен быть новым, паралленым импортом, корпоративной квотой 
	СписокДляСрезаПоследних = Новый СписокЗначений;
	СписокДляСрезаПоследних.Добавить(Перечисления.ВидАвтомобиля.Новый);
	СписокДляСрезаПоследних.Добавить(Перечисления.ВидАвтомобиля.ПараллельныйИмпорт);
	СписокДляСрезаПоследних.Добавить(Перечисления.ВидАвтомобиля.КорпоративнаяКвота);
	СписокДляСрезаПоследних.Добавить(Перечисления.ВидАвтомобиля.СобственныйПарк);
	
	Запрос.УстановитьПараметр("Автомобиль", АвтомобильСсылка);
	Запрос.УстановитьПараметр("СписокДляВсегоРегистра", СписокДляВсегоРегистра);
	Запрос.УстановитьПараметр("СписокДляСрезаПоследних", СписокДляСрезаПоследних);
	
	РезультатЗапроса = Запрос.Выполнить();
		
	Если РезультатЗапроса.Пустой() тогда
		Возврат Истина
	Иначе
		Возврат ложь;
	КонецЕсли;
	 
КонецФункции
// Холышевская -- 09.07.2026

Функция НайтиЗарегистрированноеПодразделение(ПодразделениеСкладаОстатковРодитель)
	
	Обособка = Справочники.ПодразделенияКомпании.ПустаяСсылка(); 
	// Холышевская ++ 27.06.2026 убыточные организации 
	ОрганизацияНеУбыточная = ПроверкаОрганизацияНеУбыточная(ВладелецАвто);
	Если обПраво("ВключениеОтключениеМеханизмаУбыточныхОрганизаций",Права,,ЭтотОбъект)
		И НЕ обЗначениеНеЗаполнено(Автомобиль) И НЕ ПроверкаЗаказНаАвтоЕсть()
		// Холышевская ++ 09.07.2026
		// БЫЛО
		//И ВидАвтомобиля = Перечисления.ВидАвтомобиля.АвтомобильСПробегом
		И ПроверитьВидАвтоДляУбыточныхОрганизаций(Автомобиль)
		// Холышевская -- 09.07.2026
		И ПроверкаПоследнееПоступлениеНеКомиссия(Автомобиль) И ОрганизацияНеУбыточная Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПодразделенияКомпании.Ссылка КАК Ссылка,
		|	ПодразделенияКомпании.ПометкаУдаления КАК ПометкаУдаления,
		|	ПодразделенияКомпании.ЭтоАгент КАК ЭтоАгент,
		|	ПодразделенияКомпании.ОПЗарегистрировано КАК ОПЗарегистрировано,
		|	ПодразделенияКомпании.Родитель КАК Родитель
		|ИЗ
		|	РегистрСведений.УбыточныеОрганизации КАК УбыточныеОрганизации
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ПодразделенияКомпании КАК ПодразделенияКомпании
		|		ПО ПодразделенияКомпании.Организация = УбыточныеОрганизации.УбыточнаяОрганизация
		|ГДЕ
		|	НЕ ПодразделенияКомпании.ПометкаУдаления
		|	И ПодразделенияКомпании.ОПЗарегистрировано
		|	И ПодразделенияКомпании.Родитель = &Родитель
		|
		|УПОРЯДОЧИТЬ ПО
		|	ЭтоАгент УБЫВ";
				
	Иначе		
	 //Холышевская -- 27.06.2026
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ПодразделенияКомпании.Ссылка КАК Ссылка,
	|	ПодразделенияКомпании.ОПЗарегистрировано КАК ОПЗарегистрировано,
	|	ПодразделенияКомпании.Родитель КАК Родитель,
	|	ПодразделенияКомпании.ЭтоАгент КАК ЭтоАгент
	|ИЗ
	|	Справочник.ПодразделенияКомпании КАК ПодразделенияКомпании
	|ГДЕ
	|	ПодразделенияКомпании.ОПЗарегистрировано
	|	И НЕ ПодразделенияКомпании.ПометкаУдаления
	|	И ПодразделенияКомпании.Ссылка В ИЕРАРХИИ(&Родитель)
	|	И ПодразделенияКомпании.Ссылка <> &Родитель
	|
	|УПОРЯДОЧИТЬ ПО
	|	ЭтоАгент УБЫВ"; 
	КонецЕсли;
		
	Запрос.УстановитьПараметр("Родитель", ПодразделениеСкладаОстатковРодитель);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Обособка = ВыборкаДетальныеЗаписи.Ссылка;
		Прервать;
	КонецЦикла;
	
	Возврат Обособка;
	
КонецФункции // НайтиЗарегистрированноеПодразделение(ПОдразделениеСкладаОстатков)
//Бондаренко-- 20231209

//Бондаренко++ 2023111		
Функция ОпределитьОригинальностьПТС(АвтомобильТрейдИн)
	
	ФлагОригПТС = Ложь;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ПодтверждающиеДокументы.Ссылка,
	|	ПодтверждающиеДокументы.ВидПодтверждающегоДокумента КАК Вид,
	|	ПодтверждающиеДокументы.Владелец,
	|	ПодтверждающиеДокументы.ПТСОригинал КАК ПТСОригинал,
	|	ПодтверждающиеДокументы.Текущий
	|ИЗ
	|	Справочник.ПодтверждающиеДокументы КАК ПодтверждающиеДокументы
	|ГДЕ
	|	(ПодтверждающиеДокументы.ВидПодтверждающегоДокумента = ЗНАЧЕНИЕ(Перечисление.ВидыДокументов.ПТС)
	|			ИЛИ ПодтверждающиеДокументы.ВидПодтверждающегоДокумента = ЗНАЧЕНИЕ(Перечисление.ВидыДокументов.ВыпискаИзЭлектронногоПаспорта))
	|	И ПодтверждающиеДокументы.Текущий
	|	И ПодтверждающиеДокументы.Владелец = &Владелец";
	
	Запрос.УстановитьПараметр("Владелец", АвтомобильТрейдИн);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Если ВыборкаДетальныеЗаписи.Вид = Перечисления.ВидыДокументов.ВыпискаИзЭлектронногоПаспорта Тогда
			ФлагОригПТС = Истина;
			Прервать;
		ИначеЕсли ВыборкаДетальныеЗаписи.Вид = Перечисления.ВидыДокументов.ПТС Тогда	
			Если ВыборкаДетальныеЗаписи.ПТСОригинал Тогда
				ФлагОригПТС = Истина;
				Прервать;
			КонецЕсли;
		КонецЕсли;	
	КонецЦикла;
	
	Возврат ФлагОригПТС; 
	
КонецФункции // ОпределитьОригинальностьПТС(АвтомобильТрейдИн)()
//Бондаренко-- 2023111	

//Бондаренко++ 20231230
Функция СМГ_ОбновитьДатуКПДоговораЗаказаНаАвтомобиль() Экспорт             
	Отказ_=Ложь;
	// ищем Заказ на автомобиль
	ТолькоНеПомеченные = Истина;
	МассивВидов = Новый Массив(1); МассивВидов[0] = "ЗаказНаАвтомобиль";  
	МассивПодчиненных = дкПолучитьМассивПодчиненных(Ссылка,МассивВидов,ТолькоНеПомеченные);
	Если МассивПодчиненных <> Неопределено И МассивПодчиненных.Количество() > 0 Тогда
		// нашли
		Для каждого Эл Из МассивПодчиненных Цикл
			ЗакНаАвто = Эл.Ссылка;
			Если Не ЗакНаАвто.Проведен Тогда
				Продолжить;
			КонецЕсли;
			ЗаказОтменен = СМГ_ПроверитьОтменуЗаказа(ЗакНаАвто);
			Если НЕ ЗаказОтменен Тогда
				ДоговорВзаиморасчетов_ = ЗакНаАвто.ДоговорВзаиморасчетов.ПолучитьОбъект();
				Если НачалоДня(ДоговорВзаиморасчетов_.ДатаКП) <> НачалоДня(ТекущаяДата()) Тогда
					ДоговорВзаиморасчетов_.ДатаКП = ТекущаяДата();    
					Попытка
						ДоговорВзаиморасчетов_.Записать();
					Исключение                              
						СМГ_Сообщить("ОШИБКА! Не удалось установить текущую дату как дату КП в <<"+ДоговорВзаиморасчетов_+">> с кодом <<"+ДоговорВзаиморасчетов_.Код+">>.",СтатусСообщения.ОченьВажное);
						Отказ_=Истина;
					КонецПопытки; 
				КонецЕсли; 
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	Возврат Отказ_;
КонецФункции // СМГ_ОбновитьДатуКПДоговораЗаказаНаАвтомобиль() 

Функция СМГ_ПроверитьОтменуЗаказа(ДокументОснование)
	
	Фл = Ложь;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ЗаказНаАвтомобиль.Ссылка,
	|	ЗаказНаАвтомобиль.Проведен,
	|	ЗаказНаАвтомобиль.ДокументОснование,
	|	ЗаказНаАвтомобиль.ХозОперация
	|ИЗ
	|	Документ.ЗаказНаАвтомобиль КАК ЗаказНаАвтомобиль
	|ГДЕ
	|	ЗаказНаАвтомобиль.Проведен
	|	И ЗаказНаАвтомобиль.ДокументОснование = &ДокументОснование
	|	И ЗаказНаАвтомобиль.ХозОперация = &ХозОперацияОтмена";
	
	Запрос.УстановитьПараметр("ДокументОснование", ДокументОснование);
	Запрос.УстановитьПараметр("ХозОперацияОтмена", Справочники.ХозОперации.ЗаказНаАвтомобильОтмена);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Фл = Истина;
	КонецЦикла;
	
	Возврат Фл;
	
КонецФункции // ПроверитьОтменуЗаказа(ДокументОснование)

Функция ПоискатьДругиеАвто(Авто)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 	"ВЫБРАТЬ
	|	ОстаткиАвтомобилейОстатки.Автомобиль КАК Автомобиль,
	|	ОстаткиАвтомобилейОстатки.КоличествоОстаток КАК КоличествоОстаток,
	|	ОстаткиАвтомобилейОстатки.Автомобиль.Модель КАК АвтомобильМодель,
	|	ОстаткиАвтомобилейОстатки.Автомобиль.ВариантКомплектации КАК АвтомобильВариантКомплектации,
	|	ОстаткиАвтомобилейОстатки.Автомобиль.Цвет.Наименование КАК АвтомобильЦветНаименование,
	|	РАЗНОСТЬДАТ(ОстаткиАвтомобилейОстатки.Партия.Дата, &ТекДата, ДЕНЬ) КАК Дней,
	|	ВЫБОР
	|		КОГДА ОстаткиАвтомобилейОстатки.Автомобиль = &АвтомобильВыбранный
	|			ТОГДА 1
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК ФлагНашАвто
	|ИЗ
	|	РегистрНакопления.ОстаткиАвтомобилей.Остатки КАК ОстаткиАвтомобилейОстатки
	|ГДЕ
	|	ОстаткиАвтомобилейОстатки.Автомобиль.Модель = &АвтомобильВыбранныйМодель
	|	И ОстаткиАвтомобилейОстатки.Автомобиль.ВариантКомплектации = &АвтомобильВыбранныйВариантКомплектации
	|	И ОстаткиАвтомобилейОстатки.Автомобиль.Цвет.Наименование = &АвтомобильВыбранныйЦветНаименование
	|	И ОстаткиАвтомобилейОстатки.КоличествоОстаток > 0
	|
	|УПОРЯДОЧИТЬ ПО
	|	Дней УБЫВ";
	
	Запрос.УстановитьПараметр("АвтомобильВыбранный",Авто);
	Запрос.УстановитьПараметр("АвтомобильВыбранныйМодель",Авто.Модель);
	Запрос.УстановитьПараметр("АвтомобильВыбранныйВариантКомплектации",Авто.ВариантКомплектации);
	Запрос.УстановитьПараметр("АвтомобильВыбранныйЦветНаименование",Авто.Цвет.Наименование);
	Запрос.УстановитьПараметр("ТекДата",НачалоДня(ТекущаяДата()));
	
	ТЗ = Запрос.Выполнить().Выгрузить(); 
	
	Если ТЗ.Количество() > 1 Тогда 
		ДниХраненияВыбранногоАвто = 0;
		НайденнаяСтрока = ТЗ.Найти(Авто,"Автомобиль");
		Если НайденнаяСтрока <> Неопределено Тогда
			ДниХраненияВыбранногоАвто = НайденнаяСтрока.Дней;
		КонецЕсли;
		Для каждого Стр Из ТЗ Цикл
			Если Стр.ФлагНашАвто = 1 Тогда
				Прервать;
			КонецЕсли;
			СМГ_Сообщить("Внимание! "+Стр.Автомобиль+" хранится на складе "+Стр.Дней+" дн. "+?(ДниХраненияВыбранногоАвто>0, "А выбранный - "+ДниХраненияВыбранногоАвто+" дн.",""),СтатусСообщения.Обычное);
		КонецЦикла;
	КонецЕсли;
	
КонецФункции // ПоискатьДругиеАвто(Авто)
//Бондаренко-- 20231230

//Бондаренко++ 20240321
Функция ОпределитьИнвойсПоДокПродажи()
	
	Инв_ = 0;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ПродажиАвтомобилейОбороты.ДокументПродажи КАК ДокументПродажи,
	|	ПродажиАвтомобилейОбороты.СебестоимостьОборот КАК СебестоимостьОборот,
	|	ПродажиАвтомобилейОбороты.ДокументПродажи.ДокументОснование.ДокументОснование КАК РабочийЛист,
	|	ПродажиАвтомобилейОбороты.Автомобиль КАК Автомобиль,
	|	ПродажиАвтомобилейОбороты.Партия.ХозОперация КАК ПартияХозОперация
	|ИЗ
	|	РегистрНакопления.ПродажиАвтомобилей.Обороты(, , Регистратор, ) КАК ПродажиАвтомобилейОбороты
	|ГДЕ
	|	ПродажиАвтомобилейОбороты.ДокументПродажи.ДокументОснование.ДокументОснование = &РЛ
	|	И ПродажиАвтомобилейОбороты.Автомобиль = &Автомобиль";
	
	Запрос.УстановитьПараметр("РЛ", Ссылка);
	Запрос.УстановитьПараметр("Автомобиль", Автомобиль);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Инв_ = ВыборкаДетальныеЗаписи.СебестоимостьОборот;
		Прервать;
	КонецЦикла;
	
	Возврат Инв_;
	
КонецФункции // ОпределитьИнвойсПоДокПродажи()  

Функция НайтиДатуПоступленияНаОтветХранение()
	
	//XTA219170R0539508 - Lada Granta
	
	ДатаПостНаОтветХранение_ = Дата(1,1,1);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 	"ВЫБРАТЬ
	|	ОстаткиАвтомобилейОстаткиИОбороты.Автомобиль КАК Автомобиль,
	|	ОстаткиАвтомобилейОстаткиИОбороты.СтатусПартии КАК СтатусПартии,
	|	ОстаткиАвтомобилейОстаткиИОбороты.Партия КАК Партия,
	|	ОстаткиАвтомобилейОстаткиИОбороты.КоличествоПриход КАК КоличествоПриход,
	|	ОстаткиАвтомобилейОстаткиИОбороты.Партия.Дата КАК ПартияДата
	|ИЗ
	|	РегистрНакопления.ОстаткиАвтомобилей.ОстаткиИОбороты(, , Регистратор, , ) КАК ОстаткиАвтомобилейОстаткиИОбороты
	|ГДЕ
	|	ОстаткиАвтомобилейОстаткиИОбороты.Автомобиль = &Автомобиль
	|	И ОстаткиАвтомобилейОстаткиИОбороты.СтатусПартии = ЗНАЧЕНИЕ(Перечисление.СтатусыПартий.ТоварОтветственноеХранение)
	|	И ОстаткиАвтомобилейОстаткиИОбороты.КоличествоПриход = 1";
	
	Запрос.УстановитьПараметр("Автомобиль", Автомобиль);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		ДатаПостНаОтветХранение_ = НачалоДня(ВыборкаДетальныеЗаписи.ПартияДата);
		Прервать;
	КонецЦикла;
	
	Возврат ДатаПостНаОтветХранение_;
	
КонецФункции // НайтиДатуПоступленияНаОтветХранение()

//Бондаренко-- 20240321

Функция НайтиСкладПоступленияАвто() Экспорт
	
	СкладДляПоступленияАвто_ = Неопределено;
	
	СписокОрганизаций = Новый СписокЗначений;
	
	//Бондаренко++ 20240423
	
	//Запрос = Новый Запрос;
	//Запрос.Текст = 
	//	"ВЫБРАТЬ
	//	|	Организации.Ссылка КАК Организация,
	//	|	Организации.ПометкаУдаления КАК ПометкаУдаления,
	//	|	Организации.УчаствуетВПродажахБУавтомобилей КАК УчаствуетВПродажахБУавтомобилей
	//	|ИЗ
	//	|	Справочник.Организации КАК Организации
	//	|ГДЕ
	//	|	НЕ Организации.ПометкаУдаления
	//	|	И Организации.УчаствуетВПродажахБУавтомобилей";
	//
	//СписокОрганизаций.ЗагрузитьЗначения(Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Организация"));
	
	// Семенихин 2024.11.03 +++++
	// Холышевская ++ 11.08.2026
	//Если ЗначениеЗаполнено(ПодразделениеКомпании.ПерепродажаАвто) Тогда
	//	СписокОрганизаций.Добавить(ПодразделениеКомпании.ПерепродажаАвто);
	Если НЕ обЗначениеНеЗаполнено(СкладВладельцаАвто) И НЕ обЗначениеНеЗаполнено(СкладВладельцаАвто.Подразделение.ПерепродажаАвто) Тогда
		СписокОрганизаций.Добавить(СкладВладельцаАвто.Подразделение.ПерепродажаАвто);
	// Холышевская -- 11.08.2026
	Иначе
		СписокОрганизаций.Добавить(ПодразделениеКомпании.Организация);
	КонецЕсли;
	// Семенихин 2024.11.03 ----- 
	
	// Холышевская ++ 27.06.2026 убыточные организации
	// если нужно чтобы выбираалсь не та что в ПодразделениеКомпании.ПерепродажаАвто 
	//Если НЕ обЗначениеНеЗаполнено(Автомобиль) И НЕ обЗначениеНеЗаполнено(Агент) 
	//	И ВидАвтомобиля = Перечисления.ВидАвтомобиля.АвтомобильСПробегом
	//	И ПроверкаПоследнееПоступлениеНеКомиссия(Автомобиль) Тогда
	//	ОрганизацияАгентаУбыточная = НЕ ПроверкаОрганизацияНеУбыточная(Агент.КонтрагентОрганизации);
	//	Если ОрганизацияАгентаУбыточная Тогда
	//		СписокОрганизаций.Очистить();
	//		СписокОрганизаций.Добавить(Агент);
	//	КонецЕсли;
	//КонецЕсли;
	// Холышевская -- 27.06.2026
	
	Если СписокОрганизаций.Количество() > 0 Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	СкладыКомпании.Ссылка КАК Склад,
		|	СкладыКомпании.ПометкаУдаления КАК ПометкаУдаления,
		|	СкладыКомпании.ЭтоГруппа КАК ЭтоГруппа,
		|	СкладыКомпании.Подразделение КАК Подразделение,
		|	СкладыКомпании.ТипСклада КАК ТипСклада,
		|	СкладыКомпании.ВидСклада КАК ВидСклада,
		|	СкладыКомпании.Организация КАК Организация
		|ИЗ
		|	Справочник.СкладыКомпании КАК СкладыКомпании
		|ГДЕ
		|	НЕ СкладыКомпании.ПометкаУдаления
		|	И НЕ СкладыКомпании.ЭтоГруппа
		|	И СкладыКомпании.ТипСклада = &ТипСклада
		|	И СкладыКомпании.ВидСклада = &ВидСклада
		|	И СкладыКомпании.Подразделение.ДилерскийЦентр = &ДилерскийЦентр
		|	И СкладыКомпании.Организация В(&СписокОрганизаций)";
		
		Запрос.УстановитьПараметр("ТипСклада",Перечисления.ТипыСкладов.Автомобильный);
		Запрос.УстановитьПараметр("ВидСклада",Перечисления.ВидыСкладов.Обычный);
		//Бондаренко++ 20241204 HelpDesk: #7446
		//|	И СкладыКомпании.Подразделение В ИЕРАРХИИ (&Подразделение)
		//Запрос.УстановитьПараметр("Подразделение",ПодразделениеКомпании);
		Запрос.УстановитьПараметр("ДилерскийЦентр",СкладВладельцаАвто.Подразделение.ДилерскийЦентр);
		//Бондаренко-- 20241204 HelpDesk: #7446
		Запрос.УстановитьПараметр("СписокОрганизаций",СписокОрганизаций);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			СкладДляПоступленияАвто_ = ВыборкаДетальныеЗаписи.Склад;
			Прервать;
		КонецЦикла;
		
	Иначе	
		
		СМГ_Сообщить("ОШИБКА! Не найдена организация для поступления б/у автомобилей",СтатусСообщения.ОченьВажное);	
		
	КонецЕсли;
	
	//Бондаренко++ 20240424
	Если СкладДляПоступленияАвто_ = Неопределено Тогда
		СМГ_Сообщить("ОШИБКА! Не найден склад для поступления авто  по подразделению """+ПодразделениеКомпании.ПерепродажаАвто+"""",СтатусСообщения.ОченьВажное);
	КонецЕсли;
	//Бондаренко-- 20240424	
	
	Возврат СкладДляПоступленияАвто_;
	
КонецФункции // НайтиСкладПоступленияАвто()
//Бондаренко-- 20240406

//Бондаренко++ 20240411
Процедура  СМГ_ПриКопировании(ЭтотОбъект,ОбъектКопирования)
	
	ЭтотОбъект.Автомобиль = "";
	ЭтотОбъект.Модель = "";
	ЭтотОбъект.ВариантКомплектации = "";
	
КонецПроцедуры
//Бондаренко-- 20240411

//Бондаренко++ 20240507
Функция ЕстьСтраховыеПродуктыКромеКаскоИОсаго()
	
	ЕстьСтраховыеПродукты = Ложь;
	
	Если ( СуммаСтрахованиеЖизни > 0 ) Тогда
		ЕстьСтраховыеПродукты = Истина;
	Иначе
		Для каждого Стр Из ИныеСтраховыеПродукты Цикл
			Если Стр.ПрограммаСтрахования.ВидСтрахования = Перечисления.ВидыСтрахования.КАСКО Тогда
				Продолжить;
			КонецЕсли;
			Если Стр.ПрограммаСтрахования.ВидСтрахования = Перечисления.ВидыСтрахования.ОСАГО Тогда
				Продолжить;
			КонецЕсли;
			Если Стр.СуммаСтрахования = 0 Тогда
				Продолжить;
			КонецЕсли;
			ЕстьСтраховыеПродукты = Истина;
			Прервать;
		КонецЦикла;
	КонецЕсли;
	
	Возврат ЕстьСтраховыеПродукты;
	
КонецФункции // ЕстьСтраховыеПродуктыКромеКаскоИОсаго()
//Бондаренко-- 20240507  

//Бондаренко++ 20240523                           
Функция ПолучитьТаблицуКорректировокПоступленияАвто(СпАвто)
	
	ТЗ = Новый ТаблицаЗначений;
	
	Запрос = Новый Запрос;  
	
	Запрос.Текст =
	//Иванченко 20251201 ++
	//"ВЫБРАТЬ
	//|	ОстаткиАвтомобилей.Автомобиль КАК Автомобиль,
	//|	ОстаткиАвтомобилей.КоличествоОстаток,
	//|	КорректировкиПоступления.СуммаРазница,
	//|	КорректировкиПоступления.Ссылка,
	//|	КорректировкиПоступления.Дата
	//|ИЗ
	//|	РегистрНакопления.ОстаткиАвтомобилей.Остатки КАК ОстаткиАвтомобилей
	//|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	//|			КорректировкаПоступленияАвтомобилейАвтомобили.Ссылка КАК Ссылка,
	//|			КорректировкаПоступленияАвтомобилейАвтомобили.Ссылка.Дата КАК Дата,
	//|			КорректировкаПоступленияАвтомобилейАвтомобили.Ссылка.Проведен КАК Проведен,
	//|			КорректировкаПоступленияАвтомобилейАвтомобили.СуммаРазница КАК СуммаРазница,
	//|			КорректировкаПоступленияАвтомобилейАвтомобили.Автомобиль КАК Автомобиль
	//|		ИЗ
	//|			Документ.КорректировкаПоступленияАвтомобилей.Автомобили КАК КорректировкаПоступленияАвтомобилейАвтомобили
	//|		ГДЕ
	//|			КорректировкаПоступленияАвтомобилейАвтомобили.Ссылка.Проведен) КАК КорректировкиПоступления
	//|		ПО ОстаткиАвтомобилей.Автомобиль = КорректировкиПоступления.Автомобиль
	//|ГДЕ
	//|	ОстаткиАвтомобилей.КоличествоОстаток > 0
	//|	И ОстаткиАвтомобилей.Автомобиль В(&СпАвто)
	//|	И КорректировкиПоступления.СуммаРазница <> 0";
	"ВЫБРАТЬ
	|	КорректировкаПоступленияАвтомобилейАвтомобили.Ссылка КАК Ссылка,
	|	КорректировкаПоступленияАвтомобилейАвтомобили.Ссылка.Дата КАК Дата,
	|	КорректировкаПоступленияАвтомобилейАвтомобили.Ссылка.Проведен КАК Проведен,
	|	КорректировкаПоступленияАвтомобилейАвтомобили.СуммаРазница КАК СуммаРазница,
	|	КорректировкаПоступленияАвтомобилейАвтомобили.Автомобиль КАК Автомобиль
	|ИЗ
	|	Документ.КорректировкаПоступленияАвтомобилей.Автомобили КАК КорректировкаПоступленияАвтомобилейАвтомобили
	|ГДЕ
	|	НЕ КорректировкаПоступленияАвтомобилейАвтомобили.Ссылка.ПометкаУдаления
	|	И КорректировкаПоступленияАвтомобилейАвтомобили.Ссылка.Проведен
	|	И КорректировкаПоступленияАвтомобилейАвтомобили.Автомобиль В(&СпАвто)";
	//Иванченко 20251201 --	
	
	Запрос.УстановитьПараметр("СпАвто", СпАвто);    
	
	ТЗ = Запрос.Выполнить().Выгрузить();
	
	Возврат ТЗ;                                               
	
КонецФункции // ПолучитьТаблицуКорректировокПоступленияАвто(СпАвто)
//Бондаренко-- 20240523                           

Процедура СформироватьРабочиеЛистыКредитногОтдела(ЭтаФорма=Неопределено) Экспорт
	
	#Если Клиент Тогда
		
		Если НЕ (ЭтотОбъект.Ссылка.Статус = Справочники.СтатусыРабочегоЛиста.Интерес
			ИЛИ ЭтотОбъект.Ссылка.Статус = Справочники.СтатусыРабочегоЛиста.Продажа 
			ИЛИ ЭтотОбъект.Ссылка.Статус = Справочники.СтатусыРабочегоЛиста.Сделка )
			Тогда
			Сообщить("Статус должен быть Интерес, Продажа или Сделка.");
			Возврат;	
		КонецЕсли; 
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	КредитныеПрограммы.Ссылка КАК КредитнаяПрограмма,
		|	КредитныеПрограммы.ПометкаУдаления КАК ПометкаУдаления,
		|	КредитныеПрограммы.Наименование КАК Наименование,
		|	КредитныеПрограммы.Банк КАК Банк,
		|	КредитныеПрограммы.ГодоваяСтавка КАК ГодоваяСтавка
		|ИЗ
		|	Справочник.КредитныеПрограммы КАК КредитныеПрограммы
		|ГДЕ
		|	НЕ КредитныеПрограммы.ПометкаУдаления";
		
		РезультатЗапроса = Запрос.Выполнить();
		
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			
			РЛкредОтд = Документы.РабочийЛистКредитногоОтдела.СоздатьДокумент();
			РЛкредОтд.Заполнить(Ссылка);
			
			РЛкредОтд.ДокументОснование = ЭтотОбъект.Ссылка;
			РЛкредОтд.КредитнаяПрограмма = ВыборкаДетальныеЗаписи.КредитнаяПрограмма;
			РЛкредОтд.Банк = ВыборкаДетальныеЗаписи.Банк;
			РЛкредОтд.ПроцентнаяСтавка = ВыборкаДетальныеЗаписи.ГодоваяСтавка;
			РЛкредОтд.ПервоначальныйВзнос = СуммаПредоплаты;
			РЛкредОтд.СуммаКредита = СчетИлиАвтоВКредит;
			РЛкредОтд.СрокКредита = 36;
			РЛкредОтд.ЗаявленныйДоход = 100000;
			РЛкредОтд.ВалютаЗаявленногоДохода = Константы.ВалютаРегламентированногоУчетаОрганизаций.Получить();
			РЛкредОтд.ТребованиеКПодтверждениюДохода = Перечисления.ТребованияКПодтверждениюДохода.ЗаявлениеЗаемщика; 
			РЛкредОтд.ВалютаДокумента = Константы.ВалютаРегламентированногоУчетаОрганизаций.Получить(); 
			
			Попытка
				РЛкредОтд.Записать(РежимЗаписиДокумента.Запись);
				СМГ_Сообщить("Записан новый документ "+РЛкредОтд,СтатусСообщения.БезСтатуса);			
			Исключение
				СМГ_Сообщить("ОШИБКА! Не удалось создать новый документ "+РЛкредОтд,СтатусСообщения.ОченьВажное);			
			КонецПопытки;
			
		КонецЦикла;
		
	#КонецЕсли
	
КонецПроцедуры //СформироватьРабочиеЛистыКредитногоОтдела 

Процедура СМГ_ВыполнитьДвижение(МаркетинговаяПрограмма,СкидкаФакт,КомпенсацияРетро,КомпенсацияСлед)
	
	Если Не обЗначениеНеЗаполнено(МаркетинговаяПрограмма) Тогда
		
		Если СкидкаФакт > 0 ИЛИ КомпенсацияРетро > 0 ИЛИ КомпенсацияСлед > 0 Тогда
			
			Движение = Движения.БонусныеБаллыДилера.Добавить();
			Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
			Движение.Период = Дата;
			Движение.Автомобиль = Автомобиль;
			Движение.Активность = Истина; 
			//Бондаренко++ 20260331
			Движение.ДокументРеализации = ОтгрузкаАвтомобиля;
			//Бондаренко-- 20260331
			Движение.МаркетинговаяПрограмма = МаркетинговаяПрограмма;
			Движение.ПодразделениеКомпании = РеализацияАвтомобиля.ПодразделениеКомпании;
			Движение.Организация = РеализацияАвтомобиля.Организация;
			Движение.Модель = Автомобиль.Модель;
			Движение.Марка = Автомобиль.Модель.Марка;
			Движение.КонтрагентПокупатель = РеализацияАвтомобиля.Контрагент;
			Движение.ХозОперация = Справочники.ХозОперации.КорректировкаБонусов;
			Движение.ДатаПродажи = РеализацияАвтомобиля.Дата;
			
			Движение.СкидкаПоМаркетинговойПрограмме = СкидкаФакт; 

			Если КомпенсацияСлед > 0 Тогда
				Движение.Компенсация = КомпенсацияСлед; 
				Движение.ВариантКомпенсации = Перечисления.ВариантКомпенсации.ВИнвойсеСледующего;
			ИначеЕсли КомпенсацияРетро > 0 Тогда	
				Движение.Компенсация = КомпенсацияРетро; 
				Движение.ВариантКомпенсации = Перечисления.ВариантКомпенсации.Ретроспективная;
			Иначе
				Движение.Компенсация = 0; 
				Движение.ВариантКомпенсации = Перечисления.ВариантКомпенсации.ПустаяСсылка();
			КонецЕсли;
 			
		КонецЕсли;
		
	КонецЕсли;	
    
КонецПроцедуры

//Бондаренко++ 20250614
Процедура СМГ_ОбработкаПроведения(Отказ, Режим)
	
  	Движения.ВзаиморасчетыКомпании.Очистить();
	Движения.БонусныеБаллыДилера.Очистить();
	
	СсылкаНаРеализациюАвто_ = НайтиРеализациюАвто(Ссылка);
	
	Если НЕ обЗначениеНеЗаполнено(СсылкаНаРеализациюАвто_) Тогда
		Если СсылкаНаРеализациюАвто_.Дата < Дата(2025,1,1) Тогда
			#Если Клиент Тогда
				СМГ_Сообщить("Документ "+СсылкаНаРеализациюАвто_+" слишком старый. Движения РЛ не выполняются."); 
 			#КонецЕсли
			Возврат;
		КонецЕсли;
		Если ЭтотОбъект.НеПроводной Тогда
			#Если Клиент Тогда
				СМГ_Сообщить("Документ непроводной. Не выполняются движения РЛ.",СтатусСообщения.Обычное); 
			#КонецЕсли
			Возврат;
		КонецЕсли; 
	Иначе	
		#Если Клиент Тогда
			СМГ_Сообщить("Реализация автомобиля не найдена."); 
		#КонецЕсли
		Возврат;
	КонецЕсли;
	
	Для Сч = 1 По 5 Цикл
		
		МаркПрогр = "";
		СкидкаФакт = 0;    
		КомпРетро = 0;
		КомпСлед = 0;
		
		Если Сч = 1 Тогда
			МаркПрогр = МаркетинговаяПрограммаСкидкаТрейдИн;
			СкидкаФакт = СкидкаТрейдИнФакт;    
			КомпРетро = КомпенсацияТрейдИНРетроспективная;
			КомпСлед = КомпенсацияТрейдИНВИнВойсеСледующегоАвтомобиля;
		ИначеЕсли Сч = 2 Тогда	
			МаркПрогр = МаркетинговаяПрограммаСкидкаТрейдИн2;
			СкидкаФакт = СкидкаТрейдИн2Факт;    
			КомпРетро = КомпенсацияТрейдИН2Ретроспективная;
			КомпСлед = КомпенсацияТрейдИН2ВИнВойсеСледующегоАвтомобиля;
		ИначеЕсли Сч = 3 Тогда	
			МаркПрогр = МаркетинговаяПрограммаСкидкаСубсидияКредит;
			СкидкаФакт = СкидкаСубсидияКредитФакт;    
			КомпРетро = КомпенсацияСубсидияКредитРетроспективная;
			КомпСлед = КомпенсацияСубсидияКредитВИнВойсеСледующегоАвтомобиля;
		ИначеЕсли Сч = 4 Тогда	
			МаркПрогр = МаркетинговаяПрограммаСкидкаПоПрограммамЛояльности;
			СкидкаФакт = СкидкаПоПрограммамЛояльности;    
			КомпРетро = КомпенсацияПоПрограммамЛояльностиРетроспективная;
			КомпСлед = КомпенсацияПоПрограммамЛояльностиВИнВойсеСледующегоАвтомобиля;
		ИначеЕсли Сч = 5 Тогда	
			МаркПрогр = МаркетинговаяПрограммаСкидкаПоПрограммамЛояльностиДополнительно;
			СкидкаФакт = СкидкаАвтоЦентра;    
			КомпРетро = КомпенсацияРозничнаяРетроспективная;
			КомпСлед = КомпенсацияРозничнаяВИнВойсеСледующегоАвтомобиля;
		КонецЕсли;
		
		Если Не обЗначениеНеЗаполнено(МаркПрогр) Тогда
			Если ( СкидкаФакт > 0 ) ИЛИ	( КомпРетро > 0) ИЛИ ( КомпСлед > 0 )	 Тогда
				СМГ_ВыполнитьДвижение(МаркПрогр,СкидкаФакт,КомпРетро,КомпСлед);	 
			КонецЕсли;
		КонецЕсли;
		
	КонецЦикла;
  	
КонецПроцедуры

Функция НайтиРеализациюАвто(РЛ)
	
	РеалАвто_ = "";
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	РеализацияАвтомобилейАвтомобили.Автомобиль КАК Автомобиль,
	|	РеализацияАвтомобилейАвтомобили.Ссылка КАК РеалАвто,
	|	РеализацияАвтомобилейАвтомобили.ЗаказНаАвтомобиль КАК ЗаказНаАвтомобиль,
	|	РеализацияАвтомобилейАвтомобили.ЗаказНаАвтомобиль.ДокументОснование КАК ЗаказНаАвтомобильДокументОснование,
	|	РеализацияАвтомобилейАвтомобили.Ссылка.Проведен КАК Проведен,
	|	РеализацияАвтомобилейАвтомобили.Ссылка.ПометкаУдаления КАК ПометкаУдаления
	|ИЗ
	|	Документ.РеализацияАвтомобилей.Автомобили КАК РеализацияАвтомобилейАвтомобили
	|ГДЕ
	|	РеализацияАвтомобилейАвтомобили.ЗаказНаАвтомобиль.ДокументОснование = &СсылкаНаРЛ
	|	И РеализацияАвтомобилейАвтомобили.Автомобиль = &АвтомобильРЛ";
	
	Запрос.УстановитьПараметр("АвтомобильРЛ", Ссылка.Автомобиль);
	Запрос.УстановитьПараметр("СсылкаНаРЛ", РЛ);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		РеалАвто_ = ВыборкаДетальныеЗаписи.РеалАвто; 
	КонецЦикла;                               
	
	Возврат РеалАвто_;
	
КонецФункции // НайтиРеализациюАвто(Ссылка)
//Бондаренко-- 20250614

Функция СМГ_ПолучитьСуммуПредпродажнойПодготовки(Авто,ДатаПослПост,ДатаРеализации)
	
	//Бондаренко++ 20251015
	Если ДатаРеализации = Дата(1,1,1) Тогда
		ДатаРеал_ = ТекущаяДата();
	Иначе
		ДатаРеал_ = ДатаРеализации;
	КонецЕсли;
	
	Если ДатаПослПост = Дата(1,1,1) Тогда
		ДатаПослПост_ = Дата(2017,1,1);
	Иначе
		ДатаПослПост_ = ДатаПослПост;
	КонецЕсли;
	//Бондаренко 20251015
	
	СуммаПредпродажки_ = 0;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ЗаказНаряд.Ссылка КАК Ссылка,
	|	ЗаказНаряд.Дата КАК Дата,
	|	ЗаказНаряд.Проведен КАК Проведен,
	|	ЗаказНаряд.Состояние КАК Состояние,
	|	ЗаказНаряд.ВидРемонта КАК ВидРемонта,
	|	ЗаказНаряд.Автомобиль КАК Автомобиль,
	|	ЗаказНаряд.СуммаДокумента КАК СуммаДокумента
	|ИЗ
	|	Документ.ЗаказНаряд КАК ЗаказНаряд
	|ГДЕ
	|	ЗаказНаряд.Дата >= &ДатаПослПост
	|	И ЗаказНаряд.Состояние = &СостояниеЗакрыт
	|	И ЗаказНаряд.ВидРемонта = &ВидРемонтаПредпродажнаяПодготовка
	|	И ЗаказНаряд.Автомобиль = &Автомобиль
	|	И ЗаказНаряд.Дата <= &ДатаРеал_";
	
	Запрос.УстановитьПараметр("Автомобиль", Авто);
	Запрос.УстановитьПараметр("ВидРемонтаПредпродажнаяПодготовка", Справочники.ВидыРемонта.ПредпродажнаяПодготовка);
	Запрос.УстановитьПараметр("ДатаПослПост", ДатаПослПост_);
	Запрос.УстановитьПараметр("СостояниеЗакрыт", Справочники.ВидыСостоянийЗаказНарядов.Закрыт);
	
	//Бондаренко++ 20251015
	Запрос.УстановитьПараметр("ДатаРеал_", ДатаРеал_);
	//Бондаренко-- 20251015
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		СуммаПредпродажки_ = СуммаПредпродажки_ + ВыборкаДетальныеЗаписи.СуммаДокумента ;
	КонецЦикла;
	
	Возврат СуммаПредпродажки_; 
	
КонецФункции // СМГ_ПолучитьСуммуПредпродажнойПодготовки(Авто,ДатаПослПост,ДатаРеал)

//Иванченко 20260226 ++
Функция СМГ_ПолучитьСебестоимостьДОКоммерции(Автомобиль, Дата_ПоследнееПоступление, Дата_Реализация)
		
	Если Дата_ПоследнееПоступление = Дата(1,1,1) Тогда
		Параметр_ДатаПоследнегоПоступления = Дата(2017,1,1);
	Иначе
		Параметр_ДатаПоследнегоПоступления = Дата_ПоследнееПоступление;
	КонецЕсли;       
	
	//Иванченко 20260325 ++	
	//Если Дата_Реализация = Дата(1,1,1) Тогда
	//	Параметр_ДатаРеализации = ТекущаяДата();
	//Иначе
	//	Параметр_ДатаРеализации = Дата_Реализация;
	//КонецЕсли;
	
	//Иванченко 20260406 ++	
	//Если День(Дата) < 14 Тогда
	//	Параметр_ДатаЗарплатыОП = НачалоМесяца(Дата) + 14 * 86400;       
	//Иначе 
	//	Параметр_ДатаЗарплатыОП = КонецМесяца(Дата) + 14 * 86401; 
	//КонецЕсли;
	ДатаПроверкиЗарплатыОП = ?(ДатаРеализацииАвтомобиля = '00010101', ТекущаяДата(), ДатаРеализацииАвтомобиля);
	
	Если День(ДатаПроверкиЗарплатыОП) < 14 Тогда
		Параметр_ДатаЗарплатыОП = НачалоМесяца(ДатаПроверкиЗарплатыОП) + 14 * 86400;       
	Иначе 
		Параметр_ДатаЗарплатыОП = КонецМесяца(ДатаПроверкиЗарплатыОП) + 14 * 86401; 
	КонецЕсли;	
	//Иванченко 20260406 --	
	//Иванченко 20260325 --
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	СУММА(ЗаказНаряд.СуммаДокумента) КАК СуммаДокумента
	|ИЗ
	|	Документ.ЗаказНаряд КАК ЗаказНаряд
	|ГДЕ
	|	ЗаказНаряд.Проведен
	|	И НЕ ЗаказНаряд.ПометкаУдаления
	|	И ЗаказНаряд.Дата >= &ДатаПоследнегоПоступления
	|	И ЗаказНаряд.Дата <= &ДатаЗарплатыОП
	|	И ЗаказНаряд.Состояние = ЗНАЧЕНИЕ(Справочник.ВидыСостоянийЗаказНарядов.Закрыт)
	|	И ЗаказНаряд.ВидРемонта = ЗНАЧЕНИЕ(Справочник.ВидыРемонта.КоммерческоеДопОборудование)
	|	И ЗаказНаряд.Автомобиль = &Автомобиль
	|
	|ИМЕЮЩИЕ
	|	НЕ СУММА(ЗаказНаряд.СуммаДокумента) ЕСТЬ NULL");
	Запрос.УстановитьПараметр("ДатаПоследнегоПоступления", Параметр_ДатаПоследнегоПоступления);  
	//Иванченко 20260325 ++  
	//Запрос.УстановитьПараметр("ДатаРеализации", Параметр_ДатаРеализации);
	Запрос.УстановитьПараметр("ДатаЗарплатыОП", Параметр_ДатаЗарплатыОП);	
	//Иванченко 20260325 --
	Запрос.УстановитьПараметр("Автомобиль", Автомобиль);	

	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		Параметр_СебестоимостьДОКоммерция = 0; 
	Иначе
		Параметр_СебестоимостьДОКоммерция = РезультатЗапроса.Выгрузить()[0].СуммаДокумента; 
	КонецЕсли;	
	
	Возврат Параметр_СебестоимостьДОКоммерция;
КонецФункции
//Иванченко 20260226 --

//Бондаренко++ 20250902
Функция ПолучитьОстатокАвтоНаСкладе(Авто)
	
	КолАвто_ = 0;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ОстаткиАвтомобилейОстатки.Автомобиль КАК Автомобиль,
	|	СУММА(ОстаткиАвтомобилейОстатки.КоличествоОстаток) КАК КоличествоОстаток
	|ИЗ
	|	РегистрНакопления.ОстаткиАвтомобилей.Остатки КАК ОстаткиАвтомобилейОстатки
	|ГДЕ
	|	ОстаткиАвтомобилейОстатки.Автомобиль = &Автомобиль
	|
	|СГРУППИРОВАТЬ ПО
	|	ОстаткиАвтомобилейОстатки.Автомобиль";
	
	Запрос.УстановитьПараметр("Автомобиль",Авто);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		КолАвто_ = ВыборкаДетальныеЗаписи.КоличествоОстаток;
		Прервать;
	КонецЦикла;
	
	Возврат КолАвто_;
	
КонецФункции // ПолучитьОстатокАвтоНаСкладе(Авто)

Функция СМГ_ПолучитьИнвойсИзПоступленияИКорректировок(Автомобиль,ДатаПоследнегоПоступления)
	
	ИнвойсОст = 0;
	
	СписокАвто = Новый СписокЗначений;
	СписокАвто.Добавить(Автомобиль);
	
	Запрос = Новый Запрос;
	
	Запрос.Текст = "ВЫБРАТЬ
	|	ПоступлениеАвтомобилейАвтомобили.Автомобиль КАК Автомобиль,
	|	ПоступлениеАвтомобилейАвтомобили.Ссылка.Проведен КАК Проведен,
	|	ПоступлениеАвтомобилейАвтомобили.Ссылка.Ссылка КАК Ссылка,
	|	ПоступлениеАвтомобилейАвтомобили.СуммаВсего КАК СуммаВсего,
	|	ПоступлениеАвтомобилейАвтомобили.Ссылка.Контрагент КАК Контрагент,
	|	ПоступлениеАвтомобилейАвтомобили.Ссылка.Контрагент.НашаФирма КАК КонтрагентНашаФирма,
	|	ПоступлениеАвтомобилейАвтомобили.Ссылка.Дата КАК Дата
	|ИЗ
	|	Документ.ПоступлениеАвтомобилей.Автомобили КАК ПоступлениеАвтомобилейАвтомобили
	|ГДЕ
	|	ПоступлениеАвтомобилейАвтомобили.Ссылка.Проведен
	|	И НЕ ПоступлениеАвтомобилейАвтомобили.Ссылка.Контрагент.НашаФирма
	|	И ПоступлениеАвтомобилейАвтомобили.Автомобиль В(&СписокАвто)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВводОстатковАвтомобилейАвтомобили.Автомобиль,
	|	ВводОстатковАвтомобилейАвтомобили.Ссылка.Проведен,
	|	ВводОстатковАвтомобилейАвтомобили.Ссылка,
	|	ВводОстатковАвтомобилейАвтомобили.СуммаВсего,
	|	ВводОстатковАвтомобилейАвтомобили.Ссылка.Контрагент,
	|	ВводОстатковАвтомобилейАвтомобили.Ссылка.Контрагент.НашаФирма,
	|	ВводОстатковАвтомобилейАвтомобили.Ссылка.Дата
	|ИЗ
	|	Документ.ВводОстатковАвтомобилей.Автомобили КАК ВводОстатковАвтомобилейАвтомобили
	|ГДЕ
	|	ВводОстатковАвтомобилейАвтомобили.Ссылка.Проведен
	|	И ВводОстатковАвтомобилейАвтомобили.Автомобиль В(&СписокАвто)
	|
	|УПОРЯДОЧИТЬ ПО
	|	Дата УБЫВ";  
	
	Запрос.УстановитьПараметр("СписокАвто",СписокАвто);
	
	ТЗ = Запрос.Выполнить().Выгрузить();
	
	Если ТЗ.Количество() > 0 Тогда
		ИнвойсОст = ТЗ[0].СуммаВсего;	
		ТаблицаКорректировокПоступленияАвто = ПолучитьТаблицуКорректировокПоступленияАвто(СписокАвто);
		Если ТаблицаКорректировокПоступленияАвто.Количество() > 0 Тогда
			Для каждого Эл Из ТаблицаКорректировокПоступленияАвто Цикл
				Если Эл.Дата < ДатаПоследнегоПоступления Тогда
					Продолжить;
				КонецЕсли;
				ИнвойсОст = ИнвойсОст + Эл.СуммаРазница;	
			КонецЦикла;
		КонецЕсли;
	КонецЕсли;
	
	//Бондаренко++ 20250903
	Если Автомобиль.Модель.Марка = Справочники.Марка.GAC ИЛИ
		Автомобиль.VIN = "LS4ASE2A5RJ104624" ИЛИ
		Автомобиль.VIN = "LS4ASE2A7RA707123" ИЛИ
		Автомобиль.VIN = "LS4ASE2A5RJ106714" ИЛИ
		Автомобиль.VIN = "LS5A2DKR7RA016010" Тогда
		Если ВидАвтомобиля = Перечисления.ВидАвтомобиля.Новый Тогда
			ИнвойсЧанган = 0;
			ИнвойсЧанган = ПолучитьИнвойсЧанган(Автомобиль);				
			Если ИнвойсЧанган > 0 Тогда
				ИнвойсОст = ИнвойсЧанган;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	//Бондаренко-- 20250903
	
	Возврат ИнвойсОст;
	
КонецФункции // СМГ_ПолучитьИнвойсИзПоступленияИКорректировок(Автомобиль,ДатаПоследнегоПоступления)
//Бондаренко++ 20250902 

//Иванченко 20251024 ++
Функция СМГ_ПолучитьИнвойсИзЗаказаПоставщику(Автомобиль)
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	МАКСИМУМ(ЗаказПоставщикуНаАвтомобиль.Ссылка) КАК Ссылка,
	|	ЗаказПоставщикуНаАвтомобиль.Автомобиль КАК Автомобиль
	|ПОМЕСТИТЬ ВТ
	|ИЗ
	|	Документ.ЗаказПоставщикуНаАвтомобиль КАК ЗаказПоставщикуНаАвтомобиль
	|ГДЕ
	|	ЗаказПоставщикуНаАвтомобиль.Автомобиль = &Автомобиль
	|	И НЕ ЗаказПоставщикуНаАвтомобиль.ПометкаУдаления
	|	И ЗаказПоставщикуНаАвтомобиль.Проведен
	|
	|СГРУППИРОВАТЬ ПО
	|	ЗаказПоставщикуНаАвтомобиль.Автомобиль
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ.Автомобиль КАК Автомобиль,
	|	ВТ.Ссылка.СуммаВсегоНаАвтомобиль КАК Инвойс
	|ИЗ
	|	ВТ КАК ВТ";
	Запрос.УстановитьПараметр("Автомобиль", Автомобиль); 
	
	Результат = Запрос.Выполнить().Выгрузить();
	
	Если Результат.Количество() = 0 Тогда  
			РезультатИнвойс = 0;
	Иначе	
		РезультатИнвойс = Результат[0].Инвойс;  
	КонецЕсли;
	
	Возврат РезультатИнвойс; 
КонецФункции	

//Бондаренко++ 20251015
Функция СМГ_ПолучитьДатуРеализации(Автомобиль,Ссылка)
	
	ДатаРеализации_ = Дата(1,1,1);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	РеализацияАвтомобилейАвтомобили.ЗаказНаАвтомобиль КАК ЗаказНаАвтомобиль,
	|	РеализацияАвтомобилейАвтомобили.ЗаказНаАвтомобиль.ДокументОснование КАК РабочийЛист,
	|	РеализацияАвтомобилейАвтомобили.Ссылка.Ссылка КАК Ссылка,
	|	РеализацияАвтомобилейАвтомобили.Ссылка.Номер КАК Номер,
	|	РеализацияАвтомобилейАвтомобили.Ссылка.Дата КАК Дата,
	|	РеализацияАвтомобилейАвтомобили.Ссылка.Проведен КАК Проведен
	|ИЗ
	|	Документ.РеализацияАвтомобилей.Автомобили КАК РеализацияАвтомобилейАвтомобили
	|ГДЕ
	|	РеализацияАвтомобилейАвтомобили.Ссылка.Проведен
	|	И РеализацияАвтомобилейАвтомобили.Автомобиль = &Автомобиль
	|	И РеализацияАвтомобилейАвтомобили.ЗаказНаАвтомобиль.ДокументОснование = &РабочийЛист";
	
	Запрос.УстановитьПараметр("Автомобиль", Автомобиль);
	Запрос.УстановитьПараметр("РабочийЛист", Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		ДатаРеализации_ = ВыборкаДетальныеЗаписи.Дата;
		РеализацияАвтомобиля_ = ВыборкаДетальныеЗаписи.Ссылка;
		Если РеализацияАвтомобиля <> РеализацияАвтомобиля_ Тогда
			РеализацияАвтомобиля = РеализацияАвтомобиля_;
		КонецЕсли;
		Прервать;
	КонецЦикла;
	
	Возврат ДатаРеализации_; 
	
КонецФункции // СМГ_ПолучитьДатуРеализации(Автомобиль,Ссылка)
//Бондаренко++ 20251015


////////////////////////////////////////////////////////////////////////////////
// ИСПОЛНЯЕМАЯ ЧАСТЬ МОДУЛЯ

// Вид контакта
СписокВидовКонтактов	= Новый СписокЗначений();
СписокВидовКонтактов.Добавить(Перечисления.ВидыСобытий.ЛичнаяВстреча, "Личная встреча",,БиблиотекаКартинок.СобытияВстреча16);
СписокВидовКонтактов.Добавить(Перечисления.ВидыСобытий.ТелефонныйЗвонок, "Телефонный звонок",,БиблиотекаКартинок.СобытияЗвонок16);
СписокВидовКонтактов.Добавить(Перечисления.ВидыСобытий.ЗаявкаССайта, "Заявка с сайта",,БиблиотекаКартинок.IExplorer);
СписокВидовКонтактов.Добавить(Перечисления.ВидыСобытий.ЭлектронноеПисьмо, "Электронное письмо",,БиблиотекаКартинок.КонтактнаяИнформацияЭлектроннаяПочта);
СписокВидовКонтактов.Добавить(Перечисления.ВидыСобытий.Прочее, "Прочее",,БиблиотекаКартинок.ПрочееСобытие);
// Кому покупает
СписокКомуПокупает	= Новый СписокЗначений();
СписокКомуПокупает.Добавить("Себе");
СписокКомуПокупает.Добавить("Жене");
СписокКомуПокупает.Добавить("Детям");
СписокКомуПокупает.Добавить("Родственникам");

// С кем пришел
СписокСКемПришел	= Новый СписокЗначений();
СписокСКемПришел.Добавить("Один");
СписокСКемПришел.Добавить("С женой");
СписокСКемПришел.Добавить("С семьей");
СписокСКемПришел.Добавить("С другом");
СписокСКемПришел.Добавить("С родственником");

// Предполагаемый строк
СписокСроков	= Новый СписокЗначений();
СписокСроков.Добавить("Сегодня");
СписокСроков.Добавить("Неделя");
СписокСроков.Добавить("Месяц");
СписокСроков.Добавить("Полгода");
СписокСроков.Добавить("Год");

// Список статусов рабочего листа
СписокСтатусов	= Новый СписокЗначений;
ЗапросСтатусов		= Новый Запрос();
ЗапросСтатусов.Текст= "ВЫБРАТЬ
|	СтатусыРабочегоЛиста.Ссылка КАК Ссылка,
|	СтатусыРабочегоЛиста.Наименование КАК Наименование
|ИЗ
|	Справочник.СтатусыРабочегоЛиста КАК СтатусыРабочегоЛиста
|ГДЕ
|	СтатусыРабочегоЛиста.ИспользоватьВРабочемЛисте
|	И НЕ СтатусыРабочегоЛиста.ПометкаУдаления";
ВыборкаСтатусов	= ЗапросСтатусов.Выполнить().Выбрать();
Пока ВыборкаСтатусов.Следующий() Цикл
	СписокСтатусов.Добавить(ВыборкаСтатусов.Ссылка, ВыборкаСтатусов.Наименование);	
КонецЦикла;
СписокСтатусов.СортироватьПоПредставлению();

ВводИзАРМРесепшен = Ложь;

// сохранение ссылки на коллекцию прав, настроек и окружения
Права                 = Неопределено;
#Если Клиент Тогда
	Права = глПрава;
#КонецЕсли