Процедура ЗаполнитьПоУмолчанию() Экспорт
	
СпрОб = Справочники.Renault_НастройкаФормулировокАРМАвтосервис.Приветствие.ПолучитьОбъект(); 	

СпрОб.Текст = "Вы впервые обращаетесь к нам в дилерский центр?";

СпрОб.Записать();

СпрОб = Справочники.Renault_НастройкаФормулировокАРМАвтосервис.ЗапросДанныхКлиента.ПолучитьОбъект(); 	

СпрОб.Текст = "Представьтесь, пожалуйста";

СпрОб.Записать();

СпрОб = Справочники.Renault_НастройкаФормулировокАРМАвтосервис.ЗапросПричиныОбращения.ПолучитьОбъект(); 	

СпрОб.Текст = "Какой вопрос вас интересует?";

СпрОб.Записать();

СпрОб = Справочники.Renault_НастройкаФормулировокАРМАвтосервис.ЗапросПрочихПроблем.ПолучитьОбъект(); 	

СпрОб.Текст = "Примечание";

СпрОб.Записать();

СпрОб = Справочники.Renault_НастройкаФормулировокАРМАвтосервис.УточнениеИнформацииПоКлиенту.ПолучитьОбъект(); 	

СпрОб.Текст = "Уточните информацию о клиенте";

СпрОб.Записать();

СпрОб = Справочники.Renault_НастройкаФормулировокАРМАвтосервис.УточнениеИнформацииПоАвтомобилю.ПолучитьОбъект(); 	

СпрОб.Текст = "Уточните информацию о клиенте";

СпрОб.Записать();

СпрОб = Справочники.Renault_НастройкаФормулировокАРМАвтосервис.НаполнениеЗаявки.ПолучитьОбъект(); 	

СпрОб.Текст = "Необходимые работы и запчасти по заказ-наряду";

СпрОб.Записать();
	
КонецПроцедуры