
Процедура ПередЗаписью(Отказ, Замещение)
	Права=ПараметрыСеанса.Renault_ПраваПользователя;
	Если Не Права.Скидка Тогда Сообщить("Не достаточно прав на установку скидки",СтатусСообщения.Внимание); Отказ=Истина; Возврат КонецЕсли;
	
	////расчет минимальных цен по максимальным скидкам по сумме и по проценту
	//Если Количество()>0 И Права.СкидкаМаксимальныйПроцент>0 Тогда
	//	Запрос=Новый Запрос;
	//	Запрос.УстановитьПараметр("Т",Выгрузить(,"Автомобиль,ВариантКомплектации"));
	////	Запрос.УстановитьПараметр("СкидкаМаксимальнаяСумма",Права.СкидкаМаксимальнаяСумма);
	////	Запрос.УстановитьПараметр("СкидкаМаксимальныйПроцент",Права.СкидкаМаксимальныйПроцент);
	//	Запрос.Текст="
	//	|Выбрать Т.Автомобиль,Т.ВариантКомплектации Поместить Т Из &Т Т
	//	|;
	////	|Выбрать
	////	|	Автомобиль,
	////	|	ВариантКомплектации,
	////	|	Выбор Когда МинимальнаяЦенаПоСумме>МинимальнаяЦенаПоПроценту Тогда МинимальнаяЦенаПоПроценту Иначе МинимальнаяЦенаПоСумме Конец МинимальнаяЦена
	////	|ИЗ(
	////		|Выбрать
	////		|	Автомобиль,
	////		|	ВариантКомплектации,
	////		|	Выбор Когда &СкидкаМаксимальнаяСумма=0 Тогда 0 Иначе Цена-&СкидкаМаксимальнаяСумма Конец МинимальнаяЦенаПоСумме,
	////		|	Выбор Когда &СкидкаМаксимальныйПроцент=0 Тогда 0 Иначе Цена*&СкидкаМаксимальныйПроцент/100 Конец МинимальнаяЦенаПоПроценту
	////		|ИЗ(
	//			|Выбрать
	//			|	Т.Автомобиль,
	//			|	Т.ВариантКомплектации,
	//			|	Рег.ЦенаПродажиБаза+Рег.ЦенаПродажиОпции+Рег.ЦенаЗакупкиАвтомобиля+Рег.ЦенаПродажиДопОборудования Цена
	//			|Из Т Т
	//			|Левое Соединение РегистрСведений.CRM_СостояниеАвтомобилейПроизводителя_v2 Рег  
	//			|По( ВЫРАЗИТЬ(Т.Автомобиль КАК Справочник.Автомобили)=Рег.Автомобиль ИЛИ ВЫРАЗИТЬ(Т.Автомобиль КАК Справочник.Модели)=Рег.Автомобиль ) 
	//			|	И Т.ВариантКомплектации=Рег.Версия
	////		|)ЗП
	////	|)ЗП	
	//	|";
	////	МинимальныеЦены=Запрос.Выполнить().Выгрузить();
	//	ИсходныеЦены=Запрос.Выполнить().Выгрузить();
	//КонецЕсли;
	
	Для Каждого Запись Из ЭтотОбъект Цикл
		//проверка заполнения
		Если Не ЗначениеЗаполнено(Запись.Автомобиль) Тогда Сообщить("Не заполнен автомобиль/модель",СтатусСообщения.Внимание); Отказ=Истина; Возврат КонецЕсли;
		Если Запись.ДилерскийЦентр.Пустая() Тогда Сообщить("Не заполнен дилерский центр",СтатусСообщения.Внимание); Отказ=Истина; Возврат КонецЕсли;
		Если Запись.ТипСкидки.Пустая() Тогда Сообщить("Не заполнен тип скидки",СтатусСообщения.Внимание); Отказ=Истина; Возврат КонецЕсли;
		Если Не ЗначениеЗаполнено(Запись.ДатаНачала) Тогда Сообщить("Не заполнена дата начала скидки",СтатусСообщения.Внимание); Отказ=Истина; Возврат КонецЕсли;
		Если Не ЗначениеЗаполнено(Запись.ДатаКонца) Тогда Сообщить("Не заполнена дата окончания скидки",СтатусСообщения.Внимание); Отказ=Истина; Возврат КонецЕсли;
		
		//ограничение прав
		Если ТипЗнч(Запись.Автомобиль)=Тип("СправочникСсылка.Автомобили") Тогда
			Если Не Права.СкидкаАвтомобиль Тогда Сообщить("Не достаточно прав установки скидки на автомобиль",СтатусСообщения.Внимание); Отказ=Истина; Возврат КонецЕсли;
		ИначеЕсли ТипЗнч(Запись.Автомобиль)=Тип("СправочникСсылка.Модели") Тогда
			Если Не Права.СкидкаМодельКомплектация Тогда Сообщить("Не достаточно прав установки скидки на модель",СтатусСообщения.Внимание); Отказ=Истина; Возврат КонецЕсли;
		КонецЕсли;
		
		Если Запись.ДилерскийЦентр<>Права.ДилерскийЦентр И НЕ Права.СкидкаЧужойДилерскийЦентр Тогда
			Сообщить("Не достаточно прав установки скидки на чужой дилерский центр",СтатусСообщения.Внимание); Отказ=Истина; Возврат
		КонецЕсли;
		
		Если НЕ Запись.СтатусАвтомобиля.Пустая() И Не Права.СкидкаСтатусАвтомобиля Тогда
			Сообщить("Не достаточно прав установки скидки на статус автомобиля",СтатусСообщения.Внимание); Отказ=Истина; Возврат
		КонецЕсли;	
		
		Если Запись.ГодВыпуска>'00010101' И Не Права.СкидкаГодВыпуска Тогда
			Сообщить("Не достаточно прав установки скидки на год выпуска",СтатусСообщения.Внимание); Отказ=Истина; Возврат
		КонецЕсли;	
		
		Если Запись.КоличествоДнейНаСкладе>0 И Не Права.СкидкаКоличествоДнейНаСкладе Тогда
			Сообщить("Не достаточно прав установки скидки на количество дней на складе",СтатусСообщения.Внимание); Отказ=Истина; Возврат
		КонецЕсли;
		
		Если Права.СкидкаМаксимальнаяСумма>0 И Запись.СуммаСкидки>Права.СкидкаМаксимальнаяСумма Тогда
			Сообщить("Прешена сумма максимальной скидки "+Запись.СуммаСкидки+" из "+Права.СкидкаМаксимальнаяСумма,СтатусСообщения.Внимание); Отказ=Истина; Возврат
		КонецЕсли;
		
		// НАЧАЛО DMSCOR-1030
		//---
		Если Запись.ПроцентСкидки > 100 Тогда
			Сообщить("Прешен или равен процент скидки 100!" , СтатусСообщения.Внимание);
			Отказ = Истина; 
			Возврат;
		КонецЕсли;
		
		Если Права.СкидкаМаксимальныйПроцент > 0 И Запись.ПроцентСкидки > Права.СкидкаМаксимальныйПроцент Тогда
			Сообщить("Прешен процент максимальной скидки " + Запись.ПроцентСкидки + " из " + Права.СкидкаМаксимальныйПроцент, СтатусСообщения.Внимание);
			Отказ = Истина; 
			Возврат;
		КонецЕсли;
		// КОНЕЦ DMSCOR-1030 
		
		Если Права.СкидкаМаксимальныйПроцент>0 или Не Права.СкидкаНижеСебестоимости Тогда
			//определим исходную цену и себестоимость
			
			Запрос=Новый Запрос;
			Запрос.УстановитьПараметр("Автомобиль",Запись.Автомобиль);
			Запрос.УстановитьПараметр("Версия",Запись.ВариантКомплектации);
			Запрос.Текст="
			|Выбрать  
			|	ЕстьNULL(ЦенаПродажиБаза,0)+ЕстьNULL(ЦенаПродажиОпции,0)+ЕстьNULL(ЦенаПродажиДопОборудования,0) Цена, 
			|	ЕстьNULL(СебестоимостьПоТН,0) Себестоимость
			|Из РегистрСведений.CRM_СостояниеАвтомобилейПроизводителя_v2
			|ГДЕ ЦенаПродажиБаза<>0 И СебестоимостьПоТН<>0"
			+?(ТипЗнч(Запись.Автомобиль)=Тип("СправочникСсылка.Автомобили")," И Автомобиль=&Автомобиль"," И (Модель=&Автомобиль ИЛИ Версия=&Версия)");
			
			Цена = 0;
			Себестоимость = 0;
			
			Выборка=Запрос.Выполнить().Выбрать();
			Если Выборка.Следующий() Тогда
            	Цена = Выборка.Цена;
				Себестоимость = Выборка.Себестоимость;
			КонецЕсли;
			
			Если ТипЗнч(Запись.Автомобиль)=Тип("СправочникСсылка.Автомобили") Тогда
				
				Если Цена = 0 Тогда
					Запрос=Новый Запрос;
					Запрос.УстановитьПараметр("Автомобиль",Запись.Автомобиль);
					Запрос.Текст="
					|ВЫБРАТЬ
					|	ЦеныАвтомобилейСрезПоследних.Цена
					|ИЗ
					|	РегистрСведений.ЦеныАвтомобилей.СрезПоследних(
					|			,
					|			ТипЦен = ЗНАЧЕНИЕ(Справочник.ТипыЦен.ОсновнойТипЦенПродажи)
					|				И Автомобиль = &Автомобиль) КАК ЦеныАвтомобилейСрезПоследних
					|ГДЕ Цена<>0 ";
				
					Выборка=Запрос.Выполнить().Выбрать();
					Если Выборка.Следующий() Тогда
		            	Цена = Выборка.Цена;
					КонецЕсли;
				КонецЕсли;
				
				Если Себестоимость = 0 Тогда
					Запрос=Новый Запрос;
					Запрос.УстановитьПараметр("Автомобиль",Запись.Автомобиль);
					Запрос.Текст="
					|ВЫБРАТЬ
					|	ОстаткиАвтомобилейОстатки.СуммаОстаток
					|ИЗ
					|	РегистрНакопления.ОстаткиАвтомобилей.Остатки(, Автомобиль = &Автомобиль) КАК ОстаткиАвтомобилейОстатки 
					|ГДЕ СуммаОстаток<>0 ";
					
					Выборка=Запрос.Выполнить().Выбрать();
					Если Выборка.Следующий() Тогда
		            	Себестоимость = Выборка.СуммаОстаток;
					КонецЕсли;
				КонецЕсли;
			КонецЕсли;
			
			Если Цена <> 0 И Себестоимость <> 0 Тогда
				//процент
				Если Права.СкидкаМаксимальныйПроцент>0 Тогда					
					Если Цена = 0 Тогда
						Сообщить("Не определены данные стоимости по "+Запись.Автомобиль+" "+Запись.ВариантКомплектации+", установка скидки не возможна",СтатусСообщения.Внимание); Отказ=Истина; Возврат
					Иначе
						Если Запись.СуммаСкидки > 0 Тогда 
							ТекПроцент = Запись.СуммаСкидки*100/Цена;
							Если ТекПроцент > Права.СкидкаМаксимальныйПроцент Тогда
								Сообщить("Превышен % максимальной скидки "+ТекПроцент+" из "+Права.СкидкаМаксимальныйПроцент+" по "+Запись.Автомобиль+" "+Запись.ВариантКомплектации+". Исходная цена: "+Цена,СтатусСообщения.Внимание); Отказ=Истина; Возврат
							КонецЕсли;
						КонецЕсли;
					КонецЕсли;
				КонецЕсли;
				
				//себестоимость
				Если Не Права.СкидкаНижеСебестоимости Тогда
					Если Запись.СуммаСкидки > 0 Тогда
						Если Себестоимость = 0 Или Себестоимость > (Цена - Запись.СуммаСкидки) Тогда
							Сообщить("Не достаточно прав для скидки ниже себестоимости. "+Запись.Автомобиль+" "+Запись.ВариантКомплектации+", Себестоимость: "+Себестоимость,СтатусСообщения.Внимание); Отказ=Истина; Возврат
						КонецЕсли;	
					ИначеЕсли Запись.ПроцентСкидки > 0 Тогда
						Если Себестоимость = 0 Или Себестоимость > (Цена - (Цена * (Запись.ПроцентСкидки/100))) Тогда //---
							Сообщить("Не достаточно прав для скидки ниже себестоимости. "+Запись.Автомобиль+" "+Запись.ВариантКомплектации+", Себестоимость: "+Себестоимость,СтатусСообщения.Внимание); Отказ=Истина; Возврат
						КонецЕсли;	
					КонецЕсли;
				КонецЕсли;	
			Иначе
				Сообщить("Не определены данные стоимости по "+Запись.Автомобиль+" "+Запись.ВариантКомплектации+", установка скидки не возможна",СтатусСообщения.Внимание); Отказ=Истина; Возврат
			КонецЕсли;	
		КонецЕсли;	
		
	КонецЦикла;	
КонецПроцедуры
