Перем НастройкиСоед Экспорт;
Перем СообщениеНетСвязи Экспорт;
Перем СообщениеНеАвторизован Экспорт;


Функция ПолучитьКоннектыМодуль(ЗапросИзФормы=Ложь) Экспорт
	//  получаем адрес сервера и токен

	Рез = Новый Структура;
	Рез.Вставить("АдресСервера", "");
	Рез.Вставить("АдресСервераПорт", 12346);
	Рез.Вставить("ЛокальныйТокен", "");
	Рез.Вставить("SSL", Неопределено);
	Рез.Вставить("НуженSSL", Ложь);
	Рез.Вставить("КоннектРазрешен", Ложь);
	Рез.Вставить("СтрокаОшибок", "");
	Рез.Вставить("ДилерскийЦентр" , Неопределено);
	
	Если НастройкиСоед<>Неопределено Тогда
		Если  НастройкиСоед.ДилерскийЦентр=ДилерскийЦентр Тогда
			ЗаполнитьЗначенияСвойств(Рез,НастройкиСоед);
			Если Рез.НуженSSL и не ЗапросИзФормы Тогда
				//Рез.SSL = Новый ЗащищенноеСоединениеOpenSSL( Новый СертификатКлиентаWindows(СпособВыбораСертификатаWindows.Авто),
            	//												Новый СертификатыУдостоверяющихЦентровWindows());
				
				Рез.SSL = Новый ЗащищенноеСоединениеOpenSSL( Новый СертификатКлиентаWindows(),
            													Новый СертификатыУдостоверяющихЦентровWindows());
			КонецЕсли;
			Возврат Рез;
		КонецЕсли;
	Иначе
		НастройкиСоед = Новый Структура;
		НастройкиСоед.Вставить("АдресСервера", "");
		НастройкиСоед.Вставить("АдресСервераПорт", 12346);
		НастройкиСоед.Вставить("ЛокальныйТокен", "");
		НастройкиСоед.Вставить("SSL", Неопределено);
		НастройкиСоед.Вставить("НуженSSL", Ложь);
		НастройкиСоед.Вставить("КоннектРазрешен", Ложь);
		НастройкиСоед.Вставить("СтрокаОшибок", "");
		НастройкиСоед.Вставить("ДилерскийЦентр" , Неопределено);

	КонецЕсли;
	
	АдресСервера = "";
	АдресСервераПорт = 12346;
	ЛокальныйТокен = "";
		
	СтрокаНастроек = ВебСервисПолучитьНастройки();
	Рез.ДилерскийЦентр = ДилерскийЦентр;
	Если СтрДлина(СтрокаНастроек)>0 Тогда
		Попытка 
			чт1 = Новый ЧтениеJSON();
			чт1.УстановитьСтроку(СтрокаНастроек);
			джейсон = ПрочитатьJSON(чт1);
			Рез.АдресСервера = джейсон["srvadr"];
			Рез.АдресСервераПорт = джейсон["port"];
			Рез.ЛокальныйТокен = джейсон["token"];
			Если джейсон["protected"]="1" Тогда
				Рез.НуженSSL = Истина;
				Если не ЗапросИзФормы Тогда
					Рез.SSL = Новый ЗащищенноеСоединениеOpenSSL( Новый СертификатКлиентаWindows(),
            											Новый СертификатыУдостоверяющихЦентровWindows());
				Иначе										
					Рез.SSL = Неопределено;	
				КонецЕсли;
			Иначе 
				Рез.НуженSSL = Ложь;
				Рез.SSL = Неопределено;
			КонецЕсли;	
			Рез.КоннектРазрешен = Истина;

		Исключение
			Рез.КоннектРазрешен = Ложь;
			Рез.СтрокаОшибок = "Ошибка получения адреса сервера в настройках соединения с сервером!";
			Возврат Рез;

		КонецПопытки;

	Иначе
		Рез.СтрокаОшибок = "Ошибка получения настроек соединения с сервера или выбранный дилерский центр не подключен к сервису!";
		Возврат Рез;

	КонецЕсли;
	
	ЗаполнитьЗначенияСвойств(НастройкиСоед,Рез);

		
	Возврат Рез;
КонецФункции

Функция ПолучитьВебСервисПоVOC2() Экспорт
	АдресWS	 = Справочники.Renault_СлужебныеНастройкиБазыДанных[ПараметрыСеанса.DMS_Бренд.Наименование].АдресWsCentral;
	ЛогинWS	 = Справочники.Renault_СлужебныеНастройкиБазыДанных[ПараметрыСеанса.DMS_Бренд.Наименование].ЛогинWSCentral;
	ПарольWS = Справочники.Renault_СлужебныеНастройкиБазыДанных[ПараметрыСеанса.DMS_Бренд.Наименование].ПарольWsCentral;
	
	//удалим определение документа wsdl - его добавляем автоматически
	Адрес = АдресWS +"ws/RenaultPDRTab.1cws";
	Адрес = СтрЗаменить(Адрес, "?wsdl", "");
	
	Если Renault_ОбщегоНазначенияПовтИсп.Renault_Это83() Тогда
		
		ВЫПОЛНИТЬ("ВСОпределение = Новый WSОпределения(СокрЛП(Адрес) + ""?wsdl"", СокрЛП(ЛогинWS), СокрЛП(ПарольWS),,15)");
		

		
	Иначе
		
		ВСОпределение = Новый WSОпределения(СокрЛП(Адрес) + "?wsdl",
		СокрЛП(ЛогинWS), СокрЛП(ПарольWS),15);
		
	КонецЕсли;
	
	ВебСервис = Новый WSПрокси(ВСОпределение, "http://renault-nissan.com/schema/RenaultPDRTab",ВСОпределение.Сервисы[0].Имя,ВСОпределение.Сервисы[0].ТочкиПодключения[0].Имя);     
	ВебСервис.Пользователь	 = СокрЛП(ЛогинWS);
	ВебСервис.Пароль		 = СокрЛП(ПарольWS);
	Возврат ВебСервис;
	
	
	
КонецФункции


Функция ВебСервисПолучитьНастройки() Экспорт 
	
	СтрокаНастроек = "";
	Токен = "tst-tst-tst";
	СтрРазд = "--";
	
	о1 = ЭтотОбъект;
	дц = Неопределено;
	Если ЭтотОбъект.ДилерскийЦентр=неопределено или ЭтотОбъект.ДилерскийЦентр.ссылка=справочники.CRM_ДилерскиеЦентры.ПустаяСсылка() Тогда
		Если ЗначениеЗаполнено(ЭтотОбъект.ОбращениеВАвтосервис) Тогда // DMSREN-699 
			дц = ЭтотОбъект.ОбращениеВАвтосервис.ДилерскийЦентр;
		Иначе
			дц = справочники.CRM_ДилерскиеЦентры.НайтиПоРеквизиту("Бренд",справочники.CRM_МаркаАвтомобиля.RENAULT);
		КонецЕсли;
		Если дц=неопределено или дц.ссылка=справочники.CRM_ДилерскиеЦентры.ПустаяСсылка() Тогда
			Возврат СтрокаНастроек;
		КонецЕсли;
	Иначе 
		дц = ЭтотОбъект.ДилерскийЦентр.ссылка;
	КонецЕсли;
	
	Таблица = Новый ТаблицаЗначений;
	
	ВебСервис = ПолучитьВебСервисПоVOC2();
	сОтбора = Новый Структура;  // 777777--tst-tst-tst--b27f61be-71d0-11e3-93fe-00155d03d81c
	dmdguid = "777777" + СтрРазд + Токен + СтрРазд + Строка(дц.УникальныйИдентификатор());
	сОтбора.Вставить("dmdguid", dmdguid); 
	
	ТаблицаVOC = ВебСервис.GetStock(dmdguid, "dbo.view_DMS_NEWDIAG_SETTINGS", СериализаторXDTO.ЗаписатьXDTO(сОтбора), Истина, СериализаторXDTO.ЗаписатьXDTO(Новый Структура()));
	Таблица = СериализаторXDTO.ПрочитатьXDTO(ТаблицаVOC);
	
	Если Таблица<>Неопределено Тогда
		Если Таблица.Количество()>0 Тогда 
				Попытка
					СтрокаНастроек = Таблица[0]["jsonsettings"];
				Исключение
					
				КонецПопытки;
			Иначе
				//  по Биру нет данных вообще
			КонецЕсли;
		Иначе

		КонецЕсли;

 	  Возврат СтрокаНастроек;
КонецФункции




Функция ПроверитьПодключениеКНовомуДиалоджис() Экспорт
	Рез = Ложь;
	настр =  ПолучитьКоннектыМодуль();
	Если настр<>неопределено и настр.КоннектРазрешен=истина Тогда
		Рез = Истина;
	КонецЕсли;
	Возврат Рез;
КонецФункции