
Функция ПолучитьОбращениеПоОнлайнЗаписи(ОнлайнЗапись) Экспорт 

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	Renault_CRM_ОбращениеВАвтоСервис.Ссылка КАК Ссылка
		|ИЗ
		|	Документ.Renault_CRM_ОбращениеВАвтоСервис КАК Renault_CRM_ОбращениеВАвтоСервис
		|ГДЕ
		|	Renault_CRM_ОбращениеВАвтоСервис.ДокументОнлайнЗаписи = &ДокументОнлайнЗаписи";
	
	Запрос.УстановитьПараметр("ДокументОнлайнЗаписи", ОнлайнЗапись);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Возврат ВыборкаДетальныеЗаписи.Ссылка;
	КонецЦикла;
	
	Возврат Документы.Renault_CRM_ОбращениеВАвтоСервис.СоздатьДокумент().Ссылка;	
	
КонецФункции
