// Модуль справочника КредитныеПрограммы

////////////////////////////////////////////////////////////////////////////////
// ПЕРЕМЕННЫЕ ОБЪЕКТА

Перем Права Экспорт;	// Переменная объекта - ссылка на коллекцию прав, настроек и переменных окружения

////////////////////////////////////////////////////////////////////////////////
// ЭКСПОРТНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ ДОПОЛНИТЕЛЬНЫХ МЕТОДОВ ОБЪЕКТА

// Возвращает структуру обязательных / уникальных реквизитов элемента
// Если ДляЭлемента = Истина, возвращаемая структура содержит реквизиты для проверки элемента
// Если ДляГруппы = Истина, аналогично для группы
// Возвращаемая структура содержит строковые идентификаторы реквизитов или вложенные структуры для табличных частей
// Для реквизита значение структуры содержит число 1-Обязательный, 3-Уникальный
Функция ПолучитьОбязательныеРеквизиты(ДляЭлемента=Истина, ДляГруппы=Ложь) Экспорт
	ОбязательныеРеквизиты=Новый Структура();
	ОбязательныеРеквизиты.Вставить("Код",1);
	ОбязательныеРеквизиты.Вставить("Наименование",1);
	Если ДляЭлемента Тогда 
		ОбязательныеРеквизиты.Вставить("ГодоваяСтавка",1);
		//Бондаренко++ 20250816
		Если НЕ КомиссионноеВознаграждениеНеПредусмотрено Тогда
			ОбязательныеРеквизиты.Вставить("ПроцентКВ",1);	
		КонецЕсли;
		ОбязательныеРеквизиты.Вставить("БанкПартнер",1);
		//Бондаренко-- 20250816
 	КонецЕсли;
 	Возврат ОбязательныеРеквизиты;
КонецФункции

// Проверяет корректность заполнения объекта.
// Возвращает Истина если все заполнено корректно и Ложь иначе.
// В случае некорректного заполнения формирует строку описанием возникших ошибок "Ошибки"
// На вход может быть передана структура ДопРеквизиты с дополнительными реквизитами для проверки
// может управляться булевыми флагами выполняемых проверок Заполнение, Уникальность
// (могут быть и другие необязательные)
// Обычно выполняется универсальным обработчиком, но могут быть добавлены доп. проверки
Функция ПроверитьКорректность(Ошибки="", ДопРеквизиты=Неопределено, Заполнение=Истина, Уникальность=Истина) Экспорт
	Возврат спПроверитьКорректность(ЭтотОбъект, Ошибки, ДопРеквизиты, Заполнение, Уникальность);
КонецФункции
 
// Функция проверяет, допустимо ли изменение объекта
// Возвращает Истина, если изменения возможны, ложь иначе
// Если изменения доступны частично, возвращает ложь и структуру блокируемых на изменение реквизитов,
Функция ДоступностьИзменения(БлокироватьРеквизиты=Неопределено) Экспорт
	Возврат Истина;
КонецФункции

// Обработка изменения реквизитов справочников
// Параметры
//  Имя			– Строка			– Имя реквизита справочника с полным путем.
//  ЭтаФорма	– Форма				– Ссылка на форму справочника. Если значение неопределено,
//									  производится программная обработка реквизитов.
//  ТекСтрока	– СтрокаТабличнойЧасти – Ссылка на строку табличной части справочника, реквизит которой обрабатывается.
//										 Имеет смысл только для табличных частей справочников.
//  ДопПараметры– Структура			– Структура, содержащая дополнительные параметры обработки реквизита.
// Возвращаемое значение:
//   Булево   – Результат выполнения обработки.
Функция ОбработкаРеквизита(Имя,ТекСтрока=Неопределено,ЭтаФорма=Неопределено,ДопПараметры=Неопределено) Экспорт
	// ОБРАБОТКА РЕКВИЗИТОВ СПРАВОЧНИКОВ
	Возврат спОбработкаРеквизита(ЭтотОбъект,Имя,ТекСтрока,ЭтаФорма,ДопПараметры);
КонецФункции // ОбработкаРеквизита()

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ОБРАБОТЧИКИ СТАНДАРТНЫХ СОБЫТИЙ ОБЪЕКТА

// Стандартный обработчик заполнения при вводе нового на основании
//
Процедура ОбработкаЗаполнения(Основание) Экспорт
	Если НЕ спОбработкаЗаполнения(ЭтотОбъект, Основание) Тогда Возврат; КонецЕсли;
КонецПроцедуры

// Стандартный обработчик копирования объекта
//
Процедура ПриКопировании(ОбъектКопирования)
	Если НЕ спПриКопировании(ЭтотОбъект, ОбъектКопирования) Тогда Возврат; КонецЕсли;
КонецПроцедуры

// Стандартный обработчик ПередЗаписью элемента справочника
//
Процедура ПередЗаписью(Отказ)
	Если НЕ спПередЗаписью(ЭтотОбъект, Отказ) Тогда Возврат; КонецЕсли;
	
	//Бондаренко++ 20260430
	ЭтоНовыйОбъект = Ложь;
	Попытка
		ЭтоНовыйОбъект = ЭтотОбъект.ЭтоНовый();
	Исключение
	КонецПопытки; 
	Если ЭтоНовыйОбъект Тогда
		Попытка
			ЭтотОбъект.СМ_Создатель = ПараметрыСеанса.Пользователь;
		Исключение
		КонецПопытки;
		Попытка
			ЭтотОбъект.СМ_ДатаСоздания = ТекущаяДата();
		Исключение
		КонецПопытки;
	КонецЕсли;
	
	Если обЗначениеНеЗаполнено(ЭтотОбъект.СМ_Создатель) Тогда
		Попытка
			ЭтотОбъект.СМ_Создатель = ПараметрыСеанса.Пользователь;
		Исключение
		КонецПопытки;
	КонецЕсли;
	
	Если обЗначениеНеЗаполнено(ЭтотОбъект.СМ_ДатаСоздания) Тогда
		Попытка
			ЭтотОбъект.СМ_ДатаСоздания = ТекущаяДата();
		Исключение
		КонецПопытки;
	КонецЕсли;
	//Бондаренко-- 20260430
	
	//Бондаренко++ 20260502 
	Если Не обЗначениеНеЗаполнено(ЭтотОбъект.БанкПартнер) Тогда
		Если ЭтотОбъект.БанкПартнерНаименование <> СокрЛП(ЭтотОбъект.БанкПартнер.Наименование) Тогда
			ЭтотОбъект.БанкПартнерНаименование = СокрЛП(ЭтотОбъект.БанкПартнер.Наименование);
		КонецЕсли;
	КонецЕсли;
	
	Если Не ЭтотОбъект.Недействующая Тогда
		
		Если НЕ ЭтотОбъект.НовыеВсе Тогда
			Если НЕ ЭтотОбъект.БуВсе Тогда
				Если НЕ ЭтотОбъект.НовыеОпределенныхМарок Тогда
					#Если Клиент Тогда
						СМГ_Сообщить("ОШИБКА! Все три реквизита <Новые все>, <Б/У все> и <Новые определённых марок> - пустые. Заполните хотя бы один из них.",СтатусСообщения.ОченьВажное);
					#КонецЕсли
					Отказ = Истина;		
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
		
		Если ЭтотОбъект.НовыеОпределенныхМарок Тогда
			Если Марки.Количество() = 0 Тогда
				#Если Клиент Тогда
					СМГ_Сообщить("ОШИБКА! Реквизит <Новые определённых марок> - заполнен, а таблица марок - пустая. Исправьте.",СтатусСообщения.ОченьВажное);
				#КонецЕсли
				Отказ = Истина;		
			КонецЕсли;
		КонецЕсли;
		
	КонецЕсли;
	//Бондаренко-- 20260502
	
КонецПроцедуры

// Стандартный обработчик ПриЗаписи элемента справочника
//
Процедура ПриЗаписи(Отказ)
	Если НЕ спПриЗаписи(ЭтотОбъект, Отказ) Тогда Возврат; КонецЕсли;
КонецПроцедуры

// Стандартный обработчик ПередУдалением элемента
//
Процедура ПередУдалением(Отказ)
	Если НЕ спПередУдалением(ЭтотОбъект, Отказ) Тогда Возврат; КонецЕсли;
КонецПроцедуры

// Стандартный обработчик ПриУстановкеНовогоКода элемента
//
Процедура ПриУстановкеНовогоКода(СтандартнаяОбработка, Префикс)
	Если НЕ спПриУстановкеНовогоКода(ЭтотОбъект, СтандартнаяОбработка, Префикс) Тогда Возврат; КонецЕсли;
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ИСПОЛНЯЕМАЯ ЧАСТЬ МОДУЛЯ

// сохранение ссылки на коллекцию прав, настроек и окружения
Права = Неопределено;
#Если Клиент Тогда
Права = глПрава;
#КонецЕсли