
Функция ПолучитьЗаявкуНаСервисПоОбращению(Обращение) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	Renault_CRM_ЗаявкаНаСервис.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.Renault_CRM_ЗаявкаНаСервис КАК Renault_CRM_ЗаявкаНаСервис
	|ГДЕ
	|	Renault_CRM_ЗаявкаНаСервис.Обращение = &Обращение";
	
	Запрос.УстановитьПараметр("Обращение", Обращение);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Возврат ВыборкаДетальныеЗаписи.Ссылка;
	КонецЦикла;
	
	Возврат Документы.Renault_CRM_ЗаявкаНаСервис.СоздатьДокумент().Ссылка;
	
КонецФункции

Функция ПолучитьСсылкуСКлиента(UUID) Экспорт 
	
	Возврат Документы.Renault_CRM_ЗаявкаНаСервис.ПолучитьСсылку(Новый УникальныйИдентификатор(UUID));

	
КонецФункции
