// Общий журнал

Перем Права Экспорт;

Перем Организация Экспорт;

Функция ПолучитьСписокПечатныхФорм() Экспорт
	Возврат Новый СписокЗначений();
КонецФункции
// Конец необходимых для общих журналов

Процедура ПриУстановкеНовогоНомера(СтандартнаяОбработка, Префикс)	
	Префикс = DMS_ОбщегоНазначенияСервер.ПолучитьПрефикс();
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)     	
	Если ОбменДанными.Загрузка Тогда 		
		Возврат;  		
	КонецЕсли;
	
	#Если Клиент Тогда	
		Если ЭтотОбъект.ЭтоНовый() Тогда
			
			ЭтотОбъект.Автор = ПараметрыСеанса.Пользователь;
			
		КонецЕсли;
	#КонецЕсли
	
	СуммаРаботВсего = Работы.Итог("Сумма");
	СуммаЗапчастиВсего = Товары.Итог("Сумма");
	ОбщаяДлительность = Работы.Итог("Длительность");
	СопоставитьРаботыИСоставыЭтапов();
	СопоставитьЭтапыИРегистры();
	
	Renault_АвтосервисОбщий.ЗаписатьИзмененияДокументаВСправочникИзмененияДокументов(ЭтотОбъект);
	
	УпрощенныйРежим = ДилерскийЦентр.ИспользоватьУпрощенныйФункционалСвязиСервисПродажи;
	
	Если Не УпрощенныйРежим Тогда
		
		Если ЭтотОбъект.Состояние = Справочники.ВидыСостоянийЗаказНарядов.Выполнен Тогда
			
			Для Каждого Этап из ЭтотОбъект.Этапы Цикл
				
				Если НЕ ЗначениеЗаполнено(Этап.ДлительностьЭтапаПлан) Тогда
					
					Продолжить;
					
				КонецЕсли;
						
				ОбщаяДлительность = Этап.ДлительностьЭтапаПлан;
				
			КонецЦикла;
			
		КонецЕсли;
		
	КонецЕсли;
		
КонецПроцедуры

Функция ПолучитьКонецЭтапа(ВремяНачалаЭтапа, Длительность)
	
	СтрокаГрафика = ЭтотОбъект.ДилерскийЦентр.АвтосервисГрафикРабот.Найти(ДеньНедели(ВремяНачалаЭтапа), "ДеньНедели");
	ТекущийКонецРабочегоДня = НачалоДня(ВремяНачалаЭтапа) + СтрокаГрафика.КонецРабочегоДня;
	ТекущееНачалоРабочегоДня = НачалоДня(ВремяНачалаЭтапа) + СтрокаГрафика.НачалоРабочегоДня;
	
	ВремяОкончанияЭтапа = ВремяНачалаЭтапа + Длительность * 3600;
	Пока ВремяОкончанияЭтапа > ТекущийКонецРабочегоДня Цикл
		
		ПереносимаяЧасть = ВремяОкончанияЭтапа - ТекущийКонецРабочегоДня;
		ВремяОкончанияЭтапа = ТекущееНачалоРабочегоДня + 86400 + ПереносимаяЧасть;
		ЭтоРаботыСледующегоДня = Истина;
		ВремяПредыдущихРабот = ПереносимаяЧасть;
		ВремяНачалаРаботы = ТекущееНачалоРабочегоДня + 86400;
		
		ТекущееНачалоРабочегоДня = ТекущееНачалоРабочегоДня + 86400;
		ТекущийКонецРабочегоДня = ТекущийКонецРабочегоДня + 86400;
		
	КонецЦикла;
	
	Возврат ВремяОкончанияЭтапа;
	
КонецФункции

Процедура ПриЗаписи(Отказ)   	
	Если ОбменДанными.Загрузка Тогда 		
		Возврат;  		
	КонецЕсли;
	
	СуммаДокумента = СтоимостьВсего;
	
	Для Каждого Этап Из ЭтотОбъект.Этапы Цикл
		
		Если НЕ ЗначениеЗаполнено(Этап.КонецЭтапа) Тогда
			
			Этап.КонецЭтапа = Этап.НачалоЭтапа + Этап.ДлительностьЭтапаПлан*3600;
			
		КонецЕсли;
		
		СтатусЭтапа = Этап.СтатусЭтапа;
		
		Если Не ЗначениеЗаполнено(СтатусЭтапа) Тогда
			
			СтатусЭтапа = Справочники.Renault_СтатусыАвторабот.РаботаЗапланирована;
			
		КонецЕсли;
		
		Если СтатусЭтапа = Справочники.Renault_СтатусыАвторабот.РаботаПросрочена Тогда
			
			СтатусЭтапа = Справочники.Renault_СтатусыАвторабот.РаботаЗапланирована;
			
		КонецЕсли;
		
		//ЗапланироватьЭтап(Этап, СтатусЭтапа);
		//ОбновитьСтатусЭтапаВрегистре(Этап);
		
	КонецЦикла;
	
	// Трояновский К.Е. 25.10.2019 12:18:40 {
	//ВремяОкончания = ПолучитьВремяОкончания();
	//ВремяНачала = ПолучитьВремяНачала();
	Если НЕ ЗначениеЗаполнено(ВремяОкончания) Тогда
		ВремяОкончания = ПолучитьВремяОкончания();
	КонецЕсли;
	Если НЕ ЗначениеЗаполнено(ВремяНачала) Тогда
		ВремяНачала = ПолучитьВремяНачала();
	КонецЕсли;
	// Трояновский К.Е. 25.10.2019 12:18:40 }
		
	Если Обращение.ВидОбращения.Докомплектация = Истина 
		И Автор <> ПараметрыСеанса.Пользователь И ЗначениеЗаполнено(ВремяНачала) И ЗначениеЗаполнено(ВремяОкончания) Тогда
		
		ОтправитьСообщениеАвтору();
		
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ЗаказНаряд) Тогда
		
		Набор = РегистрыНакопления.Renault_ЧастоИспользуемыеРаботы.СоздатьНаборЗаписей();
		Набор.Отбор.Регистратор.Установить(Ссылка);
		Набор.Записать();
		
		Если ЗаказНаряд.Работы.Количество() <> 0 Тогда
			
			Для Каждого СтрокаРаботы ИЗ ЗаказНаряд.Работы Цикл
				Запись = Набор.Добавить();
				Запись.Период = Дата;
				Запись.Регистратор = Ссылка;
				Запись.Авторабота = СтрокаРаботы.Работа;
				Запись.Модель = Автомобиль.Модель;
				Запись.Количество = СтрокаРаботы.Количество;
				Запись.ГодВыпуска = Год(Автомобиль.ГодВыпуска);
				Запись.Пробег = Renault_АвтосервисОбщий.Renault_ПолучитьПробег(Автомобиль);
			КонецЦикла;
			
			Набор.Записать();
			
		КонецЕсли;
		
		Набор = РегистрыНакопления.Renault_ЧастоИспользуемыеЗапчасти.СоздатьНаборЗаписей();
		Набор.Отбор.Регистратор.Установить(Ссылка);
		Набор.Записать();
		
		Если ЗаказНаряд.Товары.Количество() <> 0 Тогда
			
			Для Каждого СтрокаТовара ИЗ ЗаказНаряд.Товары Цикл
				Запись = Набор.Добавить();
				Запись.Период = Дата;
				Запись.Регистратор = Ссылка;
				Запись.Номенклатура = СтрокаТовара.Номенклатура;
				Запись.Модель = Автомобиль.Модель;
				Запись.Количество = СтрокаТовара.Количество;
				
			КонецЦикла;
			
			Набор.Записать();
			
		КонецЕсли;
		
	Иначе
		
		Набор = РегистрыНакопления.Renault_ЧастоИспользуемыеРаботы.СоздатьНаборЗаписей();
		Набор.Отбор.Регистратор.Установить(Ссылка);
		Набор.Записать();
		
		Если Работы.Количество() <> 0 Тогда
			
			Для Каждого СтрокаРаботы ИЗ Работы Цикл
				Запись = Набор.Добавить();
				Запись.Период = Дата;
				Запись.Регистратор = Ссылка;
				Запись.Авторабота = СтрокаРаботы.Работа;
				Запись.Модель = Автомобиль.Модель;
				Запись.Количество = СтрокаРаботы.Длительность;
				Запись.ГодВыпуска = Год(Автомобиль.ГодВыпуска);
				Запись.Пробег = Renault_АвтосервисОбщий.Renault_ПолучитьПробег(Автомобиль);
			КонецЦикла;
			
			Набор.Записать();
			
		КонецЕсли;
		
		Набор = РегистрыНакопления.Renault_ЧастоИспользуемыеЗапчасти.СоздатьНаборЗаписей();
		Набор.Отбор.Регистратор.Установить(Ссылка);
		Набор.Записать();
		
		Если Товары.Количество() <> 0 Тогда
			
			Для Каждого СтрокаТовара ИЗ Товары Цикл
				Запись = Набор.Добавить();
				Запись.Период = Дата;
				Запись.Регистратор = Ссылка;
				Запись.Номенклатура = СтрокаТовара.Номенклатура;
				Запись.Модель = Автомобиль.Модель;
				Запись.Количество = СтрокаТовара.Количество;
				
			КонецЦикла;
			
			Набор.Записать();
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ОтправитьСообщениеАвтору()
	
	Напоминание = Справочники.Renault_СообщенияПользователю.СоздатьЭлемент();
	
	Напоминание.Отправитель = ПараметрыСеанса.Пользователь;
	
	Напоминание.Подробнее = ЭтотОбъект.Обращение.Ссылка;
	
	Напоминание.Адресаты.Добавить().Сотрудник = Автор.Сотрудник;
	
	ДатаОтправки = ТекущаяДата();
	
	Напоминание.ДатаОтправки = ДатаОтправки;
	
	//Напоминание.Комментарий = Примечание;
	
	Напоминание.ПоказыватьС = ДатаОтправки;
	Напоминание.ПоказыватьПо = ДатаОтправки;
	
	Напоминание.Наименование = Автомобиль;
	Напоминание.Сообщение = "Заявка на докомплектацию. Запланированая дата готовности: " + ВремяОкончания + " | ";
	
	Напоминание.Записать();

КонецПроцедуры

Функция ПолучитьВремяОкончания()
	
	Запрос = Новый Запрос();
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	Renault_CRM_ЗаявкаНаСервисЭтапы.КонецЭтапа КАК КонецЭтапа
	|ИЗ
	|	Документ.Renault_CRM_ЗаявкаНаСервис.Этапы КАК Renault_CRM_ЗаявкаНаСервисЭтапы
	|ГДЕ
	|	Renault_CRM_ЗаявкаНаСервисЭтапы.Ссылка.Ссылка = &ЭтотДокумент
	|
	|УПОРЯДОЧИТЬ ПО
	|	КонецЭтапа УБЫВ";
	
	Запрос.УстановитьПараметр("ЭтотДокумент", ЭтотОбъект.Ссылка);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		
		Возврат Выборка.КонецЭтапа;
		
	Иначе
		
		Возврат Дата("00010101000000");
		
	КонецЕсли;
	
КонецФункции

Функция ПолучитьВремяНачала()
	
	Запрос = Новый Запрос();
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	Renault_CRM_ЗаявкаНаСервисЭтапы.НачалоЭтапа КАК НачалоЭтапа
	|ИЗ
	|	Документ.Renault_CRM_ЗаявкаНаСервис.Этапы КАК Renault_CRM_ЗаявкаНаСервисЭтапы
	|ГДЕ
	|	Renault_CRM_ЗаявкаНаСервисЭтапы.Ссылка.Ссылка = &ЭтотДокумент
	|
	|УПОРЯДОЧИТЬ ПО
	|	КонецЭтапа ВОЗР";
	
	Запрос.УстановитьПараметр("ЭтотДокумент", ЭтотОбъект.Ссылка);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		
		Возврат Выборка.НачалоЭтапа;
		
	Иначе
		
		Возврат Дата("00010101000000");
		
	КонецЕсли;
	
КонецФункции

Процедура СопоставитьРаботыИСоставыЭтапов()
	
	Для Каждого Работа из СоставЭтапа Цикл
		
		ЕстьРаботы = ЭтотОбъект.Работы.НайтиСтроки(Новый Структура("IDРаботы", Работа.IDРаботы));
		
		Если ЕстьРаботы.Количество() = 0 Тогда
			
			СоставЭтапа.Удалить(Работа);
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ОбновитьСтатусЭтапаВрегистре(Этап)
	
	ЗаписьСтатуса = РегистрыСведений.Renault_АвтосервисСтатусыРабот.СоздатьМенеджерЗаписи();
	ЗаписьСтатуса.РабочийДокумент = ЭтотОбъект.Ссылка;
	ЗаписьСтатуса.Период = ТекущаяДата();
	ЗаписьСтатуса.Обращение = ЭтотОбъект.Обращение;
	ЗаписьСтатуса.ДилерскийЦентр = ЭтотОбъект.ДилерскийЦентр;
	ЗаписьСтатуса.ЭтапРабот = Этап.IDЭтапа;
	ЗаписьСтатуса.Цех = Этап.Цех;
	ЗаписьСтатуса.СтатусРаботы = Этап.СтатусЭтапа;
	
	Если ЗначениеЗаполнено(ЗаписьСтатуса.СтатусРаботы) Тогда
		
		ЗаписьСтатуса.Записать();
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ОчиститьПланПоЭтапу(Этап)
	
	Если ТипЗнч(Этап) = Тип("Строка") Тогда
		
		IDЭтапа = Этап;
		
	Иначе
		
		IDЭтапа = Этап.IDЭтапа;
		
	КонецЕсли;
	
	ОтборПлана = РегистрыСведений.Renault_АвтосервисПланРабот.СоздатьНаборЗаписей();
	
	ОтборПлана.Отбор.РабочийДокумент.Установить(ЭтотОбъект.Ссылка);
	ОтборПлана.Отбор.ЭтапРабот.Установить(IDЭтапа);
	ОтборПлана.Прочитать();
	ОтборПлана.Очистить();
	ОтборПлана.Записать();
	
	ОтборСтатуса = РегистрыСведений.Renault_АвтосервисСтатусыРабот.СоздатьНаборЗаписей();
	ОтборСтатуса.Отбор.РабочийДокумент.Установить(ЭтотОбъект.Ссылка);
	ОтборСтатуса.Отбор.ЭтапРабот.Установить(IDЭтапа);
	ОтборСтатуса.Прочитать();
	ОтборСтатуса.Очистить();
	ОтборСтатуса.Записать();
	
КонецПроцедуры

Процедура ЗапланироватьЭтап(Этап, Статус)
	
	Если ЗначениеЗаполнено(Этап.НачалоЭтапа) и ЗначениеЗаполнено(Этап.КонецЭтапа) и Этап.ДлительностьЭтапаПлан > 0 Тогда
		
		ОчиститьПланПоЭтапу(Этап);
		
		Запись = РегистрыСведений.Renault_АвтосервисПланРабот.СоздатьМенеджерЗаписи();
		Запись.Обращение = ЭтотОбъект.Обращение;
		Запись.РабочийДокумент = ЭтотОбъект.Ссылка;
		Запись.ДилерскийЦентр = ЭтотОбъект.ДилерскийЦентр;
		Запись.Длительность = Этап.ДлительностьЭтапаПлан;
		Запись.ВремяНачала = Этап.НачалоЭтапа;
		Запись.ВремяОкончания = Этап.КонецЭтапа;
		Запись.ЭтапРабот = Этап.IDЭтапа;
		Запись.Цех = Этап.Цех;
		
		Этап.СтатусЭтапа = Статус;
		
		Запись.Записать();
		
		ЗаписьПлана = РегистрыСведений.Renault_АвтосервисПланОперативный.СоздатьМенеджерЗаписи();
		ЗаполнитьЗначенияСвойств(ЗаписьПлана, Запись);
		ЗаписьПлана.Период = ТекущаяДата();
		ЗаписьПлана.Записать();
		
		ОбновитьСтатусЭтапаВрегистре(Этап);
		
	КонецЕсли;
	
КонецПроцедуры

Процедура СопоставитьЭтапыИРегистры()
	
	ОтборСтатуса = РегистрыСведений.Renault_АвтосервисСтатусыРабот.СоздатьНаборЗаписей();
	ОтборСтатуса.Отбор.РабочийДокумент.Установить(ЭтотОбъект.Ссылка);
	ОтборСтатуса.Прочитать();
	
	Для Каждого Статус из ОтборСтатуса Цикл
		
		ЭтапВЗаявке = ЭтотОбъект.Этапы.Найти(Статус.ЭтапРабот, "IDЭтапа");
		
		Если НЕ ЗначениеЗаполнено(ЭтапВЗаявке) Тогда
			
			ОчиститьПланПоЭтапу(Статус.ЭтапРабот);
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

Функция ПодготовитьФормуЗаявкиКПечати(Ожидает = Ложь, СохранятьЗЧ = Ложь)Экспорт
	
	Если ЗначениеЗаполнено(ДилерскийЦентр) Тогда
		ВнешняяФорма = ДилерскийЦентр.Автосервис_ФормаПечатиЗаявки;
		Если ЗначениеЗаполнено(ВнешняяФорма) Тогда
			Если ВнешняяФорма.ХранитьВоВнешнемФайле = Ложь И ЗначениеЗаполнено(ВнешняяФорма.Хранилище) Тогда
				ДвоичныеДанные = ВнешняяФорма.Хранилище.Получить();
				ИмяВремФайла = ПолучитьИмяВременногоФайла("epf");
				ДвоичныеДанные.Записать(ИмяВремФайла);
				ВнешняяОбработка = ВнешниеОбработки.Создать(ИмяВремФайла);
				ВнешняяОбработка.СсылкаНаОбъект = Ссылка;
				Попытка
					ТабДок = ВнешняяОбработка.Печать();
					Возврат ТабДок;
				Исключение
					Сообщить("Ошибка печати из внешней печатной формы!");
					Возврат Новый ТабличныйДокумент;
				КонецПопытки;
			ИначеЕсли ВнешняяФорма.ХранитьВоВнешнемФайле = Истина И ЗначениеЗаполнено(ВнешняяФорма.ПутьКВнешнемуФайлу) Тогда
				Попытка
					ВнешняяОбработка = ВнешниеОбработки.Создать(ВнешняяФорма.ПутьКВнешнемуФайлу);
					ВнешняяОбработка.СсылкаНаОбъект = Ссылка;
					ТабДок = ВнешняяОбработка.Печать();
					Возврат ТабДок;
				Исключение
					Сообщить("Ошибка печати из внешней печатной формы!");
					Возврат Новый ТабличныйДокумент;
				КонецПопытки;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	#Если Клиент Тогда
		
		Если ДилерскийЦентр.Автосервис_ЗапрашиватьВыборОрганизации Тогда
			
			Форма = Справочники.Организации.ПолучитьФормуВыбора();
			
			Ответ = Форма.ОткрытьМодально();
			
			Если ЗначениеЗаполнено(Ответ) Тогда
				
				Орг = Ответ;
				
			Иначе
				
				Орг = ДилерскийЦентр.Организация;
				
			КонецЕсли;
			
		Иначе
			
			Орг = ДилерскийЦентр.Организация;
			
		КонецЕсли;
		
	#Иначе
		
		Орг = Справочники.Организации.ПустаяСсылка();
		
	#КонецЕсли
	
	ТабДок = Новый ТабличныйДокумент();
	СвязаннаяПриемка = ПолучитьСвязаннуюПриемкуАвто();
	СвязаннаяВыдача = ПолучитьСвязаннуюВыдачуАвто();
	// STRAKHOV
	//Макет = ПолучитьМакет("МакетЗаявка_Версия_1_2");
	// начало dev7 добавлено 13.10.2017
	Если ДилерскийЦентр.Бренд = Справочники.CRM_МаркаАвтомобиля.LADA Тогда
		Макет = ПолучитьМакет("МакетЗаявка_Версия_1_3_LADA");
	Иначе
		//Макет = ПолучитьМакет("МакетЗаявка_Версия_1_3");
		// Трояновский К.Е. 16.08.2019 14:54:53 {
		//Макет = ПолучитьМакет("МакетЗаявка_Версия_1_4");
		Макет = ПолучитьМакет("МакетЗаявка_Версия_1_5");
		// Трояновский К.Е. 16.08.2019 14:54:53 }
	КонецЕсли;
	// окончание dev7 добавлено 13.10.2017
	
	ОбластьШапки = Макет.ПолучитьОбласть("ОбластьШапки");
	
	ШтрихКод = Неопределено;
	
	Попытка
		
		Если ЗначениеЗаполнено(ЗаказНаряд) И ДилерскийЦентр.Автосервис_ИспользоватьШтрихКодЗН = Истина Тогда
			
			ШтрихКод = Renault_ШтрихКодирование.Renault_ПрочитатьШтрихКод(ЗаказНаряд);
			
			Если НЕ ЗначениеЗаполнено(ШтрихКод) Тогда
				
				Renault_ШтрихКодирование.Renault_ЗаписатьШтрихКод(ЗаказНаряд);
				ШтрихКод = Renault_ШтрихКодирование.Renault_ПрочитатьШтрихКод(ЗаказНаряд);
				
			КонецЕсли;
			
		Иначе
			
			Если ДилерскийЦентр.Автосервис_ИспользоватьШтрихКодЗН = Ложь Тогда
				
				ШтрихКод = Renault_ШтрихКодирование.Renault_ПрочитатьШтрихКод(Ссылка);
				
				Если НЕ ЗначениеЗаполнено(ШтрихКод) Тогда
					
					Renault_ШтрихКодирование.Renault_ЗаписатьШтрихКод(Ссылка);
					ШтрихКод = Renault_ШтрихКодирование.Renault_ПрочитатьШтрихКод(Ссылка);
					
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЕсли;
		
		Если ЗначениеЗаполнено(ШтрихКод) Тогда 
			
			ОбластьШапки.Рисунки.ШК.Объект.ТипКода = 1;
			ОбластьШапки.Рисунки.ШК.Объект.Сообщение = ЛЕВ(ШтрихКод, 12);
			
		КонецЕсли;
		
	Исключение
		
		Сообщить("Не удалось сформировать штрих код для документа.");
		
	КонецПопытки;
	
	ЗаполнитьОбластьШапки(ОбластьШапки, СвязаннаяПриемка, СвязаннаяВыдача, Ожидает, СохранятьЗЧ, Орг);
	ТабДок.Вывести(ОбластьШапки);
	ЗаголовокТаблицы = Макет.ПолучитьОбласть("ЗаголовокТаблицы");
	ТабДок.Вывести(ЗаголовокТаблицы);
	ТекСтрока = 1;
	
	//DMSCOR-1004
	//Если Не ЗначениеЗаполнено(ЗаказНаряд) Тогда
		
		Для Каждого ОписаниеРаботы Из Работы Цикл
			
			ОбластьСтрока = Макет.ПолучитьОбласть("СтрокаТаблицы");
			ОбластьСтрока.Параметры.Работа = ОписаниеРаботы.Работа;
			ОбластьСтрока.Параметры.Артикул = ОписаниеРаботы.Работа.Артикул;
			ОбластьСтрока.Параметры.Исполнитель = "";
			ОбластьСтрока.Параметры.Стоимость = ОписаниеРаботы.Сумма;
			ОбластьСтрока.Параметры.Скидка = ОписаниеРаботы.СуммаСкидки;
			ТабДок.Вывести(ОбластьСтрока);
			
		КонецЦикла;
		
		ОбластьПодитогРаботы = Макет.ПолучитьОбласть("ПодитогРаботы");
		ОбластьПодитогРаботы.Параметры.ИтогоРаботы = Работы.Итог("Сумма");
		ОбластьПодитогРаботы.Параметры.Скидка = Работы.Итог("СуммаСкидки");
		ТабДок.Вывести(ОбластьПодитогРаботы);
		
		Для Каждого СтрокаТовара Из Товары Цикл
			
			ОбластьСтрока = Макет.ПолучитьОбласть("СтрокаТаблицыТовары");
			ОбластьСтрока.Параметры.Номенклатура = СтрокаТовара.Номенклатура;
			ОбластьСтрока.Параметры.Артикул = СтрокаТовара.Номенклатура.Артикул;
			ОбластьСтрока.Параметры.Стоимость = СтрокаТовара.Сумма;
			ОбластьСтрока.Параметры.Скидка = СтрокаТовара.СуммаСкидки;
			ТабДок.Вывести(ОбластьСтрока);
			
		КонецЦикла;
		
		ОбластьПодитогТовары = Макет.ПолучитьОбласть("ПодитогТовары");
		ОбластьПодитогТовары.Параметры.ИтогоТовары = Товары.Итог("Сумма");
		ОбластьПодитогТовары.Параметры.Скидка = Товары.Итог("СуммаСкидки");
		ТабДок.Вывести(ОбластьПодитогТовары);
		
	//Иначе 
	//	
	//	Для Каждого ОписаниеРаботы из ЗаказНаряд.Работы Цикл
	//		
	//		ОбластьСтрока = Макет.ПолучитьОбласть("СтрокаТаблицы");
	//		ОбластьСтрока.Параметры.Работа = ОписаниеРаботы.Работа;
	//		ОбластьСтрока.Параметры.Артикул = ОписаниеРаботы.Работа.Артикул;
	//		ОбластьСтрока.Параметры.Исполнитель = "";
	//		ОбластьСтрока.Параметры.Стоимость = ОписаниеРаботы.СуммаВсего;
	//		ОбластьСтрока.Параметры.Скидка = ОписаниеРаботы.СуммаСкидки;
	//		ТабДок.Вывести(ОбластьСтрока);
	//		
	//	КонецЦикла;
	//	
	//	ОбластьПодитогРаботы = Макет.ПолучитьОбласть("ПодитогРаботы");
	//	ОбластьПодитогРаботы.Параметры.ИтогоРаботы = ЗаказНаряд.Работы.Итог("СуммаВсего");
	//	ОбластьПодитогРаботы.Параметры.Скидка = ЗаказНаряд.Работы.Итог("СуммаСкидки");
	//	ТабДок.Вывести(ОбластьПодитогРаботы);
	//	
	//	Для Каждого СтрокаТовара Из ЗаказНаряд.Товары Цикл
	//		
	//		ОбластьСтрока = Макет.ПолучитьОбласть("СтрокаТаблицыТовары");
	//		ОбластьСтрока.Параметры.Номенклатура = СтрокаТовара.Номенклатура;
	//		ОбластьСтрока.Параметры.Артикул = "-";
	//		ОбластьСтрока.Параметры.Стоимость = СтрокаТовара.СуммаВсего;
	//		ОбластьСтрока.Параметры.Скидка = СтрокаТовара.СуммаСкидки;
	//		ТабДок.Вывести(ОбластьСтрока);
	//		
	//	КонецЦикла;
	//	
	//	ОбластьПодитогТовары = Макет.ПолучитьОбласть("ПодитогТовары");
	//	ОбластьПодитогТовары.Параметры.ИтогоТовары = ЗаказНаряд.Товары.Итог("СуммаВсего");
	//	ОбластьПодитогТовары.Параметры.Скидка = ЗаказНаряд.Товары.Итог("СуммаСкидки");
	//	ТабДок.Вывести(ОбластьПодитогТовары);
	//	
	//КонецЕсли;
	
	Итоги = Макет.ПолучитьОбласть("Итоги");
	ЗаполнитьИтоги(Итоги);
	ТабДок.Вывести(Итоги);
	ОбластьКомментариев = Макет.ПолучитьОбласть("ОбластьКомментариев");
	ЗаполнитьОбластьКомментариев(ОбластьКомментариев);
	
	ОбластьКомментариев = Макет.ПолучитьОбласть("ОбластьКомментариев");
	
	Если ЗначениеЗаполнено(ЗаказНаряд) Тогда
		
		ОбластьКомментариев.Параметры.Комментарии = Строка(ЗаказНаряд.ПричинаОбращения);
		
	Иначе
		
		ОбластьКомментариев.Параметры.Комментарии = Обращение.Примечание;
		
	КонецЕсли;
	
	ТабДок.Вывести(ОбластьКомментариев);
	ВтораяСтраница = Макет.ПолучитьОбласть("ВтораяСтраница");
	ЗаполнитьВторуюСтраницу(ВтораяСтраница, СвязаннаяПриемка, СвязаннаяВыдача);
	
	Попытка
		Если (Товары.Количество() + Работы.Количество() > 5) ИЛИ (Не ТабДок.ПроверитьВывод(ВтораяСтраница))  Тогда
			ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
	Исключение
	КонецПопытки;
	
	ТабДок.Вывести(ВтораяСтраница);
	
	ТабДок.ВывестиВертикальныйРазделительСтраниц();
	
	ДопПоложение = Макет.ПолучитьОбласть("ДопПоложение");
	Если Не ПустаяСтрока(ДилерскийЦентр.Автосервис_ЮрИнфаЗаявка) Тогда
		ДопПоложение.Параметры.ОбщиеУсловия = ДилерскийЦентр.Автосервис_ЮрИнфаЗаявка;
		//Если Не ТабДок.ПроверитьВывод(ДопПоложение) Тогда
		Если СтрЧислоСтрок(ДилерскийЦентр.Автосервис_ЮрИнфаЗаявка) > 42 Тогда
			ДопПоложение.Параметры.ОбщиеУсловия = РазделитьСтрокуНаПодстроки(ДилерскийЦентр.Автосервис_ЮрИнфаЗаявка,1,42);
			ТабДок.Вывести(ДопПоложение);
			ЮридическаяИнформация = Макет.ПолучитьОбласть("ЮридическаяИнформация");
			ЮридическаяИнформация.Параметры.ЮрИнфа = РазделитьСтрокуНаПодстроки(ДилерскийЦентр.Автосервис_ЮрИнфаЗаявка,43,СтрЧислоСтрок(ДилерскийЦентр.Автосервис_ЮрИнфаЗаявка));
			ТабДок.Вывести(ЮридическаяИнформация);
		Иначе
			ТабДок.Вывести(ДопПоложение);
		КонецЕсли;
	Иначе
		ТабДок.Вывести(ДопПоложение);
		ТабДок.Вывести(Макет.ПолучитьОбласть("ОбщиеУсловия"));
	КонецЕсли;
	
	// Трояновский К.Е. 16.08.2019 16:30:55 {
	//МассивСтрокЮрИнфо = Renault_СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(ДилерскийЦентр.Автосервис_ЮрИнфаЗаявка, Символы.ПС);
	//
	//Для Каждого СтрокаИнфы из МассивСтрокЮрИнфо Цикл
	//
	//	ОбластьЮрИнфо = Макет.ПолучитьОбласть("ЮридическаяИнформация");
	//	ОбластьЮрИнфо.ТекущаяОбласть.АвтоВысотаСтроки = Истина;
	//	ОбластьЮрИнфо.Параметры.ЮрИнфа = СтрокаИнфы;
	//	ТабДок.Вывести(ОбластьЮрИнфо);
	//
	//КонецЦикла;
	// Трояновский К.Е. 16.08.2019 16:30:55 }
	
	ОбластьПодпись = Макет.ПолучитьОбласть("ПодписьЗаказчик");
	ТабДок.Вывести(ОбластьПодпись);

	Если НЕ ДилерскийЦентр.АвтосервисНеВыводитьВЗаявкуПосты Тогда 	
		//Если Этапы.Количество() > 0 Тогда
			СтрШапкаПлан = Макет.ПолучитьОбласть("СтрШапкаПлан");
			ТабДок.Вывести(СтрШапкаПлан);
		//КонецЕсли;
		
		Для Каждого Этап из Этапы Цикл
			
			СтрокаПлана = Макет.ПолучитьОбласть("СтрокаПоста");
			ЗаполнитьСтрокуПланаРабот(СтрокаПлана, Этап, ТекСтрока);
			ТабДок.Вывести(СтрокаПлана);
			
		КонецЦикла;
		
		Если ЗначениеЗаполнено(СвязаннаяВыдача) Тогда
			СтрВыдача = Макет.ПолучитьОбласть("СтрВыдача");
			СтрВыдача.Параметры.Выдача = "Выдача: " + Строка(СвязаннаяВыдача.Машиноместо) + " " + Строка(СвязаннаяВыдача.ВремяНачала);
			ТабДок.Вывести(СтрВыдача);
		КонецЕсли;
		
		СтрКомментарий = Макет.ПолучитьОбласть("СтрКомментарий");
		СтрКомментарий.Параметры.Комментарий = Обращение.Примечание;
		
		ТабДок.Вывести(СтрКомментарий);
	
	КонецЕсли;
	
	ТабДок.НижнийКолонтитул.Выводить = Истина;
	ТабДок.НижнийКолонтитул.ТекстВЦентре = "[&НомерСтраницы] из [&СтраницВсего]";
	
	Возврат ТабДок;
	
КонецФункции
//DMSREN-172
Функция ВыдачаКПечати() Экспорт
	ТабДок = Новый ТабличныйДокумент();
	СвязаннаяПриемка = ПолучитьСвязаннуюПриемкуАвто();
	СвязаннаяВыдача = ПолучитьСвязаннуюВыдачуАвто();
	#Если Клиент Тогда
		
		Если ДилерскийЦентр.Автосервис_ЗапрашиватьВыборОрганизации Тогда
			
			Форма = Справочники.Организации.ПолучитьФормуВыбора();
			
			Ответ = Форма.ОткрытьМодально();
			
			Если ЗначениеЗаполнено(Ответ) Тогда
				
				Орг = Ответ;
				
			Иначе
				
				Орг = ДилерскийЦентр.Организация;
				
			КонецЕсли;
			
		Иначе
			
			Орг = ДилерскийЦентр.Организация;
			
		КонецЕсли;
		
	#Иначе
		
		Орг = Справочники.Организации.ПустаяСсылка();
		
	#КонецЕсли

	// Трояновский К.Е. 16.08.2019 15:14:54 {
	//Макет = ПолучитьМакет("МакетВыдачи");
	Макет = ПолучитьМакет("МакетВыдачи_Версия_1_1");
	// Трояновский К.Е. 16.08.2019 15:14:54 }
	
	ОбластьШапки = Макет.ПолучитьОбласть("Шапка");
	Если ЗначениеЗаполнено(ДилерскийЦентр) Тогда
		
		ОбластьШапки.Параметры.НазваниеВРекламе = ДилерскийЦентр.НаименованиеДляПечати;
		
		ЮрНаименование = "Юридическое наименование, адрес: "+ Орг.НаименованиеПолное + " ИНН: " + Орг.ИНН + " адрес: "+ ДилерскийЦентр.ОсновнойАдрес;
		ТелефонДилера = ДилерскийЦентр.ОсновнойТелефон;
		ОбластьШапки.Параметры.ЮрРеквизиты = ЮрНаименование;
		ОбластьШапки.Параметры.ТелефонДилера = ТелефонДилера;
		ЗначениеЛоготипа = ДилерскийЦентр.ЛоготипДЦ.Получить();
		
	КонецЕсли;
	Если ЗначениеЗаполнено(СвязаннаяПриемка) Тогда
		
		ОбластьШапки.Параметры.МастерПриемщик  = СвязаннаяПриемка.Машиноместо;
		ОбластьШапки.Параметры.ДатаПриема  = СвязаннаяПриемка.ВремяОкончания;//.Дата;//.ВремяНачала;
	
	КонецЕсли;
	
	Если ЗначениеЗаполнено(СвязаннаяВыдача)И ЗначениеЗаполнено(СвязаннаяВыдача.ВремяОкончания) Тогда
		ОбластьШапки.Параметры.ВремяВыдачиАвтомобиля = Формат(СвязаннаяВыдача.ВремяОкончания,"ДФ=""дд.ММ.гггг ЧЧ:мм""");
	КонецЕсли;
	
	
	// Трояновский К.Е. 12.09.2019 12:21:18 {
	//ТекстЗаявка = "Заявка на ремонт №"+ Ссылка.Номер+" от "+ Формат(Ссылка.Дата,"ДФ=""дд.ММ.гггг""");
	Если ЗначениеЗаполнено(ЗаказНаряд) Тогда
		// Трояновский К.Е. 28.10.2019 14:28:50 { // DMSREN-399 вренул на дату документа
		ТекстЗаявка = "Гарантийный Заказ-Наряд №"+ ЗаказНаряд.Номер +" от " + Формат(ЗаказНаряд.Дата,"ДФ=""дд.ММ.гггг""");
		//ТекстЗаявка = "Гарантийный Заказ-Наряд №"+ ЗаказНаряд.Номер +" от " + Формат(ЗаказНаряд.ДатаМашинозаезда,"ДФ=""дд.ММ.гггг""");		
		// Трояновский К.Е. 28.10.2019 14:28:50 }
	Иначе
		ТекстЗаявка = "Гарантийный Заказ-Наряд";
	КонецЕсли;
	// Трояновский К.Е. 12.09.2019 12:21:18 }
	
	Если ЗначениеЗаполнено(ЗаказНаряд) Тогда
		
		// Трояновский К.Е. 12.09.2019 12:28:34 {
		//ТекстЗаявка = ТекстЗаявка + " " + ЗаказНаряд.Номер + " от " + Формат(ЗаказНаряд.Дата,"ДФ=""дд.ММ.гггг""");
		// Трояновский К.Е. 12.09.2019 12:28:34 }
		ОбластьШапки.Параметры.ДН = ЗаказНаряд.ДатаОкончания;		
	КонецЕсли;
	
	мКлиент = Клиент;
	Если ЗначениеЗаполнено(ЗаказНаряд) Тогда
		
		мКлиент = ЗаказНаряд.Заказчик; // DMSREN-571
		АвтомобильПечать = ЗаказНаряд.Автомобиль;
		
		Если ЗаказНаряд.Автомобиль <> Автомобиль Тогда
			
			//вставить сюда сообщение пользователю
			
		КонецЕсли;
		
	Иначе
		
		АвтомобильПечать = Автомобиль;
		
	КонецЕсли;
	
	ГосНомерА = Справочники.Автомобили.ЧтениеЗначенияРегистраСведения(АвтомобильПечать, Перечисления.ДополнительнаяИнформацияАвтомобилей.ГосНомер);
	
	ОбластьШапки.Параметры.ЗаявкаНаРемонт = ТекстЗаявка;
	ОбластьШапки.Параметры.ГосНомер = ?(ЗначениеЗаполнено(ГосНомерА), ГосНомерА,
	?(ЗначениеЗаполнено(СвязаннаяПриемка), СвязаннаяПриемка.ГосНомер, ""));
	ОбластьШапки.Параметры.Заказчик = СокрЛП(мКлиент.НаименованиеПолное);
	АдресЗакзачика = ПолучитьАдресКлиента(мКлиент);
	ОбластьШапки.Параметры.АдресЗаказчика = АдресЗакзачика;
	АвтомобильОписание = "";
	Если ЗначениеЗаполнено(АвтомобильПечать) тогда
		АвтомобильОписание = АвтомобильОписание + АвтомобильПечать.Модель.Наименование + ", гос. номер " + ГосНомерА +
		", VIN " + АвтомобильПечать.VIN + ", год выпуска " + Формат(АвтомобильПечать.ГодВыпуска, "ДФ=""гггг""") + ", пробег " + Справочники.Автомобили.ЧтениеЗначенияРегистраСведения(АвтомобильПечать.Ссылка, Перечисления.ДополнительнаяИнформацияАвтомобилей.Пробег);
		АвтомобильВладелец = Справочники.Автомобили.ЧтениеЗначенияРегистраСведения(АвтомобильПечать.Ссылка, 
		Перечисления.ДополнительнаяИнформацияАвтомобилей.Хозяин);
		ОбластьШапки.параметры.Автомобиль = АвтомобильОписание;
		АдресВладельца = ПолучитьАдресКлиента(АвтомобильВладелец);
		ОбластьШапки.Параметры.Владелец = ?(ЗначениеЗаполнено(АвтомобильВладелец), АвтомобильВладелец.НаименованиеПолное, "");
		ОбластьШапки.параметры.АдресВладельца = АдресВладельца;
	КонецЕсли;
	пПлательщик = ?(КлиентЯвляетсяПлательщиком,мКлиент, ?(ЗначениеЗаполнено(Плательщик), Плательщик, мКлиент));
	// Трояновский К.Е. 17.09.2019 15:24:00 {
	//ДанныеПлательщика = ПолучитьДанныеПлательщика(пПлательщик);
	ДанныеПлательщика = "Телефон клиента: " + ТелефонСКомментариями(пПлательщик);
	СвязаннаяПриемка = ПолучитьСвязаннуюПриемкуАвто();
	//+/Блинков// Исправлен баг со значением Неопределено СвязаннаяПриемка DMSREN-733
	ОбластьШапки.Параметры.СтоимостьАвтомобиля = ?(СвязаннаяПриемка = Неопределено, 0,Формат(СвязаннаяПриемка.СтоимостьАвтомобиля,"ЧЦ=10; ЧДЦ=2"));
	//-/Блинков// Исправлен баг со значением Неопределено СвязаннаяПриемка DMSREN-733

	// Трояновский К.Е. 17.09.2019 15:24:00 }
	
	Если ЗначениеЗаполнено(пПлательщик)Тогда
		// Трояновский К.Е. 09.09.2019 13:22:04 {
		// DMSREN-263
		//ОбластьШапки.Параметры.Плательщик = пПлательщик.НаименованиеПолное;		
		// Трояновский К.Е. 09.09.2019 13:22:04 }
		ОбластьШапки.Параметры.ДанныеПлательщика = ДанныеПлательщика;
	КонецЕсли;
	
	// Трояновский К.Е. 17.09.2019 15:24:54 {
	//ОбластьШапки.Параметры.email = "e-mail: " + Renault_CRM.ПолучитьЕмаилКлиент(Клиент);
	ОбластьШапки.Параметры.email = "e-mail клиента: " + Renault_CRM.ПолучитьЕмаилКлиент(мКлиент);	
	// Трояновский К.Е. 17.09.2019 15:24:54 }

	Если ЗначениеЗаполнено(ЗаказНаряд) Тогда
		
		ОбластьШапки.Параметры.Комментарии = Строка(ЗаказНаряд.ПричинаОбращения);
		
	Иначе
		
		ОбластьШапки.Параметры.Комментарии = Обращение.Примечание;
		
	КонецЕсли;
	
	#Если Клиент Тогда
		ФормаДиалога = Документы.Renault_CRM_ЗаявкаНаСервис.ПолучитьФорму("ФормаВводаКомментарий",Форма);	
		ФормаДиалога.ЭлементыФормы.КомментарийМенеджера.Значение = КомментарииМенеджера;
		
		Если ЗначениеЗаполнено(ЗаказНаряд) тогда
			
			Для Каждого ТекСтр из ЗаказНаряд.Работы цикл
				НовСтр = ФормаДиалога.ЭлементыФормы.Работы.Значение.Добавить();
				ЗаполнитьЗначенияСвойств(НовСтр,ТекСтр);								
			КонецЦикла;	
			
		КонецЕсли;	
		
		РезКомм = ФормаДиалога.ОткрытьМодально();
		
		Если РезКомм<>"" тогда
			КомментарииМенеджера = РезКомм;
			Записать();		
		КонецЕсли;	
		
	#КонецЕсли

	ОбластьШапки.Параметры.КомментарииМенеджера =  КомментарииМенеджера;
	ТабДок.Вывести(ОбластьШапки);
	
	ОбластьСтроки = Макет.ПолучитьОбласть("Строка");
	// Трояновский К.Е. 28.10.2019 11:11:00 {
	//Для Каждого стр из Товары Цикл
	//	ОбластьСтроки.Параметры.Материал = Стр.Номенклатура.Наименование;
	//	ОбластьСтроки.Параметры.Кол = Стр.Количество;
	//	ТабДок.Вывести(ОбластьСтроки);
	//КонецЦикла;
	Если ЗначениеЗаполнено(ЗаказНаряд) Тогда
		Для Каждого СтрокаТовары Из ЗаказНаряд.Товары Цикл
			ОбластьСтроки.Параметры.Материал = СтрокаТовары.Номенклатура.Наименование;
			ОбластьСтроки.Параметры.Кол = СтрокаТовары.Количество;
			ТабДок.Вывести(ОбластьСтроки);
	    КонецЦикла;
	Иначе             
		Для Каждого СтрокаТовары Из Товары Цикл
			ОбластьСтроки.Параметры.Материал = СтрокаТовары.Номенклатура.Наименование;
			ОбластьСтроки.Параметры.Кол = СтрокаТовары.Количество;
			ТабДок.Вывести(ОбластьСтроки);
	    КонецЦикла;
	КонецЕсли;		
	// Трояновский К.Е. 28.10.2019 11:11:00 }
    ОбластьПодвал = Макет.ПолучитьОбласть("Подвал");
	ПоврежденияАвто = ПолучитьПовреждения(Автомобиль);
	ОбнаруженныеПоврежденияАвтомобиля = ОтобразитьПовреждения(ОбластьПодвал, ПоврежденияАвто);
	ОбластьПодвал.Параметры.ОбнаруженныеПоврежденияАвтомобиля = ОбнаруженныеПоврежденияАвтомобиля;

	ОбластьПодвал.Параметры.ДилерскаяИнформация = ЮрНаименование;
    ТабДок.Вывести(ОбластьПодвал);
  


	Возврат ТабДок;
	
КонецФункции
	
//DMSREN-172

//Корзюков
Функция ВыдачаКПечатиДляОТО() Экспорт
	ТабДок = Новый ТабличныйДокумент();
	СвязаннаяПриемка = ПолучитьСвязаннуюПриемкуАвто();
	СвязаннаяВыдача = ПолучитьСвязаннуюВыдачуАвто();
	#Если Клиент Тогда
		
		Если ДилерскийЦентр.Автосервис_ЗапрашиватьВыборОрганизации Тогда
			
			Форма = Справочники.Организации.ПолучитьФормуВыбора();
			
			Ответ = Форма.ОткрытьМодально();
			
			Если ЗначениеЗаполнено(Ответ) Тогда
				
				Орг = Ответ;
				
			Иначе
				
				Орг = ДилерскийЦентр.Организация;
				
			КонецЕсли;
			
		Иначе
			
			Орг = ДилерскийЦентр.Организация;
			
		КонецЕсли;
		
	#Иначе
		
		Орг = Справочники.Организации.ПустаяСсылка();
		
	#КонецЕсли

		Макет = ПолучитьМакет("МакетВыдачи_Версия_Для_ОТО");
		
	ОбластьШапки = Макет.ПолучитьОбласть("Шапка");
	Если ЗначениеЗаполнено(ДилерскийЦентр) Тогда
		
		ОбластьШапки.Параметры.НазваниеВРекламе = ДилерскийЦентр.НаименованиеДляПечати;
		
		ЮрНаименование = "Юридическое наименование, адрес: "+ Орг.НаименованиеПолное + " ИНН: " + Орг.ИНН + " адрес: "+ ДилерскийЦентр.ОсновнойАдрес;
		ТелефонДилера = ДилерскийЦентр.ОсновнойТелефон;
		ОбластьШапки.Параметры.ЮрРеквизиты = ЮрНаименование;
		ОбластьШапки.Параметры.ТелефонДилера = ТелефонДилера;
		ЗначениеЛоготипа = ДилерскийЦентр.ЛоготипДЦ.Получить();
		
	КонецЕсли;
	Если ЗначениеЗаполнено(СвязаннаяПриемка) Тогда
		
		ОбластьШапки.Параметры.МастерПриемщик  = СвязаннаяПриемка.Машиноместо;
		ОбластьШапки.Параметры.ДатаПриема  = СвязаннаяПриемка.ВремяОкончания;//.Дата;//.ВремяНачала;
	
	КонецЕсли;
	
	Если ЗначениеЗаполнено(СвязаннаяВыдача)И ЗначениеЗаполнено(СвязаннаяВыдача.ВремяОкончания) Тогда
		ОбластьШапки.Параметры.ВремяВыдачиАвтомобиля = Формат(СвязаннаяВыдача.ВремяОкончания,"ДФ=""дд.ММ.гггг ЧЧ:мм""");
	КонецЕсли;
	
	
	Если ЗначениеЗаполнено(ЗаказНаряд) Тогда
		ТекстЗаявка = "Гарантийный Заказ-Наряд №"+ ЗаказНаряд.Номер +" от " + Формат(ЗаказНаряд.Дата,"ДФ=""дд.ММ.гггг""");
	Иначе
		ТекстЗаявка = "Гарантийный Заказ-Наряд";
	КонецЕсли;

	
	Если ЗначениеЗаполнено(ЗаказНаряд) Тогда
		ОбластьШапки.Параметры.ДН = ЗаказНаряд.ДатаОкончания;		
	КонецЕсли;

	мКлиент = Клиент;
	Если ЗначениеЗаполнено(ЗаказНаряд) Тогда
		
		мКлиент = ЗаказНаряд.Заказчик; // DMSREN-1146
		АвтомобильПечать = ЗаказНаряд.Автомобиль;
		
		Если ЗаказНаряд.Автомобиль <> Автомобиль Тогда
			
			//вставить сюда сообщение пользователю
			
		КонецЕсли;
		
	Иначе
		
		АвтомобильПечать = Автомобиль;
		
	КонецЕсли;
	
	ГосНомерА = Справочники.Автомобили.ЧтениеЗначенияРегистраСведения(АвтомобильПечать, Перечисления.ДополнительнаяИнформацияАвтомобилей.ГосНомер);
	
	ОбластьШапки.Параметры.ЗаявкаНаРемонт = ТекстЗаявка;
	ОбластьШапки.Параметры.ГосНомер = ?(ЗначениеЗаполнено(ГосНомерА), ГосНомерА,
	?(ЗначениеЗаполнено(СвязаннаяПриемка), СвязаннаяПриемка.ГосНомер, ""));
	ОбластьШапки.Параметры.Заказчик = СокрЛП(мКлиент.НаименованиеПолное);
	АдресЗакзачика = ПолучитьАдресКлиента(мКлиент);
	ОбластьШапки.Параметры.АдресЗаказчика = АдресЗакзачика;
	АвтомобильОписание = "";
	Если ЗначениеЗаполнено(АвтомобильПечать) тогда
		АвтомобильОписание = АвтомобильОписание + АвтомобильПечать.Модель.Наименование + ", гос. номер " + ГосНомерА +
		", VIN " + АвтомобильПечать.VIN + ", год выпуска " + Формат(АвтомобильПечать.ГодВыпуска, "ДФ=""гггг""") + ", пробег " + Справочники.Автомобили.ЧтениеЗначенияРегистраСведения(АвтомобильПечать.Ссылка, Перечисления.ДополнительнаяИнформацияАвтомобилей.Пробег);
		АвтомобильВладелец = Справочники.Автомобили.ЧтениеЗначенияРегистраСведения(АвтомобильПечать.Ссылка, 
		Перечисления.ДополнительнаяИнформацияАвтомобилей.Хозяин);
		ОбластьШапки.параметры.Автомобиль = АвтомобильОписание;
		АдресВладельца = ПолучитьАдресКлиента(АвтомобильВладелец);
		ОбластьШапки.Параметры.Владелец = ?(ЗначениеЗаполнено(АвтомобильВладелец), АвтомобильВладелец.НаименованиеПолное, "");
		ОбластьШапки.параметры.АдресВладельца = АдресВладельца;
	КонецЕсли;
	пПлательщик = ?(КлиентЯвляетсяПлательщиком,мКлиент, ?(ЗначениеЗаполнено(Плательщик), Плательщик, мКлиент));
	ДанныеПлательщика = "Телефон клиента: " + ТелефонСКомментариями(пПлательщик);
	СвязаннаяПриемка = ПолучитьСвязаннуюПриемкуАвто();
	//+/Блинков// Исправлен баг со значением Неопределено СвязаннаяПриемка DMSREN-733
	ОбластьШапки.Параметры.СтоимостьАвтомобиля = ?(СвязаннаяПриемка = Неопределено, 0,Формат(СвязаннаяПриемка.СтоимостьАвтомобиля,"ЧЦ=10; ЧДЦ=2"));
	//-/Блинков// Исправлен баг со значением Неопределено СвязаннаяПриемка DMSREN-733

	
	Если ЗначениеЗаполнено(пПлательщик)Тогда
		ОбластьШапки.Параметры.ДанныеПлательщика = ДанныеПлательщика;
	КонецЕсли;
	
	ОбластьШапки.Параметры.email = "e-mail клиента: " + Renault_CRM.ПолучитьЕмаилКлиент(мКлиент);	
	
	ТабДок.Вывести(ОбластьШапки);
	
	#Если Клиент Тогда
			
		ОбластьРаботы = Макет.ПолучитьОбласть("Работы");
		Если ЗначениеЗаполнено(ЗаказНаряд) тогда
			
			Для Каждого ТекСтр из ЗаказНаряд.Работы цикл
				
				ОбластьРаботы.Параметры.Работы = ТекСтр.Работа.Наименование;
				ТабДок.Вывести(ОбластьРаботы);
				
			КонецЦикла;
		Иначе
			
			Для Каждого ТекСтр Из Работы Цикл
				ОбластьРаботы.Параметры.Работы = ТекСтр.Работа.Наименование;
				
				ТабДок.Вывести(ОбластьРаботы);
			КонецЦикла;
			
		КонецЕсли;	
				
	#КонецЕсли

	
	ОбластьЗапЧасти = Макет.ПолучитьОбласть("ЗапЧасти");
	ТабДок.Вывести(ОбластьЗапЧасти);
	
	ОбластьСтроки = Макет.ПолучитьОбласть("Строка");
	
	Если ЗначениеЗаполнено(ЗаказНаряд) Тогда
		Для Каждого СтрокаТовары Из ЗаказНаряд.Товары Цикл
			ОбластьСтроки.Параметры.Материал = СтрокаТовары.Номенклатура.Наименование;
			ОбластьСтроки.Параметры.Кол = СтрокаТовары.Количество;
			ТабДок.Вывести(ОбластьСтроки);
	    КонецЦикла;
	Иначе             
		Для Каждого СтрокаТовары Из Товары Цикл
			ОбластьСтроки.Параметры.Материал = СтрокаТовары.Номенклатура.Наименование;
			ТабДок.Вывести(ОбластьСтроки);
	    КонецЦикла;
	КонецЕсли;		
    ОбластьПодвал = Макет.ПолучитьОбласть("Подвал");
	ПоврежденияАвто = ПолучитьПовреждения(Автомобиль);
	ОбнаруженныеПоврежденияАвтомобиля = ОтобразитьПовреждения(ОбластьПодвал, ПоврежденияАвто);
	ОбластьПодвал.Параметры.ОбнаруженныеПоврежденияАвтомобиля = ОбнаруженныеПоврежденияАвтомобиля;

	ОбластьПодвал.Параметры.ДилерскаяИнформация = ЮрНаименование;
    ТабДок.Вывести(ОбластьПодвал);
  


	Возврат ТабДок;
	
КонецФункции
	
//Корзюков

Процедура ЗаполнитьОбластьШапки(ОбластьШапки,СвязаннаяПриемка,СвязаннаяВыдача, Ожидает, СохранятьЗЧ, Орг)
	
	Если ЗначениеЗаполнено(ДилерскийЦентр) Тогда
		
		ОбластьШапки.Параметры.НазваниеВРекламе = ДилерскийЦентр.НаименованиеДляПечати;
		
		ЮрНаименование = "Юридическое наименование, адрес: "+ Орг.НаименованиеПолное + " ИНН: " + Орг.ИНН + " адрес: "+ ДилерскийЦентр.ОсновнойАдрес;
		ТелефонДилера = ДилерскийЦентр.ОсновнойТелефон;
		ОбластьШапки.Параметры.ЮрРеквизиты = ЮрНаименование;
		ОбластьШапки.Параметры.ТелефонДилера = ТелефонДилера;
		ЗначениеЛоготипа = ДилерскийЦентр.ЛоготипДЦ.Получить();
		Если ТипЗнч(ЗначениеЛоготипа) = ТИП("Картинка") Тогда
			ОбластьШапки.Рисунки.РисунокЛоготипДилера.Картинка = ЗначениеЛоготипа;
		Иначе
			//ОбластьШапки.Рисунки.Удалить(ОбластьШапки.Рисунки.РисунокЛоготипДилера);
		КонецЕсли;
		
	КонецЕсли;
	
	Если ЗначениеЗаполнено(СвязаннаяПриемка) Тогда
		
		ОбластьШапки.Параметры.МастерПриемщик  = СвязаннаяПриемка.Машиноместо;
		ОбластьШапки.Параметры.ДатаПриема  = Формат(СвязаннаяПриемка.ВремяОкончания,"ДФ=""дд.ММ.гггг ЧЧ:мм""");//СвязаннаяПриемка.ВремяНачала;

        //DMSREN-1326
		Если Ожидает = Истина И СвязаннаяПриемка.Состояние = Справочники.Renault_ВидыСостоянийДокументовАвтосервиса.Выполнен Тогда
			ОбластьШапки.Параметры.КлиентОжидает = "Клиент ожидает";
		ИначеЕсли Ожидает = Ложь И СвязаннаяПриемка.Состояние = Справочники.Renault_ВидыСостоянийДокументовАвтосервиса.Выполнен Тогда
			ОбластьШапки.Параметры.КлиентОжидает = "Клиент уедет";
			ИначеЕсли Ожидает = Ложь И СвязаннаяПриемка.Состояние = Справочники.Renault_ВидыСостоянийДокументовАвтосервиса.Заявка Тогда
			ОбластьШапки.Параметры.КлиентОжидает = "";
		КонецЕсли;
		
		Если СохранятьЗЧ = истина Тогда
			ОбластьШапки.Параметры.СохранятьЗЧ = "ДА";
		Иначе
			ОбластьШапки.Параметры.СохранятьЗЧ = "НЕТ";
		КонецЕсли;
		
		// STRAKHOV
		ОбластьШапки.Параметры.СтоимостьАвтомобиля = Формат(СвязаннаяПриемка.СтоимостьАвтомобиля,"ЧЦ=10; ЧДЦ=2");

	КонецЕсли;
	//Если СохранятьЗамененныеЧасти Тогда                                     
	//	ОбластьШапки.Рисунки.Картинка =  БиблиотекаКартинок.Renault_ПолеКлеткиГалка;
	//КонецЕсли;
	Если ЗначениеЗаполнено(СвязаннаяВыдача)И ЗначениеЗаполнено(СвязаннаяВыдача.ВремяНачала) Тогда
		ОбластьШапки.Параметры.ВремяВыдачиАвтомобиля = Формат(СвязаннаяВыдача.ВремяНачала,"ДФ=""дд.ММ.гггг ЧЧ:мм""");
	КонецЕсли;
	
	ТекстЗаявка = "Заявка на ремонт №"+ Ссылка.Номер+" от "+ Формат(Ссылка.ВремяНачала,"ДФ=""дд.ММ.гггг""");
	
	Если ЗначениеЗаполнено(ЗаказНаряд) Тогда
		
		// Трояновский К.Е. 28.10.2019 14:35:18 {
		//ТекстЗаявка = ТекстЗаявка + " " + ЗаказНаряд.Номер + " от " + Формат(ЗаказНаряд.Дата,"ДФ=""дд.ММ.гггг""")
		//ТекстЗаявка = ТекстЗаявка + " " + ЗаказНаряд.Номер + " от " + Формат(ЗаказНаряд.ДатаМашинозаезда,"ДФ=""дд.ММ.гггг""");		
		ТекстЗаявка = ТекстЗаявка + " ЗН №" + ЗаказНаряд.Номер + " от " + Формат(ЗаказНаряд.ДатаНачала,"ДФ=""дд.ММ.гггг"""); //Сергеев В.Н. DMSREN-859		
		// Трояновский К.Е. 28.10.2019 14:35:18 }
		
	КонецЕсли;
	мКлиент = Клиент;
	пПлательщик = ?(КлиентЯвляетсяПлательщиком,Клиент, ?(ЗначениеЗаполнено(Плательщик), Плательщик, Клиент));
	Если ЗначениеЗаполнено(ЗаказНаряд) Тогда
		
		АвтомобильПечать = ЗаказНаряд.Автомобиль;
		// DMSREN-1186 Подтягивает клиента и плательщика из ЗН, если он есть
		мКлиент = ЗаказНаряд.Заказчик;
		пПлательщик = ?(ЗначениеЗаполнено(ЗаказНаряд.Контрагент),ЗаказНаряд.Контрагент,пПлательщик);
		// DMSREN-1186 ----
		Если ЗаказНаряд.Автомобиль <> Автомобиль Тогда
			
			//вставить сюда сообщение пользователю
			
		КонецЕсли;
		
	Иначе
		
		АвтомобильПечать = Автомобиль;
		
	КонецЕсли;
	
	ГосНомерА = Справочники.Автомобили.ЧтениеЗначенияРегистраСведения(АвтомобильПечать, Перечисления.ДополнительнаяИнформацияАвтомобилей.ГосНомер);
	
	Скидки = Renault_АвтосервисСкидки.НайтиДоступныеСкидкиПоКлиенту(Клиент);
	
	Если ЗначениеЗаполнено(Скидки) Тогда 
		
		НомерКарты = Скидки[0].Номер_Карты;
		
	КонецЕсли;
	
	ОбластьШапки.Параметры.ЗаявкаНаРемонт = ТекстЗаявка;
	ОбластьШапки.Параметры.ГосНомер = ?(ЗначениеЗаполнено(ГосНомерА), ГосНомерА,
	?(ЗначениеЗаполнено(СвязаннаяПриемка), СвязаннаяПриемка.ГосНомер, ""));
	ОбластьШапки.Параметры.Заказчик = СокрЛП(мКлиент.НаименованиеПолное);
	АдресЗакзачика = ПолучитьАдресКлиента(мКлиент);
	//Сергеев В.Н. DMSREN-970
	ТелефонЗаказчика = ТелефонСКомментариями(мКлиент);
	ТелефонЗаказчика = ?(ПустаяСтрока(ТелефонЗаказчика),""," Телефон: " + ТелефонЗаказчика);
	//----------------------
	ОбластьШапки.Параметры.АдресЗаказчика = АдресЗакзачика + ТелефонЗаказчика;
	АвтомобильОписание = "";
	Если ЗначениеЗаполнено(АвтомобильПечать) тогда
		АвтомобильОписание = АвтомобильОписание + АвтомобильПечать.Модель.Наименование + ", гос. номер " + ГосНомерА +
		", VIN " + АвтомобильПечать.VIN + ", год выпуска " + Формат(АвтомобильПечать.ГодВыпуска, "ДФ=""гггг""") + ", пробег " + Справочники.Автомобили.ЧтениеЗначенияРегистраСведения(АвтомобильПечать.Ссылка, Перечисления.ДополнительнаяИнформацияАвтомобилей.Пробег);
		АвтомобильВладелец = Справочники.Автомобили.ЧтениеЗначенияРегистраСведения(АвтомобильПечать.Ссылка, 
		Перечисления.ДополнительнаяИнформацияАвтомобилей.Хозяин);
		ОбластьШапки.параметры.Автомобиль = АвтомобильОписание;
		АдресВладельца = ПолучитьАдресКлиента(АвтомобильВладелец);
		ОбластьШапки.Параметры.Владелец = ?(ЗначениеЗаполнено(АвтомобильВладелец), АвтомобильВладелец.НаименованиеПолное, "");
		//Сергеев В.Н. DMSREN-970
		ТелефонВладельца = ТелефонСКомментариями(АвтомобильВладелец);
		ТелефонВладельца = ?(ПустаяСтрока(ТелефонВладельца),""," Телефон: " + ТелефонВладельца);
		//----------------------
		ОбластьШапки.параметры.АдресВладельца = АдресВладельца + ТелефонВладельца;
	КонецЕсли;
	
	ДанныеПлательщика = ПолучитьДанныеПлательщика(пПлательщик);
	Если ЗначениеЗаполнено(пПлательщик)Тогда
		ОбластьШапки.Параметры.Плательщик = пПлательщик.НаименованиеПолное;
		ОбластьШапки.Параметры.ДанныеПлательщика = ДанныеПлательщика;
	КонецЕсли;
	
	ОбластьШапки.Параметры.email = "e-mail: " + Renault_CRM.ПолучитьЕмаилКлиент(мКлиент);
	// начало ЗеленчукДС изменено 13.10.2017
	//ОбластьШапки.Параметры.КартаНаСервисноеОбслуживание = "Карта на сервисное обслуживание а/м марки RENAULT: ";
	ОбластьШапки.Параметры.КартаНаСервисноеОбслуживание = "Карта на сервисное обслуживание а/м марки " + СокрЛП(ДилерскийЦентр.Бренд.Наименование) + ": ";
	// окончание ЗеленчукДС изменено 13.10.2017
	ОбластьШапки.Параметры.ДисконтнаяКарта = "Дисконтная карта Номер " + Строка(НомерКарты);
	//Добавить Клиент ожидает или клиент уехал
	
	Если ПредложеноТакси Тогда
		ОбластьШапки.Параметры.ВремРешение = "предложено такси";
	ИначеЕсли ПредложенПодменныйАвтомобиль Тогда
		ОбластьШапки.Параметры.ВремРешение = "подменный автомобиль";
	Иначе
		ОбластьШапки.Параметры.ВремРешение = "не требуется";
	КонецЕсли;
	
КонецПроцедуры

Функция ПолучитьПричинуОбращения() 
	
	Если ЗначениеЗаполнено(Обращение) тогда
		Возврат обращение.Примечание;
	Иначе
		Возврат " ";
	КонецЕсли;
	
КонецФункции

Процедура ЗаполнитьСтрокуПланаРабот(СтрокаТаблицы, ОписаниеЭтапа, нпп)
	
	//переделать
	
	СтрокаТаблицы.Параметры.ПостПриемщик = ОписаниеЭтапа.Цех;
	СтрокаТаблицы.Параметры.ВрНачала = ОписаниеЭтапа.НачалоЭтапа;
	СтрокаТаблицы.Параметры.ВрОкончания = ОписаниеЭтапа.КонецЭтапа;
	
	Отбор = Новый Структура;
	Отбор.Вставить("IDЭтапа", ОписаниеЭтапа.IDЭтапа);
	
	Состав = СоставЭтапа.НайтиСтроки(Отбор);
	
	СосТек = "";
	
	Для Каждого Сост из Состав Цикл
		
		СосТек = Строка(Сост.Работа) + Символы.ПС + Строка(СосТек);
		
	КонецЦикла;
	
	СтрокаТаблицы.Параметры.Состав = СосТек;
	
КонецПроцедуры

Процедура ЗаполнитьИтоги(Итоги)
	
	Попытка
		
		//DMSCOR-1004
		//Если ЗначениеЗаполнено(ЗаказНаряд) Тогда
		//	
		//	СуммаЗН = ЗаказНаряд.СуммаДокумента;
		//	
		//	ОплаченоБаллами = ЗаказНаряд.Работы.Итог("СуммаСкидкиСтроки") + ЗаказНаряд.Товары.Итог("СуммаСкидкиСтроки");
		//	Итоги.Параметры.ПредварительнаяСтоимость = Строка(СуммаЗН) + " рублей";
		//	
		//Иначе
			
			ОплаченоБаллами = ЗапчастиОплатаБаллами + РаботыОплатаБаллами;
			Итоги.Параметры.ПредварительнаяСтоимость = СтрЗаменить( 
													Строка(
													Число(?(ЗначениеЗаполнено(СуммаЗапчастиВсего), СуммаЗапчастиВсего, "0"))+
													Число(?(ЗначениеЗаполнено(СуммаРаботВсего), СуммаРаботВсего, "0")) - ОплаченоБаллами), Символы.НПП, "") + " рублей";
			
		//КонецЕсли;
		
	Исключение
		
		Итоги.Параметры.ПредварительнаяСтоимость = " ";
		
	КонецПопытки;
	
	Мойки = ПолучитьМойки();
	
	Если ЗначениеЗаполнено(Мойки) Тогда
		
		КоличествоМоек = Мойки.Количество();
		
	Иначе
		
		КоличествоМоек = 0;
		
	КонецЕсли;
	
	//Итоги.Параметры.ВсегоРабот = "Всего работ: " + Строка(ЭтотОбъект.Работы.Количество() + КоличествоМоек);
	Если ОплаченоБаллами <> 0 Тогда
		Итоги.Параметры.ОплаченоБаллами = "Оплачено баллами:" + ОплаченоБаллами;
	КонецЕсли;
	
КонецПроцедуры

Функция ПолучитьМойки()
	
	Запрос = Новый Запрос();
	Запрос.Текст = "ВЫБРАТЬ
	               |	Renault_CRM_ЗаявкаНаМойку.Ссылка,
	               |	Renault_CRM_ЗаявкаНаМойку.Дата,
	               |	Renault_CRM_ЗаявкаНаМойку.ДилерскийЦентр,
	               |	Renault_CRM_ЗаявкаНаМойку.Клиент,
	               |	Renault_CRM_ЗаявкаНаМойку.ВремяНачала,
	               |	Renault_CRM_ЗаявкаНаМойку.ВремяОкончания,
	               |	Renault_CRM_ЗаявкаНаМойку.Машиноместо,
	               |	Renault_CRM_ЗаявкаНаМойку.ГосНомер,
	               |	Renault_CRM_ЗаявкаНаМойку.Автомобиль,
	               |	Renault_CRM_ЗаявкаНаМойку.Обращение,
	               |	Renault_CRM_ЗаявкаНаМойку.Длительность,
	               |	Renault_CRM_ЗаявкаНаМойку.РаботаМойка,
	               |	Renault_CRM_ЗаявкаНаМойку.Платная,
	               |	Renault_CRM_ЗаявкаНаМойку.Стоимость
	               |ИЗ
	               |	Документ.Renault_CRM_ЗаявкаНаМойку КАК Renault_CRM_ЗаявкаНаМойку
	               |ГДЕ
	               |	Renault_CRM_ЗаявкаНаМойку.Обращение = &Обращение";
	Запрос.УстановитьПараметр("Обращение", Обращение);
	
	Мойки = Запрос.Выполнить().Выгрузить();
	
	Возврат Мойки;

КонецФункции

Процедура ЗаполнитьОбластьКомментариев(ОбластьКомментариев)
	
	Комментарии = "";
	ЭтоПерв = Истина;
	Для Каждого Описание Из Товары Цикл
		Если Описание.ВНаличииУКлиента = Истина Тогда
			Если ЭтоПерв Тогда
				Комментарии = Описание.Номенклатура.Наименование;
				ЭтоПерв = Ложь;
			Иначе
				Комментарии = Комментарии + ", " + Описание.Номенклатура.Наименование;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	Если не ЭтоПерв Тогда
		ОбластьКомментариев.Параметры.Комментарии = Комментарии + " предоставлены клиентом"; 
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗаполнитьВторуюСтраницу(ВтораяСтраница, СвязаннаяПриемка, СвязаннаяВыдача)
	
	Если ЗначениеЗаполнено(СвязаннаяПриемка) Тогда
		ВтораяСтраница.Параметры.МастерПриемщикРас = СвязаннаяПриемка.Машиноместо;
	КонецЕсли;
	
	Если Клиент.ФормаСобственности = Перечисления.ФормыСобственности.ЮридическоеЛицо тогда
		ВтораяСтраница.Параметры.ЗаказчикРас2 = "";
	Иначе
		ВтораяСтраница.Параметры.ЗаказчикРас2 = Клиент.Фамилия + " " + Лев(Клиент.Имя, 1) + "." + Лев(Клиент.Отчество, 1) + ".";
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ЗаказНаряд) Тогда
		ВтораяСтраница.Параметры.ВидОплаты = ЗаказНаряд.ВидОплаты;
	Иначе
		
		#Если Клиент Тогда
			
			Если ДилерскийЦентр.Автосервис_ЗапрашиватьВидОплаты Тогда
				
				Форма = Перечисления.ВидыОплаты.ПолучитьФормуВыбора();
				
				Ответ = Форма.ОткрытьМодально();
				
				Если ЗначениеЗаполнено(Ответ) Тогда
					
					ВтораяСтраница.Параметры.ВидОплаты = Ответ;
					ЭтотОбъект.ВидОплаты = Ответ;
					
				Иначе
					
					ВтораяСтраница.Параметры.ВидОплаты = Перечисления.ВидыОплаты.НаличныйРасчет;
					ЭтотОбъект.ВидОплаты = Перечисления.ВидыОплаты.НаличныйРасчет;
					
				КонецЕсли;
				
			Иначе
				
				ВтораяСтраница.Параметры.ВидОплаты = Перечисления.ВидыОплаты.НаличныйРасчет;
				ЭтотОбъект.ВидОплаты = Перечисления.ВидыОплаты.НаличныйРасчет; 
				
			КонецЕсли;
			
			ЭтотОбъект.Записать();
			
		#КонецЕсли
		
	КонецЕсли;
	
	Если Клиент.ФормаСобственности = Перечисления.ФормыСобственности.ЮридическоеЛицо тогда
		ВтораяСтраница.Параметры.ЗаказчикРас = "_____________";
	Иначе
		ВтораяСтраница.Параметры.ЗаказчикРас = Клиент.Фамилия + " " + Лев(Клиент.Имя, 1) + "." + Лев(Клиент.Отчество, 1) + ".";
	КонецЕсли;
	ПоврежденияАвто = ПолучитьПовреждения(Автомобиль);
	ОбнаруженныеПоврежденияАвтомобиля = ОтобразитьПовреждения(ВтораяСтраница, ПоврежденияАвто);
	ВтораяСтраница.Параметры.ОбнаруженныеПоврежденияАвтомобиля = ОбнаруженныеПоврежденияАвтомобиля;
	
	ВтораяСтраница.Параметры.ДатаСдачи = ТекущаяДата();
	
	//ВтораяСтраница.Параметры.ЮрИнфа = ДилерскийЦентр.Автосервис_ЮрИнфаЗаявка;
	
	Рекомендации = ПолучитьРекомендуемыеРаботы(СвязаннаяПриемка);
	ВтораяСтраница.параметры.Рекомендации = Рекомендации;
	ЮрНаименование = ?(ЗначениеЗаполнено(ДилерскийЦентр.Организация), ДилерскийЦентр.Организация.НаименованиеПолное, ДилерскийЦентр.Наименование)+
	" адрес: " + ДилерскийЦентр.ОсновнойАдрес;
	ВтораяСтраница.Параметры.ДилерскаяИнформация = ЮрНаименование;
	
КонецПроцедуры

Функция ПолучитьСвязаннуюПриемкуАвто()
	
	Запрос = Новый Запрос("ВЫБРАТЬ
	| Renault_CRM_ПриемкаАвтомобиля.Ссылка КАК Приемка
	|ИЗ
	| Документ.Renault_CRM_ПриемкаАвтомобиля КАК Renault_CRM_ПриемкаАвтомобиля
	|ГДЕ
	| Renault_CRM_ПриемкаАвтомобиля.Обращение.Ссылка = &Обращение");
	Запрос.УстановитьПараметр("Обращение", Обращение);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Приемка;
	Иначе
		Возврат Неопределено;
	КонецЕсли;
	
КонецФункции

Функция ПолучитьСвязаннуюВыдачуАвто()
	
	Запрос= Новый Запрос("ВЫБРАТЬ
	| Renault_CRM_ВыдачаАвтомобиля.Ссылка КАК Выдача
	|ИЗ
	| Документ.Renault_CRM_ВыдачаАвтомобиля КАК Renault_CRM_ВыдачаАвтомобиля
	|ГДЕ
	| Renault_CRM_ВыдачаАвтомобиля.Обращение.Ссылка = &Обращение");
	Запрос.УстановитьПараметр("Обращение", Обращение);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Выдача;
	Иначе
		Возврат Неопределено;
	КонецЕсли;
	
КонецФункции

Функция ПолучитьАдресКлиента(Клиент)
	
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	КонтактнаяИнформация.Представление КАК Представление,
	                      |	КонтактнаяИнформация.ЗначениеПоУмолчанию КАК ЗначениеПоУмолчанию
	                      |ИЗ
	                      |	РегистрСведений.КонтактнаяИнформация КАК КонтактнаяИнформация
	                      |ГДЕ
	                      |	КонтактнаяИнформация.Объект = &Объект
	                      |	И КонтактнаяИнформация.Тип = &Тип");
	Запрос.УстановитьПараметр("Объект", Клиент);
	Запрос.УстановитьПараметр("Тип", Перечисления.ТипыКонтактнойИнформации.Адрес);
	Выборка = Запрос.Выполнить().Выгрузить();
	
	Если Выборка.Количество()>0 Тогда
		СтрОсн = Выборка.НайтиСтроки(Новый СТруктура("ЗначениеПоУмолчанию", Истина));
		Если СтрОсн.Количество()>0 Тогда
			Возврат СтрОсн[0].Представление;
		Иначе			
			Возврат Выборка[0].Представление;
		КонецЕсли;
	Иначе
		Возврат " ";
	КонецЕсли;
	
КонецФункции

Функция ПолучитьДанныеПлательщика (вхПлательщик) 
	
	Ответ = "";
	Если ЗначениеЗаполнено(вхПлательщик) Тогда
		Ответ = "ИНН " + вхПлательщик.ИНН + " адрес: " + ПолучитьАдресКлиента(вхПлательщик) + " телефон: " + ТелефонСКомментариями(вхПлательщик); 
		Возврат Ответ;
	Иначе
		Возврат " ";
	КонецЕсли;
	
КонецФункции

// <Описание функции>
//
// Параметры
//  <Параметр1>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//  <Параметр2>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//
// Возвращаемое значение:
//   <Тип.Вид>   - <описание возвращаемого значения>
//
Функция ТелефонСКомментариями(Клиент)

	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	КонтактнаяИнформация.Представление,
	                      |	КонтактнаяИнформация.Комментарий
	                      |ИЗ
	                      |	РегистрСведений.КонтактнаяИнформация КАК КонтактнаяИнформация
	                      |ГДЕ
	                      |	КонтактнаяИнформация.Тип = &Тип
	                      |	И КонтактнаяИнформация.ЗначениеПоУмолчанию = ИСТИНА
	                      |	И КонтактнаяИнформация.Объект = &Объект");
	Запрос.УстановитьПараметр("Тип", Перечисления.ТипыКонтактнойИнформации.Телефон);
	Запрос.УстановитьПараметр("Объект", Клиент);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Строка(Выборка.Представление) + " " + Строка(Выборка.Комментарий);
	Иначе
		
		Попытка
			
			Телефон = Клиент.ОсновнойТелефон;
			
			Возврат СокрЛП(Телефон);
			
		Исключение
			
			Возврат "";
			
		КонецПопытки;
		
	КонецЕсли;
	
КонецФункции // ТелефонСКомментариями()

Функция ПолучитьПовреждения(Авто)
	
	Запрос = Новый Запрос();
	Запрос.Текст = "ВЫБРАТЬ
	               |	Renault_ПоврежденияКузоваСрезПоследних.Повреждение КАК Повреждение,
	               |	Renault_ПоврежденияКузоваСрезПоследних.Повреждение.Описание КАК НаименованиеПовреждения,
	               |	Renault_ПоврежденияКузоваСрезПоследних.ЗонаПовреждения КАК ЗонаПовреждения,
	               |	Renault_ПоврежденияКузоваСрезПоследних.ЗонаПовреждения.ИмяЭлемента КАК ИмяЭлемента,
	               |	Renault_ПоврежденияКузоваСрезПоследних.ЗонаПовреждения.ОтображаемаяЗона КАК Отображать,
	               |	Renault_ПоврежденияКузоваСрезПоследних.Значение КАК Значение,
	               |	Renault_ПоврежденияКузоваСрезПоследних.СтепеньПовреждения КАК СтепеньПовреждения,
	               |	Renault_ПоврежденияКузоваСрезПоследних.Комментарий КАК Комментарий,
	               |	Renault_ПоврежденияКузоваСрезПоследних.Авторабота КАК Авторабота
	               |ИЗ
	               |	РегистрСведений.Renault_ПоврежденияКузова.СрезПоследних(
	               |			,
	               |			Автомобиль = &Автомобиль
	               |				И Обращение = &Обращение) КАК Renault_ПоврежденияКузоваСрезПоследних";
	
	Запрос.УстановитьПараметр("Автомобиль", Авто);
	Запрос.УстановитьПараметр("Обращение", Обращение.Ссылка);
	ТаблицаПовреждений = Запрос.Выполнить().Выгрузить();
	
	Возврат ТаблицаПовреждений;
	
КонецФункции

Функция ОтобразитьПовреждения(ОбластьПовреждений, ТаблицаПовреждений)
	
	СписокПовреждений = "";
	нпп = 1;
	ЭтоПерв = Истина;
	Для Каждого Строка из ТаблицаПовреждений Цикл
		 
		Если Строка.ЗонаПовреждения.ПометкаУдаления Тогда
			Продолжить;
		КонецЕсли;
 
		Если Строка.Отображать = Истина Тогда
			Если Не ЗначениеЗаполнено(Строка.Повреждение) И Не ЗначениеЗаполнено(Строка.ЗонаПовреждения) Тогда
				Продолжить;
			КонецЕсли;
			
			МассивРисунки = Новый массив();
			МассивРисунки = НайтиРисунокПоИмени(Справочники.Renault_ЗоныПоврежденийАвто.ПолучитьИмяПредопределенного(Строка.ЗонаПовреждения),ОбластьПовреждений);
			Если МассивРисунки.Количество() = 0 Тогда
				МассивРисунки = НайтиРисунокПоИмени(Строка.ЗонаПовреждения.ИмяЭлемента,ОбластьПовреждений);
			КонецЕсли;
			Если ЭтоПерв = Истина Тогда
				 ЭтоПерв = Ложь;
				СписокПовреждений = "1. " + СформироватьНазваниеПовреждения(Строка);
			Иначе
				СписокПовреждений = СписокПовреждений + Символы.ПС + СтрЗаменить(Строка(нпп), Символы.НПП, "") + ". " +
				СформироватьНазваниеПовреждения(Строка);
			КонецЕсли;
			
			Если Строка.повреждение = Справочники.Renault_Автосервис_Повреждения.Удар Тогда				
				Для Каждого Рис Из МассивРисунки Цикл
					Рис.Картинка = БиблиотекаКартинок.Renault_Cross;
				КонецЦикла;
			ИначеЕсли Строка.повреждение = Справочники.Renault_Автосервис_Повреждения.Царапина
					Или Строка.повреждение = Справочники.Renault_Автосервис_Повреждения.ЦарапинаОкраска
					Или Строка.повреждение = Справочники.Renault_Автосервис_Повреждения.ЦарапинаПолировка Тогда
				Для Каждого Рис Из МассивРисунки Цикл
					Рис.Картинка = БиблиотекаКартинок.Renault_Circle;
				КонецЦикла;
			ИначеЕсли Строка.повреждение = Справочники.Renault_Автосервис_Повреждения.УдарЦарапина Тогда
				Для Каждого Рис Из МассивРисунки Цикл
					Рис.Картинка = БиблиотекаКартинок.Renault_CircleCross;
				КонецЦикла;
			Иначе
				Для Каждого Рис Из МассивРисунки Цикл
					Рис.Картинка = БиблиотекаКартинок.Renault_CircleCross;
				КонецЦикла				
			КонецЕсли;
			
			нпп = нпп+1;
			
		ИначеЕсли Строка.Повреждение = Справочники.Renault_Автосервис_Повреждения.УровеньТоплива Тогда
			
			РисункиТоплива = НайтиРисунокПоИмени("ДиаграммаТоплива", ОбластьПовреждений);
			Для Каждого Рис из РисункиТоплива Цикл
				
				Диаграмма = Рис.Объект;
				Диаграмма.ТипДиаграммы = ТипДиаграммы.Измерительная;
				Диаграмма.АвтоМаксимальноеЗначение = Ложь;
				Диаграмма.МаксимальноеЗначение = 100;
				Диаграмма.АвтоМинимальноеЗначение = Ложь;
				Диаграмма.МинимальноеЗначение = 0;
				Диаграмма.ОтображатьЛегенду = Ложь;
				
				// Создать три полосы.
				Полосы = Диаграмма.ПолосыИзмерительнойДиаграммы; 
				НоваяПолоса = Полосы.Добавить(); 
				НоваяПолоса.Начало = 0;
				НоваяПолоса.Конец = 10;
				НоваяПолоса.ЦветФона = WebЦвета.Красный;
				
				НоваяПолоса = Полосы.Добавить();
				НоваяПолоса.Начало =10;
				НоваяПолоса.Конец = 30;
				НоваяПолоса.ЦветФона = WebЦвета.Желтый;
				
				НоваяПолоса = Полосы.Добавить();
				НоваяПолоса.Начало = 30;
				НоваяПолоса.Конец = 100;
				НоваяПолоса.ЦветФона = WebЦвета.Зеленый;
				
				Диаграмма.КоличествоТочек = 1;
				Диаграмма.КоличествоСерий = 1;
				Зна = 0;
				Попытка
					Зна = Окр(100*Число(Строка.Значение));
				Исключение 
					Зна = 0;
				КонецПопытки;
				
				Диаграмма.УстановитьЗначение(0, 0, зна);
				Диаграмма.Обновление = Истина;
				
			КонецЦикла;
			
		Иначе //Если Строка.Повреждение = Справочники.Renault_Автосервис_Повреждения.КомментарийАктОсмотра Тогда
			Если ЗначениеЗаполнено(Строка.Повреждение) Тогда
				СписокПовреждений = СписокПовреждений + Символы.ПС + СтрЗаменить(Строка(нпп), Символы.НПП, "") + ". " +
				СформироватьНазваниеПовреждения(Строка);
				нпп = нпп+1;
				ЭтоПерв = Ложь;
			КонецЕсли;
		КонецЕсли;		
		
	КонецЦикла;
	
	Если ДилерскийЦентр.Автосервис_ИспользуетсяПланшет Тогда  
		ДополнительныеСведения = Renault_АвтосервисСервер.ПолучитьВсеПрочиеПовреждения(Ссылка,нпп);	  
		СписокПовреждений =СписокПовреждений + Символы.ПС + ДополнительныеСведения;
	КонецЕсли;
	
	Возврат СписокПовреждений;
	
КонецФункции

Функция РазбитьПоЗаглавным(Строка)
	
	Выход = Лев(Строка, 1);
	Для Индекс = 2 по СтрДлина(Строка) цикл
		Символ = Сред(Строка, Индекс, 1);
		Выход = Выход + ?(ВРег(Символ) = Символ, " " + НРег(Символ), Символ);
	КонецЦикла;
	
	Возврат Выход;
	
КонецФункции

Функция СформироватьНазваниеПовреждения(Описание)
	
	Ответ = "";
	
	Если ЗначениеЗаполнено(Описание.ЗонаПовреждения) Тогда		
		Ответ = РазбитьПоЗаглавным(Описание.ЗонаПовреждения.Наименование) + " -> ";		
	КонецЕсли;
	
	Если Описание.Повреждение = Справочники.Renault_Автосервис_Повреждения.Удар ИЛИ
		Описание.Повреждение = Справочники.Renault_Автосервис_Повреждения.Царапина ИЛИ
		Описание.Повреждение = Справочники.Renault_Автосервис_Повреждения.УдарЦарапина Тогда
		
		Ответ = Ответ + " " + РазбитьПоЗаглавным(Строка(Описание.Повреждение));		
		Если ЗначениеЗаполнено(Описание.СтепеньПовреждения) Тогда				
			Ответ = Ответ + " (" + Строка(Описание.СтепеньПовреждения) + ")."				
		КонецЕсли;		

	ИначеЕсли Описание.Повреждение = Справочники.Renault_Автосервис_Повреждения.КомментарийАктОсмотра Тогда	
		Ответ = Ответ + " Комментарий акта осмотра:" + Строка(Описание.Значение);
	ИначеЕсли Описание.Повреждение = Справочники.Renault_Автосервис_Повреждения.Комментарий Тогда
		Ответ = Ответ + " Дополнительный комментарий:" + Строка(Описание.Комментарий);
	Иначе			
		//Ответ = Ответ + " " + Описание.Повреждение +" " +Строка(Описание.Комментарий);	
		Ответ = Ответ + " " + Описание.Повреждение;			
	КонецЕсли;
		
	Возврат Ответ;
	
КонецФункции

Функция НайтиРисунокПоИмени(ИмяРисунка, ОбластьСРисунками)
	
	МассивРисунков = новый Массив();
	Для Каждого Рис Из ОбластьСРисунками.Рисунки Цикл
		Если Рис.Имя = ИмяРисунка Тогда
			МассивРисунков.Добавить(Рис);
		КонецЕсли;
	КонецЦикла;
	Возврат МассивРисунков;
	
КонецФункции

Функция ПолучитьРекомендуемыеРаботы(СвязаннаяПриемка)
	
	
	Запрос = Новый Запрос("ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Renault_ПоврежденияАвтомобилейСрезПоследних.Работа,
	|	Renault_ПоврежденияАвтомобилейСрезПоследних.РаботаАктуальна
	|ИЗ
	|	РегистрСведений.Renault_ПоврежденияАвтомобилей КАК Renault_ПоврежденияАвтомобилейСрезПоследних
	|ГДЕ
	|	Renault_ПоврежденияАвтомобилейСрезПоследних.Автомобиль = &Автомобиль");
	Запрос.УстановитьПараметр("Автомобиль", Автомобиль);
	ПоврежденияАвто = запрос.Выполнить().Выгрузить();
	Ответ = "";
	ЭтоПерв = Истина;
	нпп = 1;
	Для Каждого Опис из ПоврежденияАвто Цикл
		Если Опис.РаботаАктуальна = Истина Тогда
			
			ТекстРаботы = ?(ТипЗнч(Опис.Работа) = Тип("СправочникСсылка.Автоработы"), Строка(Опис.Работа.Наименование), Строка(Опис.Работа)); 
			
			Если ЭтоПерв Тогда
				Ответ = СтрЗаменить(Строка(нпп), Символы.НПП, "") + " " + ТекстРаботы;
				ЭтоПерв = Ложь;
			Иначе
				Ответ = Ответ + Символы.ПС + СтрЗаменить(Строка(нпп), Символы.НПП, "") + " " + ТекстРаботы;
			КонецЕсли;
			нпп = нпп + 1;
		КонецЕсли;
	КонецЦикла;
	Возврат Ответ;
	
КонецФункции

Процедура ЗаписатьВРегистр(Исполнитель, План, Факт, Авторабота, Цех, IDЭтапа)
	
	Запись = РегистрыСведений.Renault_АвтосервисФактПоИсполнителям.СоздатьМенеджерЗаписи();
	
	Работа = ЭтотОбъект.Работы.Найти(Авторабота);
	
	Если ЗначениеЗаполнено(Работа) Тогда
		
		Норма = Работа.ДлительностьЗН;
		IDРаботы = Работа.IDРаботы;
		
	Иначе
		
		Норма = 0;
		IDРаботы = 0;
		
	КонецЕсли;
	
	Запись.Исполнитель = Исполнитель;
	Запись.Период = ТекущаяДата();
	Запись.План = План;
	Запись.Факт = Факт;
	Запись.Цех = Цех;
	Запись.IDЭтапа = IDЭтапа;
	Запись.РабочийДокумент = ЭтотОбъект.Ссылка;
	Запись.Работа = Авторабота;
	Запись.Норма = Норма;
	Запись.IDРаботы = IDРаботы;
	
	Запись.Записать(ИСТИНА);
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, Режим)
	
	УпрощенныйРежим = ДилерскийЦентр.ИспользоватьУпрощенныйФункционалСвязиСервисПродажи;
	
	Если ЭтотОбъект.Состояние = Справочники.ВидыСостоянийЗаказНарядов.Выполнен Тогда
		
		Для Каждого Этап из ЭтотОбъект.Этапы Цикл
			
			Если ОбщаяДлительность = 0 Тогда
				
				Продолжить;
				
			КонецЕсли;
			
			Отбор = Новый Структура();
			Отбор.Вставить("Этап", Этап.IDЭтапа);
			СтрокиЗанятости = ЭтотОбъект.ВыполнениеРабот.НайтиСтроки(Отбор);
			
			Для Каждого СтрокаЗанятости ИЗ СтрокиЗанятости Цикл
				
				ЗаписатьВРегистр(СтрокаЗанятости.Исполнитель, ОбщаяДлительность, СтрокаЗанятости.Длительность, Справочники.Автоработы.ПустаяСсылка(), Этап.Цех, Этап.IDЭтапа);
				
			КонецЦикла;
			
		КонецЦикла;
		
	КонецЕсли;
		
	//////////////////
	//Доступно также в упрощенном режиме
	
	Если СтатусПодготовкиКПродаже = Перечисления.Renault_СтатусыЗаявкиНаПрепродажнуюПодготовку.Выполнена Тогда
	
		//Движения по выполнению этапов выдачи
		Если ЗначениеЗаполнено(ДоговорНаПродажуАвтомобиля) Тогда
			Запрос = Новый Запрос;
			Запрос.Текст = 
			"ВЫБРАТЬ
			|	Renault_ВыполнениеЭтаповВыдачи.Ссылка КАК ВыполнениеЭтапов,
			|	CRM_ЗаписьНаВыдачу.Ссылка КАК ЗаписьНаВыдачу
			|ИЗ
			|	Документ.CRM_ЗаписьНаВыдачу КАК CRM_ЗаписьНаВыдачу
			|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.Renault_ВыполнениеЭтаповВыдачи КАК Renault_ВыполнениеЭтаповВыдачи
			|		ПО CRM_ЗаписьНаВыдачу.Ссылка = Renault_ВыполнениеЭтаповВыдачи.ВыдачаАвтомобиля
			|ГДЕ
			|	CRM_ЗаписьНаВыдачу.ДоговорНаПродажуАвтомобиля = &ДоговорНаПродажуАвтомобиля
			|	И CRM_ЗаписьНаВыдачу.Статус <> &Статус";
			
			Запрос.УстановитьПараметр("ДоговорНаПродажуАвтомобиля",ДоговорНаПродажуАвтомобиля);
			Запрос.УстановитьПараметр("Статус", Перечисления.CRM_СтатусыДокументаЗаписьНаВыдачу.Отменено);
			Выборка = Запрос.Выполнить().Выбрать();
			
			Пока Выборка.Следующий() Цикл
				
				Если Выборка.ВыполнениеЭтапов = NULL  Тогда
					ДокОбъектВыполнениеЭтатапов = Документы.Renault_ВыполнениеЭтаповВыдачи.СоздатьДокумент();
					ДокОбъектВыполнениеЭтатапов.Дата = ТекущаяДата();
					ДокОбъектВыполнениеЭтатапов.ВыдачаАвтомобиля = Выборка.ЗаписьНаВыдачу;
				Иначе
					ДокОбъектВыполнениеЭтатапов = Выборка.ВыполнениеЭтапов.ПолучитьОбъект();
				КонецЕсли;
				СтрТЧ = ДокОбъектВыполнениеЭтатапов.ЭтатыВыдачи.Найти(Справочники.Renault_ЭтапыВыдачи.УстановкаДопОб,"Этап");
				Если СтрТЧ = Неопределено Тогда
					СтрТЧ = ДокОбъектВыполнениеЭтатапов.ЭтатыВыдачи.Добавить();
					СтрТЧ.Этап = Справочники.Renault_ЭтапыВыдачи.УстановкаДопОб;
				КонецЕсли;
				СтрТЧ.Сотрудник = ПараметрыСеанса.Пользователь.Сотрудник;
				СтрТЧ.ДатаВыполнения = ТекущаяДата();
				ДокОбъектВыполнениеЭтатапов.Записать(РежимЗаписиДокумента.Проведение);
			КонецЦикла;
		КонецЕсли;
		
	КонецЕсли;
	
	//Движения по регистрам для допов в автоскладе
		
	ДвиженияУстановленноеОборудование = Движения.Renault_УстановленноеОборудованиеАвтомобилей;
	ДвиженияУстановленноеОборудование.Очистить();
	ДвиженияУстановленноеОборудование.Записывать = Истина;
	
	ДвиженияОборудованиеКУстановке = Движения.Renault_ОборудованиеКУстановке;
	ДвиженияОборудованиеКУстановке.Очистить();
	ДвиженияОборудованиеКУстановке.Записывать = Истина;
	
	ДвиженияСтоимостьУстановленногоОборудования = Движения.Renault_СтоиомостьУстановленногоОборудования;
	ДвиженияСтоимостьУстановленногоОборудования.Очистить();
	ДвиженияСтоимостьУстановленногоОборудования.Записывать = Истина;
	
	//Соберем таблицу оборудования для движений
	
	ТаблицаОборудования = Новый ТаблицаЗначений;
	ТаблицаОборудования.Колонки.Добавить("ВидДвижения");
	ТаблицаОборудования.Колонки.Добавить("Автомобиль");
	ТаблицаОборудования.Колонки.Добавить("Оборудование");
	ТаблицаОборудования.Колонки.Добавить("Себестоимость");
	ТаблицаОборудования.Колонки.Добавить("Стоимость");
	ТаблицаОборудования.Колонки.Добавить("Количество");
	ТаблицаОборудования.Колонки.Добавить("Период");
	ТаблицаОборудования.Колонки.Добавить("АртикулОборудования");
	
	Если ТипПривязкиДоповКАвтомобилям = Перечисления.Renault_ТипыУчетаДополнительногоОборудования.ИзДополнительногоОборудования Тогда
		
		//Оборудование
		
		Для Каждого Стр Из ДополнительноеОборудование Цикл
			СтрДвиж = ТаблицаОборудования.Добавить();
			СтрДвиж.ВидДвижения = ВидДвиженияНакопления.Приход;
			СтрДвиж.Автомобиль = Автомобиль;
			СтрДвиж.Оборудование = Стр.Оборудование;
			СтрДвиж.Себестоимость = Стр.Себестоимость;
			СтрДвиж.Стоимость = Стр.ЦенаДляКлиента;
			СтрДвиж.Количество = Стр.Количество;
			Если ТипЗнч(Стр.Оборудование) = Тип("СправочникСсылка.Renault_СписокДопов") Тогда
				СтрДвиж.АртикулОборудования = Стр.Оборудование.Код;
			КонецЕсли;
			СтрДвиж.Период = ТекущаяДата();
		КонецЦикла;
		
	Иначе
		
		//Номенклатура
		
		Для Каждого Стр Из Товары Цикл
			СтрДвиж = ТаблицаОборудования.Добавить();
			СтрДвиж.ВидДвижения = ВидДвиженияНакопления.Приход;
			СтрДвиж.Автомобиль = Автомобиль;
			СтрДвиж.Оборудование = Стр.Номенклатура;
			СтрДвиж.Себестоимость = 0;
			СтрДвиж.Стоимость = Стр.Сумма;
			СтрДвиж.Количество = Стр.Количество;
			СтрДвиж.АртикулОборудования = Стр.Номенклатура.Артикул;
			СтрДвиж.Период = ТекущаяДата();
		КонецЦикла;
		
		Если ТипПривязкиДоповКАвтомобилям = Перечисления.Renault_ТипыУчетаДополнительногоОборудования.ИзНоменклатурыИРабот Тогда
				
			//Работы
			
			Для Каждого Стр Из Работы Цикл
				СтрДвиж = ТаблицаОборудования.Добавить();
				СтрДвиж.ВидДвижения = ВидДвиженияНакопления.Приход;
				СтрДвиж.Автомобиль = Автомобиль;
				СтрДвиж.Оборудование = Стр.Работа;
				СтрДвиж.Себестоимость = 0;
				СтрДвиж.Стоимость = Стр.Сумма;
				СтрДвиж.Количество = 1;
				СтрДвиж.АртикулОборудования = Стр.Работа.Артикул;
				СтрДвиж.Период = ТекущаяДата();
			КонецЦикла;
			
		КонецЕсли;
		
	КонецЕсли;
	
	////////////////////////////////////////////////////
	//Теперь сделаем движения в зависимости от статусов
		
	Если СтатусПодготовкиКПродаже = Перечисления.Renault_СтатусыЗаявкиНаПрепродажнуюПодготовку.Выполнена Тогда
		
		//ДвиженияУстановленноеОборудование
		
		Для Каждого Стр Из ТаблицаОборудования Цикл
			СтрДвиж = ДвиженияУстановленноеОборудование.Добавить();
			ЗаполнитьЗначенияСвойств(СтрДвиж, Стр);
		КонецЦикла;
		
		Если НЕ Отказ И ДвиженияУстановленноеОборудование.Количество() > 0 Тогда
			Renault_СообщенияПользователю.Renault_События_ПриВыполненииЗаявкиВАвтосервисСДопОборудованием(Ссылка);
		КонецЕсли;	
		
		//ДвиженияСтоимостьУстановленногоОборудования
		
		Для Каждого Стр Из ТаблицаОборудования Цикл
			СтрДвиж = ДвиженияСтоимостьУстановленногоОборудования.Добавить();
			ЗаполнитьЗначенияСвойств(СтрДвиж, Стр);
		КонецЦикла;
		
	ИначеЕсли СтатусПодготовкиКПродаже = Перечисления.Renault_СтатусыЗаявкиНаПрепродажнуюПодготовку.ОтправленаВРаботу Тогда
		
		//ДвиженияОборудованиеКУстановке
			
		Для Каждого Стр Из ТаблицаОборудования Цикл
			СтрДвиж = ДвиженияОборудованиеКУстановке.Добавить();
			ЗаполнитьЗначенияСвойств(СтрДвиж, Стр);
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура СоздатьСчетНаОплатуОбщий() Экспорт
	
	СтрокаСчета = ЭтотОбъект.СчетаНаОплату.Найти(Истина, "ЭтоОбщийСчет");
	Если СтрокаСчета <> Неопределено Тогда
		СчетНаОплату = СтрокаСчета.СчетНаОплату;
	Иначе
		СчетНаОплату = Неопределено;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(СчетНаОплату) Тогда
		
		СчетОбъект = СчетНаОплату.Ссылка.ПолучитьОбъект();
		СчетОбъект.Товары.Очистить();
		
		НовыйСчет = СчетОбъект;
		
	Иначе
		
		НовыйСчет = Документы.СчетНаОплату.СоздатьДокумент();
		
	КонецЕсли;

	Если ЗначениеЗаполнено(ЭтотОбъект.ЗаказНаряд) Тогда
		дкОбработкаЗаполнения(НовыйСчет, ЭтотОбъект.ЗаказНаряд);
	Иначе
		дкОбработкаЗаполнения(НовыйСчет, ЭтотОбъект);
		НовыйСчет.Контрагент = ЭтотОбъект.Клиент;
		Если ЗначениеЗаполнено(НовыйСчет.Организация) Тогда
			НовыйСчет.РасчетныйСчетОрганизации = НовыйСчет.Организация.ОсновнойБанковскийСчет;
		КонецЕсли;
		Для Каждого СтрокаТовары ИЗ НовыйСчет.Товары Цикл
			СтрокаТовары.ЕдиницаИзмерения = СтрокаТовары.Номенклатура.ОсновнаяЕдиницаИзмерения;
			СтрокаТовары.Коэффициент = 1;
			СтрокаТовары.СуммаВсего = СтрокаТовары.Цена*СтрокаТовары.Количество;
		КонецЦикла;
		
		Если НЕ ЗначениеЗаполнено(ТипЦен) Тогда
				
			НовыйСчет.ТипЦен = ЭтотОбъект.ДилерскийЦентр.Автосервис_ТипЦенПродажи;
				
		КонецЕсли;
		
		Для Каждого СтрокаРабот ИЗ ЭтотОбъект.Работы Цикл
			НоваяСтрока = НовыйСчет.Товары.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаРабот);
			НоваяСтрока.Номенклатура = СтрокаРабот.Работа;
			
			НоваяСтрока.Цена = СтрокаРабот.Цена;			
			НоваяСтрока.Коэффициент = 1;
			НоваяСтрока.ЕдиницаИзмерения = СтрокаРабот.Нормочас;
			НоваяСтрока.Количество = СтрокаРабот.Длительность;
			НоваяСтрока.СуммаВсего = НоваяСтрока.Количество * НоваяСтрока.Цена;
		КонецЦикла;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(НовыйСчет.Контрагент) Тогда
		Если НЕ ЗначениеЗаполнено(CRM_Сервер.DMS_ПолучитьОсновнойДоговорКонтрагента(НовыйСчет.Контрагент)) Тогда
			КонтрагентОбъект = НовыйСчет.Контрагент.ПолучитьОбъект();
			КонтрагентОбъект.СоздатьОсновнойДоговор();
			КонтрагентОбъект.Записать();
		КонецЕсли;
		НовыйСчет.ДоговорВзаиморасчетов = CRM_Сервер.DMS_ПолучитьОсновнойДоговорКонтрагента(НовыйСчет.Контрагент);
	КонецЕсли;
	
	НовыйСчет.Записать();
	Если СтрокаСчета <> Неопределено Тогда
		СтрокаСчета.СчетНаОплату = НовыйСчет.Ссылка;
	Иначе
		СтрокаСчета = СчетаНаОплату.Добавить();
		СтрокаСчета.СчетНаОплату = НовыйСчет.Ссылка;
		СтрокаСчета.ЭтоОбщийСчет = Истина;
	КонецЕсли;
	ЭтотОбъект.Записать();
	
КонецПроцедуры

Процедура СоздатьСчетНаОплатуТовары() Экспорт
	
	СтрокаСчета = ЭтотОбъект.СчетаНаОплату.Найти(Истина, "ЭтоСчетНаТовары");
	Если СтрокаСчета <> Неопределено Тогда
		СчетНаОплату = СтрокаСчета.СчетНаОплату;
	Иначе
		СчетНаОплату = Неопределено;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(СчетНаОплату) Тогда
		
		СчетОбъект = СчетНаОплату.Ссылка.ПолучитьОбъект();
		СчетОбъект.Товары.Очистить();
		
		НовыйСчет = СчетОбъект;
		
	Иначе
		
		НовыйСчет = Документы.СчетНаОплату.СоздатьДокумент();
		
	КонецЕсли;

	Если ЗначениеЗаполнено(ЭтотОбъект.ЗаказНаряд) Тогда
		дкОбработкаЗаполнения(НовыйСчет, ЭтотОбъект.ЗаказНаряд);
		Основание = ЭтотОбъект.ЗаказНаряд;
	Иначе
		дкОбработкаЗаполнения(НовыйСчет, ЭтотОбъект);
		Основание = ЭтотОбъект;
		НовыйСчет.Контрагент = ЭтотОбъект.Клиент;
		Если ЗначениеЗаполнено(НовыйСчет.Организация) Тогда
			НовыйСчет.РасчетныйСчетОрганизации = НовыйСчет.Организация.ОсновнойБанковскийСчет;
		КонецЕсли;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(НовыйСчет.Контрагент) Тогда
		Если НЕ ЗначениеЗаполнено(CRM_Сервер.DMS_ПолучитьОсновнойДоговорКонтрагента(НовыйСчет.Контрагент)) Тогда
			КонтрагентОбъект = НовыйСчет.Контрагент.ПолучитьОбъект();
			КонтрагентОбъект.СоздатьОсновнойДоговор();
			КонтрагентОбъект.Записать();
		КонецЕсли;
		НовыйСчет.ДоговорВзаиморасчетов = CRM_Сервер.DMS_ПолучитьОсновнойДоговорКонтрагента(НовыйСчет.Контрагент);
	КонецЕсли;
	
	НовыйСчет.Товары.Очистить();
	Для Каждого СтрокаТовары ИЗ Основание.Товары Цикл
		НоваяСтрока = НовыйСчет.Товары.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаТовары);
		НоваяСтрока.ЕдиницаИзмерения = СтрокаТовары.Номенклатура.ОсновнаяЕдиницаИзмерения;
		НоваяСтрока.Коэффициент = 1;
		НоваяСтрока.СуммаВсего = СтрокаТовары.Цена*СтрокаТовары.Количество;
	КонецЦикла;
	
	Если НЕ ЗначениеЗаполнено(ТипЦен) Тогда
		
		НовыйСчет.ТипЦен = ЭтотОбъект.ДилерскийЦентр.Автосервис_ТипЦенПродажи;
		
	КонецЕсли;
	
	НовыйСчет.Записать();
	Если СтрокаСчета <> Неопределено Тогда
		СтрокаСчета.СчетНаОплату = НовыйСчет.Ссылка;
	Иначе
		СтрокаСчета = СчетаНаОплату.Добавить();
		СтрокаСчета.СчетНаОплату = НовыйСчет.Ссылка;
		СтрокаСчета.ЭтоСчетНаТовары = Истина;
	КонецЕсли;
	ЭтотОбъект.Записать();
	
КонецПроцедуры

Процедура СоздатьСчетНаОплатуРаботы() Экспорт
	
	СтрокаСчета = ЭтотОбъект.СчетаНаОплату.Найти(Истина, "ЭтоСчетНаРаботы");
	Если СтрокаСчета <> Неопределено Тогда
		СчетНаОплату = СтрокаСчета.СчетНаОплату;
	Иначе
		СчетНаОплату = Неопределено;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(СчетНаОплату) Тогда
		
		СчетОбъект = СчетНаОплату.Ссылка.ПолучитьОбъект();
		СчетОбъект.Товары.Очистить();
		
		НовыйСчет = СчетОбъект;
		
	Иначе
		
		НовыйСчет = Документы.СчетНаОплату.СоздатьДокумент();
		
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ЭтотОбъект.ЗаказНаряд) Тогда
		дкОбработкаЗаполнения(НовыйСчет, ЭтотОбъект.ЗаказНаряд);
		Основание = ЭтотОбъект.ЗаказНаряд;
	Иначе
		дкОбработкаЗаполнения(НовыйСчет, ЭтотОбъект);
		Основание = ЭтотОбъект;
		НовыйСчет.Контрагент = ЭтотОбъект.Клиент;
		Если ЗначениеЗаполнено(НовыйСчет.Организация) Тогда
			НовыйСчет.РасчетныйСчетОрганизации = НовыйСчет.Организация.ОсновнойБанковскийСчет;
		КонецЕсли;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(НовыйСчет.Контрагент) Тогда
		Если НЕ ЗначениеЗаполнено(CRM_Сервер.DMS_ПолучитьОсновнойДоговорКонтрагента(НовыйСчет.Контрагент)) Тогда
			КонтрагентОбъект = НовыйСчет.Контрагент.ПолучитьОбъект();
			КонтрагентОбъект.СоздатьОсновнойДоговор();
			КонтрагентОбъект.Записать();
		КонецЕсли;
		НовыйСчет.ДоговорВзаиморасчетов = CRM_Сервер.DMS_ПолучитьОсновнойДоговорКонтрагента(НовыйСчет.Контрагент);
	КонецЕсли;
	
	НовыйСчет.Товары.Очистить();
	Для Каждого СтрокаРабот ИЗ Основание.Работы Цикл
		НоваяСтрока = НовыйСчет.Товары.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаРабот);
		НоваяСтрока.Номенклатура = СтрокаРабот.Работа;
		НоваяСтрока.ЕдиницаИзмерения = СтрокаРабот.Нормочас;
		НоваяСтрока.Цена = СтрокаРабот.Цена;
		Если ЗначениеЗаполнено(ЭтотОбъект.ЗаказНаряд) Тогда
			НоваяСтрока.Коэффициент = СтрокаРабот.Коэффициент;
			НоваяСтрока.Количество = СтрокаРабот.Количество;
		Иначе
			НоваяСтрока.Коэффициент = 1;
			НоваяСтрока.Количество = СтрокаРабот.Длительность;
		КонецЕсли;
		НоваяСтрока.СуммаВсего = СтрокаРабот.Цена*НоваяСтрока.Количество;
	КонецЦикла;
		
	Если НЕ ЗначениеЗаполнено(ТипЦен) Тогда
			
		НовыйСчет.ТипЦен = ЭтотОбъект.ДилерскийЦентр.Автосервис_ТипЦенПродажи;
			
	КонецЕсли;
	
	НовыйСчет.Записать();
	Если СтрокаСчета <> Неопределено Тогда
		СтрокаСчета.СчетНаОплату = НовыйСчет.Ссылка;
	Иначе
		СтрокаСчета = СчетаНаОплату.Добавить();
		СтрокаСчета.СчетНаОплату = НовыйСчет.Ссылка;
		СтрокаСчета.ЭтоСчетНаРаботы = Истина;
	КонецЕсли;
	ЭтотОбъект.Записать();
	
КонецПроцедуры


Функция ПечатьРабочейКарты(СсылкаНаОбъект) Экспорт
	

	ТабДокумент = Новый ТабличныйДокумент;
	Если НЕ ЗначениеЗаполнено(СсылкаНаОбъект) Тогда
		Возврат ТабДокумент;
	КонецЕсли;
	
	Макет = ПолучитьОбщийМакет("Renault_ШтампЧасыЗаявкиНаСервис");	
		
   	ОбластьШапка = Макет.ПолучитьОбласть("Шапка");
	ОбластьПодвал = Макет.ПолучитьОбласть("Подвал");
	ОбластьПустаяСтрока = Макет.ПолучитьОбласть("ПустаяСтрока");
	ОбластьЗаголовокТаблицыРаботы = Макет.ПолучитьОбласть("ЗаголовокТаблицыРаботы");
	ОбластьСтрокаРаботы = Макет.ПолучитьОбласть("СтрокаРаботы");

	ОбластьШапка.Параметры.НомерКарты = СсылкаНаОбъект.Номер;	
	ОбластьШапка.Параметры.ДатаКарты = Формат(СсылкаНаОбъект.Дата,"ДЛФ=Д");	
	
	ОбластьШапка.Параметры.ЗаявкаНаРемонт = СсылкаНаОбъект.Номер;	
	Если  ЗначениеЗаполнено(СсылкаНаОбъект.ЗаказНаряд) Тогда
		ОбластьШапка.Параметры.НомерЗаказНаряда = СсылкаНаОбъект.ЗаказНаряд.Номер;	
		ОбластьШапка.Параметры.ДатаЗаказНаряда = Формат(СсылкаНаОбъект.ЗаказНаряд.Дата,"ДЛФ=Д");	
		ОбластьШапка.Параметры.Комментарии = Строка(СсылкаНаОбъект.ЗаказНаряд.ПричинаОбращения);	
	Иначе
		Если ЗначениеЗаполнено(СсылкаНаОбъект.Обращение) Тогда
			ОбластьШапка.Параметры.Комментарии = СсылкаНаОбъект.Обращение.Примечание;
		КонецЕсли;
	КонецЕсли; 
	
		
	// -- приемка
	Если значениеЗаполнено(СсылкаНаОбъект.Обращение) Тогда
		Запрос = Новый Запрос("ВЫБРАТЬ РАЗРЕШЕННЫЕ
		| Renault_CRM_ПриемкаАвтомобиля.Ссылка КАК Приемка
		|ИЗ
		| Документ.Renault_CRM_ПриемкаАвтомобиля КАК Renault_CRM_ПриемкаАвтомобиля
		|ГДЕ
		| Renault_CRM_ПриемкаАвтомобиля.Обращение.Ссылка = &Обращение");
		Запрос.УстановитьПараметр("Обращение", СсылкаНаОбъект.Обращение);
		Выборка = Запрос.Выполнить().Выбрать();
        Если Выборка.Следующий() Тогда
			СвязаннаяПриемка = Выборка.Приемка;
		    ОбластьШапка.Параметры.МастерПриемщик  = СвязаннаяПриемка.Машиноместо;
			Если СвязаннаяПриемка.КлиентБудетОжидатьОкончаниеРемонта = истина Тогда
				ОбластьШапка.Параметры.КлиентОжидает = "Клиент ожидает";
			Иначе
				ОбластьШапка.Параметры.КлиентОжидает = "Клиент уехал";
			КонецЕсли;
			
			Если  СвязаннаяПриемка.СохранятьЗамененныеЗЧ = истина Тогда
				ОбластьШапка.Параметры.СохранятьЗЧ = "ДА";
			Иначе
				ОбластьШапка.Параметры.СохранятьЗЧ = "НЕТ";
			КонецЕсли;

		КонецЕсли;
	КонецЕсли;
	// --- вр начала
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	Renault_CRM_ЗаявкаНаСервисЭтапы.Ссылка,
	               |	МИНИМУМ(Renault_CRM_ЗаявкаНаСервисЭтапы.НачалоЭтапа) КАК НачалоЭтапа,
	               |	МАКСИМУМ(Renault_CRM_ЗаявкаНаСервисЭтапы.КонецЭтапа) КАК КонецЭтапа,
	               |	СУММА(Renault_CRM_ЗаявкаНаСервисЭтапы.ДлительностьЭтапаПлан) КАК ДлительностьЭтапаПлан,
	               |	СУММА(Renault_CRM_ЗаявкаНаСервисЭтапы.ДлительностьЭтапаФакт) КАК ДлительностьЭтапаФакт,
	               |	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ Renault_CRM_ЗаявкаНаСервисЭтапы.Этап) КАК Этап,
	               |	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ Renault_CRM_ЗаявкаНаСервисЭтапы.НомерСтроки) КАК НомерСтроки
	               |ИЗ
	               |	Документ.Renault_CRM_ЗаявкаНаСервис.Этапы КАК Renault_CRM_ЗаявкаНаСервисЭтапы
	               |ГДЕ
	               |	Renault_CRM_ЗаявкаНаСервисЭтапы.Ссылка = &Ссылка
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	Renault_CRM_ЗаявкаНаСервисЭтапы.Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка",СсылкаНаОбъект);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		 ОбластьШапка.Параметры.ВрНачала = Формат(Выборка.НачалоЭтапа,"ДФ=""дд.ММ.гггг ЧЧ:мм""");
		 ОбластьШапка.Параметры.ВрОкончания = Формат(Выборка.КонецЭтапа,"ДФ=""дд.ММ.гггг ЧЧ:мм""");
	КонецЕсли;
	// ---
	//  ---- повреждения
	Запрос = Новый Запрос();
	Запрос.Текст = "ВЫБРАТЬ
	               |	Renault_ПоврежденияКузоваСрезПоследних.Повреждение КАК Повреждение,
	               |	Renault_ПоврежденияКузоваСрезПоследних.Повреждение.Описание КАК НаименованиеПовреждения,
	               |	Renault_ПоврежденияКузоваСрезПоследних.ЗонаПовреждения КАК ЗонаПовреждения,
	               |	Renault_ПоврежденияКузоваСрезПоследних.ЗонаПовреждения.ИмяЭлемента КАК ИмяЭлемента,
	               |	Renault_ПоврежденияКузоваСрезПоследних.ЗонаПовреждения.ОтображаемаяЗона КАК Отображать,
	               |	Renault_ПоврежденияКузоваСрезПоследних.Значение КАК Значение,
	               |	Renault_ПоврежденияКузоваСрезПоследних.СтепеньПовреждения КАК СтепеньПовреждения,
	               |	Renault_ПоврежденияКузоваСрезПоследних.Комментарий КАК Комментарий,
	               |	Renault_ПоврежденияКузоваСрезПоследних.Авторабота КАК Авторабота
	               |ИЗ
	               |	РегистрСведений.Renault_ПоврежденияКузова.СрезПоследних(
	               |			,
	               |			Автомобиль = &Автомобиль
	               |				И Обращение = &Обращение) КАК Renault_ПоврежденияКузоваСрезПоследних";
	
	Запрос.УстановитьПараметр("Автомобиль", СсылкаНаОбъект.Автомобиль);
	Запрос.УстановитьПараметр("Обращение", СсылкаНаОбъект.Обращение.Ссылка);
	ТаблицаПовреждений = Запрос.Выполнить().Выгрузить();
	
	// ------------------------------------------------
	СписокПовреждений = "";
	нпп = 1;
	ЭтоПерв = Истина;
	Для Каждого Строка из ТаблицаПовреждений Цикл
		 
		Если Строка.ЗонаПовреждения.ПометкаУдаления Тогда
			Продолжить;
		КонецЕсли;
 
		Если Строка.Отображать = Истина Тогда
			Если Не ЗначениеЗаполнено(Строка.Повреждение) И Не ЗначениеЗаполнено(Строка.ЗонаПовреждения) Тогда
				Продолжить;
			КонецЕсли;
			
			Если ЭтоПерв = Истина Тогда
				 ЭтоПерв = Ложь;
				СписокПовреждений = "1. " + СформироватьНазваниеПовреждения(Строка);
			Иначе
				СписокПовреждений = СписокПовреждений + Символы.ПС + СтрЗаменить(Строка(нпп), Символы.НПП, "") + ". " +
				СформироватьНазваниеПовреждения(Строка);
			КонецЕсли;
			
			
			нпп = нпп+1;
			
		ИначеЕсли Строка.Повреждение = Справочники.Renault_Автосервис_Повреждения.УровеньТоплива Тогда
			
			
			
		Иначе //Если Строка.Повреждение = Справочники.Renault_Автосервис_Повреждения.КомментарийАктОсмотра Тогда
			Если ЗначениеЗаполнено(Строка.Повреждение) Тогда
				СписокПовреждений = СписокПовреждений + Символы.ПС + СтрЗаменить(Строка(нпп), Символы.НПП, "") + ". " +
				СформироватьНазваниеПовреждения(Строка);
				нпп = нпп+1;
				ЭтоПерв = Ложь;
			КонецЕсли;
		КонецЕсли;		
		
	КонецЦикла;
	
	//Если ДилерскийЦентр.Автосервис_ИспользуетсяПланшет Тогда  
	//	ДополнительныеСведения = Renault_АвтосервисСервер.ПолучитьВсеПрочиеПовреждения(Ссылка,нпп);	  
	//	СписокПовреждений =СписокПовреждений + Символы.ПС + ДополнительныеСведения;
	//КонецЕсли;
	
	ОбластьШапка.Параметры.ОбнаруженныеПоврежденияАвтомобиля = СписокПовреждений;
	

	// ---------------------------------------------
	Если ЗначениеЗаполнено(СсылкаНаОбъект.Клиент) Тогда
		кл1 =  СсылкаНаОбъект.Клиент;			
		Если ЗначениеЗаполнено(кл1.Фамилия) Тогда
			ОбластьШапка.Параметры.Заказчик = кл1.Фамилия + " " + кл1.Имя + " " + кл1.Отчество;
		Иначе
			ОбластьШапка.Параметры.Заказчик = кл1.НаименованиеПолное;
		КонецЕсли;
		ТелефонЗаказчика = Renault_УправлениеКонтактнойИнформацией.ПолучитьОсновнойТелефонКлиента(кл1.Ссылка);
		ОбластьШапка.Параметры.ТелефонЗаказчика = ТелефонЗаказчика;
	конецЕсли;
	Если ЗначениеЗаполнено(СсылкаНаОбъект.Автомобиль) Тогда
		авт1 = СсылкаНаОбъект.Автомобиль;		
		ОбластьШапка.Параметры.VIN = авт1.VIN;
		ОбластьШапка.Параметры.ГодВыпуска = формат(авт1.ГодВыпуска,"ДФ=""гггг""");
		Если ЗначениеЗаполнено(авт1.Модель) Тогда
			ОбластьШапка.Параметры.АвтомобильМодель = авт1.Модель;
			//  марка автомобиля
			Запрос = Новый Запрос;
			Запрос.Текст = 
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	CRM_МаркаАвтомобиляМоделиАвтомобилей.Ссылка,
			|	CRM_МаркаАвтомобиляМоделиАвтомобилей.Ссылка.Наименование КАК Наименование
			|ИЗ
			|	Справочник.CRM_МаркаАвтомобиля.МоделиАвтомобилей КАК CRM_МаркаАвтомобиляМоделиАвтомобилей
			|ГДЕ
			|	CRM_МаркаАвтомобиляМоделиАвтомобилей.Модель = &Модель";
			Запрос.УстановитьПараметр("Модель",авт1.Модель);
			Выборка =  Запрос.Выполнить().Выбрать();
			Если Выборка.Следующий() Тогда
				ОбластьШапка.Параметры.АвтомобильМарка =  Выборка.Наименование;
			КонецЕсли;

			
		КонецЕсли;
		Попытка
			Хозяин     = Справочники.Автомобили.ЧтениеЗначенияРегистраСведения(авт1, Перечисления.ДополнительнаяИнформацияАвтомобилей.Хозяин);
			ОбластьШапка.Параметры.Владелец = Хозяин;
			ОбластьШапка.Параметры.ТелефонВладельца = Renault_УправлениеКонтактнойИнформацией.ПолучитьОсновнойТелефонКлиента(Хозяин.Ссылка);
		Исключение
		КонецПопытки;
		//Получить последний пробег
		ОбластьШапка.Параметры.Пробег     = Справочники.Автомобили.ЧтениеЗначенияРегистраСведения(авт1, Перечисления.ДополнительнаяИнформацияАвтомобилей.Пробег);
		//Получить последний ГосНомер
		ОбластьШапка.Параметры.ГосНомер   = Справочники.Автомобили.ЧтениеЗначенияРегистраСведения(авт1, Перечисления.ДополнительнаяИнформацияАвтомобилей.ГосНомер);
		//Получить последний техпаспорт
		//Установим формат отображения года выпуска
		//ФорматПредставленияГодаВыпускаАвтомобиля=орПолучитьФорматПредставленияГодаВыпускаАвтомобиля(глПрава);
		//ЭлементыФормы.ГодВыпуска.Формат=ФорматПредставленияГодаВыпускаАвтомобиля;

	конецЕсли;
	ТабДокумент.Вывести(ОбластьШапка);
	
	ТабДокумент.Вывести(ОбластьПустаяСтрока);
	ТабДокумент.Вывести(ОбластьЗаголовокТаблицыРаботы);
	
	Счетчик = 0;
	Для каждого стрРаботы из СсылкаНаОбъект.Работы Цикл
		Счетчик = Счетчик + 1;
		ОбластьСтрокаРаботы.Параметры.НомерСтрокиРаботы = Счетчик;
		ОбластьСтрокаРаботы.Параметры.Работа = Строка(стрРаботы.Работа);
		//ОбластьСтрокаРаботы.Параметры.Артикул = Строка(стрРаботы.Работа.Артикул);
		ТабДокумент.Вывести(ОбластьСтрокаРаботы);

	КонецЦикла;
	// ОбластьСтрокаРаботы
	ТабДокумент.Вывести(ОбластьПустаяСтрока);
	
	// ----
	ОбластьЗаголовокТаблицыВыполненные = Макет.ПолучитьОбласть("ЗаголовокТаблицыВыполненные");
	ОбластьСтрокаВыполненные = Макет.ПолучитьОбласть("СтрокаВыполненные");
	ТабДокумент.Вывести(ОбластьЗаголовокТаблицыВыполненные);
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	Renault_CRM_ЗаявкаНаСервисСоставЭтапа.Ссылка,
	               |	Renault_CRM_ЗаявкаНаСервисСоставЭтапа.IDРаботы,
	               |	Renault_CRM_ЗаявкаНаСервисСоставЭтапа.IDЭтапа
	               |ПОМЕСТИТЬ тРабЭтапы
	               |ИЗ
	               |	Документ.Renault_CRM_ЗаявкаНаСервис.СоставЭтапа КАК Renault_CRM_ЗаявкаНаСервисСоставЭтапа
	               |ГДЕ
	               |	Renault_CRM_ЗаявкаНаСервисСоставЭтапа.Ссылка = &Ссылка
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	Renault_CRM_ЗаявкаНаСервисСоставЭтапа.Ссылка,
	               |	Renault_CRM_ЗаявкаНаСервисСоставЭтапа.IDРаботы,
	               |	Renault_CRM_ЗаявкаНаСервисСоставЭтапа.IDЭтапа
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	Renault_CRM_ЗаявкаНаСервисРаботы.Ссылка,
	               |	Renault_CRM_ЗаявкаНаСервисРаботы.Работа,
	               |	Renault_CRM_ЗаявкаНаСервисРаботы.Длительность,
	               |	Renault_CRM_ЗаявкаНаСервисРаботы.Нормочас,
	               |	Renault_CRM_ЗаявкаНаСервисРаботы.Цена,
	               |	Renault_CRM_ЗаявкаНаСервисРаботы.Сумма,
	               |	Renault_CRM_ЗаявкаНаСервисРаботы.ИдентификаторРаботы,
	               |	Renault_CRM_ЗаявкаНаСервисРаботы.ДлительностьЗН,
	               |	Renault_CRM_ЗаявкаНаСервисРаботы.IDРаботы,
	               |	Renault_CRM_ЗаявкаНаСервисРаботы.НомерСтроки,
	               |	Renault_CRM_ЗаявкаНаСервисРаботы.Работа.Артикул КАК Артикул,
	               |	т2.IDЭтапа
	               |ПОМЕСТИТЬ тЭтапСводно
	               |ИЗ
	               |	Документ.Renault_CRM_ЗаявкаНаСервис.Работы КАК Renault_CRM_ЗаявкаНаСервисРаботы
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ тРабЭтапы КАК т2
	               |		ПО (т2.Ссылка = Renault_CRM_ЗаявкаНаСервисРаботы.Ссылка)
	               |			И (т2.IDРаботы = Renault_CRM_ЗаявкаНаСервисРаботы.IDРаботы)
	               |ГДЕ
	               |	Renault_CRM_ЗаявкаНаСервисРаботы.Ссылка = &Ссылка
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	т3.Ссылка,
	               |	т3.IDЭтапа,
	               |	СУММА(т3.Длительность) КАК СумДлительность,
	               |	СУММА(т3.ДлительностьЗН) КАК СумДлительностьЗН,
	               |	КОЛИЧЕСТВО(т3.IDРаботы) КАК КолРаботы,
	               |	МИНИМУМ(т3.Работа) КАК МинРабота,
	               |	МАКСИМУМ(т3.Работа) КАК МаксРабота
	               |ПОМЕСТИТЬ тОписаниеЭтапа
	               |ИЗ
	               |	тЭтапСводно КАК т3
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	т3.Ссылка,
	               |	т3.IDЭтапа
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	Renault_АвтосервисЦехШтампЧасыПростои.РабочийДокумент,
	               |	Renault_АвтосервисЦехШтампЧасыПростои.IDЭтапа,
	               |	МИНИМУМ(Renault_АвтосервисЦехШтампЧасыПростои.Цех) КАК МинЦехПр,
	               |	МАКСИМУМ(Renault_АвтосервисЦехШтампЧасыПростои.Цех) КАК МаксЦехПр,
	               |	МИНИМУМ(Renault_АвтосервисЦехШтампЧасыПростои.Исполнитель) КАК МинИсполнительПр,
	               |	МАКСИМУМ(Renault_АвтосервисЦехШтампЧасыПростои.Исполнитель) КАК МаксИсполнительПр,
	               |	КОЛИЧЕСТВО(Renault_АвтосервисЦехШтампЧасыПростои.Исполнитель) КАК КолвоИсполнительПр,
	               |	МИНИМУМ(Renault_АвтосервисЦехШтампЧасыПростои.ВремяНачало) КАК МинВремяНачалоПр,
	               |	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ Renault_АвтосервисЦехШтампЧасыПростои.ВремяНачало) КАК КолвоПростоев,
	               |	МАКСИМУМ(Renault_АвтосервисЦехШтампЧасыПростои.ВремяОкончание) КАК МаксВремяОкончПр,
	               |	СУММА(Renault_АвтосервисЦехШтампЧасыПростои.Длительность) КАК ВсегоДлитПростоя,
	               |	МИНИМУМ(Renault_АвтосервисЦехШтампЧасыПростои.ТипПростоя) КАК МинТипПростоя,
	               |	"""" КАК МинКомментПростой,
	               |	"""" КАК МаксКомментПростой
	               |ПОМЕСТИТЬ тЭтапыПр
	               |ИЗ
	               |	РегистрСведений.Renault_АвтосервисЦехШтампЧасыПростои КАК Renault_АвтосервисЦехШтампЧасыПростои
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.Renault_АвтосервисЦехШтампЧасы КАК т1
	               |		ПО Renault_АвтосервисЦехШтампЧасыПростои.IDЭтапа = т1.IDЭтапа
	               |			И Renault_АвтосервисЦехШтампЧасыПростои.РабочийДокумент = т1.РабочийДокумент
	               |			И Renault_АвтосервисЦехШтампЧасыПростои.ВремяНачало = т1.ВремяОтбивки
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	Renault_АвтосервисЦехШтампЧасыПростои.РабочийДокумент,
	               |	Renault_АвтосервисЦехШтампЧасыПростои.IDЭтапа
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	Renault_АвтосервисЦехШтампЧасыИсполнители.РабочийДокумент,
	               |	Renault_АвтосервисЦехШтампЧасыИсполнители.IDЭтапа,
	               |	Renault_АвтосервисЦехШтампЧасыИсполнители.ВремяНачало,
	               |	КОЛИЧЕСТВО(Renault_АвтосервисЦехШтампЧасыИсполнители.Исполнитель) КАК КолвоИсполнителей,
	               |	МИНИМУМ(Renault_АвтосервисЦехШтампЧасыИсполнители.Исполнитель) КАК МинИсполнитель,
	               |	МАКСИМУМ(Renault_АвтосервисЦехШтампЧасыИсполнители.Исполнитель) КАК МаксИсполнитель
	               |ПОМЕСТИТЬ тИсполнители
	               |ИЗ
	               |	РегистрСведений.Renault_АвтосервисЦехШтампЧасыИсполнители КАК Renault_АвтосервисЦехШтампЧасыИсполнители
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	Renault_АвтосервисЦехШтампЧасыИсполнители.РабочийДокумент,
	               |	Renault_АвтосервисЦехШтампЧасыИсполнители.IDЭтапа,
	               |	Renault_АвтосервисЦехШтампЧасыИсполнители.ВремяНачало
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	Renault_АвтосервисЦехШтампЧасыПродуктивные.РабочийДокумент,
	               |	Renault_АвтосервисЦехШтампЧасыПродуктивные.IDЭтапа,
	               |	МИНИМУМ(Renault_АвтосервисЦехШтампЧасыПродуктивные.Цех) КАК МинЦех,
	               |	МИНИМУМ(Renault_АвтосервисЦехШтампЧасыПродуктивные.Исполнитель) КАК МинИсполнительОтб,
	               |	МАКСИМУМ(Renault_АвтосервисЦехШтампЧасыПродуктивные.Исполнитель) КАК МаксИсполнительОтб,
	               |	КОЛИЧЕСТВО(Renault_АвтосервисЦехШтампЧасыПродуктивные.Исполнитель) КАК КолвоИсполнителейОтб,
	               |	МИНИМУМ(т1.МинИсполнитель) КАК МинИсполнитель,
	               |	МАКСИМУМ(т1.МаксИсполнитель) КАК МаксИсполнитель,
	               |	КОЛИЧЕСТВО(т1.КолвоИсполнителей) КАК КолвоИсполнителей,
	               |	МИНИМУМ(Renault_АвтосервисЦехШтампЧасыПродуктивные.ВремяНачало) КАК МинВремяНачало,
	               |	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ Renault_АвтосервисЦехШтампЧасыПродуктивные.ВремяНачало) КАК КолвоПромежутков,
	               |	МАКСИМУМ(Renault_АвтосервисЦехШтампЧасыПродуктивные.ВремяОкончание) КАК МаксВремяОкончание,
	               |	СУММА(Renault_АвтосервисЦехШтампЧасыПродуктивные.Длительность) КАК ДлителностьВсего,
	               |	"""" КАК МинКомментарий,
	               |	"""" КАК МаксКомментарий,
	               |	МИНИМУМ(Renault_АвтосервисЦехШтампЧасыПродуктивные.СтатусАвтоработы) КАК МинСтатусРаботы,
	               |	МАКСИМУМ(Renault_АвтосервисЦехШтампЧасыПродуктивные.СтатусАвтоработы) КАК МаксСтатусРаботы
	               |ПОМЕСТИТЬ тЭтапы
	               |ИЗ
	               |	РегистрСведений.Renault_АвтосервисЦехШтампЧасыПродуктивные КАК Renault_АвтосервисЦехШтампЧасыПродуктивные
	               |		ЛЕВОЕ СОЕДИНЕНИЕ тИсполнители КАК т1
	               |		ПО (т1.РабочийДокумент = Renault_АвтосервисЦехШтампЧасыПродуктивные.РабочийДокумент)
	               |			И (т1.IDЭтапа = Renault_АвтосервисЦехШтампЧасыПродуктивные.IDЭтапа)
	               |			И (т1.ВремяНачало = Renault_АвтосервисЦехШтампЧасыПродуктивные.ВремяНачало)
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	Renault_АвтосервисЦехШтампЧасыПродуктивные.РабочийДокумент,
	               |	Renault_АвтосервисЦехШтампЧасыПродуктивные.IDЭтапа
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	тЭтапы.РабочийДокумент КАК Ссылка,
	               |	тЭтапы.IDЭтапа,
	               |	тЭтапы.МинЦех,
	               |	тЭтапы.МинИсполнительОтб,
	               |	тЭтапы.МаксИсполнительОтб,
	               |	тЭтапы.КолвоИсполнителейОтб,
	               |	тЭтапы.МинИсполнитель,
	               |	тЭтапы.МаксИсполнитель,
	               |	тЭтапы.КолвоИсполнителей,
	               |	тЭтапы.МинВремяНачало,
	               |	тЭтапы.КолвоПромежутков,
	               |	тЭтапы.МаксВремяОкончание,
	               |	тЭтапы.ДлителностьВсего,
	               |	тЭтапы.МинКомментарий,
	               |	тЭтапы.МаксКомментарий,
	               |	"""" КАК КомментарийПрод,
	               |	тЭтапы.МинСтатусРаботы,
	               |	тЭтапы.МаксСтатусРаботы,
	               |	т2.МинЦехПр,
	               |	т2.МаксЦехПр,
	               |	т2.МинИсполнительПр,
	               |	т2.МаксИсполнительПр,
	               |	т2.КолвоИсполнительПр,
	               |	т2.МинВремяНачалоПр,
	               |	ЕСТЬNULL(т2.КолвоПростоев, 0) КАК КолвоПростоев,
	               |	т2.МаксВремяОкончПр,
	               |	ЕСТЬNULL(т2.ВсегоДлитПростоя, 0) КАК ВсегоДлитПростоя,
	               |	т2.МинТипПростоя,
	               |	т2.МинКомментПростой,
	               |	т2.МаксКомментПростой
	               |ПОМЕСТИТЬ тЭтапыФакт
	               |ИЗ
	               |	тЭтапы КАК тЭтапы
	               |		ЛЕВОЕ СОЕДИНЕНИЕ тЭтапыПр КАК т2
	               |		ПО тЭтапы.РабочийДокумент = т2.РабочийДокумент
	               |			И тЭтапы.IDЭтапа = т2.IDЭтапа
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	Renault_CRM_ЗаявкаНаСервисЭтапы.Ссылка,
	               |	Renault_CRM_ЗаявкаНаСервисЭтапы.IDЭтапа,
	               |	МИНИМУМ(Renault_CRM_ЗаявкаНаСервисЭтапы.Этап) КАК Этап,
	               |	МИНИМУМ(Renault_CRM_ЗаявкаНаСервисЭтапы.Цех) КАК Цех,
	               |	МИНИМУМ(Renault_CRM_ЗаявкаНаСервисЭтапы.СтатусЭтапа) КАК СтатусЭтапа,
	               |	СУММА(Renault_CRM_ЗаявкаНаСервисЭтапы.ДлительностьЭтапаПлан) КАК ДлительностьЭтапаПлан,
	               |	СУММА(Renault_CRM_ЗаявкаНаСервисЭтапы.ДлительностьЭтапаФакт) КАК ДлительностьЭтапаФакт
	               |ПОМЕСТИТЬ тЭтапыШаблон
	               |ИЗ
	               |	Документ.Renault_CRM_ЗаявкаНаСервис.Этапы КАК Renault_CRM_ЗаявкаНаСервисЭтапы
	               |ГДЕ
	               |	Renault_CRM_ЗаявкаНаСервисЭтапы.Ссылка = &Ссылка
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	Renault_CRM_ЗаявкаНаСервисЭтапы.Ссылка,
	               |	Renault_CRM_ЗаявкаНаСервисЭтапы.IDЭтапа
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	тЭтапыШаблон.Ссылка,
	               |	тЭтапыШаблон.IDЭтапа,
	               |	тЭтапыШаблон.Этап,
	               |	тОписаниеЭтапа.КолРаботы,
	               |	тОписаниеЭтапа.МинРабота КАК Работа1,
	               |	ВЫБОР
	               |		КОГДА тОписаниеЭтапа.МинРабота = тОписаниеЭтапа.МаксРабота
	               |			ТОГДА ЗНАЧЕНИЕ(Справочник.Автоработы.ПустаяСсылка)
	               |		ИНАЧЕ тОписаниеЭтапа.МаксРабота
	               |	КОНЕЦ КАК Работа2,
	               |	тОписаниеЭтапа.СумДлительностьЗН КАК СумДлительностьЗН,
	               |	тЭтапыФакт.МинИсполнитель,
	               |	тЭтапыФакт.МаксИсполнитель,
	               |	тЭтапыФакт.КолвоИсполнителей,
	               |	тЭтапыФакт.МинВремяНачало,
	               |	тЭтапыФакт.КолвоПромежутков,
	               |	тЭтапыФакт.МаксВремяОкончание,
	               |	тЭтапыФакт.ДлителностьВсего,
	               |	тЭтапыФакт.МинКомментарий,
	               |	тЭтапыФакт.МаксКомментарий,
	               |	тЭтапыФакт.КомментарийПрод,
	               |	тЭтапыФакт.МинСтатусРаботы,
	               |	тЭтапыФакт.МаксСтатусРаботы,
	               |	тЭтапыФакт.МинЦехПр,
	               |	тЭтапыФакт.МаксЦехПр,
	               |	тЭтапыФакт.МинИсполнительПр,
	               |	тЭтапыФакт.МаксИсполнительПр,
	               |	тЭтапыФакт.КолвоИсполнительПр,
	               |	тЭтапыФакт.МинВремяНачалоПр,
	               |	тЭтапыФакт.КолвоПростоев,
	               |	тЭтапыФакт.МаксВремяОкончПр,
	               |	тЭтапыФакт.ВсегоДлитПростоя,
	               |	тЭтапыФакт.МинТипПростоя,
	               |	тЭтапыФакт.МинКомментПростой,
	               |	тЭтапыФакт.МаксКомментПростой
	               |ИЗ
	               |	тЭтапыШаблон КАК тЭтапыШаблон
	               |		ЛЕВОЕ СОЕДИНЕНИЕ тЭтапыФакт КАК тЭтапыФакт
	               |		ПО тЭтапыШаблон.Ссылка = тЭтапыФакт.Ссылка
	               |			И тЭтапыШаблон.IDЭтапа = тЭтапыФакт.IDЭтапа
	               |		ЛЕВОЕ СОЕДИНЕНИЕ тОписаниеЭтапа КАК тОписаниеЭтапа
	               |		ПО тЭтапыШаблон.Ссылка = тОписаниеЭтапа.Ссылка
	               |			И тЭтапыШаблон.IDЭтапа = тОписаниеЭтапа.IDЭтапа
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	тЭтапыШаблон.Ссылка,
	               |	ЕСТЬNULL(тЭтапыФакт.МинВремяНачало, ДАТАВРЕМЯ(2100, 1, 1, 0, 0, 0)),
	               |	тЭтапыШаблон.Этап";
	
	Запрос.УстановитьПараметр("Ссылка",СсылкаНаОбъект);
	Выборка =  Запрос.Выполнить().Выбрать();
	Счетчик = 0;
	Пока Выборка.Следующий() Цикл
		Счетчик = Счетчик + 1;
		ОбластьСтрокаВыполненные.Параметры.НомерСтр2 =  Счетчик;
		
		//ОбластьСтрокаВыполненные.Параметры.РаботаВып =  Строка(Выборка.Работа1) + " " + Строка(Выборка.Работа2) ;
		//АртикулВыпСтр = "";
		//Если ЗначениеЗаполнено(Выборка.Работа1) Тогда
		//	Попытка 
		//		АртикулВыпСтр = АртикулВыпСтр + Строка(Выборка.Работа1["Артикул"])  + " ";
		//	Исключение
		//	КонецПопытки;
		//КонецЕсли;
		//Если ЗначениеЗаполнено(Выборка.Работа2) Тогда
		//	Попытка
		//		АртикулВыпСтр = АртикулВыпСтр + Строка(Выборка.Работа2["Артикул"]);
		//	Исключение
		//	КонецПопытки;
		//КонецЕсли;
		
		ОбластьСтрокаВыполненные.Параметры.РаботаВып = ПолучитьСтрокуСписокРабот(СсылкаНаОбъект,Выборка.IDЭтапа);
				
		//ОбластьСтрокаВыполненные.Параметры.АртикулВып = АртикулВыпСтр;
		//ОбластьСтрокаВыполненные.Параметры.НормаВремени  = Выборка.СумДлительностьЗН;
		//ОбластьСтрокаВыполненные.Параметры.КомментарийВып = ?(СокрЛП(Выборка.МинКомментарий)=СокрЛП(Выборка.МаксКомментарий),СокрЛП(Выборка.МинКомментарий),СокрЛП(Выборка.КомментарийПрод));
		ОбластьСтрокаВыполненные.Параметры.КомментарийВып = ПолучитьСтрокуКомментариевЭтапРаботы(СсылкаНаОбъект,Выборка.IDЭтапа);
		//ОбластьСтрокаВыполненные.Параметры.ИсполнительВып = Строка(Выборка.МинИсполнитель);
		//Если Выборка.МинИсполнитель<>Выборка.МаксИсполнитель и значениеЗаполнено(Выборка.МаксИсполнитель) Тогда
		//	ОбластьСтрокаВыполненные.Параметры.ИсполнительВып = ОбластьСтрокаВыполненные.Параметры.ИсполнительВып + "; " +  Строка(Выборка.МаксИсполнитель);
		//КонецЕсли;
		ОбластьСтрокаВыполненные.Параметры.ИсполнительВып = ПолучитьСтрокуИсполнителиЭтапРаботы(СсылкаНаОбъект,Выборка.IDЭтапа);
		
		ОбластьСтрокаВыполненные.Параметры.ФактВремя  = Выборка.ДлителностьВсего;
		ОбластьСтрокаВыполненные.Параметры.НачалоРаботы  = Формат(Выборка.МинВремяНачало,"ДФ=""дд.ММ.гггг ЧЧ:мм""");
		ОбластьСтрокаВыполненные.Параметры.ОкончаниеРаботы  = Формат(Выборка.МаксВремяОкончание,"ДФ=""дд.ММ.гггг ЧЧ:мм"""); 
		ТабДокумент.Вывести(ОбластьСтрокаВыполненные);
	КонецЦикла;

	
	
	
	// ---
	
	ТабДокумент.Вывести(ОбластьПустаяСтрока);
	ТабДокумент.Вывести(ОбластьПодвал);

	// ----
	Возврат ТабДокумент;

	
КонецФункции


Функция ПолучитьСтрокуКомментариевЭтапРаботы(ДокСсылка,IDЭтапа) 
	Рез = "";
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	Renault_АвтосервисЦехШтампЧасыПродуктивные.РабочийДокумент,
	               |	Renault_АвтосервисЦехШтампЧасыПродуктивные.IDЭтапа,
	               |	Renault_АвтосервисЦехШтампЧасыПродуктивные.Цех,
	               |	Renault_АвтосервисЦехШтампЧасыПродуктивные.Исполнитель,
	               |	Renault_АвтосервисЦехШтампЧасыПродуктивные.ВремяНачало,
	               |	Renault_АвтосервисЦехШтампЧасыПродуктивные.ВремяОкончание,
	               |	Renault_АвтосервисЦехШтампЧасыПродуктивные.Длительность,
	               |	Renault_АвтосервисЦехШтампЧасыПродуктивные.Комментарий,
	               |	Renault_АвтосервисЦехШтампЧасыПродуктивные.СтатусАвтоработы
	               |ИЗ
	               |	РегистрСведений.Renault_АвтосервисЦехШтампЧасыПродуктивные КАК Renault_АвтосервисЦехШтампЧасыПродуктивные
	               |ГДЕ
	               |	Renault_АвтосервисЦехШтампЧасыПродуктивные.РабочийДокумент = &РабочийДокумент
	               |	И Renault_АвтосервисЦехШтампЧасыПродуктивные.IDЭтапа = &IDЭтапа
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	Renault_АвтосервисЦехШтампЧасыПродуктивные.ВремяНачало";
	Запрос.УстановитьПараметр("РабочийДокумент",ДокСсылка);
	Запрос.УстановитьПараметр("IDЭтапа",IDЭтапа);
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Рез = Рез + СокрЛП(Выборка.Комментарий) + "; ";	
	КонецЦикла;
	Если СтрДлина(Рез)>2 Тогда
		Рез = Лев(Рез,СтрДлина(Рез)-2);
	КонецЕсли;
	
	Возврат Рез;
КонецФункции

Функция ПолучитьСтрокуИсполнителиЭтапРаботы(ДокСсылка,IDЭтапа) 
	Рез = "";
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	Renault_АвтосервисЦехШтампЧасыИсполнители.РабочийДокумент,
	               |	Renault_АвтосервисЦехШтампЧасыИсполнители.IDЭтапа,
	               |	Renault_АвтосервисЦехШтампЧасыИсполнители.ВремяНачало,
	               |	Renault_АвтосервисЦехШтампЧасыИсполнители.Исполнитель
	               |ПОМЕСТИТЬ тИсполнители
	               |ИЗ
	               |	РегистрСведений.Renault_АвтосервисЦехШтампЧасыИсполнители КАК Renault_АвтосервисЦехШтампЧасыИсполнители
	               |ГДЕ
	               |	Renault_АвтосервисЦехШтампЧасыИсполнители.РабочийДокумент = &РабочийДокумент
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	Renault_АвтосервисЦехШтампЧасыИсполнители.РабочийДокумент,
	               |	Renault_АвтосервисЦехШтампЧасыИсполнители.IDЭтапа,
	               |	Renault_АвтосервисЦехШтампЧасыИсполнители.ВремяНачало,
	               |	Renault_АвтосервисЦехШтампЧасыИсполнители.Исполнитель
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	Renault_АвтосервисЦехШтампЧасыПродуктивные.РабочийДокумент,
	               |	Renault_АвтосервисЦехШтампЧасыПродуктивные.IDЭтапа,
	               |	Renault_АвтосервисЦехШтампЧасыПродуктивные.Цех,
	               |	Renault_АвтосервисЦехШтампЧасыПродуктивные.Исполнитель,
	               |	т1.Исполнитель КАК ИсполнительШтамп,
	               |	Renault_АвтосервисЦехШтампЧасыПродуктивные.ВремяНачало,
	               |	Renault_АвтосервисЦехШтампЧасыПродуктивные.ВремяОкончание,
	               |	Renault_АвтосервисЦехШтампЧасыПродуктивные.Длительность,
	               |	Renault_АвтосервисЦехШтампЧасыПродуктивные.Комментарий,
	               |	Renault_АвтосервисЦехШтампЧасыПродуктивные.СтатусАвтоработы
	               |ИЗ
	               |	РегистрСведений.Renault_АвтосервисЦехШтампЧасыПродуктивные КАК Renault_АвтосервисЦехШтампЧасыПродуктивные
	               |		ЛЕВОЕ СОЕДИНЕНИЕ тИсполнители КАК т1
	               |		ПО (т1.РабочийДокумент = Renault_АвтосервисЦехШтампЧасыПродуктивные.РабочийДокумент)
	               |			И (т1.IDЭтапа = Renault_АвтосервисЦехШтампЧасыПродуктивные.IDЭтапа)
	               |			И (т1.ВремяНачало = Renault_АвтосервисЦехШтампЧасыПродуктивные.ВремяНачало)
	               |ГДЕ
	               |	Renault_АвтосервисЦехШтампЧасыПродуктивные.РабочийДокумент = &РабочийДокумент
	               |	И Renault_АвтосервисЦехШтампЧасыПродуктивные.IDЭтапа = &IDЭтапа
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	Renault_АвтосервисЦехШтампЧасыПродуктивные.ВремяНачало,
	               |	т1.Исполнитель";
	Запрос.УстановитьПараметр("РабочийДокумент",ДокСсылка);
	Запрос.УстановитьПараметр("IDЭтапа",IDЭтапа);
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Если ЗначениеЗаполнено(Выборка.ИсполнительШтамп) Тогда
			Рез = Рез + СокрЛП(Строка(Выборка.ИсполнительШтамп)) + "; ";	
		КонецЕсли;
	КонецЦикла;
	Если СтрДлина(Рез)>2 Тогда
		Рез = Лев(Рез,СтрДлина(Рез)-2);
	КонецЕсли;
	
	Возврат Рез;
КонецФункции

Функция ПолучитьСтрокуСписокРабот(ДокСсылка,IDЭтапа,СтрокаАртикулы="") 
	Рез = "";
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	Renault_CRM_ЗаявкаНаСервисСоставЭтапа.Ссылка,
	               |	Renault_CRM_ЗаявкаНаСервисСоставЭтапа.IDРаботы,
	               |	Renault_CRM_ЗаявкаНаСервисСоставЭтапа.IDЭтапа
	               |ПОМЕСТИТЬ тРабЭтапы
	               |ИЗ
	               |	Документ.Renault_CRM_ЗаявкаНаСервис.СоставЭтапа КАК Renault_CRM_ЗаявкаНаСервисСоставЭтапа
	               |ГДЕ
	               |	Renault_CRM_ЗаявкаНаСервисСоставЭтапа.Ссылка = &РабочийДокумент
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	Renault_CRM_ЗаявкаНаСервисСоставЭтапа.Ссылка,
	               |	Renault_CRM_ЗаявкаНаСервисСоставЭтапа.IDРаботы,
	               |	Renault_CRM_ЗаявкаНаСервисСоставЭтапа.IDЭтапа
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	Renault_CRM_ЗаявкаНаСервисРаботы.Ссылка,
	               |	Renault_CRM_ЗаявкаНаСервисРаботы.Работа,
	               |	Renault_CRM_ЗаявкаНаСервисРаботы.Длительность,
	               |	Renault_CRM_ЗаявкаНаСервисРаботы.Нормочас,
	               |	Renault_CRM_ЗаявкаНаСервисРаботы.Цена,
	               |	Renault_CRM_ЗаявкаНаСервисРаботы.Сумма,
	               |	Renault_CRM_ЗаявкаНаСервисРаботы.ИдентификаторРаботы,
	               |	Renault_CRM_ЗаявкаНаСервисРаботы.ДлительностьЗН,
	               |	Renault_CRM_ЗаявкаНаСервисРаботы.IDРаботы,
	               |	Renault_CRM_ЗаявкаНаСервисРаботы.НомерСтроки,
	               |	Renault_CRM_ЗаявкаНаСервисРаботы.Работа.Артикул КАК Артикул,
	               |	т2.IDЭтапа
	               |ИЗ
	               |	Документ.Renault_CRM_ЗаявкаНаСервис.Работы КАК Renault_CRM_ЗаявкаНаСервисРаботы
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ тРабЭтапы КАК т2
	               |		ПО (т2.Ссылка = Renault_CRM_ЗаявкаНаСервисРаботы.Ссылка)
	               |			И (т2.IDРаботы = Renault_CRM_ЗаявкаНаСервисРаботы.IDРаботы)
	               |ГДЕ
	               |	Renault_CRM_ЗаявкаНаСервисРаботы.Ссылка = &РабочийДокумент
	               |	И т2.IDЭтапа = &IDЭтапа
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	Renault_CRM_ЗаявкаНаСервисРаботы.НомерСтроки";
	Запрос.УстановитьПараметр("РабочийДокумент",ДокСсылка);
	Запрос.УстановитьПараметр("IDЭтапа",IDЭтапа);
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Если ЗначениеЗаполнено(Выборка.Работа) Тогда
			Рез = Рез + СокрЛП(Строка(Выборка.Работа)) + "; ";
			СтрокаАртикулы = СтрокаАртикулы  + СокрЛП(Строка(Выборка.Артикул)) + "; ";
		КонецЕсли;
	КонецЦикла;
	Если СтрДлина(Рез)>2 Тогда
		Рез = Лев(Рез,СтрДлина(Рез)-2);
	КонецЕсли;
	Если СтрДлина(СтрокаАртикулы)>2 Тогда
		СтрокаАртикулы = Лев(СтрокаАртикулы,СтрДлина(СтрокаАртикулы)-2);
	КонецЕсли;

	Возврат Рез;
КонецФункции

Функция РазделитьСтрокуНаПодстроки(ОригинальнаяСтрока,ПервыйНомерСтроки, ПоследнийНомерСтроки)
	
	ВозвращаемаяСтрока = "";
	Для Индекс = ПервыйНомерСтроки По ПоследнийНомерСтроки Цикл

    	ВозвращаемаяСтрока = ВозвращаемаяСтрока + СтрПолучитьСтроку(ОригинальнаяСтрока,Индекс) + Символы.ПС;
		
	КонецЦикла; 
	Возврат ВозвращаемаяСтрока;
	
КонецФункции
