

Процедура ОбработкаВыбора(ВыбранныйНомер, ВладелецФормы, СпособЗагрузки) Экспорт
	Права = Неопределено;
	#Если Клиент Тогда
		Права = глПрава;
	#КонецЕсли
	
	Если ВыбранныйНомер <> Неопределено И ТипЗнч(ВыбранныйНомер) = Тип("Строка") Тогда
		// Получим данные из регистра сведений
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	Корзина.Номер,
		|	Корзина.Дата,
		|	Корзина.Клиент,
		|	Корзина.Значение
		|ИЗ
		|	РегистрСведений.Корзина КАК Корзина
		|ГДЕ
		|	Корзина.Номер = &Номер";
		Запрос.УстановитьПараметр("Номер", ВыбранныйНомер);
		Выборка = Запрос.Выполнить().Выбрать();
		Если Выборка.Следующий() Тогда
			Структура = Выборка.Значение.Получить();
			Если ТипЗнч(Структура)<>Тип("Структура") Тогда
				Возврат;
			КонецЕсли;
			//загрузим реквизиты шапки 
			Если СпособЗагрузки = 1 Тогда
				Попытка 
					Если ВладелецФормы.Заказчик <> Выборка.Клиент Тогда
						ВладелецФормы.Заказчик = Выборка.Клиент; 
						//форму не передаем -  не должны сработать обработчики ТЧ Товары, валюты, курса
						ВладелецФормы.ОбработкаРеквизита("Заказчик"); 
					КонецЕсли;
				Исключение КонецПопытки;
				Попытка 
					Если ВладелецФормы.Контрагент <> Выборка.Клиент Тогда
						ВладелецФормы.Контрагент = Выборка.Клиент; 
						//форму не передаем -  не должны сработать обработчики ТЧ Товары, валюты, курса
						ВладелецФормы.ОбработкаРеквизита("Контрагент"); 
					КонецЕсли;
				Исключение КонецПопытки;
				Попытка 
					Если ВладелецФормы.ДоговорВзаиморасчетов <> Структура.ДоговорВзаиморасчетов И ЗначениеЗаполнено(Структура.ДоговорВзаиморасчетов) Тогда
						ВладелецФормы.ДоговорВзаиморасчетов = Структура.ДоговорВзаиморасчетов; 
						//форму не передаем -  не должны сработать обработчики ТЧ Товары, валюты, курса
						ВладелецФормы.ОбработкаРеквизита("ДоговорВзаиморасчетов");
					КонецЕсли;
				Исключение КонецПопытки;
				Попытка 
					Если ВладелецФормы.ВалютаДокумента <> Структура.ВалютаДокумента Тогда
						ВладелецФормы.ВалютаДокумента = Структура.ВалютаДокумента;
						ВладелецФормы.ОбработкаРеквизита("ВалютаДокумента",,ВладелецФормы);
					КонецЕсли;		
				Исключение КонецПопытки;
				Попытка 
					Если ВладелецФормы.КурсДокумента <> Структура.КурсДокумента Тогда
						ВладелецФормы.КурсДокумента = Структура.КурсДокумента;
						ВладелецФормы.ОбработкаРеквизита("КурсДокумента",,ВладелецФормы);
					КонецЕсли;		
				Исключение КонецПопытки;
				Попытка 
					Если ВладелецФормы.ТипЦен <> Структура.ТипЦен Тогда
						ВладелецФормы.ТипЦен = Структура.ТипЦен;
						ВладелецФормы.ОбработкаРеквизита("ТипЦен",,ВладелецФормы);			
					КонецЕсли;
				Исключение КонецПопытки;
				Попытка 
					Если ВладелецФормы.СкладКомпании <> Структура.СкладКомпании Тогда
						ДопПараметры = Новый Структура;
						ДопПараметры.Вставить("ВозможностьИзмененияЦен", Ложь);
						ВладелецФормы.СкладКомпании = Структура.СкладКомпании;
						ВладелецФормы.ОбработкаРеквизита("СкладКомпании",,ВладелецФормы,ДопПараметры);
					КонецЕсли;		
				Исключение КонецПопытки;
				Попытка 
					Если ВладелецФормы.СкидкаНаценка <> Структура.ТипЦен Тогда
						ВладелецФормы.СкидкаНаценка = Структура.СкидкаНаценка;
						ВладелецФормы.ОбработкаРеквизита("СкидкаНаценка",,ВладелецФормы);
					КонецЕсли;		
				Исключение КонецПопытки;
				Попытка 
					Если ВладелецФормы.МаркетинговаяПрограмма <> Структура.МаркетинговаяПрограмма Тогда
						ВладелецФормы.МаркетинговаяПрограмма = Структура.МаркетинговаяПрограмма;
						ВладелецФормы.ОбработкаРеквизита("МаркетинговаяПрограмма",,ВладелецФормы);
					КонецЕсли;		
				Исключение КонецПопытки;
				
				Попытка 
					Если Не Структура.Свойство("КодРегиона") Тогда
						ВладелецФормы.КодРегиона = "";
					КонецЕсли;
					Если ВладелецФормы.КодРегиона <> Структура.КодРегиона Тогда
						ВладелецФормы.КодРегиона = Структура.КодРегиона;
					КонецЕсли;		
				Исключение КонецПопытки;
				Попытка 
					Если Не Структура.Свойство("КодГорода") Тогда
						ВладелецФормы.КодГорода = "";
					КонецЕсли;
					Если ВладелецФормы.КодГорода <> Структура.КодГорода Тогда
						ВладелецФормы.КодГорода = Структура.КодГорода;
					КонецЕсли;		
				Исключение КонецПопытки;
				Попытка 
					Если Не Структура.Свойство("ПредставлениеТелефона") Тогда
						ВладелецФормы.ПредставлениеТелефона = "";
					КонецЕсли;
					Если ВладелецФормы.ПредставлениеТелефона <> Структура.ПредставлениеТелефона Тогда
						ВладелецФормы.ПредставлениеТелефона = Структура.ПредставлениеТелефона;
					КонецЕсли;		
				Исключение КонецПопытки;
				Попытка 
					Если Не Структура.Свойство("ВнутреннийНомер") Тогда
						ВладелецФормы.ВнутреннийНомер = "";
					КонецЕсли;
					Если ВладелецФормы.ВнутреннийНомер <> Структура.ВнутреннийНомер Тогда
						ВладелецФормы.ВнутреннийНомер = Структура.ВнутреннийНомер;
					КонецЕсли;		
				Исключение КонецПопытки;
				Попытка 
					Если Не Структура.Свойство("НомерТелефона") Тогда
						ВладелецФормы.НомерТелефона = Неопределено;
					КонецЕсли;
					Если ВладелецФормы.НомерТелефона <> Структура.НомерТелефона Тогда
						ВладелецФормы.НомерТелефона = Структура.НомерТелефона;
					КонецЕсли;		
				Исключение КонецПопытки;
				Попытка 
					Если Не Структура.Свойство("ВидТелефона") Тогда
						ВладелецФормы.ВидТелефона = "";
					КонецЕсли;
					Если ВладелецФормы.ВидТелефона <> Структура.ВидТелефона Тогда
						ВладелецФормы.ВидТелефона = Структура.ВидТелефона;
					КонецЕсли;		
				Исключение КонецПопытки;
			КонецЕсли;
			
			Если ВладелецФормы.Заголовок = "АРМ Корзина" Тогда
				
				//для АРМ
				
				//эти реквизиты загружаются только в АРМ Корзина
				ВладелецФормы.Автор = Структура.Автор;
				ВладелецФормы.Организация = Структура.Организация;
				ВладелецФормы.ПодразделениеКомпании = Структура.ПодразделениеКомпании;
				ВладелецФормы.СкладКомпании = Структура.СкладКомпании;
				ВладелецФормы.Комментарий = Структура.Комментарий;
				
				ВладелецФормы.Дата = Выборка.Дата;
				ВладелецФормы.Номер = Выборка.Номер;
				
				//товары загружаются с очисткой таблицы
				ВладелецФормы.Товары.Очистить();
				ВладелецФормы.Товары.Загрузить(Структура.Товары);	
				
			Иначе
				
				//для документов
				
				Для Каждого ТекТовар Из Структура.Товары Цикл
					
					//проверка права "РедактированиеДеталейЗаказНаряда"
					Попытка
						Если ТипЗнч(ВладелецФормы.ЭтотОбъект) = Тип("ДокументОбъект.ЗаказНаряд") ИЛИ
							ТипЗнч(ВладелецФормы.ЭтотОбъект) = Тип("ДокументОбъект.ЗаявкаНаРемонт") Тогда
							РедактированиеНоменклатуры = обПраво("РедактированиеДеталейЗаказНаряда", Права);
							Если НЕ РедактированиеНоменклатуры Тогда
								Возврат;
							КонецЕсли;
						КонецЕсли;
					Исключение
					КонецПопытки;
					
					//имя реквизита зависит от вида документа
					ИмяРеквизитаКоличество = "";
					Попытка
						ИмяРеквизитаКоличество = ВладелецФормы.ЭлементыФормы.Товары.Колонки.Количество;	
						ИмяРеквизитаКоличество = "Количество";
						ИмяРеквизитаНоменклатура = "Номенклатура";
						ИмяРеквизитаХарактеристикаНоменклатуры = "ХарактеристикаНоменклатуры";
					Исключение
						Попытка
							ИмяРеквизитаКоличество = ВладелецФормы.ЭлементыФормы.Товары.Колонки.КоличествоРасход;	
							ИмяРеквизитаКоличество = "КоличествоРасход";
							ИмяРеквизитаНоменклатура = "НоменклатураРасход";
							ИмяРеквизитаХарактеристикаНоменклатуры = "ХарактеристикаНоменклатурыРасход";
						Исключение
						КонецПопытки; 
					КонецПопытки;
					
					Номенклатура 				= ТекТовар.Номенклатура;
					ЕдиницаИзмерения			= ТекТовар.ЕдиницаИзмерения;
					ХарактеристикаНоменклатуры  = ТекТовар.ХарактеристикаНоменклатуры;
					
					//возможно такая строка уже есть
					Попытка
						МассивСтрок=ВладелецФормы.Товары.НайтиСтроки(Новый Структура("Номенклатура,ЕдиницаИзмерения,ХарактеристикаНоменклатуры",Номенклатура,ЕдиницаИзмерения,ХарактеристикаНоменклатуры));
					Исключение
						Попытка
							МассивСтрок=ВладелецФормы.Товары.НайтиСтроки(Новый Структура("Номенклатура",Номенклатура));
						Исключение
							МассивСтрок=ВладелецФормы.Товары.НайтиСтроки(Новый Структура("НоменклатураРасход, ЕдиницаИзмеренияРасход",Номенклатура,ЕдиницаИзмерения));
						КонецПопытки;
					КонецПопытки;
					
					НоваяСтрока = (МассивСтрок.Количество() = 0);
					Если НоваяСтрока Тогда
						
						Попытка БлокироватьВидыНоменклатуры = ВладелецФормы.ЭтотОбъект.ПолучитьСоответствиеЗапрещенныхВидовНоменклатуры(); Исключение БлокироватьВидыНоменклатуры = Неопределено; КонецПопытки;
						
						Если БлокироватьВидыНоменклатуры<>Неопределено И ТипЗнч(БлокироватьВидыНоменклатуры)=Тип("Соответствие") И БлокироватьВидыНоменклатуры.Количество()>0 Тогда
							Попытка ЕстьОшибка=(БлокироватьВидыНоменклатуры[ТекТовар.Номенклатура.ВидНоменклатуры]<>Неопределено); Исключение ЕстьОшибка=Ложь; КонецПопытки;
							Если ЕстьОшибка Тогда
								Сообщить("Не удалось добавить """ + СокрЛП(ТекТовар.Номенклатура) + """. В таблицу нельзя вводить номенклатуру вида """ + СокрЛП(ТекТовар.Номенклатура.ВидНоменклатуры) + """");
								Продолжить;
							КонецЕсли;
						КонецЕсли;
						
						ТекущаяСтрока = ВладелецФормы.Товары.Добавить();
						
						Попытка	
							ТекущаяСтрока[ИмяРеквизитаНоменклатура] = Номенклатура;
						Исключение КонецПопытки;
						
						Попытка
							ТекущаяСтрока[ИмяРеквизитаХарактеристикаНоменклатуры] = ХарактеристикаНоменклатуры;
						Исключение КонецПопытки;
						
						Попытка
							ТекущаяСтрока.СкладКомпании = Структура.СкладКомпании;
						Исключение КонецПопытки;
						
						// для акта и корректировки
						Попытка
							ТекущаяСтрока.ПоДокументуРеализации=Ложь;
							ТекущаяСтрока.Подтверждение=Истина;
						Исключение КонецПопытки;
						
						ЗаполнитьЗначенияСвойств(ТекущаяСтрока,ТекТовар);
						
						Если СпособЗагрузки = 0 Тогда
							Если ДопПараметры=Неопределено Тогда ДопПараметры=Новый Структура; КонецЕсли; 
							ДопПараметры.Вставить("ПолучитьРасчетноеКоличество",Ложь); //док. Списание товаров
							ВладелецФормы.ОбработкаРеквизита("Товары.Номенклатура",ТекущаяСтрока,ВладелецФормы,ДопПараметры);
						Иначе
							ОбработкаРеквизита("Товары.Номенклатура",ТекущаяСтрока,ВладелецФормы,ДопПараметры);
						КонецЕсли;							
						
					Иначе
						ТекущаяСтрока = МассивСтрок[0];
						
						Попытка
							Если СпособЗагрузки = 0 Тогда
								ТекущаяСтрока[ИмяРеквизитаКоличество] = ТекущаяСтрока[ИмяРеквизитаКоличество]+ ТекТовар.Количество;
							Иначе
								ТекущаяСтрокаКоличество = ТекущаяСтрока[ИмяРеквизитаКоличество];
								ЗаполнитьЗначенияСвойств(ТекущаяСтрока,ТекТовар);
								ТекущаяСтрока[ИмяРеквизитаКоличество] = ТекущаяСтрока[ИмяРеквизитаКоличество] + ТекущаяСтрокаКоличество;
							КонецЕсли;							
						Исключение КонецПопытки;
					КонецЕсли;
					
					// обработчики документа, которые пересчитают цены
					Попытка
						ВладелецФормы.ОбработкаРеквизита("Товары.Количество",ТекущаяСтрока,ВладелецФормы);
					Исключение
					КонецПопытки;
				КонецЦикла;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

// обработчик изменения реквизитов документа-владельца
Функция ОбработкаРеквизита(Имя,ТекСтрока=Неопределено,ЭтаФорма=Неопределено,ДопПараметры=Неопределено)
	ЭтотОбъект = ЭтаФорма.ЭтотОбъект;
	Если Имя = "Товары.Номенклатура" Тогда
		// покажем если надо колонку "характеристика номенклатуры"
		Если ТипЗнч(ТекСтрока.Номенклатура)=Тип("СправочникСсылка.Номенклатура") Тогда
			ТипНоменклатуры = ТекСтрока.Номенклатура.ТипНоменклатуры;
			Если обПраво("АвтоматическиСкрыватьКолонкуХарактеристик",ЭтотОбъект.Права,,ЭтотОбъект) Тогда
				Попытка
					Если НЕ ЭтаФорма.ЭлементыФормы.Товары.Колонки.ХарактеристикаНоменклатуры.Видимость Тогда
						ЭтаФорма.ЭлементыФормы.Товары.Колонки.ХарактеристикаНоменклатуры.Видимость = (ТипНоменклатуры.ИспользованиеХарактеристик = 1 ИЛИ ТипНоменклатуры.ИспользованиеХарактеристик = 2);
					КонецЕсли; 
				Исключение
				КонецПопытки; 
			КонецЕсли;
			//установим свойства колонки характеристик в зависимости от типа номенклатуры
			РучноеСписаниеХарактеристик = (ТипНоменклатуры.АвтоСписаниеХарактеристик = Перечисления.РежимыАвтоСписанияХарактеристик.РучноеСписание ИЛИ ТипНоменклатуры.АвтоСписаниеХарактеристик.Пустая());
			Попытка  
				ЭтаФорма.ЭлементыФормы.Товары.Колонки.ХарактеристикаНоменклатуры.ЭлементУправления.ОтметкаНезаполненного = РучноеСписаниеХарактеристик;
				ЭтаФорма.ЭлементыФормы.Товары.Колонки.ХарактеристикаНоменклатуры.ПропускатьПриВводе = НЕ РучноеСписаниеХарактеристик;
			Исключение
			КонецПопытки; 
		Иначе
			Попытка
				Если НЕ ЭтаФорма.ЭлементыФормы.Товары.Колонки.ХарактеристикаНоменклатуры.Видимость Тогда
					ЭтаФорма.ЭлементыФормы.Товары.Колонки.ХарактеристикаНоменклатуры.Видимость = Ложь;
				КонецЕсли; 
				ЭтаФорма.ЭлементыФормы.Товары.Колонки.ХарактеристикаНоменклатуры.ЭлементУправления.ОтметкаНезаполненного = Ложь;
				ЭтаФорма.ЭлементыФормы.Товары.Колонки.ХарактеристикаНоменклатуры.ПропускатьПриВводе = Истина;
			Исключение
			КонецПопытки; 
		КонецЕсли; 
	КонецЕсли;
КонецФункции



