
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	// Принимаем параметры - КодПроизводителя - артикул у производителя
	ЗаполнитьЗначенияСвойств(ЭтаФорма,Параметры,"Артикул,КодПроизводителя,Производитель,Наименование");
	
	// Ищем номенклатуру с таким наименованием
	метаНом = Метаданные.Справочники.Номенклатура.Реквизиты;
	Имена=Новый Структура("ор_Производитель,асПроизводитель,Производитель,Поставщик,ор_Поставщик");
	Для Каждого Стр Из Имена Цикл
		Если метаНом.Найти(Стр.Ключ)<>Неопределено Тогда
			имяПроизводитель=Стр.Ключ;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	Имена=Новый Структура("ор_НомерПоКаталогу,НомерПоКаталогу,АртикулПроизводителя,Артикул,АртикулДляПоиска");
	Для Каждого Стр Из Имена Цикл
		Если метаНом.Найти(Стр.Ключ)<>Неопределено Тогда
			имяАртикул=Стр.Ключ;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	Если метаНом.Найти("АртикулДляПоиска")<>Неопределено Тогда
		имяАртикулДляПоиска="АртикулДляПоиска";
	Иначе
		имяАртикулДляПоиска=имяАртикул;
	КонецЕсли;
	
		Если ПодготовитьНомер(КодПроизводителя)<>Артикул Тогда
		КодПроизводителя=Артикул;
	КонецЕсли;
	
	Запрос=Новый Запрос(
	   "ВЫБРАТЬ
	 |	Номенклатура."+имяАртикул+" КАК Артикул,
 	 |	Номенклатура."+имяПроизводитель+" КАК Производитель,
	 |	Номенклатура.Ссылка КАК Номенклатура
	 |ИЗ
	 |	Справочник.Номенклатура КАК Номенклатура
	 |ГДЕ
	 |	Номенклатура."+имяАртикулДляПоиска+" = """+Артикул+"""
	 |			ИЛИ Номенклатура."+имяАртикул+" = """+КодПроизводителя+""""
	);
	Выб=Запрос.Выполнить().Выбрать();
	Пока Выб.Следующий() Цикл
		ЗаполнитьЗначенияСвойств(Номенклатуры.Добавить(),Выб,"Артикул,Производитель,Номенклатура");
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ЗаполнитьЗначенияСвойств(ЭтаФорма.Объект,ЭтаФорма.ВладелецФормы.Объект,
	"КроссПодключен,ОрганизацияДляЗаявки,Склад,БанковскийСчетДляЗаявки,Конфигурация,НДСПоУмолчанию,
	|ГруппаНоменклатуры,ИспользоватьСинонимы,РеквизитНомераДляПоиска,ШаблонНомераДляПоиска,ТипЦенЗакупка,
	|ШаблонНаименования,ШаблонНаименованияП,ВидНоменклатуры,ЦеноваяГруппа,НДСПоУмолчанию,
	|БазоваяЕдиницаИзмерения, АртикулОчищать, СтрокаПодключенияКроссов, КодСеанса,ВнешняяОбработка");
	Если Объект.КроссПодключен Тогда
		ЭтаФорма.ОбновлятьНоменклатуруИзБК=Истина;
	Иначе
		Элементы.ОбновлятьНоменклатуруИзБК.Доступность=Ложь;
	КонецЕсли;
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Функция ПодготовитьНомер(СтрНом)
	СтрНомер=СокрЛП(строка(СтрНом));
	СтрНомер=Стрзаменить(СтрНомер,символы.НПП,"");
	СтрНомер=Стрзаменить(СтрНомер,",","");
	СтрНомер=Стрзаменить(СтрНомер,")","");
	СтрНомер=Стрзаменить(СтрНомер,"(","");
	СтрНомер=Стрзаменить(СтрНомер,"-","");
	СтрНомер=Стрзаменить(СтрНомер,".","");
	СтрНомер=Стрзаменить(СтрНомер," ","");
	СтрНомер=Стрзаменить(СтрНомер,"-","");
	СтрНомер=Стрзаменить(СтрНомер,"""","");
	СтрНомер=Стрзаменить(СтрНомер,"'","");
	СтрНомер=Стрзаменить(СтрНомер,":","");
	СтрНомер=Стрзаменить(СтрНомер,";","");
	СтрНомер=Стрзаменить(СтрНомер,"/","");
	СтрНомер=Стрзаменить(СтрНомер,"|","");
	СтрНомер=Стрзаменить(СтрНомер,"\","");
	СтрНомер=Стрзаменить(СтрНомер,"!","");
	СтрНомер=Стрзаменить(СтрНомер,"#","");
	СтрНомер=Стрзаменить(СтрНомер,"№","");
	СтрНомер=Стрзаменить(СтрНомер,"?","");
	СтрНомер=Стрзаменить(СтрНомер,"*","");
	СтрНомер=Стрзаменить(СтрНомер,">","");
	СтрНомер=Стрзаменить(СтрНомер,"<","");	
	СтрНомер=Стрзаменить(СтрНомер,"_","");	
	Возврат ВРЕГ(СтрНомер);
Конецфункции

&НаКлиенте
Процедура ОткрытьКарточку(Команда)
	ТекДан=Элементы.Номенклатуры.ТекущиеДанные;
	Если ТекДан=Неопределено Тогда Возврат;КонецЕсли;
	ОткрытьФорму("Справочник.Номенклатура.ФормаОбъекта",Новый Структура("Ключ",ТекДан.Номенклатура),ЭтаФорма);
КонецПроцедуры


&НаСервере
Процедура УстановитьСоответствиеНаСервере(Номенклатура,Производитель,ПроизводительИмя)
	СпрПроизводитель=Производитель.Метаданные().Имя;
	Производитель=Справочники[СпрПроизводитель].НайтиПоНаименованию(ПроизводительИмя);
	Если Производитель.Пустая() Тогда
		ОбПр=Справочники[СпрПроизводитель].СоздатьЭлемент();
		ОбПр.Наименование=ПроизводительИмя;
		Если Производитель.Метаданные().Реквизиты.Найти("НаименованиеПолное")<>Неопределено Тогда
			ОбПр.НаименованиеПолное=ПроизводительИмя;
		КонецЕсли;
		Попытка
			ОбПр.Записать();
		Исключение
			Сообщить("Ошибка при создании производителя");
			Возврат;
		Конецпопытки;
		Производитель=ОбПр.Ссылка;
		ОбПр=Неопределено;
	КонецЕсли;
	Об=Номенклатура.ПолучитьОбъект();
	Об[имяПроизводитель]=Производитель;
	Попытка
		об.Записать();
	Исключение
		Сообщить("Ошибка при записи производителя");
	КонецПопытки;
КонецПроцедуры

&НаКлиенте
Процедура УстановитьСоответствие(Команда)
	ТекДан=Элементы.Номенклатуры.ТекущиеДанные;
	Если ТекДан=Неопределено Тогда Возврат;КонецЕсли;
	Если ТекДан.Производитель.Пустая() Тогда
		УстановитьСоответствиеНаСервере(ТекДан.Номенклатура,ТекДан.Производитель,Производитель);
	КонецЕсли;
	ЭтаФорма.Закрыть(ТекДан.Номенклатура);
КонецПроцедуры

&НаСервере
Функция СоздатьНоменклатуруНаСервере(Параметры)
	Обработка=РеквизитФормыВЗначение("Объект");
	Если ОбновлятьНоменклатуруИзБК Тогда
		Возврат Обработка.ПолучитьОбновитьНоменклатуруИзКроссов(Параметры);
	Иначе	
		Возврат Обработка.ПолучитьНоменклатуруТовара(Параметры, Истина);
	КонецЕсли;
КонецФункции

&НаКлиенте
Процедура СоздатьНоменклатуру(Команда)
	Ссылка=СоздатьНоменклатуруНаСервере(Новый Структура("Артикул,Производитель,Наименование",
	Артикул, Производитель, Наименование));
	Если ЗначениеЗаполнено(Ссылка) Тогда
		//ОткрытьФорму("Справочник.Номенклатура.ФормаОбъекта",
		//Новый Структура("Ключ",Ссылка),ЭтаФорма.ВладелецФормы,,ВариантОткрытияОкна.ОтдельноеОкно);
		ЭтаФорма.Закрыть(Ссылка);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура СоответствияНет(Команда)
	ОТип=Новый ОписаниеТипов("СправочникСсылка.Номенклатура");
	ссылка=ОТип.ПривестиЗначение("");
	ЭтаФорма.Закрыть(Ссылка);
КонецПроцедуры

