
Функция ПолучитьРабочийЛистПоТрафику(ИдентификаторТрафика) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ Renault_РабочиеЛисты.Ссылка
	|ИЗ
	|	Документ.Renault_РабочийЛист КАК Renault_РабочиеЛисты
	|ГДЕ
	|	Renault_РабочиеЛисты.IDТрафика = &IDТрафика";
	Запрос.УстановитьПараметр("IDТрафика", ИдентификаторТрафика);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		 Возврат Выборка.Ссылка;
	 Иначе
		 Возврат Неопределено;
	КонецЕсли;
	
КонецФункции

Функция ТрафикЛМТПочтаОтвеченный(Ид) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Renault_ТрафикПоСотрудникам.Отвечен
	|ИЗ
	|	РегистрСведений.Renault_ТрафикПоСотрудникам КАК Renault_ТрафикПоСотрудникам
	|ГДЕ
	|	Renault_ТрафикПоСотрудникам.ИдТрафика = &id
	|	И Renault_ТрафикПоСотрудникам.Отвечен = ИСТИНА";
	Запрос.УстановитьПараметр("id", Ид);
	//Запрос.УстановитьПараметр("Сотрудник", ПараметрыСеанса.Пользователь.Сотрудник);
	Табл = Запрос.Выполнить().Выгрузить();
	Если Табл.Количество()>0 Тогда
		Возврат Истина;//Табл[0].Отвечен;
	Иначе
		Возврат Ложь;
	КонецЕсли;
	
КонецФункции

Процедура ЗакрытьТрафик(ИдТрафика, ПричинаЗакрытия = Неопределено, ТипТрафика = Неопределено) Экспорт
	
	Если ТипТрафика = Справочники.CRM_ТипТрафика.ЛидRenault Тогда
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	Renault_Лид.Ссылка
		|ИЗ
		|	Документ.Renault_Лид КАК Renault_Лид
		|ГДЕ
		|	Renault_Лид.ТрафикИД = &Идентификатор
		|	И Renault_Лид.Проведен = ИСТИНА";
		Запрос.УстановитьПараметр("Идентификатор", ИдТрафика);
		Выборка = Запрос.Выполнить().Выбрать();
		Если Выборка.Следующий() Тогда
			Попытка
				ДокСсылка = Выборка.Ссылка.ПолучитьОбъект();
				ДокСсылка.ТрафикОбработан = Истина;
				ДокСсылка.РезультатОбработки = ПричинаЗакрытия;
				ДокСсылка.Записать();
				Запись = Renault_КонтактЦентр_Общий.ПолучитьЗаписьТрафикаПоID(ИдТрафика);
				//Запись.Обработан = Истина;
				Запись.Закрытый = Истина;
				Запись.Записать();
			Исключение
				Сообщить(ОписаниеОшибки());
			КонецПопытки;
		КонецЕсли;
	ИначеЕсли ТипТрафика = Справочники.CRM_ТипТрафика.OnlineКонсультант Тогда
		Запись = Renault_КонтактЦентр_Общий.ПолучитьЗаписьТрафикаПоID(ИдТрафика);
		//Запись.Обработан = Истина;
		Если ЗначениеЗаполнено(ПричинаЗакрытия) Тогда
			Запись.Комментарий = Строка(ПричинаЗакрытия.Наименование);
		КонецЕсли;
		Запись.Закрытый = Истина;
		Запись.Записать();
		
		Renault_ОнлайнКонсультант.ЗакрытьСоединениеСКлиентом();
		
	ИначеЕсли ТипТрафика = Справочники.CRM_ТипТрафика.Email Тогда
		Запись = Renault_КонтактЦентр_Общий.ПолучитьЗаписьТрафикаПоID(ИдТрафика);
		//Запись.Обработан = Истина;
		Запись.Закрытый = Истина;
		Запись.Записать();
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ *
		|ИЗ РегистрСведений.Renault_ТрафикПисьма КАК Renault_ТрафикПисьма
		|ГДЕ
		|	Renault_ТрафикПисьма.ИдТрафика = &ID";
		Запрос.УстановитьПараметр("ID", ИдТрафика);
		Выборка = Запрос.Выполнить().Выбрать();
		Пока Выборка.Следующий() Цикл
			Запись = РегистрыСведений.Renault_ТрафикПисьма.СоздатьМенеджерЗаписи();
			ЗаполнитьЗначенияСвойств(Запись, Выборка);
			Запись.РезультатОбработки = ПричинаЗакрытия;
			Запись.Записать();
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

Процедура ОтметитьТрафикЛМТПочтаОтвеченным(Ид) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ *
	|ИЗ
	|	РегистрСведений.Renault_Трафик КАК Renault_Трафик
	|ГДЕ
	|	Renault_Трафик.Идентификатор = &Идентификатор";
	Запрос.УстановитьПараметр("Идентификатор", Ид);
	Табл = Запрос.Выполнить().Выгрузить();
	Для Каждого Описание Из Табл Цикл
		Менеджер = РегистрыСведений.Renault_Трафик.СоздатьМенеджерЗаписи();
		ЗаполнитьЗначенияСвойств(Менеджер, Описание);
		Менеджер.Прочитать();
		Если Менеджер.Выбран() тогда
			ЗаполнитьЗначенияСвойств(Менеджер, Описание);
			Менеджер.Комментарий = Менеджер.Комментарий + Символы.ПС + "Ответ от " + Формат(ТекущаяДата(), "ДФ=""дд.ММ.гггг ЧЧ:мм:сс""");
				Если НЕ ЗначениеЗаполнено(Менеджер.Администратор) Тогда
					Менеджер.Администратор = ПараметрыСеанса.Пользователь.Сотрудник;
				КонецЕсли;
			Менеджер.Обработан = Истина;
			Менеджер.Записать();
		КонецЕсли;
	КонецЦикла;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ *
	|ИЗ
	|	РегистрСведений.Renault_ТрафикПоСотрудникам КАК Renault_ТрафикПоСотрудникам
	|ГДЕ
	|	Renault_ТрафикПоСотрудникам.ИдТрафика = &id
	|	И Renault_ТрафикПоСотрудникам.Сотрудник = &Сотрудник";
	Запрос.УстановитьПараметр("id", Ид);
	Запрос.УстановитьПараметр("Сотрудник", ПараметрыСеанса.Пользователь.Сотрудник);
	Табл = Запрос.Выполнить().Выгрузить();
	Запись = РегистрыСведений.Renault_ТрафикПоСотрудникам.СоздатьМенеджерЗаписи();
	Если Табл.Количество() > 0 Тогда
		Описание = Табл[0];
		ЗаполнитьЗначенияСвойств(Запись, Описание);
		Запись.Прочитать();
	Иначе
		Запись.Сотрудник = ПараметрыСеанса.Пользователь.Сотрудник;
		Запись.ИдТрафика = ид;
	КонецЕсли;
	Запись.Отвечен = Истина;
	Запись.Записать();
	
КонецПроцедуры

