&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	АдресСервера = ПараметрыСеанса.АдресСервераЛицензирования;
	
	Если НЕ ЗначениеЗаполнено(АдресСервера) Тогда
		Сообщить("Отсутствует подключение к серверу лицензирования");
		Отказ = Истина;
	КонецЕсли;
	
	СписокРешений = ЛицензированиеПоддержка.ПолучитьСписокРешений();
	
	Если СписокРешений.Количество() > 1 Тогда // Несколько решений
		Элементы.ВыбранноеРешение.Видимость = Истина;
		КоличествоРешений = СписокРешений.Количество();
		СписокВыбораРешений = Элементы.ВыбранноеРешение.СписокВыбора;
		ИндексРешения = 0;
		Для Каждого ЭлементСписка Из СписокРешений Цикл
			СписокВыбораРешений.Добавить(ИндексРешения, ЭлементСписка.Значение);
			ИндексРешения = ИндексРешения + 1;
		КонецЦикла;
	Иначе
		Элементы.ВыбранноеРешение.Видимость = Ложь;
	КонецЕсли;
	
	ВыбранноеРешение = 0;
	
	ИмяОбработки = ПолучитьИмяОбработкиПоИндексу(ВыбранноеРешение);
	
	Если НЕ Отказ Тогда
		Результат = ПолучитьПараметрыКлюча(ИмяОбработки);
		
		ЭтоПоставкаСПрограммнымКлючом = (СерийныйНомер = АппаратныйНомер);
		
		Если Результат Тогда
			ЗаполнитьТаблицуПараметров();
		Иначе
			Элементы.ОписаниеОшибки.Видимость = Истина;
			ОписаниеОшибки = "Не удалось получить параметры ключа защиты!";
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Функция ПолучитьПараметрыКлюча(ИмяОбработки)
	ПараметрДатаОкончания = 0;
	
	Результат = ЛицензированиеСервер.ПолучитьПараметрыКлючаЗащиты(ИмяОбработки, ВсегоПользователейЗаМесто, СвободноПользователейЗаМесто, ВсегоПользователейЗаСессию
	                                                             , СвободноПользователейЗаСессию, Маска, Счетчик1, Счетчик2, Счетчик3
																 , ПараметрДатаОкончания, ТипКлюча, СерийныйНомер, АппаратныйНомер, ПинКод, НазваниеКлюча, ОписаниеОшибки, КодОшибки);
	Если НЕ Результат Тогда
		Возврат Ложь;
	Иначе
		ДатаОкончания = ПараметрДатаОкончания;
		Возврат Истина;
	КонецЕсли;
КонецФункции

&НаСервере
Функция ПолучитьИмяОбработкиПоИндексу(Индекс)
	СписокРешений = ЛицензированиеПоддержка.ПолучитьСписокРешений();
	ТекИндекс = 0;
	Для Каждого ЭлементСписка Из СписокРешений Цикл
		Если ТекИндекс = Индекс Тогда
			Возврат ЭлементСписка.Ключ;
		Иначе
			ТекИндекс = ТекИндекс + 1;
		КонецЕсли;
	КонецЦикла;
КонецФункции

// Возвращает строковое представление типа ключа
&НаСервере
Функция СтрокаТипКлюча(ТипКлюча)
	Если ЭтоПоставкаСПрограммнымКлючом Тогда
		ТипКлючаСтрокой = "Программный";
	Иначе
		ТипКлючаСтрокой = "Аппаратный";
	КонецЕсли;
	
	Если ТипКлюча = 2 Тогда
		ТипКлючаСтрокой = ТипКлючаСтрокой + ", демонстрационный";
	КонецЕсли;
	
	Возврат ТипКлючаСтрокой;
КонецФункции

// Возвращает описание количества подключений
&НаСервере
Функция СтрокаКоличествоПодключений(Всего, Свободно)
	Если Всего>=255 Тогда
		Строка = "Без ограничения , " + "занято - " + Строка(Всего - Свободно);
	Иначе
		Строка = "всего - " + Строка(Всего) + ", " + "занято - " + Строка(Всего - Свободно) + ", " + "свободно - " + Строка(Свободно);
	КонецЕсли;
	Возврат Строка;
КонецФункции

// Возвращает строковое представление даты окончания действия ключа
&НаСервере
Функция СтрокаДатаОкончаниеДействия(ДатаОкончания)
	Если ДатаОкончания = '18991230000000' Тогда
		ДатаОкончанияСтрокой = "не определена"
	Иначе
		ДатаОкончанияСтрокой = Формат(ДатаОкончания,"ДФ=dd.MM.yyyy");
	КонецЕсли;
	Возврат ДатаОкончанияСтрокой;
КонецФункции

// Заполняет таблицу параметров ключа лицензирования
&НаСервере
Процедура ЗаполнитьТаблицуПараметров()
	ТаблицаПараметровДобавитьСтроку("Сервер лицензирования", ПараметрыСеанса.АдресСервераЛицензирования);
	ТаблицаПараметровДобавитьСтроку("Название ключа", НазваниеКлюча);
	ТаблицаПараметровДобавитьСтроку("Серийный номер", СерийныйНомер);
	Если НЕ ЭтоПоставкаСПрограммнымКлючом Тогда
		ТаблицаПараметровДобавитьСтроку("Аппаратный номер", АппаратныйНомер);
	КонецЕсли;
	ТаблицаПараметровДобавитьСтроку("Дата окончания", СтрокаДатаОкончаниеДействия(ДатаОкончания));
	ТаблицаПараметровДобавитьСтроку("Тип ключа", СтрокаТипКлюча(ТипКлюча));
	Если ЭтоПоставкаСПрограммнымКлючом Тогда
		ТаблицаПараметровДобавитьСтроку("Пин-код", ПинКод);
	КонецЕсли;
	ТаблицаПараметровДобавитьСтроку("Подключений за место", СтрокаКоличествоПодключений(ВсегоПользователейЗаМесто, СвободноПользователейЗаМесто));
	ТаблицаПараметровДобавитьСтроку("Подключений за сессию", СтрокаКоличествоПодключений(ВсегоПользователейЗаСессию, СвободноПользователейЗаСессию));
	ТаблицаПараметровДобавитьСтроку("Маска", Маска);
	ТаблицаПараметровДобавитьСтроку("Версия компоненты", ЛицензированиеСервер.ПолучитьЗащищеннуюОбработку(ИмяОбработки).Компонента.Версия);
	
	МестоХраненияКомпоненты = ЛицензированиеСервер.ПолучитьМестоХраненияКомпоненты();
	Если Найти(МестоХраненияКомпоненты, "ОбщийМакет") Тогда
		ИсточникКомпоненты = "Внутреннее хранилище";
	Иначе
		ИсточникКомпоненты = "Внешнее хранилище";
	КонецЕсли;
	ТаблицаПараметровДобавитьСтроку("Источник компоненты", ИсточникКомпоненты);
КонецПроцедуры

&НаСервере
Процедура ТаблицаПараметровДобавитьСтроку(Параметр, Значение)
	НоваяСтрока = ТаблицаПараметровКлюча.Добавить();
	НоваяСтрока.Параметр = Параметр;
	НоваяСтрока.Значение = Значение;
КонецПроцедуры

&НаКлиенте
Процедура КомандаСохранитьВФайл(Команда)
	Текст = "";
	
	Текст = Текст + "Дата: " + ТекущаяДата() + Символы.ВК + Символы.ПС;
	Если НЕ ОписаниеОшибки = "" Тогда
		Текст = Текст + "Описание ошибки: " + ОписаниеОшибки + Символы.ВК + Символы.ПС; 
	КонецЕсли;
	
	Для Каждого ТекСтрока Из ТаблицаПараметровКлюча Цикл
		Текст = Текст + ТекСтрока.Параметр + ": " + ТекСтрока.Значение + Символы.ВК + Символы.ПС;
	КонецЦикла;
	
	ИмяФайла = "LicParam_"+СерийныйНомер+".txt";
	
	Диалог = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Сохранение);
	
	Диалог.Заголовок = "Сохранить файл параметров лицензирования как";
	Диалог.Фильтр = "Файлы *.txt|*.txt";
	Диалог.ПолноеИмяФайла = ИмяФайла;
	
	Если Диалог.Выбрать() Тогда
		ИмяФайла = Диалог.ПолноеИмяФайла;
	Иначе
		Возврат;
	КонецЕсли;
	
	Файл = Новый ТекстовыйДокумент();
	Файл.Записать(ИмяФайла, КодировкаТекста.ANSI);
	
	Файл.УстановитьТекст(Текст);
	Файл.Записать(ИмяФайла, КодировкаТекста.ANSI);
	
	ТекстПредупреждения = "Описание текущих параметров лицензирования сохранено в файл: " + ИмяФайла;
	Предупреждение(ТекстПредупреждения,,"Сохранён файл текущих параметров лицензирования");
КонецПроцедуры

&НаКлиенте
Процедура ВыбранноеРешениеПриИзменении(Элемент)
	
	ТаблицаПараметровКлюча.Очистить();
	
	Результат = ПолучитьПараметрыКлюча(ПолучитьИмяОбработкиПоИндексу(ВыбранноеРешение));
	
	ЭтоПоставкаСПрограммнымКлючом = (СерийныйНомер = АппаратныйНомер);
	
	Если Результат Тогда
		ЗаполнитьТаблицуПараметров();
	Иначе
		Элементы.ОписаниеОшибки.Видимость = Истина;
		ОписаниеОшибки = "Не удалось получить параметры ключа защиты!";
	КонецЕсли;
КонецПроцедуры
