////////////////////////////////////////////////////////////////////////////////////////////////////////////////
//////////////////////// Экспортные функции общего назначения //////////////////////////////////////////////////
////////////////////////////////////////////////////////////////////////////////////////////////////////////////

//Функция ПолучитьСхемуПоСкладу(СкладКомпании)
//Возвращает иерархическую схему, в которую входит склад
//Входящие параметры: СкладКомпании - СправочникСсылка.СкладыКомпании
//Возвращаемое значение: СправочникСсылка.СхемыИерархическихСкладов, Неопределено
Функция ПолучитьСхемуПоСкладу(СкладКомпании) Экспорт
	Если НЕ ЗначениеЗаполнено(СкладКомпании) ТОгда
		Возврат Неопределено;
	КонецЕсли;
	
	ЗапросСхемы = Новый Запрос();
	ЗапросСхемы.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	                    |	СхемыИерархическихСкладовСклады.Ссылка
	                    |ИЗ
	                    |	Справочник.СхемыИерархическихСкладов.Склады КАК СхемыИерархическихСкладовСклады
	                    |ГДЕ
	                    |	СхемыИерархическихСкладовСклады.СкладКомпании = &СкладКомпании";
	ЗапросСхемы.УстановитьПараметр("СкладКомпании", СкладКомпании);
	РезультатЗапроса = ЗапросСхемы.Выполнить().Выбрать();
	Если РезультатЗапроса.Следующий() Тогда
		Возврат РезультатЗапроса.Ссылка;
	Иначе
		Возврат Неопределено;
	КонецЕсли;
КонецФункции

//Функция ИерархичесикйСклад(СкладКомпании)
//Позволяет проверить, входит ли склад в иерархическую схему
//Входящеи параметры: СкладКомпании - СправочникСсылка.СкладыКомпании
//Возвращаемое значение: истина, если входит в иерархическую схему, ложь в противном случае
Функция ИерархическийСклад(СкладКомпании) Экспорт
	Если НЕ ЗначениеЗаполнено(СкладКомпании) Тогда
		Возврат ложь;
	КОнецЕсли;
	
	ЗапросСхемы = Новый Запрос();
	ЗапросСхемы.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	                    |	СхемыИерархическихСкладовСклады.Ссылка
	                    |ИЗ
	                    |	Справочник.СхемыИерархическихСкладов.Склады КАК СхемыИерархическихСкладовСклады
	                    |ГДЕ
	                    |	СхемыИерархическихСкладовСклады.СкладКомпании = &СкладКомпании";
	ЗапросСхемы.УстановитьПараметр("СкладКомпании", СкладКомпании);
	
	Возврат НЕ ЗапросСхемы.Выполнить().Пустой();
КонецФункции

//Функция НазначитьЯчейкиДляОбъекта
//Функция предназначена для заполнения таблицы ячеек внутри формы номенклатуры
//Принимаемые значения:
//НоменклатураОбъект - Номенклатура для заполнения. Объект из формы
//СтурктураПолей - структура, в которой содержатся значения полей Идентификатор зоны, ряда, сталлажа, полки, ячейки.
//СхемаСклада, СправочникСсылка.СхемыИерархическихСкладов. Схема, для которой нужно проставить ячейки
Функция НазначитьЯчейкиДляОбъекта(НоменклатураОбъект, СтруктураПолей, СхемаСклада) Экспорт
	НачатьТранзакцию();
	ТаблицаНоменклатуры = Новый ТаблицаЗначений();
	ТаблицаНоменклатуры.Колонки.Добавить("Номенклатура");
	ТаблицаНоменклатуры.Колонки.Добавить("ЯчейкаХранения");
	
	
	Для Каждого СтрокаСклада Из СхемаСклада.Склады Цикл
		СкладКомпании = СтрокаСклада.СкладКомпании;
		
		ЗонаСклада = НайтиЭлемент(СтруктураПолей.Зона, "Зона", СкладКомпании);
		Если ЗонаСклада = Неопределено Тогда
			Сообщить("В схеме не найдена или помечена на удаление зона " + СтруктураПолей.Зона + ". Нет прав на создание новых зон");
			ОтменитьТранзакцию();
			Возврат ложь;
		ИначеЕсли ЗонаСклада = Ложь Тогда
			Сообщить("Не удалось записать зону " + СтруктураПолей.Зона);
			ОтменитьТранзакцию();
			Возврат ложь;
		КонецЕсли;
		
		РядСклада = НайтиЭлемент(СтруктураПолей.Ряд, "Ряд", ЗонаСклада);
		Если РядСклада = Неопределено Тогда
			Сообщить("В зоне " + ЗонаСклада.ИдентификаторДляЯрлыка + " не найден или помечен на удаление ряд " + СтруктураПолей.Ряд + ". Нет прав на создание новых рядов");
			ОтменитьТранзакцию();
			Возврат ложь;
		ИначеЕсли РядСклада = Ложь Тогда
			Сообщить("Не удалось записать ряд " + СтруктураПолей.Ряд);
			ОтменитьТранзакцию();
			Возврат ложь;
		КонецЕсли;
		
		СтеллажСклада = НайтиЭлемент(СтруктураПолей.Стеллаж, "Стеллаж", РядСклада);
		Если СтеллажСклада = Неопределено Тогда
			Сообщить("В зоне " + СтруктураПолей.Зона + " в ряду " + СтруктураПолей.Ряд + " не найден или помечен на удаление стеллаж " + СтруктураПолей.Стеллаж + ". Нет прав на создание новых стеллажей");
			ОтменитьТранзакцию();
			Возврат ложь;
		ИначеЕсли СтеллажСклада = Ложь Тогда
			Сообщить("Не удалось записать стеллаж " + СтруктураПолей.Стеллаж);
			ОтменитьТранзакцию();
			Возврат ложь;
		КонецЕсли;
		
		ПолкаСклада = НайтиЭлемент(СтруктураПолей.Полка, "Полка", СтеллажСклада);
		Если ПолкаСклада = Неопределено ИЛИ ПолкаСклада = ложь Тогда
			Сообщить("Не удалось записать полку");
			ОтменитьТранзакцию();
			Возврат ложь;
		КонецЕсли;
		
		ЯчейкаСклад = НайтиЭлемент(СтруктураПолей.Ячейка, "Ячейка", ПолкаСклада);
		Если ЯчейкаСклад = Неопределено Или ЯчейкаСклад = ложь Тогда
			Сообщить("Не удалось записать ячейку");
			ОтменитьТранзакцию();
			Возврат ложь;
		КонецЕсли;
		
		ПолучитьНоменклатуруНаЯчейке(ЯчейкаСклад, ТаблицаНоменклатуры);
		
		СуществующаяСтрока = НоменклатураОбъект.ЯчейкиХранения.Найти(СкладКомпании, "СкладКомпании");
		Если СуществующаяСтрока <> Неопределено Тогда
			Если СуществующаяСтрока.ЯчейкаХранения <> ЯчейкаСклад Тогда
				//Тут запишем представление старой ячейки в регистр
				СуществующаяСтрока.ЯчейкаХранения = ЯчейкаСклад;
			КонецЕсли;
		Иначе
			СтрокаЯчейки = НоменклатураОбъект.ЯчейкиХранения.Добавить();
			СтрокаЯчейки.СкладКомпании = СкладКомпании;
			СтрокаЯчейки.ЯчейкаХранения = ЯчейкаСклад;
		КонецЕсли;
	КонецЦикла;
	
	ТаблицаНоменклатуры.Свернуть("Номенклатура");
	Если ТаблицаНоменклатуры.Количество() <> 0 Тогда
		ТекстВопроса = "На ячейке уже есть номенклатура: ";
		Для Каждого СтрокаТаблицыНоменклатуры Из ТаблицаНоменклатуры Цикл
			ТекстВопроса = ТекстВопроса + Символы.ПС + Символы.Таб + "(" + СтрокаТаблицыНоменклатуры.Номенклатура.Артикул + ") " + СтрокаТаблицыНоменклатуры.Номенклатура.Наименование;
		КонецЦикла;
		
		Сообщить(ТекстВопроса);
	КонецЕсли;
	
	ЗафиксироватьТранзакцию();
	Возврат истина;
КонецФункции

//Функция  НайтиЭлемент
//Получает значение элемента по строковому и иерархическому представлению
//Входящеи параметры
//ИмяЭлементы - полученное от пользователя или программы наименование элемента
//ТипЭлемента - Тип элемента иерархии (Зона, Ряд, Стеллаж, Полка)
//Родитель	  - Более высокий по иерархии элемент (Полка-Стеллаж-Ряд-Зона-Склад)
//Возвращаемые значения
//Неопределено, Ложь, СправочникСсылка (Ячейка, Полка, Стеллаж, Ряд, Зона), Неопределено возвращается в случае отсутствия прав на создание элементов верхнего уровня, Ложь, в случае ошибок при записи элементов (новых или восстановленных)
Функция НайтиЭлемент(ИдентификаторЭлемента, ТипЭлемента, Родитель)
	//Проверим, не является ли имя элемента числом, если является и меньше 10, то прибавим 0
	Попытка 
		ИмяЭлемента = Формат(Число(СокрЛП(ИдентификаторЭлемента)), "ЧЦ=2; ЧН=00; ЧВН=; ЧГ=0");
	Исключение
		ИмяЭлемента = ВРег(СокрЛП(ИдентификаторЭлемента));
	КонецПопытки;
	
	Если ТипЭлемента = "Зона" Тогда
		ИскомыйЭлемент = Справочники.Зоны.НайтиПоКоду(Родитель.ИдентификаторДляЯрлыка + "-" + ИмяЭлемента,,,Родитель);
		Если НЕ ЗначениеЗаполнено(ИскомыйЭлемент) Тогда
			Если НЕ обПраво("РедактированиеЛогикиСклада") Тогда
				Возврат Неопределено;
			КОнецЕсли;
			
			ЭлементОбъект = Справочники.Зоны.СоздатьЭлемент();
			ЭлементОбъект.ИдентификаторДляЯрлыка = ИмяЭлемента;
			ЭлементОбъект.Владелец = Родитель;
			ЭлементОбъект.Код = Родитель.ИдентификаторДляЯрлыка + "-" + ИмяЭлемента;
			Попытка
				ЭлементОбъект.Записать();
			Исключение
				Возврат ложь;
			КонецПопытки;
			
			ИскомыйЭлемент = ЭлементОбъект.Ссылка;
		ИначеЕсли ИскомыйЭлемент.ПометкаУдаления Тогда
			Если НЕ обПраво("РедактированиеЛогикиСклада") Тогда
				Возврат Неопределено;
			КОнецЕсли;
		
			ЭлементОбъект = ИскомыйЭлемент.ПолучитьОбъект();
			ЭлементОбъект.ПометкаУдаления = ложь;
			Попытка
				ЭлементОбъект.Записать();
			Исключение
				Возврат ложь;
			КонецПопытки;
		КонецЕсли;
		
		Возврат ИскомыйЭлемент;
	ИначеЕсли ТипЭлемента = "Ряд" Тогда
		ИскомыйЭлемент = Справочники.Ряды.НайтиПоКоду(Родитель.Код + "-" + ИмяЭлемента,,,Родитель);
		Если НЕ ЗначениеЗаполнено(ИскомыйЭлемент) Тогда
			Если НЕ обПраво("РедактированиеЛогикиСклада") Тогда
				Возврат Неопределено;
			КОнецЕсли;
			
			ЭлементОбъект = Справочники.Ряды.СоздатьЭлемент();
			ЭлементОбъект.ИдентификаторДляЯрлыка = ИмяЭлемента;
			ЭлементОбъект.Владелец = Родитель;
			ЭлементОбъект.Код = Родитель.Код + "-" + ИмяЭлемента;
			Попытка
				ЭлементОбъект.Записать();
			Исключение
				Возврат ложь;
			КонецПопытки;
			
			ИскомыйЭлемент = ЭлементОбъект.Ссылка;
		ИначеЕсли ИскомыйЭлемент.ПометкаУдаления Тогда
			Если НЕ обПраво("РедактированиеЛогикиСклада") Тогда
				Возврат Неопределено;
			КОнецЕсли;
			
			ЭлементОбъект = ИскомыйЭлемент.ПолучитьОбъект();
			ЭлементОбъект.ПометкаУдаления = ложь;
			Попытка
				ЭлементОбъект.Записать();
			Исключение
				Возврат ложь;
			КонецПопытки;
			ИскомыйЭлемент = ЭлементОбъект.Ссылка;
		КонецЕсли;
		
		Возврат ИскомыйЭлемент;
	ИначеЕсли ТипЭлемента = "Стеллаж" Тогда
		ИскомыйЭлемент = Справочники.Стеллажи.НайтиПоКоду(Родитель.Код + "-" + ИмяЭлемента,,,Родитель);
		Если НЕ ЗначениеЗаполнено(ИскомыйЭлемент) Тогда
			Если НЕ обПраво("РедактированиеЛогикиСклада") Тогда
				Возврат Неопределено;
			КОнецЕсли;
			
			ЭлементОбъект = Справочники.Стеллажи.СоздатьЭлемент();
			ЭлементОбъект.ИдентификаторДляЯрлыка = ИмяЭлемента;
			ЭлементОбъект.Владелец = Родитель;
			ЭлементОбъект.Код = Родитель.Код + "-" + ИмяЭлемента;
			Попытка
				ЭлементОбъект.Записать();
			Исключение
				Возврат ложь;
			КонецПопытки;
			
			ИскомыйЭлемент = ЭлементОбъект.Ссылка;
		ИначеЕсли ИскомыйЭлемент.ПометкаУдаления Тогда
			Если НЕ обПраво("РедактированиеЛогикиСклада") Тогда
				Возврат Неопределено;
			КОнецЕсли;
			
			ЭлементОбъект = ИскомыйЭлемент.ПолучитьОбъект();
			ЭлементОбъект.ПометкаУдаления = ложь;
			Попытка
				ЭлементОбъект.Записать();
			Исключение
				Возврат ложь;
			КонецПопытки;
			ИскомыйЭлемент = ЭлементОбъект.Ссылка;
		КонецЕсли;
		
		Возврат ИскомыйЭлемент;
	ИначеЕсли ТипЭлемента = "Полка" Тогда
		ИскомыйЭлемент = Справочники.Полки.НайтиПоКоду(Родитель.Код + "-" + ИмяЭлемента,,,Родитель);
		Если НЕ ЗначениеЗаполнено(ИскомыйЭлемент) Тогда
			ЭлементОбъект = Справочники.Полки.СоздатьЭлемент();
			ЭлементОбъект.ИдентификаторДляЯрлыка = ИмяЭлемента;
			ЭлементОбъект.Владелец = Родитель;
			ЭлементОбъект.Код = Родитель.Код + "-" + ИмяЭлемента;
			Попытка
				ЭлементОбъект.Записать();
			Исключение
				Возврат ложь;
			КонецПопытки;
			
			ИскомыйЭлемент = ЭлементОбъект.Ссылка;
		ИначеЕсли ИскомыйЭлемент.ПометкаУдаления Тогда
			
			ЭлементОбъект = ИскомыйЭлемент.ПолучитьОбъект();
			ЭлементОбъект.ПометкаУдаления = ложь;
			Попытка
				ЭлементОбъект.Записать();
			Исключение
				Возврат ложь;
			КонецПопытки;
			ИскомыйЭлемент = ЭлементОбъект.Ссылка;
		КонецЕсли;
		
		Возврат ИскомыйЭлемент;
	ИначеЕсли ТипЭлемента = "Ячейка" Тогда
		//Получим склад Полка.Стеллаж.Ряд.Зона.Склад
		СкладВладелец = Родитель.Владелец.Владелец.Владелец.Владелец;
		ИскомыйЭлемент = Справочники.ЯчейкиХранения.НайтиПоКоду(Родитель.Код + "-" + ИмяЭлемента,,,СкладВладелец);
		Если НЕ ЗначениеЗаполнено(ИскомыйЭлемент) Тогда
			ЭлементОбъект = Справочники.ЯчейкиХранения.СоздатьЭлемент();
			ЭлементОбъект.НомерЯчейки = ИмяЭлемента;
			ЭлементОбъект.Код = Родитель.Код + "-" + ИмяЭлемента;
			ЭлементОбъект.Владелец = СкладВладелец;
			ЭлементОбъект.Полка = Родитель;
			ЭлементОбъект.Стеллаж = Родитель.Владелец;
			ЭлементОбъект.Ряд = Родитель.Владелец.Владелец;
			ЭлементОбъект.Зона = Родитель.Владелец.Владелец.Владелец;
			
			Попытка
				ЭлементОбъект.Записать();
			Исключение
				Возврат ложь;
			КонецПопытки;
			
			ИскомыйЭлемент = ЭлементОбъект.Ссылка;
		ИначеЕсли ИскомыйЭлемент.ПометкаУдаления Тогда
			
			ЭлементОбъект = ИскомыйЭлемент.ПолучитьОбъект();
			ЭлементОбъект.ПометкаУдаления = ложь;
			Попытка
				ЭлементОбъект.Записать();
			Исключение
				Возврат ложь;
			КонецПопытки;
			ИскомыйЭлемент = ЭлементОбъект.Ссылка;
		КонецЕсли;
		Возврат ИскомыйЭлемент;
	Иначе
		Возврат(Неопределено);
	КонецЕсли;
КонецФункции

//Функция ПолучитьНоменклатуруНаЯчейке
//возвращает номенклатуру, хранящуюся на ячейке
Процедура ПолучитьНоменклатуруНаЯчейке(ЯчейкаХранения, ТаблицаНоменклатуры, НоваяНоменклатура = Неопределено)
	
	ЗапросНоменклатуры = Новый Запрос();
	ЗапросНоменклатуры.Текст = "ВЫБРАТЬ
	                           |	НоменклатураЯчейкиХранения.Ссылка КАК Номенклатура
	                           |ИЗ
	                           |	Справочник.Номенклатура.ЯчейкиХранения КАК НоменклатураЯчейкиХранения
	                           |ГДЕ
	                           |	НоменклатураЯчейкиХранения.ЯчейкаХранения = &ЯчейкаХранения
	                           |	И НоменклатураЯчейкиХранения.Ссылка <> &Номенклатура
	                           |
	                           |СГРУППИРОВАТЬ ПО
	                           |	НоменклатураЯчейкиХранения.Ссылка";
	ЗапросНоменклатуры.УстановитьПараметр("ЯчейкаХранения", ЯчейкаХранения);
	ЗапросНоменклатуры.УстановитьПараметр("Номенклатура", НоваяНоменклатура);
	РезультатЗапроса = ЗапросНоменклатуры.Выполнить().Выбрать();
	Пока РезультатЗапроса.Следующий() Цикл
		СтрокаТаблицы = ТаблицаНоменклатуры.Добавить();
		СтрокаТаблицы.Номенклатура = РезультатЗапроса.Номенклатура;
		СтрокаТаблицы.ЯчейкаХранения = СокрЛП(ЯчейкаХранения.Код);
	КонецЦикла;
КОнецПроцедуры


