//Бондаренко++ 20211026 
Процедура ВыгрузитьЗНпоШевроле(Параметры = Неопределено) Экспорт
	
	//Бондаренко++ 20220203
	Если ТипЗНЧ(Параметры)=Тип("ДокументСсылка.ЗаказНаряд") Тогда
	//Бондаренко-- 20220203	 
 		ВыгрузитьЗН(Параметры);
	Иначе	
		Для Счетчик = 1 По 3 Цикл
 			Если Счетчик = 1 Тогда
				Параметры = Справочники.ПодразделенияКомпании.НайтиПоКоду("ЦБ000231");  //Престиж Моторс ООО Пойменная
			ИначеЕсли Счетчик = 2 Тогда
				Параметры = Справочники.ПодразделенияКомпании.НайтиПоКоду("ЦБ001330");	//Престиж Моторс ООО Волгодонск Лада
			Иначе	
				Параметры = Справочники.ПодразделенияКомпании.НайтиПоКоду("ЦБ000126");  //Престиж Моторс ООО Олимп
			КонецЕсли;
 			ВыгрузитьЗН(Параметры);			
 		КонецЦикла;        
	//Бондаренко-- 20220203	
	КонецЕсли;             
    //Бондаренко++ 20220203
 
КонецПроцедуры
 //Бондаренко-- 20211026

//Бондаренко++ 20201221
Процедура ВыгрузитьЗН(Параметры)  Экспорт
	
	КоммерческийРемонт       = Справочники.ВидыРемонта.КоммерческийРемонт;
	ТехническоеОбслуживание  = Справочники.ВидыРемонта.ТехническоеОбслуживание;
	ГарантийныйРемонт        = Справочники.ВидыРемонта.ГарантияПроизводителя; 
	
	СзВидРемонта = Новый СписокЗначений;
	
	СзВидРемонта.Добавить(КоммерческийРемонт);
	СзВидРемонта.Добавить(ТехническоеОбслуживание);
	СзВидРемонта.Добавить(ГарантийныйРемонт);
	СзВидРемонта.Добавить(Справочники.ВидыРемонта.ДополнительноеОборудование);
	СзВидРемонта.Добавить(Справочники.ВидыРемонта.ДопОборудованиеСогласованноеСДилером);

	
	РаботыЗН = Новый ТаблицаЗначений;
	РаботыЗН.Колонки.Добавить("Номер");
	РаботыЗН.Колонки.Добавить("ТипПозиции");
	РаботыЗН.Колонки.Добавить("НомерПозиции");
	РаботыЗН.Колонки.Добавить("КодПозиции");
	РаботыЗН.Колонки.Добавить("НомерЗаказЗапчасти");
	РаботыЗН.Колонки.Добавить("НаименованиеПозиции");
	РаботыЗН.Колонки.Добавить("Количество");
	РаботыЗН.Колонки.Добавить("ИтоговаяСтоимость");
	РаботыЗН.Колонки.Добавить("РасширениеЗН");
	РаботыЗН.Колонки.Добавить("Вналичии");
	РаботыЗН.Колонки.Добавить("Ссылка");
	
	ДилерСтарый = Справочники.Организации.НайтиПоРеквизиту("ИНН","6168069282");
	//ИНН 6168069282 у Престиж Моторс ООО
	КодДилераСтарый = "RUS026";
	
	ГдеСоздавать = КаталогВременныхФайлов();
	ИмяФайла = ГдеСоздавать+"file1.txt";
	ИмяФайлаСРаботами = ГдеСоздавать+"file2.txt";
	
	//=========================== 1 часть ===
	
	сч = 0;
	
	Запрос = Новый Запрос;
	
	Если ТипЗНЧ(Параметры) = Тип("СправочникСсылка.ПодразделенияКомпании") Тогда  
		
		ПодразделениеКомпании = Параметры;
		
		Запрос.Текст = "ВЫБРАТЬ
		|	ЗаказНарядРаботы.Ссылка,
		|	ЗаказНарядРаботы.Ссылка.Дата КАК ДатаЗН,
		|	ЗаказНарядРаботы.Ссылка.Организация,
		|	ЗаказНарядРаботы.Ссылка.Проведен,
		|	ЗаказНарядРаботы.НомерСтроки КАК НомерПозиции,
		|	ЗаказНарядРаботы.Работа КАК НаименованиеПозиции,
		|	""РАБОТА"" КАК ТипПозиции,
		|	ВЫБОР
		|		КОГДА ЗаказНарядРаботы.Работа.Артикул = """"
		|			ТОГДА ЗаказНарядРаботы.Работа.Код
		|		ИНАЧЕ ЗаказНарядРаботы.Работа.Артикул
		|	КОНЕЦ КАК КодПозиции,
		|	ЗаказНарядРаботы.Количество * ЗаказНарядРаботы.Коэффициент КАК Количество,
		|	ЗаказНарядРаботы.СуммаВсего КАК ИтоговаяСтоимость,
		|	"""" КАК Вналичии,
		|	ЗаказНарядРаботы.Ссылка.Номер КАК НомерЗН,
		|	ЗаказНарядРаботы.Ссылка.Состояние,
		|	ВЫБОР
		|		КОГДА ЗаказНарядРаботы.Основная
		|			ТОГДА ""Нет""
		|		ИНАЧЕ ""Да""
		|	КОНЕЦ КАК Расширение,
		|	ЗаказНарядРаботы.Ссылка.ВидРемонта,
		|	КодыДилеров.КодДилера,
		|	ЗаказНарядРаботы.Ссылка.Организация.НаименованиеДляПечати КАК Дилер
		|ИЗ
		|	Документ.ЗаказНаряд.Работы КАК ЗаказНарядРаботы
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		|			КодыДилеровСрезПоследних.ПодразделениеКомпании КАК ПодразделениеКомпании,
		|			КодыДилеровСрезПоследних.Бренд КАК Бренд,
		|			КодыДилеровСрезПоследних.КодДилера КАК КодДилера
		|		ИЗ
		|			РегистрСведений.КодыДилеров.СрезПоследних КАК КодыДилеровСрезПоследних) КАК КодыДилеров
		|		ПО ЗаказНарядРаботы.Ссылка.ПодразделениеКомпании = КодыДилеров.ПодразделениеКомпании
		|			И ЗаказНарядРаботы.Ссылка.Автомобиль.Модель.Марка = КодыДилеров.Бренд
		|ГДЕ
		|	ЗаказНарядРаботы.Ссылка.Дата МЕЖДУ &ДатаНачала И &ДатаОкончания
		|	И ЗаказНарядРаботы.Ссылка.Проведен = ИСТИНА
		|	И ЗаказНарядРаботы.Ссылка.ПодразделениеКомпании = &ПодразделениеВыгрузки
		|	И ЗаказНарядРаботы.Ссылка.Автомобиль.ГодВыпуска >= &ГодВыпуска2020
		|	И ЗаказНарядРаботы.Ссылка.Автомобиль.Модель.Марка = &Марка
		|	И ЗаказНарядРаботы.Ссылка.Состояние = ЗНАЧЕНИЕ(Справочник.ВидыСостоянийЗаказНарядов.Закрыт)
		|	И ЗаказНарядРаботы.Ссылка.ВидРемонта В(&спВидРемонта)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ЗаказНарядТовары.Ссылка,
		|	ЗаказНарядТовары.Ссылка.Дата,
		|	ЗаказНарядТовары.Ссылка.Организация,
		|	ЗаказНарядТовары.Ссылка.Проведен,
		|	ЗаказНарядТовары.НомерСтроки,
		|	ЗаказНарядТовары.Номенклатура,
		|	""ДЕТАЛЬ"",
		|	ВЫБОР
		|		КОГДА ЗаказНарядТовары.Номенклатура.Артикул = """"
		|			ТОГДА ЗаказНарядТовары.Номенклатура.Код
		|		ИНАЧЕ ЗаказНарядТовары.Номенклатура.Артикул
		|	КОНЕЦ,
		|	ЗаказНарядТовары.Количество,
		|	ЗаказНарядТовары.СуммаВсего,
		|	""ДА"",
		|	ЗаказНарядТовары.Ссылка.Номер,
		|	ЗаказНарядТовары.Ссылка.Состояние,
		|	ВЫБОР
		|		КОГДА ЗаказНарядТовары.Основная
		|			ТОГДА ""Нет""
		|		ИНАЧЕ ""Да""
		|	КОНЕЦ,
		|	ЗаказНарядТовары.Ссылка.ВидРемонта,
		|	КодыДилеров.КодДилера,
		|	ЗаказНарядТовары.Ссылка.Организация.НаименованиеДляПечати
		|ИЗ
		|	Документ.ЗаказНаряд.Товары КАК ЗаказНарядТовары
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		|			КодыДилеровСрезПоследних.ПодразделениеКомпании КАК ПодразделениеКомпании,
		|			КодыДилеровСрезПоследних.Бренд КАК Бренд,
		|			КодыДилеровСрезПоследних.КодДилера КАК КодДилера
		|		ИЗ
		|			РегистрСведений.КодыДилеров.СрезПоследних КАК КодыДилеровСрезПоследних) КАК КодыДилеров
		|		ПО ЗаказНарядТовары.Ссылка.ПодразделениеКомпании = КодыДилеров.ПодразделениеКомпании
		|			И ЗаказНарядТовары.Ссылка.Автомобиль.Модель.Марка = КодыДилеров.Бренд
		|ГДЕ
		|	ЗаказНарядТовары.Ссылка.Дата МЕЖДУ &ДатаНачала И &ДатаОкончания
		|	И ЗаказНарядТовары.Ссылка.Проведен = ИСТИНА
		|	И ЗаказНарядТовары.Ссылка.ПодразделениеКомпании = &ПодразделениеВыгрузки
		|	И ЗаказНарядТовары.Ссылка.Автомобиль.ГодВыпуска >= &ГодВыпуска2020
		|	И ЗаказНарядТовары.Ссылка.Автомобиль.Модель.Марка = &Марка
		|	И ЗаказНарядТовары.Ссылка.Состояние = ЗНАЧЕНИЕ(Справочник.ВидыСостоянийЗаказНарядов.Закрыт)
		|	И ЗаказНарядТовары.Ссылка.ВидРемонта В(&спВидРемонта)";
		
		Запрос.УстановитьПараметр("ДатаНачала", НачалоДня(ТекущаяДата())-86400*10*7);
		Запрос.УстановитьПараметр("ДатаОкончания", КонецДня(ТекущаяДата())-86400);
		Запрос.УстановитьПараметр("Марка", Справочники.Марка.CHEVROLET);
		Запрос.УстановитьПараметр("ГодВыпуска2020", Дата(2020,1,1));
		Запрос.УстановитьПараметр("спВидРемонта", СзВидРемонта);
		Запрос.УстановитьПараметр("ПодразделениеВыгрузки",Параметры);
		
	Иначе   
		
		ПодразделениеКомпании = Параметры.ПодразделениеКомпании;
		
		Запрос.Текст = "ВЫБРАТЬ
		|	ЗаказНарядРаботы.Ссылка,
		|	ЗаказНарядРаботы.Ссылка.Дата КАК ДатаЗН,
		|	ЗаказНарядРаботы.Ссылка.Организация,
		|	ЗаказНарядРаботы.Ссылка.Проведен,
		|	ЗаказНарядРаботы.НомерСтроки КАК НомерПозиции,
		|	ЗаказНарядРаботы.Работа КАК НаименованиеПозиции,
		|	""РАБОТА"" КАК ТипПозиции,
		|	ВЫБОР
		|		КОГДА ЗаказНарядРаботы.Работа.Артикул = """"
		|			ТОГДА ЗаказНарядРаботы.Работа.Код
		|		ИНАЧЕ ЗаказНарядРаботы.Работа.Артикул
		|	КОНЕЦ КАК КодПозиции,
		|	ЗаказНарядРаботы.Количество * ЗаказНарядРаботы.Коэффициент КАК Количество,
		|	ЗаказНарядРаботы.СуммаВсего КАК ИтоговаяСтоимость,
		|	"""" КАК Вналичии,
		|	ЗаказНарядРаботы.Ссылка.Номер КАК НомерЗН,
		|	ЗаказНарядРаботы.Ссылка.Состояние,
		|	ВЫБОР
		|		КОГДА ЗаказНарядРаботы.Основная
		|			ТОГДА ""Нет""
		|		ИНАЧЕ ""Да""
		|	КОНЕЦ КАК Расширение,
		|	ЗаказНарядРаботы.Ссылка.ВидРемонта,
		|	КодыДилеров.КодДилера,
		|	ЗаказНарядРаботы.Ссылка.Организация.НаименованиеДляПечати КАК Дилер
		|ИЗ
		|	Документ.ЗаказНаряд.Работы КАК ЗаказНарядРаботы
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		|			КодыДилеровСрезПоследних.ПодразделениеКомпании КАК ПодразделениеКомпании,
		|			КодыДилеровСрезПоследних.Бренд КАК Бренд,
		|			КодыДилеровСрезПоследних.КодДилера КАК КодДилера
		|		ИЗ
		|			РегистрСведений.КодыДилеров.СрезПоследних КАК КодыДилеровСрезПоследних) КАК КодыДилеров
		|		ПО ЗаказНарядРаботы.Ссылка.ПодразделениеКомпании = КодыДилеров.ПодразделениеКомпании
		|			И ЗаказНарядРаботы.Ссылка.Автомобиль.Модель.Марка = КодыДилеров.Бренд
		|ГДЕ
		|	ЗаказНарядРаботы.Ссылка = &СсылкаНаСамЗН
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ЗаказНарядТовары.Ссылка,
		|	ЗаказНарядТовары.Ссылка.Дата,
		|	ЗаказНарядТовары.Ссылка.Организация,
		|	ЗаказНарядТовары.Ссылка.Проведен,
		|	ЗаказНарядТовары.НомерСтроки,
		|	ЗаказНарядТовары.Номенклатура,
		|	""ДЕТАЛЬ"",
		|	ВЫБОР
		|		КОГДА ЗаказНарядТовары.Номенклатура.Артикул = """"
		|			ТОГДА ЗаказНарядТовары.Номенклатура.Код
		|		ИНАЧЕ ЗаказНарядТовары.Номенклатура.Артикул
		|	КОНЕЦ,
		|	ЗаказНарядТовары.Количество,
		|	ЗаказНарядТовары.СуммаВсего,
		|	""ДА"",
		|	ЗаказНарядТовары.Ссылка.Номер,
		|	ЗаказНарядТовары.Ссылка.Состояние,
		|	ВЫБОР
		|		КОГДА ЗаказНарядТовары.Основная
		|			ТОГДА ""Нет""
		|		ИНАЧЕ ""Да""
		|	КОНЕЦ,
		|	ЗаказНарядТовары.Ссылка.ВидРемонта,
		|	КодыДилеров.КодДилера,
		|	ЗаказНарядТовары.Ссылка.Организация.НаименованиеДляПечати
		|ИЗ
		|	Документ.ЗаказНаряд.Товары КАК ЗаказНарядТовары
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		|			КодыДилеровСрезПоследних.ПодразделениеКомпании КАК ПодразделениеКомпании,
		|			КодыДилеровСрезПоследних.Бренд КАК Бренд,
		|			КодыДилеровСрезПоследних.КодДилера КАК КодДилера
		|		ИЗ
		|			РегистрСведений.КодыДилеров.СрезПоследних КАК КодыДилеровСрезПоследних) КАК КодыДилеров
		|		ПО ЗаказНарядТовары.Ссылка.ПодразделениеКомпании = КодыДилеров.ПодразделениеКомпании
		|			И ЗаказНарядТовары.Ссылка.Автомобиль.Модель.Марка = КодыДилеров.Бренд
		|ГДЕ
		|	ЗаказНарядТовары.Ссылка = &СсылкаНаСамЗН"; 
		
		Запрос.УстановитьПараметр("СсылкаНаСамЗН", Параметры);
 		
	КонецЕсли;
 	
	ТЗ = Запрос.Выполнить().Выгрузить();
	
	ТЗ.Сортировать("Дилер, КодДилера, ДатаЗН, НомерЗН, ТипПозиции Убыв, НомерПозиции");
	
 	РаботыЗН=ТЗ.Скопировать();
	
	ТЗ.Свернуть("Дилер,КодДилера,Ссылка,НомерЗН,ДатаЗН");
	
	ТЗ.Сортировать("Дилер,КодДилера,ДатаЗН, НомерЗН");

 	Состав = Новый ТаблицаЗначений;
	Состав=ТЗ.Скопировать(,"Дилер, КодДилера, Ссылка, НомерЗН,ДатаЗН");
	
 	ВсегоСтрок = Состав.Количество();
	
	//Состав.Колонки.Добавить("Дилер");
	//Состав.Колонки.Добавить("КодДилера");
	Состав.Колонки.Добавить("ФИОВладельца");
	Состав.Колонки.Добавить("ТелефонВладельца");
	Состав.Колонки.Добавить("VIN");
	Состав.Колонки.Добавить("ГосНомер");
	Состав.Колонки.Добавить("Марка");
	Состав.Колонки.Добавить("Модель");
	Состав.Колонки.Добавить("Пробег");
	Состав.Колонки.Добавить("ТипВладельца");
	Состав.Колонки.Добавить("КонтактноеЛицо");
	Состав.Колонки.Добавить("ТелефонКонтактногоЛица");
	Состав.Колонки.Добавить("ДатаОбращения");
	Состав.Колонки.Добавить("ПочтаКонтактногоЛица");
	Состав.Колонки.Добавить("СогласиеНаОбработкуПД");
	Состав.Колонки.Добавить("СогласиеНаЗвонок");
	Состав.Колонки.Добавить("СогласиеНаПисьмо");
	Состав.Колонки.Добавить("СогласиеНаСМС");
	Состав.Колонки.Добавить("ПричинаОбращения");
	Состав.Колонки.Добавить("ДатаСозданияЗН");
	Состав.Колонки.Добавить("ДатаНачалаРабот");
	Состав.Колонки.Добавить("ДатаОкончанияРабот");
	Состав.Колонки.Добавить("ДатаЗакрытия");
	Состав.Колонки.Добавить("ТипРемонта");
	Состав.Колонки.Добавить("ТО");
	Состав.Колонки.Добавить("СервиснаяКомпания");
	Состав.Колонки.Добавить("ДобраяВоля");
	Состав.Колонки.Добавить("СлесарныйРемонт");
	Состав.Колонки.Добавить("КузовнойРемонт");
	Состав.Колонки.Добавить("Акция");
	Состав.Колонки.Добавить("ДопОборудование");
	
	Для Каждого Строка Из Состав Цикл
		
		ТекЗН = Строка.Ссылка;
		ТекАвто = ТекЗН.Автомобиль;
		ТекЗаказчик = ТекЗН.Заказчик;
		ТекДатаЗН = ТекЗН.Дата;
		
		//Строка.Дилер = Дилер;
		//Строка.КодДилера = КодДилера;
		Строка.ФИОВладельца = ТекЗаказчик;
		Строка.ТелефонВладельца = Прав(Строка.ФИОВладельца.ОсновнойТелефон,10);
		Строка.VIN = ТекАвто.VIN;
		Строка.ГосНомер = Справочники.Автомобили.ЧтениеЗначенияРегистраСведения(ТекАвто , Перечисления.ДополнительнаяИнформацияАвтомобилей.ГосНомер);
		Если обЗначениеНеЗаполнено(Строка.ГосНомер) Тогда
			Строка.ГосНомер = "Б/Н";
		КонецЕсли; 
		Строка.Марка = ТекАвто.Модель.Марка;
		Строка.Модель = ТекАвто.Модель;
		
		Пробег = ТекЗН.Пробег;
		Строка.Пробег = СтрЗаменить(Пробег,Символы.НПП,"");
		
		Если ТекЗаказчик.ФормаСобственности=Перечисления.ФормыСобственности.ЧастноеЛицо ИЛИ ТекЗаказчик.ФормаСобственности=Перечисления.ФормыСобственности.ЧастныйПредприниматель Тогда
			Строка.ТипВладельца="ФЛ";
		Иначе
			Строка.ТипВладельца="ЮЛ";
		КонецЕсли; 
		Строка.КонтактноеЛицо = ТекЗаказчик;
		Строка.ТелефонКонтактногоЛица = Прав(ТекЗаказчик.ОсновнойТелефон,10);
		Строка.ДатаОбращения = ТекДатаЗН;
		Строка.ПочтаКонтактногоЛица = ТекЗаказчик.ОсновнойАдресЭлектроннойПочты;
		
		Если ТекЗаказчик.СогласиеНаОбработкуПерсональныхДанных=Перечисления.ВариантыОтветов.Да Тогда
			Строка.СогласиеНаОбработкуПД = "Да"; 
			Строка.СогласиеНаЗвонок      = "Да"; 
			Строка.СогласиеНаПисьмо      = "Да";
			Строка.СогласиеНаСМС         = "Да";
		Иначе
			Строка.СогласиеНаОбработкуПД = "Нет"; 
			Строка.СогласиеНаЗвонок      = "Нет"; 
			Строка.СогласиеНаПисьмо      = "Нет";
			Строка.СогласиеНаСМС         = "Нет";
		КонецЕсли;
		
		Строка.ДатаОбращения = ТекДатаЗН;
		
		Попытка
			Строка.ПричинаОбращения = ТекЗН.Работы[0].Работа;
		Исключение
			Строка.ПричинаОбращения = ТекЗН.ПричинаОбращения;
		КонецПопытки; 
		Строка.ДатаСозданияЗН     = ТекДатаЗН;
		Строка.ДатаНачалаРабот    = ТекДатаЗН;
		Строка.ДатаОкончанияРабот = ТекДатаЗН;
		Строка.ДатаЗакрытия       = ТекДатаЗН;
		
		Если ТекЗН.ВидРемонта = Справочники.ВидыРемонта.ДобраяВоляПроизводителя ИЛИ ТекЗН.ВидРемонта = Справочники.ВидыРемонта.ДобраяВоляКомпании Тогда
			Строка.ДобраяВоля         = "ДА";
		Иначе 
			Строка.ДобраяВоля         = "НЕТ";
		КонецЕсли;
		
		Если ТекЗН.ВидРемонта = Справочники.ВидыРемонта.ТехническоеОбслуживание ИЛИ ТекЗН.ВидРемонта = Справочники.ВидыРемонта.ТО_ноль ИЛИ ТекЗН.ВидРемонта = Справочники.ВидыРемонта.МасляныйСервис Тогда
			Строка.ТО                 = "ДА";
		Иначе 
			Строка.ТО 		         = "НЕТ";
		КонецЕсли;
		
		Если обЗначениеНеЗаполнено(ТекЗН.СервиснаяКампания) Тогда
			Строка.СервиснаяКомпания  = "НЕТ";
		Иначе
			Строка.СервиснаяКомпания  = "ДА";
		КонецЕсли;   
		
		Если ТекЗН.ВидРемонта = Справочники.ВидыРемонта.КузовнойКоммерческий ИЛИ ТекЗН.ВидРемонта = Справочники.ВидыРемонта.КузовнойРемонт Тогда    
			Строка.КузовнойРемонт     = "ДА";
		Иначе
			Строка.КузовнойРемонт     = "НЕТ";
		КонецЕсли;   	   
		
		Строка.СлесарныйРемонт 	 = "ДА";
		
		Если ТекЗН.ВидРемонта = Справочники.ВидыРемонта.АкцияЛучшееДляСвоих Тогда
			Строка.Акция 	         = "ДА";
		Иначе
			Строка.Акция 	         = "НЕТ";
		КонецЕсли;	
		
		Если (ТекЗН.ВидРемонта = Справочники.ВидыРемонта.ДополнительноеОборудование) ИЛИ (ТекЗН.ВидРемонта = Справочники.ВидыРемонта.ДопОборудованиеСогласованноеСДилером) Тогда
			Строка.ДопОборудование   = "ДА";
		Иначе
			Строка.ДопОборудование 	 = "НЕТ";
		КонецЕсли;	
		
		ТекПлательщик = ТекЗн.Контрагент;
		
		Если ТекЗаказчик = ТекПлательщик Тогда
			Строка.ТипРемонта="Коммерческий";	
		Иначе
			Если ТекПлательщик.НашаФирма Тогда
				Строка.ТипРемонта="Внутренний";	
			Иначе
				Строка.ТипРемонта="Гарантийный";		
			КонецЕсли; 
		КонецЕсли;	
		
	КонецЦикла;
	
	//=========================== 2 часть ===
	
	ТекстЗН = Новый ТекстовыйДокумент; 
	
	ТекстЗН.ДобавитьСтроку("Дилер;Код дилера;Номер заказ-наряда;VIN номер автомобиля;Гос.номер автомобиля;Марка автомобиля;Модель автомобиля;Пробег (км); ФИО владельца;Телефон владельца; Тип владельца;Контактное лицо;Телефон контактного лица; ПочтаКонтактного лица; СОПД; Согласие на звонок; Согласие на письмо; Согласие на SMS; Дата обращения клиента;Причина обращения; Дата содания заказ-наряда;Дата начала работ; Дата окончания работ; Дата закрытия заказ-наряда;Тип ремонта;ТО;Сервисная кампания;Гудвилл;Слесарный ремонт;Кузовной ремонт;Акция; Доп.оборудование" );
	//Бондаренко++ 20210322
	ТекстЗН.ДобавитьСтроку("");
	//Бондаренко-- 20210322	
 
	Для каждого Строка Из Состав Цикл
		ТекстЗН.ДобавитьСтроку(СтрЗаменить(Строка.Дилер,"""","'") + ";"+
		Строка.КодДилера + ";"+
		Строка.НомерЗН + ";"+
		Строка.VIN + ";"+
		Строка.ГосНомер + ";"+
		Строка.Марка + ";"+
		Строка.Модель + ";"+
		Строка.Пробег + ";"+
		Строка.ФИОВладельца + ";"+
		Строка.ТелефонВладельца + ";"+
		Строка.ТипВладельца + ";"+
		Строка.КонтактноеЛицо + ";"+
		Строка.ТелефонКонтактногоЛица + ";"+
		Строка.ПочтаКонтактногоЛица + ";"+
		Строка.СогласиеНаОбработкуПД + ";"+
		Строка.СогласиеНаЗвонок + ";"+
		Строка.СогласиеНаПисьмо + ";"+
		Строка.СогласиеНаСМС + ";"+
		Сред(Строка.ДатаОбращения,1,10) + ";"+
		Строка.ПричинаОбращения + ";"+
		Сред(Строка.ДатаСозданияЗН,1,10) + ";"+
		Сред(Строка.ДатаНачалаРабот,1,10) + ";"+
		Сред(Строка.ДатаОкончанияРабот,1,10) + ";"+
		Сред(Строка.ДатаЗакрытия,1,10) + ";"+
		Строка.ТипРемонта+ ";"+
		Строка.ТО + ";"+
		Строка.СервиснаяКомпания + ";"+
		Строка.ДобраяВоля + ";"+
		Строка.СлесарныйРемонт + ";"+
		Строка.КузовнойРемонт + ";"+
		Строка.Акция + ";"+
		Строка.ДопОборудование); 
	КонецЦикла;
	
	//ТекстЗН.Показать("Файл №1",ИмяФайла);
	
	Попытка
		ТекстЗН.Записать(ИмяФайла); 
	Исключение
		//Сообщить("ОШИБКА! Не удалось записать файл с заголовками заказ-нарядов "+ИмяФайлаСработами);	
	КонецПопытки; 
	
	ТекстСРаботами = Новый ТекстовыйДокумент;
	ТекстСРаботами.ДобавитьСтроку("Номер заказ-наряда;Тип позиции;Номер позиции;Код позиции;Номер заказа запчасти;Наименование позиции;Количество;Итоговая стоимость;Расширение заказ-наряда;В наличии");
	Для каждого Строка Из РаботыЗН Цикл
		ТекстСРаботами.ДобавитьСтроку(Строка.НомерЗН + ";"+
		Строка.ТипПозиции + ";"+
		Строка.НомерПозиции + ";"+
		Строка.КодПозиции + ";"+
		"" + ";"+
		Строка.НаименованиеПозиции + ";"+
		Строка.Количество + ";"+
		СтрЗаменить(Строка.ИтоговаяСтоимость,Символы.НПП,"") + ";"+
		Строка.Расширение + ";"+
		Строка.Вналичии); 
	КонецЦикла; 
	
	//ТекстСРаботами.Показать("Файл №2",ИмяФайла);		
	
	Попытка
		ТекстСРаботами.Записать(ИмяФайлаСработами); 
	Исключение
		//Сообщить("ОШИБКА! Не удалось записать файл с работами заказ-нарядов");	
	КонецПопытки; 
	
	//=========================== 3 часть ===
	
	Если Состав.Количество()+РаботыЗН.Количество() > 0 Тогда
		
		ДвоичныеДанныеЗН=Новый ДвоичныеДанные(ИмяФайла);
		АдресВХ_ЗН = ПоместитьВоВременноеХранилище(ДвоичныеДанныеЗН);
		
		ДвоичныеДанныеРабот=Новый ДвоичныеДанные(ИмяФайлаСРаботами);
		АдресВХ_Работ = ПоместитьВоВременноеХранилище(ДвоичныеДанныеРабот);
		
		ВыгрузкаНаПорталШевроле(АдресВХ_ЗН,АдресВХ_Работ, ПодразделениеКомпании);	
		
	КонецЕсли; 
	
КонецПроцедуры
//Бондаренко-- 20201221  

//Бондаренко++ 20220203
Процедура ВыгрузкаНаПорталШевроле(АдресВХ_ЗН,АдресВХ_Работ,Подразделение) Экспорт
	
	Перем ОписаниеОшибки;
	
	ДатаВремяСтрокой = "";
	ДатаВремяСтрокой = СокрЛП(Формат(ТекущаяДата(),"ДЛФ=DT"));
	ДатаВремяСтрокой = СтрЗаменить(ДатаВремяСтрокой,".","_");
	ДатаВремяСтрокой = СтрЗаменить(ДатаВремяСтрокой,":","_");
	ДатаВремяСтрокой = СтрЗаменить(ДатаВремяСтрокой," ","_");
	
	ПутьКЛог = "C:\Program Files\ChevroletServiceDataUploader\log.txt";
	ФайлЛогНаДиске = Новый Файл(ПутьКЛог);                                        
	
	Если Подразделение.Код = "ЦБ000231" Тогда APIKey = "Vv7Cj1yqRFr9w2ek5gG8Gq7971M6TD" //Ростов
	ИначеЕсли Подразделение.Код = "ЦБ000126" Тогда APIKey = "m4Ht7pxiOh2UX01kZIZA4vW7QtqCK6"; //Шахты 
	ИначеЕсли Подразделение.Код = "ЦБ001330" Тогда APIKey = "lnaj3mmtXa1jq3WF3ogI47U2obsZYX"; //Волгодонск
	КонецЕсли;
	
	ПолныйПутьКпрограмме = "C:\Program Files\ChevroletServiceDataUploader\ChevroletServiceDataUploader.exe";		
	ИмяФайлаПрограммыНаДиске = Новый Файл(ПолныйПутьКпрограмме);
	
	Если   ИмяФайлаПрограммыНаДиске.Существует() Тогда
		
		ИмяВременногоФайлаЗН = "C:\Program Files\ChevroletServiceDataUploader\DataToSend\file1.txt";
		ДвоичныеДанные = ПолучитьИзВременногоХранилища(АдресВХ_ЗН);
		ДвоичныеДанные.Записать(ИмяВременногоФайлаЗН);
		
		ИмяВременногоФайлаРабот = "C:\Program Files\ChevroletServiceDataUploader\DataToSend\file2.txt";
		ДвоичныеДанные = ПолучитьИзВременногоХранилища(АдресВХ_Работ);
		ДвоичныеДанные.Записать(ИмяВременногоФайлаРабот);
		
		ИмяКоманды = """C:\Program Files\ChevroletServiceDataUploader\ChevroletServiceDataUploader.exe"""+" "+ APIKey ;
		
		Попытка
			ОбщиеСервер.ВыполнитьКомандуНаСервере(ИмяКоманды,ОписаниеОшибки);
		Исключение
			ОписаниеОшибки = ОписаниеОшибки();
		КонецПопытки;	
		
	Иначе			
		
		ОписаниеОшибки = "ОШИБКА! Файл '"+ПолныйПутьКпрограмме+"' не существует.";			
		
	КонецЕсли;
	
	//Бондаренко-- 20201002
	Если ФайлЛогНаДиске.Существует() Тогда
		ТекстПисьма = "";
		Текст = Новый ЧтениеТекста(ПутьКЛог,КодировкаТекста.ANSI,Символы.ПС,    ,  Истина);
		ёё = 0;
		Пока Истина Цикл
			ёё = ёё + 1;
			Если ёё > 10000 Тогда
				Прервать;
			КонецЕсли; 
			Строка = Текст.ПрочитатьСтроку();
			Если Строка = Неопределено Тогда
				мКому = Новый Массив;
				мКому.Добавить("valter_y@sokolmotors.ru");
				мКопии = Новый Массив;
				мКопии.Добавить("bondarenko_vg@sokolmotors.ru");
				ТемаПисьма = "Выгрузка ЗН по CHEVROLET "+ТекущаяДата();
				Суть = ТекстПисьма;
				Попытка
					г_Функции.СоздатьИОтпраитьЭлПисьмо(мКому,мКопии,ТемаПисьма,Суть);
				Исключение
					//				
				КонецПопытки; 
			Иначе
				ТекстПисьма = СокрЛП(ТекстПисьма)+Символы.ПС+Строка;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;	
	
КонецПроцедуры
//Бондаренко-- 20220203 

//Бондаренко++ 20220203           
Функция ПолучитьТЗДилеров(Шевроле) Экспорт
	
	ТЗ = Новый ТаблицаЗначений;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	КодыДилеровСрезПоследних.Период,
		|	КодыДилеровСрезПоследних.ПодразделениеКомпании,
		|	КодыДилеровСрезПоследних.Бренд,
		|	КодыДилеровСрезПоследних.КодДилера
		|ИЗ
		|	РегистрСведений.КодыДилеров.СрезПоследних(&Период, ) КАК КодыДилеровСрезПоследних
		|ГДЕ
		|	КодыДилеровСрезПоследних.Бренд = &Бренд";
	
	Запрос.УстановитьПараметр("Бренд", Шевроле);
	Запрос.УстановитьПараметр("Период", ТекущаяДата());
	
	ТЗ = Запрос.Выполнить().Выгрузить();  
	
	//ТЗ.ВыбратьСтроку(ТЗ.Количество());
	
	Возврат ТЗ;
 
КонецФункции // ПолучитьТЗДилеров(Бренд)
 

Процедура ВыгрузитьОстаткиНоменклатурыПоШевроле(Параметры = Неопределено)  Экспорт
	
 	ИмяФайла = КаталогВременныхФайлов()+"file3.txt";
 	
	Шевроле = Справочники.Марка.CHEVROLET;
	ТЗ = ПолучитьТЗДилеров(Шевроле);
	
	Если ТЗ.Количество() > 0 Тогда
		Для каждого Элем Из ТЗ Цикл
 			
			Запрос = Новый Запрос;
			Запрос.Текст = 
			"ВЫБРАТЬ
			|	&Дилер КАК Дилер,
			|	&КодДилера КАК КодДилера,
			|	ПартииТоваровКомпанииОстатки.Номенклатура.Артикул КАК Артикул,
			|	СУММА(ПартииТоваровКомпанииОстатки.КоличествоОстаток) КАК СвободныйОстаток,
			|	ПартииТоваровКомпанииОстатки.Номенклатура КАК Ссылка,
			|	Цены.РозничнаяЦена КАК РозничнаяЦена
			|ИЗ
			|	РегистрНакопления.ПартииТоваровКомпании.Остатки(&ДатаОтчета, ) КАК ПартииТоваровКомпанииОстатки
			|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
			|			ЦеныСрезПоследних.Номенклатура КАК Номенклатура,
			|			ЦеныСрезПоследних.ТипЦен КАК ТипЦен,
			|			ЦеныСрезПоследних.Цена КАК РозничнаяЦена
			|		ИЗ
			|			РегистрСведений.Цены.СрезПоследних(&ДатаОтчета, ) КАК ЦеныСрезПоследних
			|		ГДЕ
			|			ЦеныСрезПоследних.ТипЦен = ЗНАЧЕНИЕ(Справочник.ТипыЦен.ОсновнойТипЦенПродажи)) КАК Цены
			|		ПО ПартииТоваровКомпанииОстатки.Номенклатура = Цены.Номенклатура
			|ГДЕ
			|	ПартииТоваровКомпанииОстатки.СкладКомпании.Подразделение В ИЕРАРХИИ(&ГруппаПодразделений)
			|	И ПартииТоваровКомпанииОстатки.Партия.Контрагент = &КелесРус
			|	И Цены.РозничнаяЦена > 0
			|	И ПартииТоваровКомпанииОстатки.КоличествоОстаток > 0
			|
			|СГРУППИРОВАТЬ ПО
			|	ПартииТоваровКомпанииОстатки.Номенклатура.Артикул,
			|	ПартииТоваровКомпанииОстатки.Номенклатура,
			|	Цены.РозничнаяЦена
			|
			|УПОРЯДОЧИТЬ ПО
			|	РозничнаяЦена УБЫВ";
			
 			Запрос.УстановитьПараметр("Дилер", Элем.ПодразделениеКомпании.Организация.НаименованиеДляПечати);
			Запрос.УстановитьПараметр("КодДилера", Элем.КодДилера);
			Запрос.УстановитьПараметр("ДатаОтчета", КонецДня(ТекущаяДата()  -  86400));   //Минус  1 день
			Запрос.УстановитьПараметр("КелесРус", Справочники.Контрагенты.НайтиПоРеквизиту("ИНН","9715380692")); // КЕЛЕС РУС ООО
			Запрос.УстановитьПараметр("ГруппаПодразделений",Элем.ПодразделениеКомпании.Родитель);
			
			ТаблицаОстатков = Запрос.Выполнить().Выгрузить();
 
			Если ТаблицаОстатков.Количество()  > 0 Тогда
				
				ТекстЗН = Новый ТекстовыйДокумент; 
				
				Для каждого Строка Из ТаблицаОстатков Цикл
					ТекстЗН.ДобавитьСтроку(""+СтрЗаменить(Строка.Дилер,"""","'") + ";"+
					Строка.КодДилера + ";"+
					Строка.Артикул + ";"+
					Строка.СвободныйОстаток + ";"+
					СтрЗаменить(Строка.РозничнаяЦена,Символы.НПП,"")); 
				КонецЦикла;
				
				Попытка
					ТекстЗН.Записать(ИмяФайла); 
				Исключение
					//Сообщить("ОШИБКА! Не удалось записать файл "+ИмяФайла);	
				КонецПопытки; 				
				
				ДвоичныеДанныеЗН=Новый ДвоичныеДанные(ИмяФайла);
				АдресВХ_Остатки = ПоместитьВоВременноеХранилище(ДвоичныеДанныеЗН);
				ВыгрузкаОстатковНоменклатурыИЦенНаПорталШевроле(АдресВХ_Остатки,Элем.ПодразделениеКомпании);	
				
			КонецЕсли; 
		КонецЦикла;
	КонецЕсли;
  	
КонецПроцедуры //ВыгрузитьОстаткиНоменклатурыПоШевроле
//Бондаренко-- 20220203


//Бондаренко++ 20220203
Процедура ВыгрузкаОстатковНоменклатурыИЦенНаПорталШевроле(АдресВХ_Остатков,Подразделение) Экспорт
	
	Перем ОписаниеОшибки;
	
 	ДатаВремяСтрокой = "";
	ДатаВремяСтрокой = СокрЛП(Формат(ТекущаяДата(),"ДЛФ=DT"));
	ДатаВремяСтрокой = СтрЗаменить(ДатаВремяСтрокой,".","_");
	ДатаВремяСтрокой = СтрЗаменить(ДатаВремяСтрокой,":","_");
	ДатаВремяСтрокой = СтрЗаменить(ДатаВремяСтрокой," ","_");
	
	ПутьКПапкеПрограммы = "C:\Program Files\ChevroletServiceDataUploader";
	
	ПутьКЛог = ПутьКПапкеПрограммы + "\log.txt";
	ФайлЛогНаДиске = Новый Файл(ПутьКЛог);
	 	
	ПолныйПутьКпрограмме = ПутьКПапкеПрограммы + "\ChevroletStockDataUploader.exe";		
	ИмяФайлаПрограммыНаДиске = Новый Файл(ПолныйПутьКпрограмме);
	
	Если   ИмяФайлаПрограммыНаДиске.Существует() Тогда
		
		ИмяВременногоФайлаЗН = ПутьКПапкеПрограммы+ "\DataToSend\file3.txt";
		ДвоичныеДанные = ПолучитьИзВременногоХранилища(АдресВХ_Остатков);
		ДвоичныеДанные.Записать(ИмяВременногоФайлаЗН);
		
		Если Подразделение.Код = "ЦБ000231" Тогда APIKey = "Vv7Cj1yqRFr9w2ek5gG8Gq7971M6TD" //Ростов Пойменная
		ИначеЕсли Подразделение.Код = "ЦБ000126" Тогда APIKey = "m4Ht7pxiOh2UX01kZIZA4vW7QtqCK6"; //Шахты ОЛИМП 
		ИначеЕсли Подразделение.Код = "ЦБ001330" Тогда APIKey = "lnaj3mmtXa1jq3WF3ogI47U2obsZYX"; //Волгодонск Лада
		КонецЕсли;
 		
		ИмяКоманды = """" + ПолныйПутьКпрограмме + """ " + APIKey;
		
		Попытка
			ОбщиеСервер.ВыполнитьКомандуНаСервере(ИмяКоманды,ОписаниеОшибки);
		Исключение
			ОписаниеОшибки = ОписаниеОшибки();
		КонецПопытки;	
		
	Иначе			
		
		ОписаниеОшибки = "ОШИБКА! Файл '"+ПолныйПутьКпрограмме+"' не существует.";			
		
	КонецЕсли;
	
 	Если ФайлЛогНаДиске.Существует() Тогда
		ТекстПисьма = "";
		Текст = Новый ЧтениеТекста(ПутьКЛог,КодировкаТекста.ANSI,Символы.ПС,    ,  Истина);
		ёё = 0;
		Пока Истина Цикл
			ёё = ёё + 1;
			Если ёё > 10000 Тогда
				Прервать;
			КонецЕсли; 
			Строка = Текст.ПрочитатьСтроку();
			Если Строка = Неопределено Тогда
				мКому = Новый Массив;
				мКому.Добавить("valter_y@sokolmotors.ru");
				мКопии = Новый Массив;
				мКопии.Добавить("bondarenko_vg@sokolmotors.ru");
				ТемаПисьма = "Выгрузка остатков номенклатуры по CHERY "+текущаяДата();
				Суть = ТекстПисьма;
				Попытка
					г_Функции.СоздатьИОтпраитьЭлПисьмо(мКому,мКопии,ТемаПисьма,Суть);
				Исключение
					//				
				КонецПопытки; 
			Иначе
				ТекстПисьма = СокрЛП(ТекстПисьма)+Символы.ПС+Строка;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;	
 	
КонецПроцедуры
//Бондаренко-- 20220203