
// Эта функция возвращает список защищенных решений, которые были объеденены в одну конфигурацию.
// Список состоит из имени защищенной обработки и имени конфигурации, для которой она предназначена.
// Имя конфигурации используется для показа информации о лицензировании.
// Имя обработки состоит из трех частей, разделенных точкой.
// XXX.YYY.ZZZ где:
// XXX - имя общего макета, в котором храниться обработка
// YYY - имя общего макета, в котором хранятся параметры лицензирования
// ZZZ - собственно имя защищенной обработки
// Количество объединенных решений не ограничено

Функция ПолучитьСписокРешений() Экспорт
	Список = новый Соответствие;
	
	ИмяОбработки = "а5ХранилищеЗащищеннойОбработки.а5ПараметрыЛицензирования.ЗащитаТОР";
	ИмяРешения = "Альфа-Авто: Автосалон+Автосервис+Автозапчасти ПРОФ, редакция 5.1";
	Список.Вставить(ИмяОбработки, ИмяРешения);
	
	//ИмяОбработки = "ИмяХранилищаОбработки.ИмяХранилищаПараметровЛицензирования.ИмяОбработки";
	//ИмяРешения = "Название решения";
	//Список.Вставить(ИмяОбработки, ИмяРешения);
	
	Возврат Список;
КонецФункции
