
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("ДилерскийЦентр") Тогда
		ДилерскийЦентр = Параметры.ДилерскийЦентр;	
	КонецЕсли; 	
	
	Если Не ЗначениеЗаполнено(ДилерскийЦентр) Тогда
		ДилерскийЦентр = Renault_CRM.ПолучитьДилерскийЦентрПользователя();	
	КонецЕсли;
	
	Если Параметры.Свойство("Клиент") И ЗначениеЗаполнено(Параметры.Клиент) Тогда 
		
		Элементы.ФИООтбор.СписокВыбора.Добавить(Параметры.Клиент.Наименование);
		ФИООтбор = Параметры.Клиент.Наименование;
		
		ДобавитьЭлементКомпоновки(Список,"Ссылка",ВидСравненияКомпоновкиДанных.Равно,Параметры.Клиент,,Истина);	
		
		УстановитьОтборПоКлиентуВОбращении(Параметры.Клиент);
		УстановитьОтборПоКлиентуВАвтомобилях(Параметры.Клиент);
		
	Иначе 
		УстановитьОтборПоКлиентуВОбращении(Неопределено);
		УстановитьОтборПоКлиентуВАвтомобилях(Неопределено);
	КонецЕсли;                   
	
	Если Параметры.Свойство("ДокументОснование") Тогда
		ДокументОснование = Параметры.ДокументОснование;	
	КонецЕсли; 
	
	Если Параметры.Свойство("РежимПроверкиБлокировок") Тогда
		РежимПроверкиБлокировок = Параметры.РежимПроверкиБлокировок;	
	КонецЕсли; 
	
	Если Параметры.Свойство("Телефон") Тогда
		
		Элементы.ТелефонОтбор.СписокВыбора.Добавить(Параметры.Телефон);
		ТелефонОтбор = Параметры.Телефон;
		
		Если Не ПустаяСтрока(ТелефонОтбор) Тогда
			
			СписокОбъектов = НайтиКонтрагентовПоТелефону(ТелефонОтбор);
			
			Использование = (СписокОбъектов.Количество() > 0);
			УстановитьОтборПоСсылке(СписокОбъектов,Использование);
			
		КонецЕсли; 	

	КонецЕсли;
		
	УстановитьУсловноеОформление();
	
КонецПроцедуры

&НаКлиенте
Процедура ФИООтборАвтоПодбор(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, Ожидание, СтандартнаяОбработка)
	
	//да потому, что на 8.2 другие параметры в процедуре	
	Попытка
		
		Ожидание = 3;
		ПараметрыПолученияДанных.ПолнотекстовыйПоиск = ПолнотекстовыйПоискПриВводеПоСтроке.Использовать;
		ПараметрыПолученияДанных.СтрокаПоиска = Неопределено;
	
	Исключение
		
		ПараметрыПолученияДанных = 3;
		
	КонецПопытки;
		
	Если Не ПустаяСтрока(Текст) 
		И (СтрДлина(Текст) > МаксимальнаяДлинаТекста + ?(МаксимальнаяДлинаТекста = 0,3,5) Или СтрДлина(Текст)>3 И СтрДлина(Текст)<МаксимальнаяДлинаТекста) Тогда
		
		СписокВыбораФИО = Новый СписокЗначений;
		
		Элементы.ФИООтбор.ОбновлениеТекстаРедактирования = ОбновлениеТекстаРедактирования.НеИспользовать;
		
		ТекстПоиска = СокрЛП(Текст);
		
 		Если Не ПолнотекстовыйПоискКонтрагентов(Текст,СписокВыбораФИО) Тогда 
			
			СписокВыбораФИО = Новый СписокЗначений;
			
			мФИО = Renault_СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивСлов(ТекстПоиска);
			
			Если мФИО.Количество() = 3 Тогда
				МассивФИО = ПолучитьФИОДляОтбора(мФИО[0],мФИО[1],мФИО[2]);
				СписокВыбораФИО.ЗагрузитьЗначения(МассивФИО); 
			ИначеЕсли мФИО.Количество() = 2 Тогда
				МассивФИО = ПолучитьФИОДляОтбора(мФИО[0],мФИО[1]);
				СписокВыбораФИО.ЗагрузитьЗначения(МассивФИО); 
			ИначеЕсли мФИО.Количество() = 1 Тогда
				МассивФИО = ПолучитьФИОДляОтбора(мФИО[0]);
				СписокВыбораФИО.ЗагрузитьЗначения(МассивФИО);
			Иначе 
				СписокВыбораФИО.Очистить(); 
			КонецЕсли; 
									
			Если СписокВыбораФИО.НайтиПоЗначению(ТекстПоиска) = Неопределено Тогда
				СписокВыбораФИО.Добавить(ТекстПоиска);
			КонецЕсли;

			Элемент.СписокВыбора.ЗагрузитьЗначения(СписокВыбораФИО.ВыгрузитьЗначения());
			ФИООтбор = ТекстПоиска;
			
		Иначе 
			Если СписокВыбораФИО.НайтиПоЗначению(ТекстПоиска) = Неопределено Тогда
				СписокВыбораФИО.Добавить(ТекстПоиска);
			КонецЕсли;
			
			Элемент.СписокВыбора.ЗагрузитьЗначения(СписокВыбораФИО.ВыгрузитьЗначения());			
			ФИООтбор = ТекстПоиска;
				
		КонецЕсли;
		
		Если МаксимальнаяДлинаТекста > СтрДлина(Текст) Тогда
			МаксимальнаяДлинаТекста = ?(СтрДлина(Текст)<=3,0,МаксимальнаяДлинаТекста - ?(СтрДлина(Текст)/5>1,5,МаксимальнаяДлинаТекста));
		Иначе 
			МаксимальнаяДлинаТекста = СтрДлина(СокрЛП(Текст));			
		КонецЕсли; 
		
	КонецЕсли; 

	Если Элемент.СписокВыбора.НайтиПоЗначению(ТекстПоиска) = Неопределено Тогда
		Элемент.СписокВыбора.Добавить(ТекстПоиска);
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ФИООтборПриИзменении(Элемент)
	
	ФИООтбор = Элемент.ТекстРедактирования;
	Элементы.ФИООтбор.ОбновлениеТекстаРедактирования = ОбновлениеТекстаРедактирования.Авто;
	УстановитьОтборСписка();
	Если Не ПустаяСтрока(ФИООтбор) 
		И (Renault_СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивСлов(ФИООтбор).Количество() = 3)Тогда
	
		ПроверитьПодобныхКонтрагентов(СокрЛП(ФИООтбор));
	
	КонецЕсли; 
	
	МаксимальнаяДлинаТекста = СтрДлина(СокрЛП(ФИООтбор));
	
КонецПроцедуры

&НаКлиенте
Процедура ФамилияОтборАвтоПодбор(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, Ожидание, СтандартнаяОбработка)
	
	Если Не ПустаяСтрока(Текст) 
		И СтрДлина(Текст)>3 Тогда
		
		ТекстПоиска = СокрЛП(Текст);
		
		МассивФИО = ПолучитьФамилиюДляОтбора(ТекстПоиска);
		Элементы.ФамилияОтбор.СписокВыбора.ЗагрузитьЗначения(МассивФИО);
		
		Элементы.ФамилияОтбор.СписокВыбора.Добавить(ТекстПоиска);
		
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура ФамилияОтборПриИзменении(Элемент)
		
КонецПроцедуры

&НаКлиенте
Процедура ИмяОтборАвтоПодбор(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, Ожидание, СтандартнаяОбработка)
	
	Если Не ПустаяСтрока(Текст) 
		И СтрДлина(Текст)>3 Тогда
		
		ТекстПоиска = СокрЛП(Текст);
		
		МассивФИО = ПолучитьИмяДляОтбора(ТекстПоиска);
		Элементы.ИмяОтбор.СписокВыбора.ЗагрузитьЗначения(МассивФИО);
		
		Элементы.ИмяОтбор.СписокВыбора.Добавить(ТекстПоиска);
		
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура ИмяОтборПриИзменении(Элемент)
	
КонецПроцедуры

&НаКлиенте
Процедура ОтчествоОтборАвтоПодбор(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, Ожидание, СтандартнаяОбработка)
	
	Если Не ПустаяСтрока(Текст) 
		И СтрДлина(Текст)>3 Тогда
		
		ТекстПоиска = СокрЛП(Текст);
		
		МассивФИО = ПолучитьОтчествоДляОтбора(ТекстПоиска);
		Элементы.ОтчествоОтбор.СписокВыбора.ЗагрузитьЗначения(МассивФИО);
		
		Элементы.ОтчествоОтбор.СписокВыбора.Добавить(ТекстПоиска);
		
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура ОтчествоОтборПриИзменении(Элемент)
	
КонецПроцедуры

&НаКлиенте
Процедура ГосНомерОтборАвтоПодбор(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, Ожидание, СтандартнаяОбработка)
	
	Если Не ПустаяСтрока(Текст) 
		И СтрДлина(Текст)>1 Тогда
		
		ТекстПоиска = СокрЛП(Текст);
		
		МассивГосНомеров = ПолучитьСписокВыбораПоГосНомерам(ТекстПоиска);
		Элементы.ГосНомерОтбор.СписокВыбора.ЗагрузитьЗначения(МассивГосНомеров);
		
		//Элементы.ГосНомерОтбор.СписокВыбора.Добавить(ТекстПоиска);
		
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура ГосНомерОтборПриИзменении(Элемент)
	УстановитьОтборСписка();	
КонецПроцедуры

&НаКлиенте
Процедура VINОтборАвтоПодбор(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, Ожидание, СтандартнаяОбработка)
	
	Если Не ПустаяСтрока(Текст) 
		И СтрДлина(Текст)>3 Тогда
		
		ТекстПоиска = СокрЛП(Текст);
		
		МассивVIN = ПолучитьСписокВыбораПоVIN(ТекстПоиска);
		Элементы.VINОтбор.СписокВыбора.ЗагрузитьЗначения(МассивVIN);
		
		//Элементы.VINОтбор.СписокВыбора.Добавить(ТекстПоиска);
		
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура VINОтборПриИзменении(Элемент)
	УстановитьОтборСписка();	
КонецПроцедуры

&НаКлиенте
Процедура ТелефонОтборАвтоПодбор(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, Ожидание, СтандартнаяОбработка)
	
	Если Не ПустаяСтрока(Текст) 
		И СтрДлина(Текст)>3 Тогда
		
		ТекстПоиска = СокрЛП(Текст);
		
		МассивТелефонов = ПолучитьСписокВыбораПоТелефону(ТекстПоиска);
		Элементы.ТелефонОтбор.СписокВыбора.ЗагрузитьЗначения(МассивТелефонов);
		
		Элементы.ТелефонОтбор.СписокВыбора.Добавить(ТекстПоиска);
		
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура ТелефонОтборПриИзменении(Элемент)
	УстановитьОтборСписка();	
КонецПроцедуры

&НаКлиенте
Процедура АдресЭлектроннойПочтыОтборАвтоПодбор(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, Ожидание, СтандартнаяОбработка)
	
	Если Не ПустаяСтрока(Текст) 
		И СтрДлина(Текст)>3 Тогда
		
		ТекстПоиска = СокрЛП(Текст);
		
		МассивEmail = ПолучитьСписокВыбораПоEmail(ТекстПоиска);
		Элементы.АдресЭлектроннойПочтыОтбор.СписокВыбора.ЗагрузитьЗначения(МассивEmail);
		
		//Элементы.АдресЭлектроннойПочтыОтбор.СписокВыбора.Добавить(ТекстПоиска);
		
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура АдресЭлектроннойПочтыОтборПриИзменении(Элемент)
	УстановитьОтборСписка();	
КонецПроцедуры

&НаКлиенте
Процедура ИННОтборПриИзменении(Элемент)
	УстановитьОтборСписка();	
КонецПроцедуры

&НаКлиенте
Процедура КППОтборПриИзменении(Элемент)
	УстановитьОтборСписка();	
КонецПроцедуры

&НаКлиенте
Процедура СоздатьКонтрагента(Команда)
	
	МассивПодобных = НайтиДублиНаСервере(ФИООтбор);
	
	Если МассивПодобных.Количество() > 0 Тогда
		
		ПараметрыФормы = Новый Структура("Контрагенты,Заголовок,Подсказка",МассивПодобных,"Поиск дублей","Найдены дублирующие элементы:");
		
		ЗначениеВыбора = ОткрытьФормуМодально("ОбщаяФорма.DMS_ФормаПодобныхКонтрагентов",ПараметрыФормы);
		
		Если ЗначениеЗаполнено(ЗначениеВыбора) Тогда		
			ОповеститьОВыборе(ЗначениеВыбора);
			Возврат;
		КонецЕсли; 
		
	КонецЕсли; 
	
	НовыйКонтрагент = Справочники.Контрагенты.СоздатьЭлемент();
	НовыйКонтрагент.Родитель = ДилерскийЦентр.КаталогСозданияКонтрагентовАвтосервис;
	НовыйКонтрагент.НаименованиеПолное = ФИООтбор;
	
	Обработка = Обработки.CRM_АРМ_АвтоСервис.Создать();
	Обработка.ДилерскийЦентр = ДилерскийЦентр; //DMSCOR-973
	Форма = Обработка.ПолучитьФорму("ФормаСозданиеКонтрагента");
	Форма.ЭлементыФормы.ФИО.Значение 	 = ФИООтбор;
	Форма.ЭлементыФормы.Телефон.Значение = ТелефонОтбор;
	
	НовыйКонтрагент = Форма.ОткрытьМодально();
	
	Если НовыйКонтрагент <> Неопределено Тогда
	
		Если ЗначениеЗаполнено(НовыйКонтрагент.Ссылка) Тогда
			Закрыть(НовыйКонтрагент.Ссылка);
		КонецЕсли;
	
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьКарточку(Команда)
	
	ТекущаяСтрока = Элементы.Список.ТекущиеДанные;
	
	Если ТекущаяСтрока = Неопределено Тогда
		
		Сообщить("Выберите контрагента");
		Возврат;
	
	КонецЕсли; 
	
	Профиль = ПолучитьПрофильКлиента(ТекущаяСтрока.Ссылка);
	
	Если Профиль <> Неопределено И ЗначениеЗаполнено(Профиль) Тогда
		
		Профиль.Ссылка.ПолучитьФорму().Открыть();
		
	Иначе
		
		ТекущаяСтрока.Ссылка.ПолучитьФорму().Открыть();
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
		
	ТекущаяСтрока = Элементы.Список.ТекущиеДанные;
	
	Если ТекущаяСтрока = Неопределено Тогда
		Возврат;
	КонецЕсли; 
	
	СтандартнаяОбработка = Ложь;
	
	Текст = Renault_АвтосервисОбщий.Renault_СообщитьОЗаметках(ТекущаяСтрока.Ссылка);
	
	Если ЗначениеЗаполнено(Текст) Тогда
		Предупреждение(Текст);
	КонецЕсли;
		
	Если РежимПроверкиБлокировок <> Истина Тогда
	
		ОповеститьОВыборе(ТекущаяСтрока.Ссылка);
	
	Иначе
		
		Если ПроверитьБлокировкуДокументов() <> Истина Тогда
			
			Предупреждение("Один из документов заблокирован другим пользователем, невозможно изменить контрагента");
			
		Иначе
			
			ОповеститьОВыборе(ТекущаяСтрока.Ссылка);			
			
		КонецЕсли;		
	
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СписокПриАктивизацииСтроки(Элемент)
	
	ТекущаяСтрока = Элементы.Список.ТекущиеДанные;
	
	Если ТекущаяСтрока = Неопределено Тогда
		Возврат;
	КонецЕсли; 
	
	УстановитьОтборПоКлиентуВОбращении(ТекущаяСтрока.Ссылка);
	УстановитьОтборПоКлиентуВАвтомобилях(ТекущаяСтрока.Ссылка);
	
	ДанныеПоСкидкамИБаллам = Renault_АвтосервисСкидки.ПолучитьИнформациюПоСкидкамИБонусамПоКонтрагенту(ТекущаяСтрока.Ссылка);
	
	ЗаполнитьЗначенияСвойств(ЭтаФорма,ДанныеПоСкидкамИБаллам,"ОстатокБаллов,ПрограммаЛояльности,СкидкаЗапчасти,СкидкаРаботы");
	
	Элементы.ПрограммаЛояльности.Видимость = ЗначениеЗаполнено(ПрограммаЛояльности);
	Элементы.ГруппаПривилегии.Видимость    = ТекущаяСтрока.ЕстьПривилегии;
	
	Элементы.тВзаиморасчеты.Заголовок = Renault_АвтосервисОбщий.Renault_ПолучитьДолгКлиента(ТекущаяСтрока.Ссылка);
	
	Элементы.Хобби.Заголовок = "Хобби(" + Строка(Renault_АвтосервисСервер.ПолучитьКоличествоХобби(ТекущаяСтрока.Ссылка)) + ")";
	
КонецПроцедуры

&НаКлиенте
Процедура СписокПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	Отказ = Истина;
КонецПроцедуры

&НаКлиенте
Процедура СписокПередУдалением(Элемент, Отказ)
	Отказ = Истина;
КонецПроцедуры

&НаКлиенте
Процедура СписокОбращенийПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	Отказ = Истина;
КонецПроцедуры

&НаКлиенте
Процедура СписокОбращенийПередУдалением(Элемент, Отказ)
	Отказ = Истина;
КонецПроцедуры

&НаКлиенте
Процедура СписокАвтомобилейПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	Отказ = Истина;
КонецПроцедуры

&НаКлиенте
Процедура СписокАвтомобилейПередУдалением(Элемент, Отказ)
	Отказ = Истина;
КонецПроцедуры

&НаКлиенте
Процедура СписокАвтомобилейВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	ТекущаяСтрока = Элементы.СписокАвтомобилей.ТекущиеДанные;
	
	Если ТекущаяСтрока = Неопределено Тогда
		Возврат;
	КонецЕсли; 
	
	Если Поле = Элементы.СписокАвтомобилейНайти Тогда
		
		СтандартнаяОбработка = Ложь;
		
		Если ЗначениеЗаполнено(ТекущаяСтрока.Ссылка) Тогда
			
			Обработка = Обработки.Renault_ИсторияАвтомобиля.Создать();
			Обработка.ВнешнийЗапрос = ИСТИНА;
			Обработка.ЗаполнитьТаблицу(ТекущаяСтрока.Ссылка, "");
			Форма = Обработка.ПолучитьФорму("Форма");
			Ответ = Форма.ОткрытьМодально();
			
		КонецЕсли;
		
	КонецЕсли; 
	
КонецПроцедуры
 
&НаСервереБезКонтекста
Функция ПолучитьФИОДляОтбора(Фамилия = "",Имя = "",Отчество = "")
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Фамилия",  ?(Фамилия = "","","%" + СокрЛП(Фамилия)+"%"));
	Запрос.УстановитьПараметр("Имя", 	  ?(Имя = "","","%" + СокрЛП(Имя)+"%"));
	Запрос.УстановитьПараметр("Отчество", ?(Отчество = "","","%" + СокрЛП(Отчество)+"%"));
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	ДанныеФизическихЛиц.Фамилия + "" "" + ДанныеФизическихЛиц.Имя + "" "" + ДанныеФизическихЛиц.Отчество КАК ФИО
		|ПОМЕСТИТЬ мФИО
		|ИЗ
		|	РегистрСведений.DMS_ДанныеФизическихЛиц КАК ДанныеФизическихЛиц
		|ГДЕ
		|	ДанныеФизическихЛиц.Фамилия ПОДОБНО &Фамилия
		|	И ДанныеФизическихЛиц.Имя ПОДОБНО &Имя
		|	И ДанныеФизическихЛиц.Отчество ПОДОБНО &Отчество
		|	И &Фамилия <> """"
		|			И &Имя <> """"
		|			И &Отчество <> """"
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ДанныеФизическихЛиц.Фамилия + "" "" + ДанныеФизическихЛиц.Имя + "" "" + ДанныеФизическихЛиц.Отчество
		|ИЗ
		|	РегистрСведений.DMS_ДанныеФизическихЛиц КАК ДанныеФизическихЛиц
		|ГДЕ
		|	ДанныеФизическихЛиц.Фамилия ПОДОБНО &Фамилия
		|	И ДанныеФизическихЛиц.Имя ПОДОБНО &Имя
		|	И &Фамилия <> """"
		|			И &Имя <> """"
		|			И &Отчество = """"
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ДанныеФизическихЛиц.Фамилия + "" "" + ДанныеФизическихЛиц.Имя + "" "" + ДанныеФизическихЛиц.Отчество
		|ИЗ
		|	РегистрСведений.DMS_ДанныеФизическихЛиц КАК ДанныеФизическихЛиц
		|ГДЕ
		|	ДанныеФизическихЛиц.Фамилия ПОДОБНО &Фамилия
		|	И ДанныеФизическихЛиц.Отчество ПОДОБНО &Отчество
		|	И &Фамилия <> """"
		|			И &Имя = """"
		|			И &Отчество <> """"
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ДанныеФизическихЛиц.Фамилия + "" "" + ДанныеФизическихЛиц.Имя + "" "" + ДанныеФизическихЛиц.Отчество
		|ИЗ
		|	РегистрСведений.DMS_ДанныеФизическихЛиц КАК ДанныеФизическихЛиц
		|ГДЕ
		|	ДанныеФизическихЛиц.Фамилия ПОДОБНО &Фамилия
		|	И &Фамилия <> """"
		|			И &Имя = """"
		|			И &Отчество = """"
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ДанныеФизическихЛиц.Фамилия + "" "" + ДанныеФизическихЛиц.Имя + "" "" + ДанныеФизическихЛиц.Отчество
		|ИЗ
		|	РегистрСведений.DMS_ДанныеФизическихЛиц КАК ДанныеФизическихЛиц
		|ГДЕ
		|	ДанныеФизическихЛиц.Имя ПОДОБНО &Имя
		|	И &Фамилия = """"
		|			И &Имя <> """"
		|			И &Отчество = """"
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	мФИО.ФИО
		|ИЗ
		|	мФИО КАК мФИО";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	МассивФИО = Новый Массив;
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		МассивФИО.Добавить(ВыборкаДетальныеЗаписи.ФИО);
	КонецЦикла;
	
	Возврат МассивФИО;
	
КонецФункции // ПолучитьФИОДляОтбора()

&НаСервереБезКонтекста
Функция ПолучитьФамилиюДляОтбора(СтрокаПоиска)
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("СтрокаПоиска",  "%" + СокрЛП(СтрокаПоиска)+"%");
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	ДанныеФизическихЛиц.Фамилия КАК ДанныеПоиска
		|ИЗ
		|	РегистрСведений.DMS_ДанныеФизическихЛиц КАК ДанныеФизическихЛиц
		|ГДЕ
		|	ДанныеФизическихЛиц.Фамилия ПОДОБНО &СтрокаПоиска";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	МассивДанных = Новый Массив;
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		МассивДанных.Добавить(ВыборкаДетальныеЗаписи.ДанныеПоиска);	
	КонецЦикла;
	
	Возврат МассивДанных;
	
КонецФункции // ПолучитьФамилиюДляОтбора()

&НаСервереБезКонтекста
Функция ПолучитьИмяДляОтбора(СтрокаПоиска)
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("СтрокаПоиска",  "%" + СокрЛП(СтрокаПоиска)+"%");
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	ДанныеФизическихЛиц.Имя КАК ДанныеПоиска
		|ИЗ
		|	РегистрСведений.DMS_ДанныеФизическихЛиц КАК ДанныеФизическихЛиц
		|ГДЕ
		|	ДанныеФизическихЛиц.Имя ПОДОБНО &СтрокаПоиска";
		
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	МассивДанных = Новый Массив;
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		МассивДанных.Добавить(ВыборкаДетальныеЗаписи.ДанныеПоиска);	
	КонецЦикла;
	
	Возврат МассивДанных;
	
КонецФункции // ПолучитьИмяДляОтбора()

&НаСервереБезКонтекста
Функция ПолучитьОтчествоДляОтбора(СтрокаПоиска)
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("СтрокаПоиска",  "%" + СокрЛП(СтрокаПоиска)+"%");
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	ДанныеФизическихЛиц.Отчество КАК ДанныеПоиска
		|ИЗ
		|	РегистрСведений.DMS_ДанныеФизическихЛиц КАК ДанныеФизическихЛиц
		|ГДЕ
		|	ДанныеФизическихЛиц.Отчество ПОДОБНО &СтрокаПоиска";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	МассивДанных = Новый Массив;
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		МассивДанных.Добавить(ВыборкаДетальныеЗаписи.ДанныеПоиска);	
	КонецЦикла;
	
	Возврат МассивДанных;
	
КонецФункции // ПолучитьОтчествоДляОтбора()
 
&НаСервереБезКонтекста
Функция ПолучитьСписокВыбораПоГосНомерам(ГосНомер)
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ГосНомер", "%"+ГосНомер+"%");
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	ВЫРАЗИТЬ(АвтомобилиСрезПоследних.Значение КАК СТРОКА(20)) КАК ГосНомер
		|ИЗ
		|	РегистрСведений.Автомобили.СрезПоследних(, ВидЗначения = ЗНАЧЕНИЕ(Перечисление.ДополнительнаяИнформацияАвтомобилей.ГосНомер)) КАК АвтомобилиСрезПоследних
		|ГДЕ
		|	(ВЫРАЗИТЬ(АвтомобилиСрезПоследних.Значение КАК СТРОКА(20))) Подобно &ГосНомер";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	МассивГосНомеров = Новый Массив;
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		МассивГосНомеров.Добавить(ВыборкаДетальныеЗаписи.ГосНомер);
	КонецЦикла;
	
 	Возврат МассивГосНомеров;
	
КонецФункции // ПолучитьСписокВыбораПоГосНомерам()

&НаСервереБезКонтекста
Функция ПолучитьСписокВыбораПоVIN(VIN)
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("VIN", "%"+VIN+"%");
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	ВЫРАЗИТЬ(АвтомобилиСрезПоследних.Автомобиль.VIN КАК СТРОКА(20)) КАК VIN
		|ИЗ
		|	РегистрСведений.Автомобили.СрезПоследних(, ВидЗначения = ЗНАЧЕНИЕ(Перечисление.ДополнительнаяИнформацияАвтомобилей.Хозяин)) КАК АвтомобилиСрезПоследних
		|ГДЕ
		|	ВЫРАЗИТЬ(АвтомобилиСрезПоследних.Автомобиль.VIN КАК СТРОКА(20)) ПОДОБНО &VIN";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	МассивVIN = Новый Массив;
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		МассивVIN.Добавить(ВыборкаДетальныеЗаписи.VIN);
	КонецЦикла;
	
 	Возврат МассивVIN;
	
КонецФункции // ПолучитьСписокВыбораПоVIN()

&НаСервереБезКонтекста
Функция ПолучитьСписокВыбораПоТелефону(НомерТелефона)
		
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Телефон", ?(НомерТелефона = "","","%" + НомерТелефона + "%"));
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	НормализованныеКонтактыДляПоиска.Телефон
		|ИЗ
		|	РегистрСведений.Renault_НормализованныеКонтактыДляПоиска КАК НормализованныеКонтактыДляПоиска
		|ГДЕ
		|	НормализованныеКонтактыДляПоиска.Телефон<> """" И НормализованныеКонтактыДляПоиска.Телефон ПОДОБНО &Телефон И &Телефон <> """"
		|	И НормализованныеКонтактыДляПоиска.Объект ССЫЛКА Справочник.Контрагенты";
	
	Результат = Запрос.Выполнить();
	
	Выборка = Результат.Выбрать();
	
	МассивОбъектов = Новый Массив;
	
	Пока Выборка.Следующий() Цикл
		МассивОбъектов.Добавить(Выборка.Телефон);	
	КонецЦикла; 
	
	Возврат МассивОбъектов;

КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьСписокВыбораПоEmail(АдресЭлектроннойПочты)
		
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("АдресЭлектроннойПочты", ?(АдресЭлектроннойПочты = "","","%" + АдресЭлектроннойПочты + "%"));
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	НормализованныеКонтактыДляПоиска.АдресЭлектроннойПочты
		|ИЗ
		|	РегистрСведений.Renault_НормализованныеКонтактыДляПоиска КАК НормализованныеКонтактыДляПоиска
		|ГДЕ
		|	НормализованныеКонтактыДляПоиска.АдресЭлектроннойПочты<>"""" И НормализованныеКонтактыДляПоиска.АдресЭлектроннойПочты ПОДОБНО &АдресЭлектроннойПочты И &АдресЭлектроннойПочты <> """"
		|	И НормализованныеКонтактыДляПоиска.Объект ССЫЛКА Справочник.Контрагенты";
	
	Результат = Запрос.Выполнить();
	
	Выборка = Результат.Выбрать();
	
	МассивОбъектов = Новый Массив;
	
	Пока Выборка.Следующий() Цикл
		МассивОбъектов.Добавить(Выборка.АдресЭлектроннойПочты);	
	КонецЦикла; 
	
	Возврат МассивОбъектов;

КонецФункции

&НаСервереБезКонтекста
Функция НайтиКонтрагентовПоГосНомеру(ГосНомер,НаДату = Неопределено)
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ГосНомер", "%"+СокрЛП(ГосНомер)+"%");
	Запрос.УстановитьПараметр("НаДату",   ?(НаДату = Неопределено,Дата('00010101'),НаДату));
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	ВЫРАЗИТЬ(ВладельцыАвто.Значение КАК Справочник.Контрагенты) КАК Контрагент
		|ИЗ
		|	РегистрСведений.Автомобили.СрезПоследних(&НаДату, ВидЗначения = ЗНАЧЕНИЕ(Перечисление.ДополнительнаяИнформацияАвтомобилей.ГосНомер)) КАК АвтомобилиПоГосНомер
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.Автомобили.СрезПоследних КАК ВладельцыАвто
		|		ПО АвтомобилиПоГосНомер.Автомобиль = ВладельцыАвто.Автомобиль
		|			И (ВладельцыАвто.ВидЗначения = ЗНАЧЕНИЕ(Перечисление.ДополнительнаяИнформацияАвтомобилей.Хозяин))
		|			И ((ВЫРАЗИТЬ(ВладельцыАвто.Значение КАК Справочник.Контрагенты)) <> ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка))
		|ГДЕ
		|	ВЫРАЗИТЬ(АвтомобилиПоГосНомер.Значение КАК СТРОКА) ПОДОБНО &ГосНомер";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		
	мСписокКонтрагентов = Новый СписокЗначений;
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		мСписокКонтрагентов.Добавить(ВыборкаДетальныеЗаписи.Контрагент);
	КонецЦикла;
	
	Возврат мСписокКонтрагентов;
	
КонецФункции // НайтиКонтрагентовПоГосНомеру()

&НаСервереБезКонтекста
Функция НайтиКонтрагентовПоVIN(VIN,НаДату = Неопределено)
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("VIN", "%"+СокрЛП(VIN)+"%");
	Запрос.УстановитьПараметр("НаДату", ?(НаДату = Неопределено,Дата('00010101'),НаДату));
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	ВЫРАЗИТЬ(АвтомобилиПоВИН.Значение КАК Справочник.Контрагенты) КАК Контрагент
		|ИЗ
		|	РегистрСведений.Автомобили.СрезПоследних(
		|			&НаДату,
		|			ВидЗначения = ЗНАЧЕНИЕ(Перечисление.ДополнительнаяИнформацияАвтомобилей.Хозяин)
		|				И Автомобиль.VIN ПОДОБНО &VIN) КАК АвтомобилиПоВИН";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		
	мСписокКонтрагентов = Новый СписокЗначений;
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		мСписокКонтрагентов.Добавить(ВыборкаДетальныеЗаписи.Контрагент);
	КонецЦикла;
	
	Возврат мСписокКонтрагентов;
	
КонецФункции // НайтиКонтрагентовПоГосНомеру()

&НаСервереБезКонтекста
Функция НайтиКонтрагентовПоТелефону(ОтборТелефон)
	
	НомерТелефона = НормализоватьНомерТелефона(ОтборТелефон);
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Телефон", ?(НомерТелефона = "","","%" + НомерТелефона + "%"));
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	ВЫРАЗИТЬ(НормализованныеКонтактыДляПоиска.Объект КАК Справочник.Контрагенты) КАК Контрагент,
		|	НормализованныеКонтактыДляПоиска.Телефон
		|ИЗ
		|	РегистрСведений.Renault_НормализованныеКонтактыДляПоиска КАК НормализованныеКонтактыДляПоиска
		|ГДЕ
		|	НормализованныеКонтактыДляПоиска.Телефон<>"""" И НормализованныеКонтактыДляПоиска.Телефон ПОДОБНО &Телефон И &Телефон <> """"
		|	И НормализованныеКонтактыДляПоиска.Объект ССЫЛКА Справочник.Контрагенты";
	
	Результат = Запрос.Выполнить();
	
	Выборка = Результат.Выбрать();
	
	СписокОбъектов = Новый СписокЗначений;
	
	Пока Выборка.Следующий() Цикл
		СписокОбъектов.Добавить(Выборка.Контрагент);	
	КонецЦикла; 
	
	Возврат СписокОбъектов;

КонецФункции

&НаСервереБезКонтекста
Функция НайтиКонтрагентовПоEMail(EMail)
		
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("EMail", ?(EMail = "","","%" + EMail + "%"));
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	ВЫРАЗИТЬ(НормализованныеКонтактыДляПоиска.Объект КАК Справочник.Контрагенты) КАК Контрагент,
		|	НормализованныеКонтактыДляПоиска.АдресЭлектроннойПочты
		|ИЗ
		|	РегистрСведений.Renault_НормализованныеКонтактыДляПоиска КАК НормализованныеКонтактыДляПоиска
		|ГДЕ
		|   НормализованныеКонтактыДляПоиска.АдресЭлектроннойПочты <> """" И НормализованныеКонтактыДляПоиска.АдресЭлектроннойПочты ПОДОБНО &EMail И &EMail <> """"
		|	И НормализованныеКонтактыДляПоиска.Объект ССЫЛКА Справочник.Контрагенты";
	
	Результат = Запрос.Выполнить();
	
	Выборка = Результат.Выбрать();
	
	СписокОбъектов = Новый СписокЗначений;
	
	Пока Выборка.Следующий() Цикл
		СписокОбъектов.Добавить(Выборка.Контрагент);	
	КонецЦикла; 
	
	Возврат СписокОбъектов;

КонецФункции

&НаСервереБезКонтекста
Функция НормализоватьНомерТелефона(Телефон)
	
	Фрагмент = СокрЛП(Телефон);
	
	СтрокаЦифр = "0123456789";
	
	НомерТелефона = "";
	
 	Для А = 1 По СтрДлина(Фрагмент) Цикл
		Символ = Сред(Фрагмент, А, 1);
		Если Найти(СтрокаЦифр,Символ) <> 0 Тогда
			НомерТелефона = НомерТелефона + Символ; 
		КонецЕсли;
	КонецЦикла;
	
	Если ПустаяСтрока(НомерТелефона) Тогда
		Возврат НомерТелефона;
	КонецЕсли; 
	
	Возврат НомерТелефона;
	
КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьСписокКонтрагентовПоОтборам(ИсходныйСписок,ТекущийСписок)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	Контрагенты.Ссылка
		|ИЗ
		|	Справочник.Контрагенты КАК Контрагенты
		|ГДЕ
		|	Контрагенты.Ссылка В(&ИсхоныйСписок)
		|	И Контрагенты.Ссылка В(&ТекущийСписок)
		|	И НЕ Контрагенты.ЭтоГруппа";
	
	Запрос.УстановитьПараметр("ИсхоныйСписок", ИсходныйСписок);
	Запрос.УстановитьПараметр("ТекущийСписок", ТекущийСписок);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	мСписокКонтрагентов = Новый СписокЗначений;
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		мСписокКонтрагентов.Добавить(ВыборкаДетальныеЗаписи.Ссылка);
	КонецЦикла;
	
	Возврат мСписокКонтрагентов;

КонецФункции // ПолучитьСписокКонтрагентовПоОтборам()

&НаСервере
Процедура УстановитьОтборСписка()
	
	Список.Отбор.Элементы.Очистить();
	
	Если Не ПустаяСтрока(VINОтбор) Тогда
		
		СписокОбъектов = НайтиКонтрагентовПоVIN(VINОтбор);//ПоискКонтрагента("ПоVINАвтомобиля", Неопределено, "", ЭлементыФормы.ОтборVIN.Значение);
		
		Использование = Истина;//(СписокОбъектов.Количество() > 0);
		УстановитьОтборПоСсылке(СписокОбъектов,Использование);
		
	КонецЕсли; 	

	Если Не ПустаяСтрока(ТелефонОтбор) Тогда
		
		СписокОбъектов = НайтиКонтрагентовПоТелефону(ТелефонОтбор);
		
		Использование = Истина;//(СписокОбъектов.Количество() > 0);
		УстановитьОтборПоСсылке(СписокОбъектов,Использование);
		
	КонецЕсли; 	

	Если Не ПустаяСтрока(АдресЭлектроннойПочтыОтбор) Тогда
		
		СписокОбъектов = НайтиКонтрагентовПоEMail(АдресЭлектроннойПочтыОтбор);
		
		Использование = Истина;//(СписокОбъектов.Количество() > 0);
		УстановитьОтборПоСсылке(СписокОбъектов,Использование);
		
	КонецЕсли; 	

	Если Не ПустаяСтрока(ГосНомерОтбор) Тогда
		
		СписокОбъектов = НайтиКонтрагентовПоГосНомеру(ГосНомерОтбор);
		
		Использование = Истина;//(СписокОбъектов.Количество() > 0);
		УстановитьОтборПоСсылке(СписокОбъектов,Использование);
		
	КонецЕсли; 	
	
	ТекстПоиска = СокрЛП(ФИООтбор);
	ДобавитьЭлементКомпоновки(Список,"НаименованиеПолное",ВидСравненияКомпоновкиДанных.Содержит,ТекстПоиска,,Не ПустаяСтрока(ТекстПоиска));
	
	ТекстПоиска = СокрЛП(ИННОтбор);
	ДобавитьЭлементКомпоновки(Список,"ИНН",ВидСравненияКомпоновкиДанных.Содержит,ТекстПоиска,,Не ПустаяСтрока(ТекстПоиска));
	
	ТекстПоиска = СокрЛП(КППОтбор);
	ДобавитьЭлементКомпоновки(Список,"КПП",ВидСравненияКомпоновкиДанных.Содержит,ТекстПоиска,,Не ПустаяСтрока(ТекстПоиска));
	
КонецПроцедуры // УстановитьОтборСписка()

&НаСервере
Процедура УстановитьОтборПоСсылке(СписокОтбора,Использование)

	ДобавитьЭлементКомпоновки(Список,"Ссылка",ВидСравненияКомпоновкиДанных.ВСписке,СписокОтбора,,Использование);	

КонецПроцедуры // УстановитьОтборПоСсылке()

&НаСервере
Функция ДобавитьЭлементКомпоновки(ОбластьДобавления,
									Знач ИмяПоля,
									Знач ВидСравнения,
									Знач ПравоеЗначение = Неопределено,
									Знач Представление  = Неопределено,
									Знач Использование  = Неопределено,
									знач РежимОтображения = Неопределено,
									знач ИдентификаторПользовательскойНастройки = Неопределено) Экспорт
									
	ЗначениеПоиска = Новый ПолеКомпоновкиДанных(ИмяПоля);
	
	СпособПоиска = 1;
	МассивЭлементов = Новый Массив;
	
	НайтиРекурсивно(ОбластьДобавления.Отбор.Элементы, МассивЭлементов, СпособПоиска, ЗначениеПоиска);
	
	СписокДляОтбора = ПравоеЗначение;
	
	Если МассивЭлементов.Количество() > 0 Тогда
	                                    
		мЭлементОтбора = МассивЭлементов[0];
		
		мЗначениеОтбора = мЭлементОтбора.ПравоеЗначение;
		
		Если ТипЗнч(мЗначениеОтбора) = Тип("СписокЗначений") Тогда
			СписокДляОтбора = ПолучитьСписокКонтрагентовПоОтборам(мЗначениеОтбора,ПравоеЗначение);	
		КонецЕсли; 
		
	КонецЕсли; 
	
	Элемент = ОбластьДобавления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	Элемент.ЛевоеЗначение = Новый ПолеКомпоновкиДанных(ИмяПоля);
	Элемент.ВидСравнения = ВидСравнения;
		
	Если ПравоеЗначение <> Неопределено Тогда
		Элемент.ПравоеЗначение = СписокДляОтбора;
	КонецЕсли;
	
	Если Представление <> Неопределено Тогда
		Элемент.Представление = Представление;
	КонецЕсли;
	
	Если Использование <> Неопределено Тогда
		Элемент.Использование = Использование;
	КонецЕсли;
	
	Если ИдентификаторПользовательскойНастройки <> Неопределено Тогда
		Элемент.ИдентификаторПользовательскойНастройки = ИдентификаторПользовательскойНастройки;
	ИначеЕсли Элемент.РежимОтображения <> РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный Тогда
		Элемент.ИдентификаторПользовательскойНастройки = ИмяПоля;
	КонецЕсли;
	
	Возврат Элемент;
	
КонецФункции

&НаСервере   
Процедура НайтиРекурсивно(КоллекцияЭлементов, МассивЭлементов, СпособПоиска, ЗначениеПоиска)
	
	Для каждого ЭлементОтбора Из КоллекцияЭлементов Цикл
		
		Если ТипЗнч(ЭлементОтбора) = Тип("ЭлементОтбораКомпоновкиДанных") Тогда
			
			Если СпособПоиска = 1 Тогда
				Если ЭлементОтбора.ЛевоеЗначение = ЗначениеПоиска Тогда
					МассивЭлементов.Добавить(ЭлементОтбора);
				КонецЕсли;
			ИначеЕсли СпособПоиска = 2 Тогда
				Если ЭлементОтбора.Представление = ЗначениеПоиска Тогда
					МассивЭлементов.Добавить(ЭлементОтбора);
				КонецЕсли;
			КонецЕсли;
		Иначе
			
			НайтиРекурсивно(ЭлементОтбора.Элементы, МассивЭлементов, СпособПоиска, ЗначениеПоиска);
			
			Если СпособПоиска = 2 И ЭлементОтбора.Представление = ЗначениеПоиска Тогда
				МассивЭлементов.Добавить(ЭлементОтбора);
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьОтборПоКлиентуВОбращении(КлиентОтбора)

	СписокОбращений.Параметры.УстановитьЗначениеПараметра("Клиент",			 КлиентОтбора);
	СписокОбращений.Параметры.УстановитьЗначениеПараметра("УстановитьОтбор", ЗначениеЗаполнено(КлиентОтбора));

КонецПроцедуры // УстановитьОтборПоКлиентуВОбращении()

&НаСервере
Процедура УстановитьОтборПоКлиентуВАвтомобилях(КлиентОтбора)

	СписокАвтомобилей.Параметры.УстановитьЗначениеПараметра("Клиент", КлиентОтбора);

КонецПроцедуры // УстановитьОтборПоКлиентуВОбращении()

&НаКлиенте
Процедура Привилегии(Команда)
	
	ТекущаяСтрока = Элементы.Список.ТекущиеДанные;
	
	Если ТекущаяСтрока = Неопределено Тогда
		Возврат;
	КонецЕсли; 
	
	мТабличныйДокумент = Renault_АвтосервисСкидки.ПечатьПривилегийКартыКлиента(ТекущаяСтрока.Ссылка);
	
	мТабличныйДокумент.Показать("Привилегии клиента");
	
КонецПроцедуры

&НаКлиенте
Процедура ПроверитьПодобныхКонтрагентов(ФИО)
	
	МассивПодобных = ПолучитьМассивПодобныхКонтрагентов(ФИО);
	
	Если МассивПодобных.Количество() <> 0 Тогда
		
		ПараметрыФормы = Новый Структура("Контрагенты",МассивПодобных);
						
		ЗначениеВыбора = ОткрытьФормуМодально("ОбщаяФорма.DMS_ФормаПодобныхКонтрагентов",ПараметрыФормы);
		
		Если ЗначениеЗаполнено(ЗначениеВыбора) Тогда
		
			мФИООтбор = ЗначениеВыбора.НаименованиеПолное;	
			
			Если Элементы.ФИООтбор.СписокВыбора.НайтиПоЗначению(мФИООтбор) = Неопределено Тогда
				Элементы.ФИООтбор.СписокВыбора.Добавить(мФИООтбор);
			КонецЕсли; 
			
			ФИООтбор = мФИООтбор;
			
			УстановитьОтборСписка();
			
		КонецЕсли; 
		
	КонецЕсли; 
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьМассивПодобныхКонтрагентов(ФИО)
	
	МассивПодобныхКонтрагентов = Новый Массив;
	
	Запрос = Новый Запрос;
	
	СтруктураФИО = DMS_ФизическиеЛицаСервер.ФамилияИмяОтчество(ФИО);
	
	Для каждого ТекущийПараметр Из СтруктураФИО Цикл
		Запрос.УстановитьПараметр(ТекущийПараметр.Ключ,ТекущийПараметр.Значение);
	КонецЦикла; 
	
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	ДанныеФизическихЛиц.Фамилия,
		|	ДанныеФизическихЛиц.Имя,
		|	ДанныеФизическихЛиц.Отчество
		|ПОМЕСТИТЬ ПредпологаемыеФИО
		|ИЗ
		|	РегистрСведений.DMS_ДанныеФизическихЛиц КАК ДанныеФизическихЛиц
		|ГДЕ
		|	ДанныеФизическихЛиц.Фамилия = &Фамилия
		|	И ДанныеФизическихЛиц.Имя = &Имя
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ДанныеФизическихЛиц.Фамилия,
		|	ДанныеФизическихЛиц.Имя,
		|	ДанныеФизическихЛиц.Отчество
		|ИЗ
		|	РегистрСведений.DMS_ДанныеФизическихЛиц КАК ДанныеФизическихЛиц
		|ГДЕ
		|	ДанныеФизическихЛиц.Фамилия = &Фамилия
		|	И ДанныеФизическихЛиц.Отчество = &Отчество
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ДанныеФизическихЛиц.Фамилия,
		|	ДанныеФизическихЛиц.Имя,
		|	ДанныеФизическихЛиц.Отчество
		|ИЗ
		|	РегистрСведений.DMS_ДанныеФизическихЛиц КАК ДанныеФизическихЛиц
		|ГДЕ
		|	ДанныеФизическихЛиц.Имя = &Имя
		|	И ДанныеФизическихЛиц.Отчество = &Отчество
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ДанныеФизическихЛиц.Фамилия,
		|	ДанныеФизическихЛиц.Имя,
		|	ДанныеФизическихЛиц.Отчество
		|ИЗ
		|	РегистрСведений.DMS_ДанныеФизическихЛиц КАК ДанныеФизическихЛиц
		|ГДЕ
		|	ДанныеФизическихЛиц.Имя = &Имя
		|	И ДанныеФизическихЛиц.Отчество = &Отчество
		|	И ДанныеФизическихЛиц.Фамилия = &Фамилия
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	МАКСИМУМ(ВЫРАЗИТЬ(ВЫБОР
		|				КОГДА ПредпологаемыеФИО.Фамилия = &Фамилия
		|						И ПредпологаемыеФИО.Имя = &Имя
		|						И ПредпологаемыеФИО.Отчество = &Отчество
		|					ТОГДА 4
		|				КОГДА ПредпологаемыеФИО.Фамилия = &Фамилия
		|						И ПредпологаемыеФИО.Имя = &Имя
		|					ТОГДА 1
		|				КОГДА ПредпологаемыеФИО.Фамилия = &Фамилия
		|						И ПредпологаемыеФИО.Отчество = &Отчество
		|					ТОГДА 2
		|				КОГДА ПредпологаемыеФИО.Имя = &Имя
		|						И ПредпологаемыеФИО.Отчество = &Отчество
		|					ТОГДА 3
		|				ИНАЧЕ 0
		|			КОНЕЦ КАК ЧИСЛО(1, 0))) КАК ВариантСовпадения
		|ПОМЕСТИТЬ ВариантыСовпадения
		|ИЗ
		|	ПредпологаемыеФИО КАК ПредпологаемыеФИО
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	ПредпологаемыеФИО.Отчество КАК СтрокиПоиска,
		|	&Отчество КАК ОбъектПоиска,
		|	ВариантыСовпадения.ВариантСовпадения КАК ВариантСовпадения
		|ПОМЕСТИТЬ ДанныеАнализа
		|ИЗ
		|	ВариантыСовпадения КАК ВариантыСовпадения
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ПредпологаемыеФИО КАК ПредпологаемыеФИО
		|		ПО (ВариантыСовпадения.ВариантСовпадения = 1)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ПредпологаемыеФИО.Имя,
		|	&Имя,
		|	ВариантыСовпадения.ВариантСовпадения
		|ИЗ
		|	ВариантыСовпадения КАК ВариантыСовпадения
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ПредпологаемыеФИО КАК ПредпологаемыеФИО
		|		ПО (ВариантыСовпадения.ВариантСовпадения = 2)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ПредпологаемыеФИО.Фамилия,
		|	&Фамилия,
		|	ВариантыСовпадения.ВариантСовпадения
		|ИЗ
		|	ВариантыСовпадения КАК ВариантыСовпадения
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ПредпологаемыеФИО КАК ПредпологаемыеФИО
		|		ПО (ВариантыСовпадения.ВариантСовпадения = 3)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	ДанныеАнализа.ОбъектПоиска КАК ОбъектПоиска,
		|	ДанныеАнализа.ВариантСовпадения
		|ИЗ
		|	ДанныеАнализа КАК ДанныеАнализа
		|
		|УПОРЯДОЧИТЬ ПО
		|	ОбъектПоиска
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	ДанныеАнализа.СтрокиПоиска КАК СтрокиПоиска
		|ИЗ
		|	ДанныеАнализа КАК ДанныеАнализа
		|
		|УПОРЯДОЧИТЬ ПО
		|	СтрокиПоиска";
		
	РезультатЗапроса = Запрос.ВыполнитьПакет();
	
	ВыборкаОбъектПоиска = РезультатЗапроса[3].Выбрать();
	
	Если ВыборкаОбъектПоиска.Следующий() Тогда

		ВариантПоиска = ВыборкаОбъектПоиска.ВариантСовпадения;
		
		Запрос = Новый Запрос;
		
		ОбъектПоиска = НРег(СокрЛП(ВыборкаОбъектПоиска.ОбъектПоиска));	
		
		ПараметрПоиска = "ПараметрПоиска";
		
		ТекстРезультат 		= "";
		ТекстКоличествоБукв = "";
		
		МассивБукв = Новый Массив;
		
		Для А = 1 По СтрДлина(ОбъектПоиска) Цикл
			                                                   
			Символ = Сред(ОбъектПоиска, А, 1);
			
			ИмяПараметра 	  = "ПараметрПоиска"+Формат(А,"ЧЦ=3; ЧН=0; ЧГ=");
			ЗначениеПараметра = """%"+Символ+"%""";
			
			Запрос.УстановитьПараметр(ИмяПараметра,ЗначениеПараметра);     
			
			ТекстРезультат 		= ТекстРезультат + Символы.ПС +"Выбор когда ДанныеАнализа.СтрокиПоиска Подобно "+ЗначениеПараметра+" Тогда "+А+" Иначе 0 Конец + ";
			
			Если МассивБукв.Найти(Символ) <> Неопределено Тогда
				ТекстКоличествоБукв = ТекстКоличествоБукв + Символы.ПС +"Выбор когда ДанныеАнализа.СтрокиПоиска Подобно "+ЗначениеПараметра+" Тогда 0 Иначе 0 Конец + ";
			Иначе 	
				МассивБукв.Добавить(Символ);                    
				ТекстКоличествоБукв = ТекстКоличествоБукв + Символы.ПС +"Выбор когда ДанныеАнализа.СтрокиПоиска Подобно "+ЗначениеПараметра+" Тогда 1 Иначе 0 Конец + ";
			КонецЕсли; 
			
		КонецЦикла;
		
		МассивБукв = Неопределено;
		
		ТекстРезультат		= Лев(СокрЛП(ТекстРезультат),СтрДлина(СокрЛП(ТекстРезультат))-1);
		ТекстКоличествоБукв = Лев(СокрЛП(ТекстКоличествоБукв),СтрДлина(СокрЛП(ТекстКоличествоБукв))-1);
		
		Запрос.УстановитьПараметр("мДанныеАнализа",РезультатЗапроса[4].Выгрузить());
		Запрос.Текст = 
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	мДанныеАнализа.СтрокиПоиска
			|ПОМЕСТИТЬ ДанныеАнализа
			|ИЗ
			|	&мДанныеАнализа КАК мДанныеАнализа
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////   
			|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
			|	ДанныеАнализа.СтрокиПоиска КАК СтрокиПоиска,
			|	СУММА("+ТекстРезультат+") КАК РезультатПоиска,
			|	СУММА("+ТекстКоличествоБукв+") КАК КоличествоБукв
			|ПОМЕСТИТЬ РезультатАнализа
			|ИЗ
			|	ДанныеАнализа КАК ДанныеАнализа
			|
			|СГРУППИРОВАТЬ ПО
			|	ДанныеАнализа.СтрокиПоиска
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ ПЕРВЫЕ 3
			|	РезультатАнализа.СтрокиПоиска КАК СтрокиПоиска,
			|	РезультатАнализа.РезультатПоиска,
			|	РезультатАнализа.КоличествоБукв
			|ИЗ
			|	РезультатАнализа КАК РезультатАнализа
			|ГДЕ
			|	РезультатАнализа.КоличествоБукв > 2
			|
			|УПОРЯДОЧИТЬ ПО
			|	РезультатПоиска УБЫВ";
		
		РезультатЗапроса = Запрос.Выполнить();
		
		ВыборкаПоиска = РезультатЗапроса.Выбрать();
		
		Пока ВыборкаПоиска.Следующий() Цикл 
			
			мФИО = "";
			
			Если ВариантПоиска = 1 Тогда
				мФИО = СтруктураФИО.Фамилия +" "+СтруктураФИО.Имя+" "+ВыборкаПоиска.СтрокиПоиска;
			ИначеЕсли ВариантПоиска = 2 Тогда
				мФИО = СтруктураФИО.Фамилия +" "+ВыборкаПоиска.СтрокиПоиска+" "+СтруктураФИО.Отчество;
			ИначеЕсли ВариантПоиска = 3 Тогда
				мФИО = ВыборкаПоиска.СтрокиПоиска +" "+СтруктураФИО.Имя+" "+СтруктураФИО.Отчество;
			КонецЕсли; 		
						
			Если Не ПустаяСтрока(мФИО) Тогда
				
				ФизическоеЛицо = DMS_ФизическиеЛицаСервер.ПолучитьКонтрагентаПоФИО(мФИО);
				
				Если ЗначениеЗаполнено(ФизическоеЛицо) Тогда
					МассивПодобныхКонтрагентов.Добавить(ФизическоеЛицо);
				КонецЕсли; 
				
			КонецЕсли; 
			
		КонецЦикла;
		
	КонецЕсли;       
	
	Возврат МассивПодобныхКонтрагентов;
	
КонецФункции // ПолучитьМассивПодобныхКонтрагентов()

&НаСервереБезКонтекста
Функция ПолучитьПрофильКлиента(Контрагент)

	Возврат Справочники.Renault_ПрофилиКлиентов.НайтиПрофильКлиента(Контрагент);	

КонецФункции // ПолучитьПрофильКлиента()

&НаСервере
Функция ПроверитьБлокировкуДокументов()
	
	Если ЗначениеЗаполнено(ДокументОснование) Тогда
		
		Если ТипЗнч(ДокументОснование) = Тип("ДокументСсылка.Renault_CRM_ОбращениеВАвтоСервис") Тогда
			
		Обращение = ДокументОснование;	
			
		УдалосьЗаблокироватьВСе = ИСТИНА;	
			
		Обр = Обращение.Ссылка.ПолучитьОбъект();
		
		Попытка 
			
			Обр.Заблокировать();
			
		Исключение
			
			УдалосьЗаблокироватьВСе = ЛОЖЬ;			
			
		КонецПопытки;
						
		Выдача = Документы.Renault_CRM_ВыдачаАвтомобиля.НайтиПоРеквизиту("Обращение", Обр.Ссылка).Ссылка.ПолучитьОбъект();
		
		Попытка 
			
			Выдача.Заблокировать();
			
		Исключение
			
			УдалосьЗаблокироватьВСе = ЛОЖЬ;			
			
		КонецПопытки;

		ЗапросМойки = Новый Запрос();
		ЗапросМойки.Текст = "ВЫБРАТЬ
			|	ЗаявкаНаМойку.Ссылка
			|ИЗ
			|	Документ.Renault_CRM_ЗаявкаНаМойку КАК ЗаявкаНаМойку
			|ГДЕ
			|	ЗаявкаНаМойку.Обращение = &Обращение";
		ЗапросМойки.УстановитьПараметр("Обращение", Обр.Ссылка);
		Мойки = ЗапросМойки.Выполнить().Выбрать();	
			
			Пока Мойки.Следующий() Цикл
				
				Мойка = Мойки.Ссылка.ПолучитьОбъект();
				
				
				Попытка
					
					Мойка.Заблокировать();
								
				Исключение
					
					УдалосьЗаблокироватьВСе = ЛОЖЬ;					
					
				КонецПопытки;;
				
			КонецЦикла;
			
			ЗапросЗаявки = Новый Запрос();
			ЗапросМойки.Текст = "ВЫБРАТЬ
			                    |	ЗаявкаНаСервис.Ссылка
			                    |ИЗ
			                    |	Документ.Renault_CRM_ЗаявкаНаСервис КАК ЗаявкаНаСервис
			                    |ГДЕ
			                    |	ЗаявкаНаСервис.Обращение = &Обращение";
			ЗапросЗаявки.УстановитьПараметр("Обращение", Обр.Ссылка);
			Заявки = ЗапросМойки.Выполнить().Выбрать();	
			
			Пока Заявки.Следующий() Цикл
				
				Заявка = Заявки.Ссылка.ПолучитьОбъект();
				
				Попытка
				
					Заявка.Заблокировать();
				
				Исключение
					
					УдалосьЗаблокироватьВСе = ЛОЖЬ;					
									
				КонецПопытки;
				
			КонецЦикла;
			
			Подменка = Документы.Renault_CRM_ЗаявкаНаПодменныйАвто.НайтиПоРеквизиту("Обращение", Обр.Ссылка);
			
			Если ЗначениеЗаполнено(Подменка) Тогда
				
				Подменка = Подменка.Ссылка.ПолучитьОбъект();
			
				Попытка
				
					Подменка.Заблокировать();
				
				Исключение
					
					УдалосьЗаблокироватьВСе = Ложь;
					
				КонецПопытки;
				
			КонецЕсли;
			
		Возврат УдалосьЗаблокироватьВСе;	
					
		КонецЕсли;
		
		
	КонецЕсли;
	
КонецФункции

&НаСервере
Процедура УстановитьУсловноеОформление()

	УсловноеОформление.Элементы.Очистить();
	
	ШрифтУдаления = Новый Шрифт(ШрифтыСтиля.ШрифтТекста,"ШрифтУдаления",,,,,Истина);
	
	//
	
	Элемент = УсловноеОформление.Элементы.Добавить();
	
	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.Ссылка.Имя);
	
	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.СписокОсновнойТелефон.Имя);
	
	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ИНН.Имя);   
	
	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.КПП.Имя);
	
	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.СписокДатаРождения.Имя);
		
	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ЕстьПривилегии.Имя);
	
	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("Список.ЕстьПривилегии");
	ОтборЭлемента.ВидСравнения   = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = Истина;
	
	Элемент.Оформление.УстановитьЗначениеПараметра("ЦветФона", Новый Цвет(255,182,0));
	
	//
	
	Элемент = УсловноеОформление.Элементы.Добавить();
	
	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ЕстьПривилегии.Имя);
	
	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("Список.ЕстьПривилегии");
	ОтборЭлемента.ВидСравнения   = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = Истина;
	
	Элемент.Оформление.УстановитьЗначениеПараметра("Текст", "Есть");
	
	//
	
	Элемент = УсловноеОформление.Элементы.Добавить();
		
	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ЕстьПривилегии.Имя);
	
	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("Список.ЕстьПривилегии");
	ОтборЭлемента.ВидСравнения   = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = Ложь;
	
	Элемент.Оформление.УстановитьЗначениеПараметра("Текст", "Нет");
		
	//
	
	Элемент = УсловноеОформление.Элементы.Добавить();
		
	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ИНН.Имя);   
	
	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.КПП.Имя);
	
	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("Список.ИНН");
	ОтборЭлемента.ВидСравнения   = ВидСравненияКомпоновкиДанных.НеЗаполнено;
	
	Элемент.Оформление.УстановитьЗначениеПараметра("Текст", "-");
		
	//
	
	Элемент = УсловноеОформление.Элементы.Добавить();
		
	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ИНН.Имя);   
	
	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("Список.ИНН");
	ОтборЭлемента.ВидСравнения   = ВидСравненияКомпоновкиДанных.НеЗаполнено;
	
	Элемент.Оформление.УстановитьЗначениеПараметра("Текст", "-");
		
	//
	
	Элемент = УсловноеОформление.Элементы.Добавить();
		
	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.СписокОсновнойТелефон.Имя);   
	
	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("Список.СписокОсновнойТелефон");
	ОтборЭлемента.ВидСравнения   = ВидСравненияКомпоновкиДанных.НеЗаполнено;
	
	Элемент.Оформление.УстановитьЗначениеПараметра("Текст", "<Не указан>");
	
	//
	
	Элемент = УсловноеОформление.Элементы.Добавить();
			
	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.КПП.Имя);
	
	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("Список.КПП");
	ОтборЭлемента.ВидСравнения   = ВидСравненияКомпоновкиДанных.НеЗаполнено;
	
	Элемент.Оформление.УстановитьЗначениеПараметра("Текст", "-");
	
	//
	
	Элемент = УсловноеОформление.Элементы.Добавить();
		
	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.Ссылка.Имя);
		
	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ИНН.Имя);
		
	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.КПП.Имя);
		
	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.СписокДатаРождения.Имя);
		
	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.Привилегии.Имя);
		
	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.СписокОсновнойТелефон.Имя);
	
	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("Список.ПометкаУдаления");
	ОтборЭлемента.ВидСравнения   = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = Истина;
	
	Элемент.Оформление.УстановитьЗначениеПараметра("ЦветТекста", ЦветаСтиля.ЦветОтрицательногоЧисла);
	Элемент.Оформление.УстановитьЗначениеПараметра("Шрифт", ШрифтУдаления);
		
КонецПроцедуры // УстановитьУсловноеОформление()

&НаСервере
Функция ПолнотекстовыйПоискКонтрагентов(ТекстПоиска,СписокВыбораФИО)
			
	ГдеИщем = Новый Массив;
	ГдеИщем.Добавить(Метаданные.Справочники.Контрагенты.ПолноеИмя());
	ГдеИщем.Добавить(Метаданные.Справочники.CRM_ПотенциальныеКонтрагенты.ПолноеИмя());
	ГдеИщем.Добавить(Метаданные.РегистрыСведений.DMS_ДанныеФизическихЛиц.ПолноеИмя());
	
	мТекстПоиска = СокрЛП(ТекстПоиска);
	
	Попытка
		Результат = Renаult_ПолнотекстовыйПоиск.ВыполнитьПоиск(мТекстПоиска,ГдеИщем,Истина,25,10,Истина);
	Исключение
		Возврат Ложь;
	КонецПопытки;
		Результат.Сортировать("Представление Возр");
	
	Если ЗначениеЗаполнено(Результат) Тогда
				
		ИассивРезультат = Результат.ВыгрузитьКолонку("Представление");
		
		Для каждого ТекущаяСтрока Из ИассивРезультат Цикл
			
			Если СписокВыбораФИО.НайтиПоЗначению(ТекущаяСтрока) = Неопределено Тогда
				СписокВыбораФИО.Добавить(ТекущаяСтрока,ТекущаяСтрока);
			КонецЕсли; 
			             
		КонецЦикла; 
		
		Если СписокВыбораФИО.НайтиПоЗначению(ТекстПоиска) = Неопределено Тогда
			СписокВыбораФИО.Добавить(ТекстПоиска);
		КонецЕсли; 
		
		ФИООтбор = ТекстПоиска;		
				
		Возврат Истина;
		
	КонецЕсли;
	
	Возврат Ложь;
	
КонецФункции // ПолнотекстовыйПоискКонтрагентов()
 
&НаСервереБезКонтекста
Функция НайтиДублиНаСервере(НаименованиеКонтрагента)
	
	КонтрагентОбъект = Справочники.Контрагенты.СоздатьЭлемент();
	КонтрагентОбъект.Наименование 		= НаименованиеКонтрагента;
	КонтрагентОбъект.НаименованиеПолное = НаименованиеКонтрагента;
	
	ПоискДублей = Обработки.ПоискИЗаменаДублирующихсяЭлементов.Создать();
	
	СтруктураПоиска = Новый Структура("Код,Наименование,НаименованиеПолное, ИНН,ОсновнойТелефон",Неопределено,"=",Неопределено,Неопределено,Неопределено);
	НайденныеОбъекты  = ПоискДублей.НайтиДубли(КонтрагентОбъект,СтруктураПоиска);
	
	СтруктураПоиска = Новый Структура("Код,Наименование,НаименованиеПолное, ИНН,ОсновнойТелефон",Неопределено,Неопределено,"=",Неопределено,Неопределено);
	
	Для Каждого Объект из ПоискДублей.НайтиДубли(КонтрагентОбъект,СтруктураПоиска) цикл
		
		НайденныйОбъект = НайденныеОбъекты.Найти(Объект.Ссылка, "Ссылка");
		
		Если (НайденныйОбъект <> Неопределено) тогда
			
			Для Каждого Колонка Из НайденныеОбъекты.Колонки Цикл
				
				Если ТипЗнч(НайденныйОбъект[Колонка.Имя]) = Тип("Булево") И НЕ НайденныйОбъект[Колонка.Имя] И Объект[Колонка.Имя] Тогда	
					НайденныйОбъект[Колонка.Имя] = Истина;
				КонецЕсли;
				
			КонецЦикла; 
			
			Продолжить;
			
		КонецЕсли;
		
		НоваяСтрока = НайденныеОбъекты.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока,Объект);
		
	КонецЦикла;
	
	Возврат НайденныеОбъекты.ВыгрузитьКолонку("Ссылка");
	
КонецФункции // НайтиДубли()


&НаКлиенте
Процедура ФИООтборНачалоВыбораИзСписка(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
КонецПроцедуры


&НаКлиенте
Процедура тВзаиморасчеты(Команда)
	
	ТекущаяСтрока = Элементы.Список.ТекущиеДанные;
	
	Если ТекущаяСтрока = Неопределено Тогда
		Возврат;
	КонецЕсли; 
	
	ТекущийКонтрагент = ТекущаяСтрока.Ссылка; 
	
	Если Не ЗначениеЗаполнено(ТекущийКонтрагент) Тогда
		
		Возврат;
		
	КонецЕсли;
	
		// проверки
	//Если ЭтотОбъект.Модифицированность() Тогда
	//	Предупреждение("Договор должен быть записан",10);
	//	Возврат;
	//Иначе
	//	ДоговорВзаиморасчетов=ЭтотОбъект.Ссылка;
	//КонецЕсли;
	//Контрагент=Неопределено;
	//Попытка
	//	Если НЕ обЗначениеНеЗаполнено(Владелец) Тогда Контрагент=Владелец; Иначе Возврат; КонецЕсли;
	//Исключение
	//	Возврат; // раз нет контрагента, то дальше и делить нечего
	//КонецПопытки;
	//// заполним параметры отчета
	Отчет=Отчеты.Взаиморасчеты.Создать();
	Отчет.ВидОтчета=Перечисления.ВидыОтчетов.Остатки;
	Отчет.ДатаКонца=РабочаяДата;
	Отчет.РежимВыводаОтчета=Перечисления.РежимыВыводаОтчета.ТабличныйДокумент;
	Отчет.РежимНастройки=Перечисления.РежимыНастройкиОтчетов.Эксперт;
	Отчет.ИмяФормыНастроек="НастройкиОстатки";
	//Отчет.ЗаполнитьНачальныеНастройки("ПараметрыОтчетовВзаиморасчетыКомпанииОстатки");
	Отчет.ЗаполнитьНачальныеНастройки("ТекстЗапросаОстатки");
	// уберем измерения "Организация", "ПодразделениеКомпании".
	//Отчет.ПостроительОтчета.ИзмеренияСтроки.Удалить(Отчет.ПостроительОтчета.ИзмеренияСтроки[0]);
	//Отчет.ПостроительОтчета.ИзмеренияСтроки.Удалить(Отчет.ПостроительОтчета.ИзмеренияСтроки[0]);
	ТекОрганизация = Отчет.ИзмеренияСтроки.Найти("Организации", "ПутьКДанным");
	Если ТекОрганизация<>Неопределено Тогда ТекОрганизация.Использование = Ложь; КонецЕсли;
	ТекПодразделениеКомпании = Отчет.ИзмеренияСтроки.Найти("Подразделение", "ПутьКДанным");
	Если ТекПодразделениеКомпании<>Неопределено Тогда ТекПодразделениеКомпании.Использование = Ложь; КонецЕсли;
	
	// показатели все
	Для Каждого СтрокаПоказателей Из Отчет.Показатели Цикл
		СтрокаПоказателей.Использование=Истина;
	КонецЦикла;
	// фильтры
	Отчет.ПостроительОтчета.Отбор.Контрагент.Значение=ТекущийКонтрагент;
	Отчет.ПостроительОтчета.Отбор.Контрагент.Использование=Истина;
	//Отчет.ПостроительОтчета.Отбор.ДоговорВзаиморасчетов.Значение=ДоговорВзаиморасчетов;
	//Отчет.ПостроительОтчета.Отбор.ДоговорВзаиморасчетов.Использование=Истина;
	
	ФормаОтчета=ПолучитьОбщуюФорму("Отчет",,ЭтаФорма);
	ФормаОтчета.ОтчетОбъект=Отчет;
	ФормаОтчета.Заголовок="Взаиморасчеты компании";
	ФормаОтчета.Открыть();

	
КонецПроцедуры


&НаКлиенте
Процедура Хобби(Команда)
	
	
	ТекущаяСтрока = Элементы.Список.ТекущиеДанные;
	
	Если ТекущаяСтрока = Неопределено Тогда
		Возврат;
	КонецЕсли; 
	
	Набор = РегистрыСведений.Renault_ХоббиКлиентов.СоздатьНаборЗаписей();
	
	Набор.Отбор.Клиент.Значение = ТекущаяСтрока.Ссылка;
	Набор.Отбор.Клиент.ВидСравнения = ВидСравнения.Равно;
	Набор.Отбор.Клиент.Использование = Истина;
	
	Набор.Прочитать();
	
	Набор.ПолучитьФорму("ФормаРедактированияХобби").Открыть();

	
КонецПроцедуры
	