////////////////////////////////////////////////////////////////////////////////
// Подсистема "Печать".
//
////////////////////////////////////////////////////////////////////////////////

////////////////////////////////////////////////////////////////////////////////
// ПРОГРАММНЫЙ ИНТЕРФЕЙС

////////////////////////////////////////////////////////////////////////////////
// Работа с шаблонами офисных документов

// Интерфейс для вызова из клиентских модулей печати форм по макетам офисных документов.
//
// Подробнее - см. описание Renault_УправлениеПечатью.ПолучитьМакетыИДанныеОбъектов().
//
Функция ПолучитьМакетыИДанныеОбъектов(знач ИмяМенеджераПечати, знач ИменаМакетов, знач СоставДокументов) Экспорт
	
	Возврат Renault_УправлениеПечатью.ПолучитьМакетыИДанныеОбъектов(ИмяМенеджераПечати, ИменаМакетов, СоставДокументов);
	
КонецФункции

////////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

// Сформировать печатные формы для непосредственного вывода на принтер
//
// Подробнее - см. описание Renault_УправлениеПечатью.СформироватьПечатныеФормыДляБыстройПечати().
//
Процедура СформироватьПечатныеФормыДляБыстройПечати(ИмяМенеджераПечати, ИменаМакетов, МассивОбъектов,
	ПараметрыПечати, ТабличныеДокументы, ОбъектыПечати, ПараметрыВывода, Отказ) Экспорт
	
	Renault_УправлениеПечатью.СформироватьПечатныеФормыДляБыстройПечати(
		ИмяМенеджераПечати,
		ИменаМакетов,
		МассивОбъектов,
		ПараметрыПечати,
		ТабличныеДокументы,
		ОбъектыПечати,
		ПараметрыВывода,
		Отказ
	);
	
КонецПроцедуры

// Сформировать печатные формы для непосредственного вывода на принтер в обычном приложении
//
// Подробнее - см. описание Renault_УправлениеПечатью.СформироватьПечатныеФормыДляБыстройПечатиОбычноеПриложение().
//
Процедура СформироватьПечатныеФормыДляБыстройПечатиОбычноеПриложение(ИмяМенеджераПечати, ИменаМакетов, МассивОбъектов,
	ПараметрыПечати, Адрес, ОбъектыПечати, ПараметрыВывода, Отказ) Экспорт
	
	Renault_УправлениеПечатью.СформироватьПечатныеФормыДляБыстройПечатиОбычноеПриложение(
		ИмяМенеджераПечати,
		ИменаМакетов,
		МассивОбъектов,
		ПараметрыПечати,
		Адрес,
		ОбъектыПечати,
		ПараметрыВывода,
		Отказ
	);
	
КонецПроцедуры

// Сохраняет во временное хранилище путь к каталогу, который используется при печати.
//
// Подробнее - см. описание Renault_УправлениеПечатью.СохранитьЛокальныйКаталогФайловПечати().
//
Процедура СохранитьЛокальныйКаталогФайловПечати(Каталог) Экспорт
	
	Renault_УправлениеПечатью.СохранитьЛокальныйКаталогФайловПечати(Каталог);
	
КонецПроцедуры
