&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	//в случае если расчет был выполнен ранее - заполнение условий расчета по ранее посчитанным данным
	Если Параметры.Свойство("УсловияРасчета") И СтрДлина(Параметры.УсловияРасчета)>0 Тогда
		Для Каждого Эл Из ЗначениеИзСтрокиВнутр(Параметры.УсловияРасчета) Цикл 
			Если Эл.Ключ="Сервисы" Тогда
				Сервисы.Загрузить(ЗначениеИзСтрокиВнутр(Эл.Значение))
			Иначе
				ЭтаФорма[Эл.Ключ]=Эл.Значение 	
			КонецЕсли;	
		КонецЦикла;
	Иначе //инициализация и расчет
		
		//автозаполнение реквизитов
		Для Каждого Реквизит Из ПолучитьРеквизиты() Цикл
			Если Параметры.Свойство(Реквизит.Имя) Тогда ЭтаФорма[Реквизит.Имя]=Параметры[Реквизит.Имя] КонецЕсли
		КонецЦикла;
		
		//СтоимостьКАСКО=?(СтоимостьКАСКО=0,ПолучитьСтоимостьКАСКО(),СтоимостьКАСКО);
		Если КредитноеПредложение.Пустая() Тогда НайтиКредитноеПредложение() Иначе ЗаполнитьДанныеКредитногоПредложенияПоУмолчанию() КонецЕсли;
		
	КонецЕсли;	
	
	УправлениеЭлементами();
КонецПроцедуры

Процедура УправлениеЭлементами()
	Элементы.СтоимостьАвтомобиля.Доступность=СтоимостьАвтомобиля=0;
	Элементы.ЗаголовокФормы.Заголовок=""+ТипКП+": "+Автомобиль+" "+Версия+", Стоимость: "+СтоимостьАвтомобиля+" руб.";
	//данные сторонних банков
	Элементы.грДанныеСтороннихБанков.Видимость=КредитноеПредложение.Владелец<>Справочники.Renault_КредитныеПредложения.РНБанк();
КонецПроцедуры	

Процедура НайтиКредитноеПредложение()
	Банк=?(КредитноеПредложение.Пустая(),Справочники.Renault_КредитныеПредложения.РНБанк(),КредитноеПредложение.Владелец);
	КредитноеПредложение=Справочники.Renault_КредитныеПредложения.ОптимальноеКредитноеПредложение(Банк,Автомобиль,Версия,ПовторныйКлиентБанка,ПрограммаCRM);
	ЗаполнитьДанныеКредитногоПредложенияПоУмолчанию();
	ВыполнитьРасчет();
КонецПроцедуры	

Процедура ЗаполнитьДанныеКредитногоПредложенияПоУмолчанию()
	Если КредитноеПредложение.Пустая() Тогда 
		СрокКредита=0;
		СтавкаМаркетинговая=0;
		СтавкаБанка=0;
		СуммаКредита=0;
		ЕжемесячныйПлатеж=0;
		Возврат
	КонецЕсли;
	
	//сервисы и стоимость
	Запрос=Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка",КредитноеПредложение);
	Запрос.УстановитьПараметр("Модель",?(ТипЗнч(Автомобиль)=Тип("СправочникСсылка.Модели"),Автомобиль,Автомобиль.Модель));
	Запрос.Текст="
	|Выбрать
	|	ЗП.Сервис Сервис,
	|	ЗП.Сервис.ТипСервиса ТипСервиса,
	|	Обязательный,
	|	ВыбранПоУмолчанию,
	|	Стоимость.ФиксированнаяСтоимость,
	|	Стоимость.ПроцентОтСтоимостиАвтомобиля,
	|	Стоимость.ПроцентОтСтоимостиКредита
	|ИЗ(	
	|	Выбрать
	|		Сервисы.*,
	|		Выбор Когда Обязательные.ТипСервиса Есть NULL Тогда Ложь Иначе Истина Конец Обязательный,
	|		Выбор Когда ПоУмолчанию.ТипСервиса Есть NULL Тогда Ложь Иначе Истина Конец ВыбранПоУмолчанию
			
	|	Из Справочник.Renault_КредитныеПредложения.ДоступныеСервисы Сервисы

	|	Левое Соединение Справочник.Renault_КредитныеПредложения.ОбязательныеСервисы Обязательные
	|	По Обязательные.Ссылка=&Ссылка И Сервисы.Сервис.ТипСервиса=Обязательные.ТипСервиса    

	|	Левое Соединение Справочник.Renault_КредитныеПредложения.СервисыПоУмолчанию ПоУмолчанию
	|	По ПоУмолчанию.Ссылка=&Ссылка И Сервисы.Сервис.ТипСервиса=ПоУмолчанию.ТипСервиса

	|	ГДЕ Сервисы.Ссылка=&Ссылка
	|)ЗП

	|Левое Соединение Справочник.Renault_КредитныеСервисы.СтоимостьСервиса Стоимость
	|ПО ЗП.Сервис=Стоимость.Ссылка И Стоимость.Модель=&Модель
	|";
	Сервисы.Загрузить(Запрос.Выполнить().Выгрузить());
	
	//отметим обязательные сервисы по принципу самый дорогой
	Обязательные=КредитноеПредложение.ОбязательныеСервисы.Выгрузить().ВыгрузитьКолонку("ТипСервиса");
	Для Каждого ТипСервиса Из Обязательные Цикл
		МаксОбязательный=0; СервисОбязательный="";
		Для Каждого Стр Из Сервисы.НайтиСтроки(Новый Структура("ТипСервиса",ТипСервиса)) Цикл
			Если Обязательные.Найти(Стр.ТипСервиса)<>Неопределено Тогда
				Если (Стр.ФиксированнаяСтоимость+Стр.ПроцентОтСтоимостиАвтомобиля+Стр.ПроцентОтСтоимостиКредита)>МаксОбязательный Тогда
					МаксОбязательный=Стр.ФиксированнаяСтоимость+Стр.ПроцентОтСтоимостиАвтомобиля+Стр.ПроцентОтСтоимостиКредита;
					СервисОбязательный=Стр.Сервис;
				КонецЕсли;	
			КонецЕсли;
		КонецЦикла;
		Строки=Сервисы.НайтиСтроки(Новый Структура("Сервис",СервисОбязательный)); Если Строки.Количество()>0 Тогда Строки[0].Вкл=Истина КонецЕсли;
	КонецЦикла;
	
	//отметим сервисы по умолчанию по принципу самый дорогой
	ПоУмолчанию=КредитноеПредложение.СервисыПоУмолчанию.Выгрузить().ВыгрузитьКолонку("ТипСервиса");
	Для Каждого ТипСервиса Из ПоУмолчанию Цикл
		МаксПоУмолчанию=0; СервисПоУмолчанию="";
		Для Каждого Стр Из Сервисы.НайтиСтроки(Новый Структура("ТипСервиса",ТипСервиса)) Цикл
			Если ПоУмолчанию.Найти(Стр.ТипСервиса)<>Неопределено Тогда
				Если (Стр.ФиксированнаяСтоимость+Стр.ПроцентОтСтоимостиАвтомобиля+Стр.ПроцентОтСтоимостиКредита)>МаксПоУмолчанию Тогда
					МаксПоУмолчанию=Стр.ФиксированнаяСтоимость+Стр.ПроцентОтСтоимостиАвтомобиля+Стр.ПроцентОтСтоимостиКредита;
					СервисПоУмолчанию=Стр.Сервис;
				КонецЕсли;	
			КонецЕсли;	
		КонецЦикла;
		Строки=Сервисы.НайтиСтроки(Новый Структура("Сервис",СервисПоУмолчанию)); Если Строки.Количество()>0 Тогда Строки[0].Вкл=Истина КонецЕсли;
	КонецЦикла;
	
	//доступный выбор срока кредита
	МинимальныйСрок=КредитноеПредложение.ОграничениеСрокаОт;
	МаксимальныйСрок=КредитноеПредложение.ОграничениеСрокаДо;
	РазницаЛет=(МаксимальныйСрок-МинимальныйСрок)/12;
	Для Индекс=0 По РазницаЛет Цикл	Элементы.СрокКредита.СписокВыбора.Добавить((МинимальныйСрок+Индекс*12)) КонецЦикла;
	Элементы.СтрСрокКредита.Заголовок=""+МинимальныйСрок+" ... "+МаксимальныйСрок +" месяца";
	Элементы.СрокКредита.МинимальноеЗначение=МинимальныйСрок;
	Элементы.СрокКредита.МаксимальноеЗначение=МаксимальныйСрок;
	СрокКредита=?(СрокКредита>0,СрокКредита,КредитноеПредложение.СрокПоУмолчанию);
//	ИспользуетсяРазумноеКАСКО=КредитноеПредложение.ПоддерживаетРазумноеКАСКО;

	Элементы.ИспользоватьBaloon.Доступность=КредитноеПредложение.Baloon;
	Элементы.СтрОстаточныйПлатежПроцент.Заголовок=""+КредитноеПредложение.BaloonОт+" ... "+КредитноеПредложение.BaloonДо+" %";
	Элементы.ОстаточныйПлатежПроцент.МинимальноеЗначение=КредитноеПредложение.BaloonОт;
	Элементы.ОстаточныйПлатежПроцент.МаксимальноеЗначение=КредитноеПредложение.BaloonДо;
	ПроцентОстаточногоПлатежа=?(ПроцентОстаточногоПлатежа<=КредитноеПредложение.BaloonДо И ПроцентОстаточногоПлатежа>=КредитноеПредложение.BaloonОт,ПроцентОстаточногоПлатежа,КредитноеПредложение.BaloonОт);

	//Если КредитноеПредложение.ТребуетсяКАСКО Тогда КАСКОвКредит=Истина КонецЕсли;
	//Элементы.КАСКОвКредит.Доступность=НЕ КредитноеПредложение.ТребуетсяКАСКО;
	//Элементы.СтоимостьКАСКО.АвтоОтметкаНезаполненного=КредитноеПредложение.ТребуетсяКАСКО;
	
	//первоначальный взнос...
	ПервоначальныйВзносПроцент=КредитноеПредложение.ПервоначальныйВзносПоУмолчанию;
	ПервоначальныйВзнос=СтоимостьАвтомобиля*ПервоначальныйВзносПроцент/100;
	
	Запрос=Новый Запрос("Выбрать ЕстьNULL(Минимум(ПервоначальныйВзносОт),0) от, ЕстьNULL(Максимум(ПервоначальныйВзносДо),0) до Из Справочник.Renault_КредитныеПредложения.КредитныеСтавки ГДЕ Ссылка=&КП");
	Запрос.УстановитьПараметр("КП",КредитноеПредложение);
	Выборка=Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Элементы.СтрПервоначальныйВзносПроцент.Заголовок=""+Выборка.от+" ... "+Выборка.до+" %";
		Элементы.ПервоначальныйВзносПроцент.МинимальноеЗначение=Выборка.от;
		Элементы.ПервоначальныйВзносПроцент.МаксимальноеЗначение=Выборка.до;
		
		ВзносОт=Окр(СтоимостьАвтомобиля*Выборка.от/100);
		ВзносДо=Окр(СтоимостьАвтомобиля*Выборка.до/100);
		Элементы.СтрПервоначальныйВзнос.Заголовок=""+ВзносОт+" ... "+ВзносДо+" руб.";
		Элементы.ПервоначальныйВзнос.МинимальноеЗначение=ВзносОт;
		Элементы.ПервоначальныйВзнос.МаксимальноеЗначение=ВзносДо;
	КонецЕсли;
	
	//график обновим при открытии на клиенте
	
	//???????????????????????????????
	////продленная гарантия
	//Если КредитноеПредложение.БесплатнаяПГ И ЗначениеЗаполнено(КредитноеПредложение.ПродленнаяГарантия) Тогда
	//	Набор=РегистрыСведений.CRM_СтоимостьПродленнойГарантии.СоздатьНаборЗаписей();
	//	Набор.Отбор.Модель.Установить(Автомобиль);
	//	Набор.Отбор.ПредложениеПГ.Установить(КредитноеПредложение.ПродленнаяГарантия);
	//	Набор.Прочитать();
	//	ПродленнаяГарантия=КредитноеПредложение.ПродленнаяГарантия;
	//	Если Набор.Количество() Тогда
	//		СтоимостьПГ=Набор[0].Сумма;
	//		Элементы.ПГВКредит.Доступность=Ложь;
	//	КонецЕсли;
	//Иначе
	//	СтоимостьПГ=0;
	//	Элементы.ПГВКредит.Доступность=Истина;
	//КонецЕсли;
	
КонецПроцедуры	

Процедура ВыполнитьРасчет()
	СуммаКредита=0;
	ЕжемесячныйПлатеж=0;
	
	Если КредитноеПредложение.Пустая() Тогда Возврат КонецЕсли;
	
	//проверка отметки обязательных сервисов
	ЕстьОшибки=Ложь;
	Для Каждого Сервис Из КредитноеПредложение.ОбязательныеСервисы Цикл
		Если Сервисы.НайтиСтроки(Новый Структура("ТипСервиса,Вкл",Сервис.ТипСервиса,Истина)).Количество()=0 Тогда
			Сообщить("Не выбран обязательный сервис "+Сервис.ТипСервиса,СтатусСообщения.Внимание);
			ЕстьОшибки=Истина;
		КонецЕсли;	
	КонецЦикла;
	Если ЕстьОшибки Тогда
		Сообщить("Расчет не выполнен",СтатусСообщения.Внимание);
		Возврат
	КонецЕсли;	
	
	//Если КредитноеПредложение.ТребуетсяКАСКО Тогда
	//	//СтоимостьКАСКО=?(СтоимостьКАСКО=0,ПолучитьСтоимостьКАСКО(),СтоимостьКАСКО);
	//	Если СтоимостьКАСКО=0 Тогда
	//		Сообщить("Не заполнена стоимость КАСКО",СтатусСообщения.Внимание);
	//		Возврат
	//	КонецЕсли;	
	//КонецЕсли;
	
	//Если СтоимостьПГ<СубсидияПГ Тогда
	//	Сообщить("Стоимость выбранной в данный момент продленной гарантии меньше, чем у подарочной версии. 
	//	|Пожалуйста, выберите подарочную, или более дорогую версию гарантии на вкладке «Дополнительное Оборудование».",СтатусСообщения.Внимание);
	//	Возврат
	//КонецЕсли;
	
	//найти кредитную ставку по первоначальному взносу и сроку кредита
	Запрос=Новый Запрос;
	Запрос.Текст=" 
	|ВЫБРАТЬ
	|	МаркетинговаяСтавка,
	|	БанковскаяСтавка
	|ИЗ Справочник.Renault_КредитныеПредложения.КредитныеСтавки
	|ГДЕ Ссылка=&Ссылка
	|	И &ПервоначальныйВзносПроцент Между ПервоначальныйВзносОт И ПервоначальныйВзносДо
	|	И &СрокКредита Между СрокКредитаОт и СрокКредитаДо";
	Запрос.УстановитьПараметр("Ссылка", КредитноеПредложение);
	Запрос.УстановитьПараметр("ПервоначальныйВзносПроцент", ПервоначальныйВзносПроцент);
	Запрос.УстановитьПараметр("СрокКредита",СрокКредита);
	Выборка=Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		//СтавкаМаркетинговая=Выборка.МаркетинговаяСтавка-?(ИспользуетсяРазумноеКАСКО,КредитноеПредложение.СубсидияПоСтавке,0);
		СтавкаМаркетинговая=Выборка.МаркетинговаяСтавка;
		СтавкаБанка=Выборка.БанковскаяСтавка;
	Иначе Возврат	
	КонецЕсли;
	
//версия 1

	//рассчет
	//Pо=СтоимостьАвтомобиля+СтоимостьПГ; //цена автомобиля для расчета субсидии
	//Swe=СубсидияПГ; //субсидия по продленной гарантии
	//DP=ПервоначальныйВзнос/Pо; //первоначальный взнос, в %
	//Lо=Pо*(1-DP); //исходная сумма кредита
	//T=СрокКредита; //срок кредита, введенный пользователем
	//Rb=СтавкаБанка/12; //банковская ставка
	//Rm=СтавкаМаркетинговая/12; //маркетинговая ставка
	//Sc=Lо*(1-Rm/Rb*Pow( (1+Rm)/(1+Rb) ,T)* (Pow(1+Rb,T)-1)/(Pow(1+Rm,T)-1) ); //субсидия по кредитной ставке
	//Ps=Pо-Sc-Swe; //цена автомобиля после субсидирования
	//E=СтоимостьДопОборудования; //дополнительное оборудование
	//Ec=?(ДопОборудованиеВКредит,СтоимостьДопОборудования,0); //дополнительное оборудование в кредит
	//W=СтоимостьПГ; //стоимость продленной гарантии
	//Pf=Ps+E+W; //цена автомобиля итоговая
	//Ls=Lо-Sc-Swe+W; //сумма кредита после субсидирования
	//Ri=СтавкаЗащитыКредита; //ставка защиты кредита
	//Fi=ФиксированнаяЧастьЗащитыКредита; //фиксированная часть защиты кредита
	//I=?(ЗащитаКредита,Ls*Ri*T+Fi*(1+Ri*T),0); //сумма защиты кредита
	//
	//СуммаКредита=Ls+I; //сумма кредита итоговая
	//ЕжемесячныйПлатеж=(Rb*СуммаКредита*Pow(1+Rb,T))/(Pow(1+Rb,T)-1); //ежемесячный платеж
	
//версия 2

	//ЦенаАвтомобиляДляРасчетаСубсидии=СтоимостьАвтомобиля+СтоимостьПГ;
	//ИсходнаяСуммаКредита=ЦенаАвтомобиляДляРасчетаСубсидии-ПервоначальныйВзнос;
	//
	//Если СтавкаМаркетинговая=0 Тогда
	//	СубсидияПоКредитнойПрограмме = ИсходнаяСуммаКредита * (1-1/СрокКредита*(Pow((1+СтавкаБанка/1200), СрокКредита)-1)/((СтавкаБанка/1200)*Pow((1+СтавкаБанка/1200), СрокКредита)));
	//Иначе
	//	СубсидияПоКредитнойПрограмме = ИсходнаяСуммаКредита * (1-(СтавкаМаркетинговая/СтавкаБанка)*Pow(((1+СтавкаМаркетинговая/1200)/(1+СтавкаБанка/1200)),СрокКредита)*((Pow(1+СтавкаБанка/1200, СрокКредита)-1)/(Pow(1+СтавкаМаркетинговая/1200, СрокКредита)-1)));
	//КонецЕсли;
	//
	//ЦенаАвтомобиляПослеСубсидирования=ЦенаАвтомобиляДляРасчетаСубсидии-СубсидияПоКредитнойПрограмме-СубсидияПГ;
	//СтоимостьДопОборудованияВКредит=?(ДопОборудованиеВКредит,СтоимостьДопОборудования,0);
	//ЦенаАвтомобиляИтоговая=ЦенаАвтомобиляПослеСубсидирования+СтоимостьДопОборудованияВКредит+СтоимостьПГ;
	//СуммаКредитаПослеСубсидирования=ИсходнаяСуммаКредита-СубсидияПоКредитнойПрограмме-СубсидияПГ+СтоимостьПГ;
	//
	//Если ЗащитаКредита Тогда
	//	СуммаЗащитыКредита=СуммаКредитаПослеСубсидирования*СтавкаЗащитыКредита/100*СрокКредита+ФиксированнаяЧастьЗащитыКредита*(1+СтавкаЗащитыКредита/100*СрокКредита);
	//Иначе
	//	СуммаЗащитыКредита=0;
	//КонецЕсли;
	//
	//СуммаКредита=СтоимостьАвтомобиля+?(КАСКОвКредит,СтоимостьКАСКО,0)+?(ПГВКредит,СтоимостьПГ,0)+СуммаЗащитыКредита-ПервоначальныйВзнос;
	//
	//Если СрокКредита<>0 Тогда
	//	Если СтавкаБанка>0 Тогда
	//		ЕжемесячныйПлатеж=(СтавкаБанка/1200*СуммаКредита*Pow(1+СтавкаБанка/1200, СрокКредита))/(Pow(1+СтавкаБанка/1200, СрокКредита)-1)
	//	Иначе
	//		ЕжемесячныйПлатеж=СуммаКредита/СрокКредита
	//	КонецЕсли;
	//КонецЕсли;
	
//версия 3

	CpriceInput=СтоимостьАвтомобиля;
	cPriceDDisc=СтоимостьАвтомобиля; //стоимость авто со скидкой (в нашем случае она уже со скидкой)
	
	//ПервоначальныйВзнос=CpriceInput*ПервоначальныйВзносПроцент/100; //D37 Первоначальный взнос
	cCashInput=ПервоначальныйВзнос;
	
	cFPInput=CpriceInput*ПроцентОстаточногоПлатежа/100; //Остаточный платеж (baloon)
	cFPPerc=ПроцентОстаточногоПлатежа/100;
	cFP=?(cFPPerc>0,cPriceDDisc*cFPPerc,cFPInput);

	cBRateFIrst=СтавкаБанка/100;
	cTerm=СрокКредита;
	cMRateFirst=СтавкаМаркетинговая/100;
	
	cAccessLoan=0; //D92 ? допоборудование =0 т.к. включено в стоимость тачки
	cRefinLoan=0; //D30 ? скидка за трейдин
	cASSubsFixRate=0; //G127 ? субсидии за допсервисы, пока не используется
	cASSubsMarkRate=0; //I127 ? пока не используется
	
	cDealerSubsPercInput=0; //D82? ставка под которую хотят выдать кредит, пока не учитывать и выводить в интерфейс
	cDealerSubsInput=0; //D80? сумма скидки дилера, пока не учитывать и выводить в интерфейс
	
	F115=0; G115=0; H115=0;
	Для Каждого Стр Из Сервисы.НайтиСтроки(Новый Структура("Вкл",Истина)) Цикл
		F115=F115+Стр.ФиксированнаяСтоимость;
		G115=G115+Стр.ПроцентОтСтоимостиАвтомобиля;
		H115=H115+Стр.ПроцентОтСтоимостиКредита;
	КонецЦикла;	
	
	F114=0; //? не используется   
	cASLoanFix=F115-F114;
	
	cASSubsLoanRate=0; //H127 ? не учитываем, субсидия по доп сервисам
	F126=0; //?  не учитываем, субсидия по доп сервисам
	cASFixSubs=F126;
	cTradeIN=0; //D28 ? не учитываем
	cCashPercInput=ПервоначальныйВзносПроцент; //D39
	
	cCashDP=?(cCashPercInput>0,cPriceDDisc*cCashPercInput/100-cTradeIN,cCashInput);
	
	cDP=cTradeIN+cCashDP;
	cLoanAfterDP=cPriceDDisc-cDP;
	
	cSubsidyFirst=Окр(cLoanAfterDP-rciPV(cBRateFIrst/12,cTerm, rciPMT(cMRateFirst/12,cTerm,cLoanAfterDP,cFP) ,cFP),2);
	cPriceSFirst=cPriceDDisc-cSubsidyFirst;
	
	cLoanAfterSubsFirst=cPriceSFirst-cDP;
	cDealerSubsidy=?(cDealerSubsPercInput=0,cDealerSubsInput,cLoanAfterSubsFirst-rciPV(cMRateFirst/12,cTerm, rciPMT(cDealerSubsPercInput/12,cTerm,cLoanAfterSubsFirst,cFP) ,cFP));
	
	cLoanAfterDealerSubs=cLoanAfterSubsFirst-cDealerSubsidy;
	cLoanAfterAccess=cLoanAfterDealerSubs+cAccessLoan+cRefinLoan;
	cASFixSubs=СубсидииНаДопСервисы;
	cLoanAfterFixSubs=cLoanAfterAccess-cASFixSubs;
	
	cPriceSubsDealer=cPriceSFirst-cDealerSubsidy;
	D100=СубсидииНаДопОборудование;
	cPriceAfterAccess=cPriceSubsDealer-D100;
	cPriceAfterFixSubs=cPriceAfterAccess-cASFixSubs;
	
	cASSubs=((cLoanAfterFixSubs-cAccessLoan-cRefinLoan)*(cASSubsFixRate+cASSubsMarkRate+cASSubsLoanRate)+(cPriceAfterFixSubs-(cLoanAfterFixSubs-cAccessLoan-cRefinLoan))*(cASSubsFixRate))/(1+cASSubsFixRate+cASSubsLoanRate+cASSubsMarkRate);
	
	cPriceAfterASSubs=cPriceAfterFixSubs-cASSubs;
	
	cLoanAfterASSubs=cLoanAfterFixSubs-cASSubs;
	
	cASLoanDKP=G115*cPriceAfterASSubs;
	cASLoanLoan=(H115*(cLoanAfterASSubs+cASLoanFix+cASLoanDKP)+F114)/(1-H115);
	cLoanAS=cASLoanFix+cASLoanDKP+cASLoanLoan;
	
	cLoanAfterAS=cLoanAfterASSubs+cLoanAS; 
	
	cOtherKASKOLoan=КАСКО_СтороннихПоставщиковВКредит; //итого чужая КАСКО в кредит	
	
	cLoan=cLoanAfterAS+cOtherKASKOLoan;	//общая сумма кредита = стоимость авто - первоначальный взнос + стоимость дополнительных сервисов приобретаемых в кредит 
	
	СуммаКредита=cLoan;
	ЕжемесячныйПлатеж=rciPMT(cBRateFIrst/12,cTerm,cLoan,cFP);	
	
КонецПроцедуры
Function rciPMT(Rate,Знач Nper,PV,FV)
	If FV > 0 Then Nper = Nper - 1 EndIf;
	If Rate = 0 Then
	    Return (PV - FV) / Nper
	Else
	    Return (Rate * (PV * Pow(1 + Rate,Nper) - FV / (1 + Rate))) / (Pow(1 + Rate,Nper) - 1)
	EndIf
EndFunction
Function rciPV(Rate,Знач Nper,PMT,FV)
	If FV > 0 Then Nper = Nper - 1 EndIf;
	If Rate = 0 Then
	    Return PMT * Nper + FV
	Else
	    Return (PMT * ( Pow(1 + Rate,Nper) - 1) / Rate + FV / (1 + Rate)) / Pow(1 + Rate,Nper) 
	EndIf
EndFunction

//&НаКлиенте
//Процедура ПриОткрытии(Отказ) ОбновитьГрафик() КонецПроцедуры

//+интерактивный пересчет
&НаКлиенте
Процедура НайтиКП(Элемент) НайтиКредитноеПредложение() КонецПроцедуры
&НаКлиенте
Процедура КП_НачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка) //выбор кредитного предложения
	Если Renault_ОбщиеФункции.СтараяПлатформа() Тогда Возврат КонецЕсли; //откроется простая форма списка без подбора
	СтандартнаяОбработка=Ложь;
	Парам=Новый Структура;
	Парам.Вставить("РежимВыбора",Истина);
	Если Не КредитноеПредложение.Пустая() И КредитноеПредложение.Владелец<>Справочники.Renault_КредитныеПредложения.РНБанк() Тогда
		Парам.Вставить("Банк",КредитноеПредложение.Владелец);
	КонецЕсли;	
	Парам.Вставить("Модель",Автомобиль);
	Парам.Вставить("Комплектация",Версия);
	Если ПовторныйКлиентБанка Тогда Парам.Вставить("ПовторныйКлиентБанка",Истина) КонецЕсли;
	Если ПрограммаCRM Тогда Парам.Вставить("ПрограммаCRM",Истина) КонецЕсли;
	Если ТипКП=Перечисления.Renault_ТипКП.НовыйАвтомобиль Тогда Парам.Вставить("НовыйАвтомобиль",Истина) КонецЕсли;
	
	Ответ=ОткрытьФормуМодально("Справочник.Renault_КредитныеПредложения.ФормаВыбора",Парам,ЭтаФорма);
	Если Ответ=Неопределено Тогда Возврат КонецЕсли;
	КредитноеПредложение=Ответ;
	
	Попытка ВладелецФормы.Объект.КомментарийПричиныОтказаОтРНБанка=КомментарийПричиныОтказаОтРНБанка Исключение КонецПопытки;
	ЗаполнитьДанныеКредитногоПредложенияПоУмолчанию();
	ВыполнитьРасчет();
	//ОбновитьГрафик();
	УправлениеЭлементами();
КонецПроцедуры

&НаКлиенте
Процедура ПервоначальныйВзносПриИзменении(Элемент) 
	НовыйПервоначальныйВзносПроцент=ПервоначальныйВзнос*100/СтоимостьАвтомобиля;
	Если НовыйПервоначальныйВзносПроцент<Элементы.ПервоначальныйВзносПроцент.МинимальноеЗначение Тогда ПервоначальныйВзносПроцент=Элементы.ПервоначальныйВзносПроцент.МинимальноеЗначение
	ИначеЕсли НовыйПервоначальныйВзносПроцент>Элементы.ПервоначальныйВзносПроцент.МаксимальноеЗначение Тогда ПервоначальныйВзносПроцент=Элементы.ПервоначальныйВзносПроцент.МаксимальноеЗначение
	Иначе ПервоначальныйВзносПроцент=НовыйПервоначальныйВзносПроцент;
	КонецЕсли;	
	ВыполнитьРасчет();
	//ОбновитьГрафик();
КонецПроцедуры
&НаКлиенте
Процедура ПервоначальныйВзносПроцентПриИзменении(Элемент)
	НовыйПервоначальныйВзнос=СтоимостьАвтомобиля*ПервоначальныйВзносПроцент/100;
	Если НовыйПервоначальныйВзнос<Элементы.ПервоначальныйВзнос.МинимальноеЗначение Тогда ПервоначальныйВзнос=Элементы.ПервоначальныйВзнос.МинимальноеЗначение
	ИначеЕсли НовыйПервоначальныйВзнос>Элементы.ПервоначальныйВзнос.МаксимальноеЗначение Тогда ПервоначальныйВзнос=Элементы.ПервоначальныйВзнос.МаксимальноеЗначение
	Иначе ПервоначальныйВзнос=НовыйПервоначальныйВзнос	
	КонецЕсли;
	ВыполнитьРасчет();
	//ОбновитьГрафик();
КонецПроцедуры

&НаКлиенте
Процедура ОстаточныйПлатежПроцентПриИзменении(Элемент)
	Если ПроцентОстаточногоПлатежа<Элементы.ОстаточныйПлатежПроцент.МинимальноеЗначение Тогда ПроцентОстаточногоПлатежа=Элементы.ОстаточныйПлатежПроцент.МинимальноеЗначение
	ИначеЕсли ПроцентОстаточногоПлатежа>Элементы.ОстаточныйПлатежПроцент.МаксимальноеЗначение Тогда ПроцентОстаточногоПлатежа=Элементы.ОстаточныйПлатежПроцент.МаксимальноеЗначение
	КонецЕсли;
	ВыполнитьРасчет();
	//ОбновитьГрафик();
КонецПроцедуры

&НаКлиенте
Процедура Перерасчет(Элемент) ВыполнитьРасчет() КонецПроцедуры // ОбновитьГрафик(); КонецПроцедуры
//-интерактивный пересчет

//&НаКлиенте
//Процедура ОбновитьГрафик()
//	Диаграмма.Очистить();

//	т1=Диаграмма.Точки.Добавить("Т1");
//	с1=Диаграмма.Серии.Добавить("Сумма кредита");
//	с2=Диаграмма.Серии.Добавить("Первоначальный взнос");
//	с3=Диаграмма.Серии.Добавить("Ежемесячный платеж");
//	
//	с1.Цвет=Новый Цвет(255,207,0);
//	с2.Цвет=Новый Цвет(189,195,206);
//	с3.Цвет=Новый Цвет(231,231,231);
//	
//	Диаграмма.УстановитьЗначение(т1,с1,СуммаКредита);
//	Диаграмма.УстановитьЗначение(т1,с2,ПервоначальныйВзнос);
//	Диаграмма.УстановитьЗначение(т1,с3,ЕжемесячныйПлатеж);
//	Возврат
//	
//	//Элементы.ГрафикHTML.Видимость=НЕ(СуммаКредита=0 или ЕжемесячныйПлатеж=0);
//	//Если НЕ Элементы.ГрафикHTML.Видимость Тогда Возврат КонецЕсли;
//	//Фреймворк=Обработки[Renault_ОбщиеФункции.ПолучитьИмяФреймворкаОтчетов()].Создать();
//	//Фреймворк.Тип="pie";
//	//
//	//Менеджер=Обработки[Renault_ОбщиеФункции.ПолучитьИмяФреймворкаОтчетов()];
//	//ИмяСерии="Соотношение";
//	//
//	//Точки=Новый Массив;
//	//Точка=Менеджер.НоваяТочка(ИмяСерии,"Сумма кредита",Окр(СуммаКредита/СтоимостьАвтомобиля*100,2));
//	//Точки.Добавить(Точка);
//	//Менеджер.УстановитьАктивнуюТочку(Фреймворк,Точка);
//	//
//	//Точки.Добавить(Менеджер.НоваяТочка(ИмяСерии,"Первоначальный взнос",Окр(ПервоначальныйВзнос/СтоимостьАвтомобиля*100,2)));
//	//Точки.Добавить(Менеджер.НоваяТочка(ИмяСерии,"Ежемесячный платеж",Окр(ЕжемесячныйПлатеж/СтоимостьАвтомобиля*100,2)));

//	//Серия=Новый Структура("ИмяСерии,Точки",ИмяСерии,Точки);
//	//Серии=Новый Массив;
//	//Серии.Добавить(Серия);
//	//Фреймворк.Серии=ЗначениеВСтрокуВнутр(Серии);
//	//
//	//ГрафикHTML=Фреймворк.ПолучитьHTML();
//КонецПроцедуры	

//Функция ПолучитьСтоимостьКАСКО()
//	Запрос=Новый Запрос;
//	Запрос.УстановитьПараметр("Клиент",Клиент);
//	Запрос.УстановитьПараметр("Автомобиль",Автомобиль);
//	Запрос.УстановитьПараметр("Версия",Версия);
//	Запрос.Текст="
//	|Выбрать Первые 1 Стоимость Из Документ.Renault_РабочийЛистОФУ.ФинансовыеУслуги
//	|ГДЕ Ссылка.Проведен 
//	|	И Ссылка.Клиент=&Клиент
//	|	И Ссылка.Автомобиль=&Автомобиль И Ссылка.Версия=&Версия
//	|	И ФинансоваяУслуга.Вид=Значение(Перечисление.ВидыСтрахования.КАСКО)
//	|Упорядочить По Ссылка.Дата Убыв";
//	Возврат Запрос.Выполнить().Выгрузить().Итог("Стоимость")
//КонецФункции	

&НаКлиенте
Процедура кнОк(Команда) Закрыть(СтруктураФормы()) КонецПроцедуры //закрытие модального диалога и передача расчета
Функция СтруктураФормы()
	Структура=Новый Структура;
	//Структура.Вставить("Банк",КредитноеПредложение.Владелец);
	//Структура.Вставить("СтавкаБанка",СтавкаБанка);
	Для Каждого Эл Из ПолучитьРеквизиты() Цикл Структура.Вставить(Эл.Имя,ЭтаФорма[Эл.Имя]) КонецЦикла;
	
//	УсловияРасчета=Новый Структура;
//	УсловияРасчета.Вставить("ПовторныйКлиентБанка",ПовторныйКлиентБанка);
//	УсловияРасчета.Вставить("ПрограммаCRM",ПрограммаCRM);
////	УсловияРасчета.Вставить("КАСКОвКредит",КАСКОвКредит);
////	УсловияРасчета.Вставить("СтоимостьКАСКО",СтоимостьКАСКО);
////	УсловияРасчета.Вставить("ПГВКредит",ПГВКредит);
////	УсловияРасчета.Вставить("СтоимостьПГ",СтоимостьПГ);
////	УсловияРасчета.Вставить("СубсидияПГ",СубсидияПГ);
////	УсловияРасчета.Вставить("ДопОборудованиеВКредит",ДопОборудованиеВКредит);
////	УсловияРасчета.Вставить("СтоимостьДопОборудования",СтоимостьДопОборудования);
////	УсловияРасчета.Вставить("ЗащитаКредита",ЗащитаКредита);
////	УсловияРасчета.Вставить("СтавкаЗащитыКредита",СтавкаЗащитыКредита);
////	УсловияРасчета.Вставить("ФиксированнаяЧастьЗащитыКредита",ФиксированнаяЧастьЗащитыКредита);

//	УсловияРасчета.Вставить("СтоимостьАвтомобиля",СтоимостьАвтомобиля);
//	УсловияРасчета.Вставить("СтавкаБанка",СтавкаБанка);
//	УсловияРасчета.Вставить("СтавкаМаркетинговая",СтавкаМаркетинговая);
//	УсловияРасчета.Вставить("ПервоначальныйВзнос",ПервоначальныйВзнос);
//	УсловияРасчета.Вставить("ПервоначальныйВзносПроцент",ПервоначальныйВзносПроцент);
//	УсловияРасчета.Вставить("СрокКредита",СрокКредита);
//	УсловияРасчета.Вставить("ПроцентОстаточногоПлатежа",ПроцентОстаточногоПлатежа);
//	//УсловияРасчета.Вставить("ОстаточныйПлатежСумма",ОстаточныйПлатежСумма);
//	УсловияРасчета.Вставить("СуммаКредита",СуммаКредита);
//	УсловияРасчета.Вставить("ЕжемесячныйПлатеж",ЕжемесячныйПлатеж);

//	УсловияРасчета.Вставить("Сервисы",ЗначениеВСтрокуВнутр(Сервисы.Выгрузить()));
//	
//	//сторонние банки
//	//УсловияРасчета.Вставить("Банк",КредитноеПредложение.Владелец); - банк из кредитного предложения
//	УсловияРасчета.Вставить("ЗаявленныйДоходКлиента",ЗаявленныйДоходКлиента);
//	УсловияРасчета.Вставить("ДоходПодтвержден",ДоходПодтвержден);
	
//	Структура.Вставить("УсловияРасчета",ЗначениеВСтрокуВнутр(УсловияРасчета));

	Структура.Вставить("Сервисы",ЗначениеВСтрокуВнутр(Сервисы.Выгрузить()));
	
	Возврат Структура
КонецФункции	

&НаКлиенте
Процедура кнОбновить(Команда) ВыполнитьРасчет() КонецПроцедуры

&НаКлиенте
Процедура СтоимостьАвтомобиляПриИзменении(Элемент)  УправлениеЭлементами() КонецПроцедуры

&НаКлиенте
Процедура СервисыВклПриИзменении(Элемент) ВыполнитьРасчет() КонецПроцедуры


