&НаКлиенте
Перем Права;

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)  	

	// СтандартныеПодсистемы.Печать
	Renault_УправлениеПечатью.ПриСозданииНаСервере(ЭтаФорма);
	// Конец СтандартныеПодсистемы.Печать
	
	Если Объект.Автор.Пустая() Тогда 
		Объект.Автор=ПараметрыСеанса.Пользователь 
	КонецЕсли;
	
	спЗакладки.Добавить("Автомобили");
	спЗакладки.Добавить("Опции");
	спЗакладки[0].Пометка = Истина;

	
	//УстановитьОсновнуюЗаявку();//поиск основной заявки по банку
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	//Права = глПрава;				
	
	//Установим дату входящего документа на текущую
	Если Объект.Ссылка.Пустая() Тогда
		//ЗакрыватьНераспределенныеЗаказыПокупателей = обПраво("ЗакрыватьНераспределенныеЗаказыПокупателей",Права,,Объект);				
		Модифицированность = ЛОЖЬ;
	КонецЕсли;
	
	//УправлениеДиалогом();

	
	УправлениеЭлементами();
	ВывестиЗаголовокСуммаДокумента(ЭтаФорма); 	
	ВывестиЗаголовокВзаиморасчеты(ЭтаФорма);
	ОрганизацияПодразделениеИндикация(ЭтаФорма);
	ВывестиЗаголовокСчетФактура();
	//ЗагрузитьВнешнююКомпоненту("C:\temp\V8ADD.dll");
	
КонецПроцедуры

&НаКлиенте
Процедура КоманднаяПанельТоварыЗаполнение(Команда)
	Если Не Объект.ДокументОснование = Неопределено 
		И Не Объект.ДокументОснование.Пустая() 
		И Не Объект.ДокументОснование.Метаданные().ТабличныеЧасти.Найти("Товары") = Неопределено Тогда
		Объект.Товары.Очистить();
		Об = Объект.ДокументОснование.ПолучитьОбъект();
		Для каждого Стр Из Об.Товары Цикл
			НоваяСтрока = Объект.Товары.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, Стр);
		КонецЦикла;
		ВывестиЗаголовокСуммаДокумента(ЭтаФорма);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ДолгКлиентаНажатие(Элемент)
	ВзаиморасчетыНажатие(ЭтаФорма,Элемент);
КонецПроцедуры

// нажатие на гиперссылку, показывающую текущее состояние взаиморасчетов 
//
// Параметры:
// ЭтаФорма 			- форма, форма переданного документа
// Элемент 			- ЭУ надпись, служит для вывода состояния взаиморасчетов
// РеквизитКонтрагента - СправочникСсылка.Контрагенты, контрагент документа,
// по которому выводится состояние взаиморасчетов
// РеквизитКонтрагента - СправочникСсылка.договорыВзаиморасчетов, договор
// контрагента, по которому выводится состояние взаиморасчетов
//
&НаКлиенте
Процедура ВзаиморасчетыНажатие(ЭтаФорма,Элемент,РеквизитКонтрагента = Неопределено,РеквизитДоговорВзаиморасчетов = Неопределено) Экспорт
	// проверки
	Контрагент = Неопределено; ДоговорВзаиморасчетов = Неопределено;
	Попытка
		Если РеквизитКонтрагента = Неопределено Тогда
			Если НЕ ЗначениеНеЗаполнено(Объект.Контрагент) Тогда 
				Контрагент = Объект.Контрагент; 
			Иначе 
				Возврат; 
			КонецЕсли;
		Иначе
			Если НЕ ЗначениеНеЗаполнено(Объект[РеквизитКонтрагента]) Тогда 
				Контрагент = Объект[РеквизитКонтрагента]; 
			Иначе 
				Возврат; 
			КонецЕсли;
		КонецЕсли; 
	Исключение
		Возврат; // раз нет контрагента, то дальше и делить нечего
	КонецПопытки;
	Попытка
		Если РеквизитДоговорВзаиморасчетов = Неопределено Тогда
			Если НЕ ЗначениеНеЗаполнено(Объект.ДоговорВзаиморасчетов) Тогда 
				ДоговорВзаиморасчетов = Объект.ДоговорВзаиморасчетов; 
			КонецЕсли;
		Иначе
			Если НЕ ЗначениеНеЗаполнено(Объект[РеквизитДоговорВзаиморасчетов]) Тогда 
				ДоговорВзаиморасчетов = Объект[РеквизитДоговорВзаиморасчетов]; 
			КонецЕсли;
		КонецЕсли; 
	Исключение
	КонецПопытки;
	
	ФормаОтчета = ПолучитьФорму("ОбщаяФорма.Отчет_Тонкий_Клиент",,ЭтаФорма);
	ФормаОтчета.ОтчетОбъект = СоздатьОтчетОбъектНаСервере();
	ФормаОтчета.Заголовок = "Взаиморасчеты компании";
	ФормаОтчета.Открыть();
	
	ВывестиЗаголовокВзаиморасчеты(ЭтаФорма);
КонецПроцедуры // дкВзаиморасчетыНажатие()

&НаСервере
Функция СоздатьОтчетОбъектНаСервере()
	// заполним параметры отчета
	Отчет = Отчеты.Взаиморасчеты.Создать();
	Отчет.ВидОтчета = Перечисления.ВидыОтчетов.Остатки;
	Отчет.ДатаКонца = ТекущаяДата();
	Отчет.РежимВыводаОтчета = Перечисления.РежимыВыводаОтчета.ТабличныйДокумент;
	Отчет.РежимНастройки = Перечисления.РежимыНастройкиОтчетов.Эксперт;
	Отчет.ИмяФормыНастроек = "НастройкиОстатки";
	Отчет.ЗаполнитьНачальныеНастройки("ТекстЗапросаОстатки");
	
	//// уберем измерения "Организация", "ПодразделениеКомпании" ...
	//ТекОрганизация = Отчет.ИзмеренияСтроки.Найти("Организации", "ПутьКДанным");
	//Если ТекОрганизация<>Неопределено Тогда ТекОрганизация.Использование = Ложь; КонецЕсли;
	//ТекПодразделениеКомпании = Отчет.ИзмеренияСтроки.Найти("Подразделение", "ПутьКДанным");
	//Если ТекПодразделениеКомпании<>Неопределено Тогда ТекПодразделениеКомпании.Использование = Ложь; КонецЕсли;
	Для каждого Измерение Из Отчет.ИзмеренияСтроки Цикл
		Если Измерение.ПутьКДанным="Контрагент" ИЛИ 
			 Измерение.ПутьКДанным="ДоговорВзаиморасчетов" ИЛИ
			 Измерение.ПутьКДанным="Сделка" Тогда
			Измерение.Использование=Истина;
		Иначе
			Измерение.Использование=Ложь;
		КонецЕсли; 
	КонецЦикла; 
	
	// показатели все только итоговых сумм
	Для Каждого СтрокаПоказателей Из Отчет.Показатели Цикл
		Если СтрокаПоказателей.Имя="ИтогоСумма" ИЛИ
			 СтрокаПоказателей.Имя="ИтогоСуммаБаз" Тогда
			СтрокаПоказателей.Использование=Истина;
		Иначе
			СтрокаПоказателей.Использование=Ложь;
		КонецЕсли; 
	КонецЦикла;
	
	// фильтры
	Попытка
		Отчет.ПостроительОтчета.Отбор.Контрагент.Значение = Объект.Контрагент;
		Отчет.ПостроительОтчета.Отбор.Контрагент.Использование = Истина;
		//ТекКонтрагент = Отчет.ИзмеренияСтроки.Найти("Контрагент", "ПутьКДанным");
		//Если ТекКонтрагент <> Неопределено Тогда ТекКонтрагент.Использование = Ложь; КонецЕсли;
	Исключение
	КонецПопытки; 
	Попытка 
		Отчет.ПостроительОтчета.Отбор.ДоговорВзаиморасчетов.Значение = Объект.ДоговорВзаиморасчетов;
		Отчет.ПостроительОтчета.Отбор.ДоговорВзаиморасчетов.Использование = НЕ ЗначениеНеЗаполнено(Объект.ДоговорВзаиморасчетов);
		//ТекДоговорВзаиморасчетов = Отчет.ИзмеренияСтроки.Найти("ДоговорВзаиморасчетов", "ПутьКДанным");
		//Если ТекДоговорВзаиморасчетов <> Неопределено Тогда ТекДоговорВзаиморасчетов.Использование = Ложь; КонецЕсли;
	Исключение 
	КонецПопытки;
	Возврат Отчет;
КонецФункции	

// формирует заголовок гиперссылки, показывающей текущее состояние взаиморасчетов 
//
// Параметры:
// ЭтаФорма - форма, форма переданного документа
//
&НаКлиенте
Процедура ВывестиЗаголовокВзаиморасчеты(ЭтаФорма) Экспорт
	Если ЭтаФорма <> Неопределено Тогда
		// проверка на договор
		Если ЭтаФорма.Элементы.Найти("ДоговорВзаиморасчетов") = Неопределено Тогда
			Возврат 
		КонецЕсли;
		
		//получим элемент на форме
		Попытка
			НадписьНаФорме = ЭтаФорма.Элементы.ДолгКлиента;
			ДляАРМ = Ложь;
		Исключение
			НадписьНаФорме = ЭтаФорма.Элементы.тВзаиморасчетыДляАРМ;
			ДляАРМ = Истина;
		КонецПопытки;	
		
		//НадписьНаФорме.ЦветТекста = ЦветаСтиля.ТекстИнформационнойНадписи;
		Если ЗначениеНеЗаполнено(Объект.ДоговорВзаиморасчетов) Тогда
			// пустой договор
			НадписьНаФорме.Заголовок = " < Договор не выбран > ";
		Иначе
			// получим долг
			Долг = ДолгКонтрагента();
			// выведем на экран этот долг
			Если ДляАРМ Тогда
				НадписьНаФорме.Заголовок = "Долг контрагент" + ?(Долг < 0,"у","а") + ": " + Формат(?(Долг < 0,-Долг,Долг),"ЧДЦ = 2; ЧН = 0,00") + " " + СокрЛП(ПолучитьНаименованиеВалютыВзаиморасчетов());
			Иначе
				НадписьНаФорме.Заголовок = "По договору долг контрагент" + ?(Долг < 0,"у","а") + " составляет: " + Формат(?(Долг < 0,-Долг,Долг),"ЧДЦ = 2; ЧН = 0,00") + " " + СокрЛП(ПолучитьНаименованиеВалютыВзаиморасчетов());
			КонецЕсли;
			Если Долг < 0 Тогда
				НадписьНаФорме.ЦветТекста = WebЦвета.ТемноКрасный;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли; 
КонецПроцедуры // дкВывестиЗаголовокВзаиморасчеты()

&НаСервере 
Функция ПолучитьНаименованиеВалютыВзаиморасчетов()
	Возврат Объект.ДоговорВзаиморасчетов.ВалютаВзаиморасчетов.Наименование;
КонецФункции

&НаСервере
Функция ДолгКонтрагента()
	СтруктураОтбора = Новый Структура("Контрагент,ДоговорВзаиморасчетов",Объект.Контрагент,Объект.ДоговорВзаиморасчетов);
	тзДолги = РегистрыНакопления.ВзаиморасчетыКомпании.Остатки(,СтруктураОтбора,,"Сумма,СуммаУпр");
	Долг = тзДолги.Итог("Сумма");
	Возврат Долг;
КонецФункции	

// Возвращает массив подчиненных документов.
//
// Параметры: Основание	 - ДокументСсылка. Тот документ подчиненных для которого ищем
//	МассивВидов			 - Массив. Массив строк с видами подчиненных документов. Если МассивВидов не определен,
//						 то возвращаются все подчиненные документы
//
// Возвращаемое значение: 
// Массив ссылок документов
//
&НаСервере
Функция ПолучитьМассивПодчиненных(Основание,МассивВидов = Неопределено, ТолькоНеПомеченные = Ложь) Экспорт
	// проверим на пустое основание
	Если ЗначениеНеЗаполнено(Основание) Тогда
		Возврат Неопределено;
	КонецЕсли;
	// получим массив подчиненных документов
	МассивПодчиненных = КритерииОтбора.ПодчиненныеДокументы.Найти(Основание);
	// если задан фильтр на виды документов, то пропустим полученный массив через этот фильтр
	Если (МассивВидов <> Неопределено) И (МассивПодчиненных.Количество() > 0) Тогда
		ТекИндекс = 0;
		Пока ТекИндекс <= МассивПодчиненных.ВГраница() Цикл
			НайденВФильтре = Ложь;
			Для Сч = 0 По МассивВидов.ВГраница() Цикл
				Если МассивПодчиненных[ТекИндекс].Ссылка.Метаданные().Имя = МассивВидов[Сч] Тогда
					НайденВФильтре = Истина; Прервать;
				КонецЕсли;
			КонецЦикла;
			Если НайденВФильтре И (НЕ ТолькоНеПомеченные ИЛИ НЕ МассивПодчиненных[ТекИндекс].Ссылка.ПометкаУдаления) Тогда 
				ТекИндекс = ТекИндекс + 1; 
			Иначе 
				МассивПодчиненных.Удалить(ТекИндекс);
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	Возврат МассивПодчиненных;
КонецФункции // дкЗаполнитьТабличнуюЧастьПоОснованию()

&НаКлиенте
Процедура кнПечать(Команда)
	
	Если Объект.Ссылка.Пустая() или Модифицированность Тогда
		Предупреждение("Печать доступна только после записи");
		Возврат
	КонецЕсли; 
	
	Парам = Новый Структура;
	Парам.Вставить("Заголовок","Доступные печатные формы");
	Парам.Вставить("МножественныйВыбор",Ложь);
	Парам.Вставить("КоличествоЭлементовВСтроке",3);
	Парам.Вставить("ШиринаЭлемента",19); 
	Парам.Вставить("ВысотаЭлемента",3);
	
	Renault_УправлениеПечатьюКлиент.ВыбратьПечатнуюФорму(Этаформа,Объект,Парам);
	
КонецПроцедуры

&НаКлиенте
Процедура УправлениеЭлементами()
	//Элементы.кнВернутьВЗадачи.Доступность=Не Объект.Задача.Пустая() И НЕ Объект.Ссылка.Проведен И НЕ Объект.Ссылка.Пустая();
	//Элементы.кнСостояние.Заголовок="Состояние:"+Символы.ПС+Объект.Состояние;
	////Элементы.ЗаголовокФормы.Заголовок="Рабочий лист кредит ("+Нрег(Объект.Состояние)+")";
	//Заголовок="Рабочий лист кредит ("+Нрег(Объект.Состояние)+")";
	
	//Элементы.кнВернутьВЗадачи.Видимость=НЕ Объект.Задача.Пустая();
	
	//Элементы.Версия.СписокВыбора.ЗагрузитьЗначения(Renault_ОбщиеФункции.ВариантыКомплектаций(Объект.Автомобиль));
	//
	//Если Не Объект.КоммерческоеПредложение.Пустая() Тогда
	//	Элементы.Автомобиль.ТолькоПросмотр=Истина;
	//	Элементы.Версия.ТолькоПросмотр=Истина;
	//	Элементы.КоммерческоеПредложение.ТолькоПросмотр=Истина;
	//	Элементы.СтоимостьАвтомобиля.ТолькоПросмотр=Истина;
	//	Элементы.Клиент.ТолькоПросмотр=Истина;
	//КонецЕсли;	
	
	//переключение закладки
	АктивныйЦвет=Новый Цвет(255,207,0);
	ПассивныйЦвет=Новый Цвет(189,195,206);
	Для Каждого Эл Из спЗакладки Цикл
		Элементы["кн"+Эл.Значение].ЦветФона=?(Эл.Пометка,АктивныйЦвет,ПассивныйЦвет);
		Элементы["кн"+Эл.Значение].ЦветРамки=?(Эл.Пометка,АктивныйЦвет,ПассивныйЦвет);
		Элементы[Эл.Значение].Видимость=Эл.Пометка;
	КонецЦикла;
	
	//Элементы.кнОформитьЗаявку.Видимость=ИмяТЧ()<>"ПредоставленныеДокументы";
	//Элементы.кнОсновной.Доступность=ИмяТЧ()="ЗаявкиВБанк";
	
	////добавим условное оформление
	//Отбор=ЭтаФорма.УсловноеОформление.Элементы[0].Отбор.Элементы[0];
	//Отбор.ПравоеЗначение=ОсновнаяЗаявка;
	
	//Элементы.кнОформитьСтраховойПолис.Доступность=Объект.ФинансовыеУслуги.Количество()>0;
	
КонецПроцедуры	

&НаКлиенте
Функция ИмяТЧ() 
	Для Каждого Эл Из спЗакладки Цикл 
		Если Эл.Пометка Тогда 
			Возврат Эл.Значение 
		КонецЕсли 
	КонецЦикла 
КонецФункции	

&НаКлиенте
Процедура кнопкиТЧ(Команда)
	
	ИмяТЧ = ИмяТЧ();
	ИмяТЧОбъекта = ?(ИмяТЧ = "Оборудование","Товары",ИмяТЧ);
	
	Если ТекущийЭлемент.Имя = "кнДобавить" Тогда 
		СтрокаТЧ = Объект[ИмяТЧОбъекта].Добавить();
	ИначеЕсли ТекущийЭлемент.Имя = "кнУдалить" Тогда 
		Если Элементы[ИмяТЧ].ТекущаяСтрока = Неопределено Тогда 
			Возврат; 
		КонецЕсли;
		ТекСтрока = Объект[ИмяТЧОбъекта].НайтиПоИдентификатору(Элементы[ИмяТЧ].ТекущаяСтрока);
		Если ТекСтрока <> Неопределено Тогда 
			Объект[ИмяТЧОбъекта].Удалить(ТекСтрока) 
		КонецЕсли;
	ИначеЕсли ТекущийЭлемент.Имя="кнОбновить" Тогда		
		Элементы[ИмяТЧ].Обновить();
	КонецЕсли;
	
	УправлениеЭлементами(); 
	
КонецПроцедуры

&НаКлиенте
Процедура ОрганизацияПодразделениеНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ПараметрыФормы = Новый Структура(); 	
	ПараметрыФормы.Вставить("Ссылка",Объект.Ссылка); 	
	ПараметрыФормы.Вставить("ПодразделениеКомпании",Объект.ПодразделениеКомпании);	
	ПараметрыФормы.Вставить("Организация",Объект.Организация);	
	ПараметрыФормы.Вставить("Автор",Объект.Автор);	
	//ПараметрыФормы.Вставить("Менеджер",Объект.Менеджер);	
	//ПараметрыФормы.Вставить("Проект",Объект.Проект);	
	ПараметрыФормы.Вставить("РегламентированныйУчет",Объект.РегламентированныйУчет);
	Если ЕстьРеквизитОбъекта("ДокументОснование", Объект.Ссылка) 
		И Не Объект.ДокументОснование = Неопределено	
		И Не Объект.ДокументОснование.Пустая() Тогда
		ПараметрыФормы.Вставить("ДокументОснование",Объект.ДокументОснование);
	КонецЕсли;
	//ОткрытьФорму("Документ.ПоступлениеТоваров.Форма.ФормаВыборОбщихРеквизитов", ПараметрыФормы, ЭтаФорма);
	
	ОткрытьФорму("ОбщаяФорма.Renault_ВыборОбщихРеквизитов", ПараметрыФормы, ЭтаФорма, Новый УникальныйИдентификатор(),,,,РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);	
КонецПроцедуры

Функция ЕстьРеквизитОбъекта(ИмяРеквизита, Объект) Экспорт
	
	МетаданныеОбъекта = Объект.Метаданные();
	Если МетаданныеОбъекта.Реквизиты.Найти(ИмяРеквизита) = Неопределено Тогда
		Возврат Ложь;
	Иначе
		Возврат Истина;
	КонецЕсли; 
	
КонецФункции


&НаКлиенте
Процедура ВывестиЗаголовокСуммаДокумента(ЭтаФорма) Экспорт
	Если ЭтаФорма <> Неопределено Тогда
		// попытаемся пересчитать сумму документа
		
		Попытка 
			ВремСумма = Объект.Товары.Итог("СуммаВсего"); 
		Исключение 
		КонецПопытки;
		
		Попытка
			//Если ВремСумма <> ЭтаФорма.СуммаДокумента Тогда ЭтаФорма.СуммаДокумента = ВремСумма; КонецЕсли;
		Исключение
		КонецПопытки;	
		// обновим надпись валюты и суммы документа
		ТекстВалюта = "";
		Попытка	
			ТекстВалюта = "Валюта: " + СокрЛП(Объект.ВалютаДокумента) + " (" + Формат(Объект.КурсДокумента,"ЧДЦ = 4") + ")";
			Попытка
				Если ВремСумма <> Неопределено Тогда
					ТекстСумма = " ИТОГО: " + Формат(ВремСумма,"ЧДЦ = 2; ЧН = 0,00");
				КонецЕсли; 
			Исключение
			КонецПопытки;
			ЭтаФорма.Элементы.СуммаДокумента.Заголовок = ТекстВалюта + ТекстСумма;
		Исключение 
		КонецПопытки;
	КонецЕсли; 
КонецПроцедуры // ВывестиЗаголовокСуммаДокумента()

// Определяет заполнено ли переданное значение
//
// Параметры: 
//  Значение - Неопределено - Значение, заполнение которого надо проверить
//
// Возвращаемое значение:
//  Булево - Истина, если значение не заполнено, иначе ложь.
//
&НаСервере
Функция ЗначениеНеЗаполнено(Значение) Экспорт

	Результат = Ложь;
	
	Попытка
		Результат = Не ЗначениеЗаполнено(Значение)	
	Исключение // Мутабельные типы (Объекты)
		Результат = Ложь
	КонецПопытки;
	
	Возврат Результат;
	
КонецФункции // ЗначениеНеЗаполнено()

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "ЗакрытьФормуВыбораОбщихРеквизитов" Тогда
		ЗаполнитьЗначенияСвойств(Объект,Параметр);
		ОрганизацияПодразделениеИндикация(ЭтаФорма);
	КонецЕсли;
	
	Если ИмяСобытия = "ЗакрытьФормуСчетФактуры" Тогда
		ВывестиЗаголовокСчетФактура();
	КонецЕсли;
	
КонецПроцедуры 

&НаКлиенте
Процедура ОрганизацияПодразделениеИндикация(ЭтаФорма) Экспорт
	
	Если ЭтаФорма <> Неопределено Тогда

		Попытка
			Сп = Новый СписокЗначений;
			Сп.Добавить(Объект.Организация);
			Сп.Добавить(Объект.ПодразделениеКомпании);
			Попытка
				Если Не ЗначениеНеЗаполнено(Объект.Проект) Тогда
					Сп.Добавить(Объект.Проект);
				КонецЕсли;
			Исключение
			КонецПопытки;

			Попытка
				Если Не ЗначениеНеЗаполнено(Объект.Автор) Тогда
					Сп.Добавить(Объект.Автор);
				КонецЕсли;
			Исключение
			КонецПопытки;

			Попытка
				Если Не ЗначениеНеЗаполнено(Объект.Менеджер) Тогда
					Сп.Добавить(Объект.Менеджер);
				КонецЕсли;
			Исключение
			КонецПопытки;
			ОрганизацияПодразделение = Сп;
		Исключение
		КонецПопытки;
	КонецЕсли;
	
КонецПроцедуры


&НаКлиенте
Процедура КонтрагентПриИзменении(Элемент)	 	
	ВывестиЗаголовокВзаиморасчеты(ЭтаФорма);
КонецПроцедуры


&НаКлиенте
Процедура кнЗакладка(Команда)
	Для Каждого Эл Из спЗакладки Цикл 
		Эл.Пометка = Найти(ТекущийЭлемент.Имя, Эл.Значение) > 0 
	КонецЦикла; //пометка текущей закладки в списке
	УправлениеЭлементами();
КонецПроцедуры

&НаКлиенте
Процедура ГиперссылкаСчетФактураНажатие(Элемент)
	СчетФактураНажатие(ЭтаФорма,Элемент,"СчетФактураПолученный");
КонецПроцедуры

// нажатие на гиперссылку "Ввести счет-фактуру"
//
// Параметры:
// ЭтаФорма - форма, форма переданного документа
// Элемент - ЭУ надпись, служит для отображения гиперссылки
// ВидСФ 	 - Строка. Вид счета-фактуры ("СчетФактураПолученный"/"СчетФактураВыданный")
//
&НаКлиенте
Процедура СчетФактураНажатие(ЭтаФорма,Элемент,ВидСФ)
	// получим имеющуюся счет-фактуру
	МассивВидов = Новый Массив(1);
	МассивВидов[0] = ВидСФ;
	МассивПодчиненных = ПолучитьМассивПодчиненных(Этаформа.Объект.Ссылка,МассивВидов, Истина);
	Если НЕ МассивПодчиненных = Неопределено И МассивПодчиненных.Количество() > 0 Тогда
		// счет-фактура найден, откроем его
		СчетФактура = МассивПодчиненных[0];
		ОткрытьЗначение(СчетФактура);
	Иначе
		// счет-фактура НЕ найден, введем новый
		ОткрытьФорму("Документ."+ВидСФ+".Форма.Renault_ФормаДокументаУпр", Новый Структура("Основание,ЗначенияЗаполнения", Объект.Ссылка, Новый Структура("ДокументОснование",Объект.Ссылка)),ЭтаФорма);
	КонецЕсли;
КонецПроцедуры // дкСчетФактураНажатие()

&НаКлиенте
Процедура ВывестиЗаголовокСчетФактура()
	МассивВидов = Новый Массив(1);
	МассивВидов[0] = "СчетФактураПолученный";
	МассивПодчиненных = ПолучитьМассивПодчиненных(Объект.Ссылка,МассивВидов, Истина);
	Если НЕ МассивПодчиненных = Неопределено И МассивПодчиненных.Количество() > 0 Тогда
		Элементы.ГиперссылкаСчетФактура.Заголовок = МассивПодчиненных[0];
	КонецЕсли; 
КонецПроцедуры // ВывестиЗаголовокСчетФактура()
