
&НаСервере
Процедура УСтановитьДаты()
	
	для Каждого ст из Список.Отбор.Элементы Цикл
		Если Строка(Ст.ЛевоеЗначение) = "Дата" Тогда
			Если Ст.ВидСравнения = ВидСравненияКомпоновкиДанных.МеньшеИлиРавно Тогда
				Ст.ПравоеЗначение = Период.ДатаОкончания;
				Ст.Использование = Истина;
			ИначеЕсли  Ст.ВидСравнения = ВидСравненияКомпоновкиДанных.БольшеИлиРавно Тогда
				Ст.ПравоеЗначение = Период.ДатаНачала;
				Ст.Использование = Истина;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	Элементы.Список.Обновить();	

КонецПроцедуры  

&НаСервере
Процедура УбратьДаты()
	для Каждого ст из Список.Отбор.Элементы Цикл
		Если Строка(Ст.ЛевоеЗначение) = "Дата" Тогда
			Если Ст.ВидСравнения = ВидСравненияКомпоновкиДанных.МеньшеИлиРавно Тогда
				Ст.Использование = Ложь;
			ИначеЕсли  Ст.ВидСравнения = ВидСравненияКомпоновкиДанных.БольшеИлиРавно Тогда
				Ст.Использование = Ложь;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	Элементы.Список.Обновить();
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьПериод(Команда)
	УСтановитьДаты();
КонецПроцедуры

&НаКлиенте
Процедура ОтменитьПериод(Команда)
	// Вставить содержимое обработчика.
	УбратьДаты();
КонецПроцедуры

&НаКлиенте
Процедура ОтборКЗ(Команда)
	
	ОтключитьВсеОтборыКромеДаты();
	
	Для Каждого Ст из Список.Отбор.Элементы Цикл
		
		Если Строка(Ст.ЛевоеЗначение) = "Статус" Тогда
			Ст.ПравоеЗначение = Перечисления.CRM_СтатусыДоговоровНаПродажуАвтомобиля.Подписан;
			Ст.Использование = Истина;
		КонецЕсли;
		
		Если Строка(Ст.ЛевоеЗначение) = "VIN" Тогда
			Ст.ПравоеЗначение = "";
			Ст.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
			Ст.Использование = Истина;
		КонецЕсли;
		
		Если Строка(Ст.ЛевоеЗначение) = "НомерКЗDistri" Тогда
			Ст.ПравоеЗначение = "";
			Ст.Использование = Истина;
		КонецЕсли;
		
	КонецЦикла;
	
	ВыделитьКнопку(Элементы.ОтборКЗ);
	
КонецПроцедуры

&НаКлиенте
Процедура ОтборЗаказВПроизводство(Команда)
	
	ОтключитьВсеОтборыКромеДаты();
	
	Для Каждого Ст из Список.Отбор.Элементы Цикл
		Если Строка(Ст.ЛевоеЗначение) = "Статус" Тогда
			Ст.ПравоеЗначение = Перечисления.CRM_СтатусыДоговоровНаПродажуАвтомобиля.Подписан;
			Ст.Использование = Истина;
		КонецЕсли;
		Если Строка(Ст.ЛевоеЗначение) = "НомерЗаказаDistri" Тогда
			Ст.ПравоеЗначение = "";
			Ст.Использование = Истина;
		КонецЕсли;
		Если Строка(Ст.ЛевоеЗначение) = "VIN" Тогда
			Ст.ПравоеЗначение = "";
			Ст.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
			Ст.Использование = Истина;
		КонецЕсли;
	КонецЦикла;
	
	Элементы.Список.Обновить();	
	ВыделитьКнопку(Элементы.ОтборЗаказВПроизводство);
	
КонецПроцедуры

&НаКлиенте
Процедура ОтборВсе(Команда)
	
	ОтключитьВсеОтборыКромеДаты();
	ВыделитьКнопку(Элементы.ОтборВсе);
	
КонецПроцедуры

Процедура ОтключитьВсеОтборыКромеДаты()
	
	Для Каждого Ст из Список.Отбор.Элементы Цикл
		Если Строка(Ст.ЛевоеЗначение) <> "Дата" Тогда
			Ст.Использование = Ложь;
		КонецЕсли;
	КонецЦикла;
	
	Элементы.Список.Обновить();	

КонецПроцедуры

&НаКлиенте
Процедура ОтборНаОформление(Команда)
	
	ОтключитьВсеОтборыКромеДаты();
	
	Для Каждого Ст из Список.Отбор.Элементы Цикл
		Если Строка(Ст.ЛевоеЗначение) = "Статус" Тогда
			Ст.ПравоеЗначение = Перечисления.CRM_СтатусыДоговоровНаПродажуАвтомобиля.НаОформление;
			Ст.Использование = Истина;
		КонецЕсли;
		Если Строка(Ст.ЛевоеЗначение) = "ВидДоговора" Тогда
			Ст.ПравоеЗначение = Перечисления.CRM_ВидыДоговоров.ДКП;
			Ст.Использование = Истина;
		КонецЕсли;
	КонецЦикла;
	
	Элементы.Список.Обновить();
	ВыделитьКнопку(Элементы.ОтборНаОформление);
	
КонецПроцедуры

&НаКлиенте
Процедура ОтборНаПодписание(Команда)
	
	ОтключитьВсеОтборыКромеДаты();
	
	Для Каждого Ст из Список.Отбор.Элементы Цикл
		Если Строка(Ст.ЛевоеЗначение) = "Статус" Тогда
			Ст.ПравоеЗначение = Перечисления.CRM_СтатусыДоговоровНаПродажуАвтомобиля.Оформлен;
			Ст.Использование = Истина;
		КонецЕсли;
	КонецЦикла;
	
	Элементы.Список.Обновить();
	ВыделитьКнопку(Элементы.ОтборНаПодписание);
	
КонецПроцедуры

&НаКлиенте
Процедура ОтборНаСозданиеРеализаций(Команда)
	
	ОтключитьВсеОтборыКромеДаты();
	
	Для Каждого Ст из Список.Отбор.Элементы Цикл
		Если Строка(Ст.ЛевоеЗначение) = "РеализацияАвтомобиля" Тогда
			Ст.ПравоеЗначение = Документы.РеализацияАвтомобилей.ПустаяСсылка();
			Ст.Использование = Истина;
		КонецЕсли;
		Если Строка(Ст.ЛевоеЗначение) = "Статус" Тогда
			Ст.ПравоеЗначение = Перечисления.CRM_СтатусыДоговоровНаПродажуАвтомобиля.Подписан;
			Ст.Использование = Истина;
		КонецЕсли;
		Если Строка(Ст.ЛевоеЗначение) = "ВидДоговора" Тогда
			Ст.ПравоеЗначение = Перечисления.CRM_ВидыДоговоров.ДКП;
			Ст.Использование = Истина;
		КонецЕсли;
		Если Строка(Ст.ЛевоеЗначение) = "VIN" Тогда
			Ст.ПравоеЗначение = "";
			Ст.ВидСравнения = ВидСравненияКомпоновкиДанных.НеРавно;
			Ст.Использование = Истина;
		КонецЕсли;
	КонецЦикла;
	
	Элементы.Список.Обновить();
	ВыделитьКнопку(Элементы.ОтборНаСозданиеРеализаций);
	
КонецПроцедуры


&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия= "ОбновитьРабочийЛистПослеЗаписиДоговора" Тогда	
		Элементы.Список.Обновить();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВыделитьКнопку(КнопкаДляВыделения)
	
	ЦветФормы = Новый Цвет(245, 242, 221);
	
	Элементы.ОтборВсе.ЦветФона = ЦветФормы;
	Элементы.ОтборНаСозданиеРеализаций.ЦветФона = ЦветФормы;
	Элементы.ОтборНаОформление.ЦветФона = ЦветФормы;
	Элементы.ОтборНаПодписание.ЦветФона = ЦветФормы;
	Элементы.ОтборЗаказВПроизводство.ЦветФона = ЦветФормы;
	Элементы.ОтборКЗ.ЦветФона = ЦветФормы;
	Элементы.ОтборНаОформлениеАванс.ЦветФона = ЦветФормы;
	
	ЦветРено = Новый Цвет(255, 182, 0);
	КнопкаДляВыделения.ЦветФона = ЦветРено;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ВыделитьКнопку(Элементы.ОтборВсе);
КонецПроцедуры

&НаКлиенте
Процедура ОтборНаОформлениеАванс(Команда)
	ОтключитьВсеОтборыКромеДаты();
	
	Для Каждого Ст из Список.Отбор.Элементы Цикл
		Если Строка(Ст.ЛевоеЗначение) = "Статус" Тогда
			Ст.ПравоеЗначение = Перечисления.CRM_СтатусыДоговоровНаПродажуАвтомобиля.НаОформление;
			Ст.Использование = Истина;
		КонецЕсли;
		Если Строка(Ст.ЛевоеЗначение) = "ВидДоговора" Тогда
			Ст.ПравоеЗначение = Перечисления.CRM_ВидыДоговоров.Аванс;
			Ст.Использование = Истина;
		КонецЕсли;
	КонецЦикла;
	
	Элементы.Список.Обновить();
	ВыделитьКнопку(Элементы.ОтборНаОформлениеАванс);
КонецПроцедуры
