Процедура ОтправитьЗаявкиНаСогласование () Экспорт 
	Попытка		
		УстановитьПривилегированныйРежим(Истина);
		
		//Узел = Константы.RenaultFlotte_ОбменДляЗаявокНаСкидки.Получить();
		Узел = ПланыОбмена.Renault_ОчередьЗаявокНаСкидку.ПоличитьУзелОбмена();
		ЗаписьЖурналаРегистрации(
		"Выгрузка заявки на скидку",
		УровеньЖурналаРегистрации.Информация,
		,,
		Строка(Узел));
		
		ВыборкаДанных = ПланыОбмена.ВыбратьИзменения(Узел, Узел.НомерОтправленного);
		
		Пока ВыборкаДанных.Следующий() Цикл
			СтрокаВыборки = ВыборкаДанных.Получить();
			ЗаписьЖурналаРегистрации(
			"Выгрузка заявки на скидку",
			УровеньЖурналаРегистрации.Информация,
			,,
			Строка(СтрокаВыборки));
			Отказ = ОтправитьЗаявкуНаСогласование(СтрокаВыборки);
			Если Не Отказ Тогда
				ПланыОбмена.УдалитьРегистрациюИзменений(Узел,СтрокаВыборки);
			КонецЕсли;
		КонецЦикла;   
		
		УзелОбъект = Узел.ПолучитьОбъект();
		УзелОбъект.НомерОтправленного = УзелОбъект.НомерОтправленного + 1;
		УзелОбъект.Записать();
	Исключение
		Инфо = ИнформацияОбОшибке();
		ЗаписьЖурналаРегистрации(
		"КорпЗагрузкаДанных.ОтправитьЗаявкиНаСогласование",
		УровеньЖурналаРегистрации.Ошибка,,,
		ПодробноеПредставлениеОшибки(Инфо));
	КонецПопытки;
	
КонецПроцедуры


Функция ОтправитьЗаявкуНаСогласование (СтрокаВыборки)
	
	Если ПараметрыСеанса.DMS_Бренд = Справочники.CRM_МаркаАвтомобиля.LADA Тогда
		Пакет = СформироватьСтруктуруЗаявкиНаСкидку(СтрокаВыборки);	
		ТелоСообщения = Renault_ОбщиеФункцииСервер.ПолучитьСтрокуJSONИзXDTO(Пакет);
		Настройки = DMS_ОбщиеПовторныеФункции.ПараметрыHTTPСоединения(,ПараметрыСеанса.DMS_Бренд);
		Ответ = ВыполнитьPOSTЗапрос(ТелоСообщения, Настройки, "/hs/Fleet/DiscountRequest");
		Если Ответ.КодСостояния = 200 Тогда
			Возврат Ложь;
		ИначеЕсли Ответ.КодСостояния = 300 Тогда
			ЗаписьЖурналаРегистрации(
			"КорпЗагрузкаДанных.ОтправитьЗаявкиНаСогласование",
			УровеньЖурналаРегистрации.Ошибка,,,
			"Строка соединения информационной базы не соответствует пользователю в служебных настройках");
			Возврат Истина;
		Иначе
			// произошла неведомая ошибка
			Возврат Истина;
		КонецЕсли;
	
	Иначе 
		Попытка
			Прокси = RenaultFlotte_ОбщегоНазначения.ПолучитьПрокси();
			Сервер = СтрокаСоединенияИнформационнойБазы();
			Пакет = СформироватьСтруктуруЗаявкиНаСкидку(СтрокаВыборки);	
			Прокси.PutDiscountRequestStructure(Пакет, Сервер);
			Возврат Ложь;
		Исключение
			Инфо = ИнформацияОбОшибке();
				ЗаписьЖурналаРегистрации(
					"Загрузка заявок на корпоративную скидку",
					УровеньЖурналаРегистрации.Ошибка,,,
					ПодробноеПредставлениеОшибки(Инфо));
			Возврат Истина;
		КонецПопытки;
	КонецЕсли;
	
КонецФункции

Функция ПолучитьХэш(ИсходныеДанные, Хэш=5381, М=33, Разрядность=18446744073709551616)

    // приведем к строке
    Если ТипЗнч(ИсходныеДанные) = Тип("ДвоичныеДанные") Тогда
        СтрокаДляКодирования = Base64Строка(ИсходныеДанные);
	ИначеЕсли ТипЗнч(ИсходныеДанные) = Тип("ХранилищеЗначения") Тогда
		Данные = ИсходныеДанные.Получить();
		Если ТипЗнч(Данные) = Тип("Картинка") Тогда
			СтрокаДляКодирования = Base64Строка(Данные.ПолучитьДвоичныеДанные());	
		Иначе
        	СтрокаДляКодирования = Base64Строка(Данные);
		КонецЕсли;
    КонецЕсли;

    ДлинаБлока = 11;
    НачПозиция = 1;
    ДлинаСтроки = СтрДлина(СтрокаДляКодирования);

    Пока НачПозиция <= ДлинаСтроки Цикл
        СтрокаБлока = Сред(СтрокаДляКодирования, НачПозиция, ДлинаБлока);
        ДлинаПодстроки = СтрДлина(СтрокаБлока);
        Если ДлинаПодстроки = ДлинаБлока Тогда
            Хэш = ((((((((((( Хэш*М + КодСимвола(СтрокаБлока, 1))*М + КодСимвола(СтрокаБлока, 2))*М
                + КодСимвола(СтрокаБлока, 3))*М + КодСимвола(СтрокаБлока, 4))*М + КодСимвола(СтрокаБлока, 5))*М
                + КодСимвола(СтрокаБлока, 6))*М + КодСимвола(СтрокаБлока, 7))*М + КодСимвола(СтрокаБлока, 8))*М
                + КодСимвола(СтрокаБлока, 9))*М + КодСимвола(СтрокаБлока, 10))*М + КодСимвола(СтрокаБлока, 11))
        Иначе
            Для к = 1 По ДлинаПодстроки Цикл
                Хэш = М * Хэш + КодСимвола(СтрокаБлока, к)
            КонецЦикла
        КонецЕсли;
        Хэш = Хэш % Разрядность;
        НачПозиция = НачПозиция + ДлинаБлока
    КонецЦикла;

    Возврат Хэш;

КонецФункции

Процедура ЗагрузитьСтатусыVIN () Экспорт
	Попытка	
		УстановитьПривилегированныйРежим(Истина);
		Сервер = СтрокаСоединенияИнформационнойБазы();
		Выборка = Справочники.CRM_ДилерскиеЦентры.Выбрать();
		Пока Выборка.Следующий() Цикл
			Если Выборка.Бренд = Справочники.CRM_МаркаАвтомобиля.LADA Тогда
				ПараметрыЗапроса = Новый Структура();
				ПараметрыЗапроса.Вставить("Server", Сервер);
				ПараметрыЗапроса.Вставить("idDealer", Строка(Выборка.Ссылка.УникальныйИдентификатор()));
				ТелоЗапроса = Renault_ОбщиеФункцииСервер.ПолучитьСтрокуJSONИзXDTO(СериализаторXDTO.ЗаписатьXDTO(ПараметрыЗапроса));
				Настройки = DMS_ОбщиеПовторныеФункции.ПараметрыHTTPСоединения(,?(Не ЗначениеЗаполнено(Выборка.Бренд),ПараметрыСеанса.DMS_Бренд, Выборка.Бренд));
				ОтветHTTP = ВыполнитьPOSTЗапрос(ТелоЗапроса, Настройки, "/hs/Fleet/DiscountStatus"); 
				Если ОтветHTTP.КодСостояния <> 200 Тогда
					Продолжить;
				КонецЕсли;
				
				ТаблицаДанных = Renault_ОбщиеФункцииСервер.ПолучитьЗначениеИзJSON(ОтветHTTP.ПолучитьТелоКакСтроку());
			Иначе
				Прокси = RenaultFlotte_ОбщегоНазначения.ПолучитьПрокси();
				ОбъектXDTO = Прокси.GetDiscountStatus(Новый УникальныйИдентификатор("50b73217-1de4-11e6-80bb-c46e1f036a3d"), "Srvr=""CLIO"";Ref=""pu01593_DMS"";");//Выборка.Ссылка.УникальныйИдентификатор(), Сервер);
				Сериализатор = Новый СериализаторXDTO(ФабрикаXDTO);
				ТаблицаДанных = Сериализатор.ПрочитатьXDTO(ОбъектXDTO);
			КонецЕсли;
		
			МассивОбработанных = Новый Массив;
			Для Каждого Пакет из ТаблицаДанных Цикл
				ДвоичныеДанныеФайла = Пакет.Данные.Получить();
				ИмяВременногоФайла = ПолучитьИмяВременногоФайла("xml");
				ДвоичныеДанныеФайла.Записать(ИмяВременногоФайла);
				ЧтениеXML = Новый ЧтениеXML;
				ЧтениеXML.ОткрытьФайл(ИмяВременногоФайла);
				ЧтениеXML.Прочитать();
				ЧтениеXML.Прочитать(); // пропуск тэга Message
				Пока ЧтениеXML.ТипУзла = ТипУзлаXML.НачалоЭлемента Цикл
					ТипXDTO = ФабрикаXDTO.Тип(Пакет.ПространствоИменДанных, ЧтениеXML.Имя);
					сЗаявки = СериализаторXDTO.ПрочитатьXML(ЧтениеXML); 
					Отказ = ЗагрузитьСтатусVIN(сЗаявки);
				КонецЦикла;
				ЧтениеXML.Закрыть();
				УдалитьФайлы(ИмяВременногоФайла);
				Если Не Отказ Тогда
					МассивОбработанных.Добавить(Пакет.МоментВремени);
				КонецЕсли;
			КонецЦикла;
			Если Выборка.Бренд = Справочники.CRM_МаркаАвтомобиля.LADA Тогда
				ПараметрыЗапроса = Новый Структура();
				ПараметрыЗапроса.Вставить("Array", МассивОбработанных);
				ПараметрыЗапроса.Вставить("idDealer", Строка(Выборка.Ссылка.УникальныйИдентификатор()));
				ЗаписьJSON = Новый ЗаписьJSON();
				ЗаписьJSON.УстановитьСтроку();
				ЗаписатьJSON(ЗаписьJSON, ПараметрыЗапроса);
				ТелоЗапроса = ЗаписьJSON.Закрыть();
				
				ВыполнитьPOSTЗапрос(ТелоЗапроса, Настройки, "/hs/Fleet/ConfirmProcessingClient");  
			Иначе
				МассивОбработанныхОбъектXDTO = Сериализатор.ЗаписатьXDTO(МассивОбработанных);
				Прокси.ConfirmProcessingClient(МассивОбработанныхОбъектXDTO, Выборка.Ссылка.УникальныйИдентификатор(), Выборка.BIR);
			КонецЕсли;
		КонецЦикла;
	Исключение
		Инфо = ИнформацияОбОшибке();
		ЗаписьЖурналаРегистрации(
		"КорпЗагрузкаДанных.ЗагрузитьСтатусыVIN",
		УровеньЖурналаРегистрации.Ошибка,,,
		ПодробноеПредставлениеОшибки(Инфо));
		ВызватьИсключение;
	КонецПопытки;	
КонецПроцедуры

Процедура ЗагрузитьТаблицуКорпСкидок () Экспорт
	Попытка	
		УстановитьПривилегированныйРежим(Истина);
		Отказ = ложь;
		Сервер = СтрокаСоединенияИнформационнойБазы();

		Выборка = Справочники.CRM_ДилерскиеЦентры.Выбрать();
		Пока Выборка.Следующий() Цикл
			Если Выборка.Бренд = Справочники.CRM_МаркаАвтомобиля.LADA Тогда
			ПараметрыЗапроса = Новый Структура();
			ПараметрыЗапроса.Вставить("Server", Сервер);
			ПараметрыЗапроса.Вставить("idDealer", Строка(Выборка.Ссылка.УникальныйИдентификатор()));
			ТелоЗапроса = Renault_ОбщиеФункцииСервер.ПолучитьСтрокуJSONИзXDTO(СериализаторXDTO.ЗаписатьXDTO(ПараметрыЗапроса));
			
			Настройки = DMS_ОбщиеПовторныеФункции.ПараметрыHTTPСоединения(,?(Не ЗначениеЗаполнено(Выборка.Бренд),ПараметрыСеанса.DMS_Бренд, Выборка.Бренд));
			ОтветHTTP = ВыполнитьPOSTЗапрос(ТелоЗапроса, Настройки, "/hs/Fleet/DiscountList");
			Если ОтветHTTP.КодСостояния <> 200 Тогда
				Продолжить;
			КонецЕсли;
			
			ТаблицаДанных = Renault_ОбщиеФункцииСервер.ПолучитьЗначениеИзJSON(ОтветHTTP.ПолучитьТелоКакСтроку());
		Иначе
			Прокси = RenaultFlotte_ОбщегоНазначения.ПолучитьПрокси();
			ОбъектXDTO = Прокси.GetDiscountList(Выборка.Ссылка.УникальныйИдентификатор(), Сервер);
			Сериализатор = Новый СериализаторXDTO(ФабрикаXDTO);
			ТаблицаДанных = Сериализатор.ПрочитатьXDTO(ОбъектXDTO);
		КонецЕсли;
			МассивОбработанных = Новый Массив;
			Для Каждого Пакет из ТаблицаДанных Цикл
				ДвоичныеДанныеФайла = Пакет.Данные.Получить();
				ИмяВременногоФайла = ПолучитьИмяВременногоФайла("xml");
				ДвоичныеДанныеФайла.Записать(ИмяВременногоФайла);
				ЧтениеXML = Новый ЧтениеXML;
				ЧтениеXML.ОткрытьФайл(ИмяВременногоФайла);
				ЧтениеXML.Прочитать();
				ЧтениеXML.Прочитать(); // пропуск тэга Message
				Пока ЧтениеXML.ТипУзла = ТипУзлаXML.НачалоЭлемента Цикл

					Таблица = СериализаторXDTO.ПрочитатьXML(ЧтениеXML);
					Таблица.Колонки.Добавить("Модель", Новый ОписаниеТипов("СправочникСсылка.Модели"));
					Таблица.Колонки.Добавить("Комплектация", Новый ОписаниеТипов("СправочникСсылка.ВариантыКомплектации"));

					Для Каждого СтрокаТЗ из Таблица Цикл                                     
						Модель = Справочники.Модели.НайтиПоРеквизиту("Артикул", СтрокаТЗ.МодельАртикул);
						Если Не ЗначениеЗаполнено(Модель) Тогда
							Отказ = Истина;
							Возврат;
						КонецЕсли;
						Комплектация = Справочники.ВариантыКомплектации.НайтиПоРеквизиту("Артикул", СтрокаТЗ.КомплектацияАртикул,,Модель);
						Если не ЗначениеЗаполнено(Комплектация) Тогда
							Отказ = Истина;
							Возврат;
						КонецЕсли;
						СтрокаТЗ.Модель = Модель;
						СтрокаТЗ.Комплектация = Комплектация;
					КонецЦикла;
					НаборЗаписи = РегистрыСведений.Renault_КорпоративныеСкидки.СоздатьНаборЗаписей();
					НаборЗаписи.Отбор.Модель.Установить(СтрокаТЗ.Модель);
					НаборЗаписи.Отбор.Период.Установить(СтрокаТЗ.Период);
					НаборЗаписи.Загрузить(Таблица);
					НаборЗаписи.Записать();	

				КонецЦикла;
				ЧтениеXML.Закрыть();
				УдалитьФайлы(ИмяВременногоФайла);
				Если Не Отказ Тогда
					МассивОбработанных.Добавить(Пакет.МоментВремени);
				КонецЕсли;		
			КонецЦикла;
			Если Выборка.Бренд = Справочники.CRM_МаркаАвтомобиля.LADA Тогда
				ПараметрыЗапроса = Новый Структура();
				ПараметрыЗапроса.Вставить("Array", МассивОбработанных);
				ПараметрыЗапроса.Вставить("idDealer", Строка(Выборка.Ссылка.УникальныйИдентификатор()));
				ЗаписьJSON = Новый ЗаписьJSON();
				ЗаписьJSON.УстановитьСтроку();
				ЗаписатьJSON(ЗаписьJSON, ПараметрыЗапроса);
				ТелоЗапроса = ЗаписьJSON.Закрыть();			
				ВыполнитьPOSTЗапрос(ТелоЗапроса, Настройки, "/hs/Fleet/ConfirmProcessingClient");
			Иначе
				МассивОбработанныхОбъектXDTO = Сериализатор.ЗаписатьXDTO(МассивОбработанных);
				Прокси.ConfirmProcessingClient(МассивОбработанныхОбъектXDTO, Выборка.Ссылка.УникальныйИдентификатор(), Выборка.BIR);
			КонецЕсли;
			
		КонецЦикла;
	Исключение
		Инфо = ИнформацияОбОшибке();
		ЗаписьЖурналаРегистрации(
		"КорпЗагрузкаДанных.ЗагрузитьТаблицуКорпСкидок",
		УровеньЖурналаРегистрации.Ошибка,,,
		ПодробноеПредставлениеОшибки(Инфо));
		ВызватьИсключение;
	КонецПопытки;
КонецПроцедуры

Функция ЗагрузитьСтатусVIN (ОбъектXDTO)
	
	Автомобиль = Справочники.Автомобили.НайтиПоРеквизиту("VIN", ОбъектXDTO.VIN);
	Если не ЗначениеЗаполнено(Автомобиль) Тогда
		Возврат Истина;
	КонецЕсли;
	
	Заявка = Документы.Renault_ЗаявкаНаКорпоративнуюСкидку.ПолучитьСсылку(Новый УникальныйИдентификатор(ОбъектXDTO.idRequest));
	ЗаявкаОбъект = Заявка.ПолучитьОбъект();
	Если ЗаявкаОбъект = Неопределено Тогда
		Возврат Истина;
	КонецЕсли;
	
	НаборЗаписи = РегистрыСведений.Renault_СостоянияVINВЗаявках.СоздатьНаборЗаписей();
	НаборЗаписи.Отбор.Заявка.Установить(Заявка);
	НаборЗаписи.Отбор.VIN.Установить(Автомобиль);
	СтрокаНабора = НаборЗаписи.Добавить();
	СтрокаНабора.VIN = Автомобиль;
	СтрокаНабора.Заявка = Заявка;
	СтрокаНабора.Статус = Перечисления.Renault_СостоянияСогласованияКорпСкидок[ОбъектXDTO.Status];
	
	ДанныеСкидки = ?(ОбъектXDTO.Свойство("discountInfo"), ОбъектXDTO.discountInfo, Неопределено);
	Если ДанныеСкидки <> Неопределено Тогда
		Для Каждого СтрокаТаблицы Из ЗаявкаОбъект.ТаблицаВИН Цикл
			Если СтрокаТаблицы.ВИН = ОбъектXDTO.VIN Тогда
				ЗаполнитьЗначенияСвойств(СтрокаТаблицы, ДанныеСкидки,, "Автомобиль");
				Прервать;
			КонецЕсли;
		КонецЦикла;
		ЗаявкаОбъект.Записать();
	КонецЕсли;
	
	//@++ Васильев ВА
	ИсточникДанных = Перечисления.Renault_ИсточникДанныхЗаявкиНаКорпоративнуюСкидку.Renault;
	CRM_Сервер.ВыполнитьДвиженияДокументаRenault_ЗаявкаНаКорпоративнуюСкидку(ЗаявкаОбъект.Ссылка, ИсточникДанных);
	//@++ 
	
	Попытка
		НаборЗаписи.Записать();
		Renault_СообщенияПользователям.ПослатьСообщениеПользователю(
			Справочники.Renault_ВидСообщения.Корп_ИзменениеСтатусаЗаявкиНаVIN,
			Заявка.Автор,
			"Статус корп. VIN " + Автомобиль + " изменился на " + Перечисления.Renault_СостоянияСогласованияКорпСкидок[ОбъектXDTO.Status],
			Автомобиль.VIN);
	Исключение
		Возврат Истина;
		Инфо = ИнформацияОбОшибке();
			ЗаписьЖурналаРегистрации(
				"Загрузка заявок на корпоративную скидку",
				УровеньЖурналаРегистрации.Ошибка,,,
				ПодробноеПредставлениеОшибки(Инфо));
	КонецПопытки;
	
	Возврат Ложь;
	
КонецФункции

Процедура ЗагрузитьЗаявкиНаСкидку () Экспорт
	Попытка
		УстановитьПривилегированныйРежим(Истина);
		
		Сервер = СтрокаСоединенияИнформационнойБазы();
		Выборка = Справочники.CRM_ДилерскиеЦентры.Выбрать();
		Пока Выборка.Следующий() Цикл
			ПараметрыЗапроса = Новый Структура();
			ПараметрыЗапроса.Вставить("Server", Сервер);
			ПараметрыЗапроса.Вставить("idDealer", Строка(Выборка.Ссылка.УникальныйИдентификатор()));
			Если Выборка.Бренд = Справочники.CRM_МаркаАвтомобиля.LADA Тогда
				ЗаписьJSON = Новый ЗаписьJSON();
				ЗаписьJSON.УстановитьСтроку();
				ЗаписатьJSON(ЗаписьJSON, ПараметрыЗапроса);
				ТелоЗапроса = ЗаписьJSON.Закрыть();
				
				Настройки = DMS_ОбщиеПовторныеФункции.ПараметрыHTTPСоединения(,?(Не ЗначениеЗаполнено(Выборка.Бренд),ПараметрыСеанса.DMS_Бренд, Выборка.Бренд));

				ОтветHTTP = ВыполнитьPOSTЗапрос(ТелоЗапроса, Настройки, "/hs/Fleet/DiscountCenter");
				Если ОтветHTTP.КодСостояния <> 200 Тогда
					Продолжить;
				КонецЕсли;
				
				ТаблицаДанных = Renault_ОбщиеФункцииСервер.ПолучитьЗначениеИзJSON(ОтветHTTP.ПолучитьТелоКакСтроку());
			Иначе
				Прокси = RenaultFlotte_ОбщегоНазначения.ПолучитьПрокси();
				ОбъектXDTO = Прокси.GetDiscountCenter(Выборка.Ссылка.УникальныйИдентификатор(), Сервер);
				ТаблицаДанных = СериализаторXDTO.ПрочитатьXDTO(ОбъектXDTO);
			КонецЕсли;
			
			МассивОбработанных = Новый Массив;
			Для Каждого Пакет из ТаблицаДанных Цикл				
				ДвоичныеДанныеФайла = Пакет.Данные.Получить();
				ИмяВременногоФайла = ПолучитьИмяВременногоФайла("xml");
				ДвоичныеДанныеФайла.Записать(ИмяВременногоФайла);
				ЧтениеXML = Новый ЧтениеXML;
				ЧтениеXML.ОткрытьФайл(ИмяВременногоФайла);
				ЧтениеXML.Прочитать();
				ЧтениеXML.Прочитать(); // пропуск тэга Message
				Пока ЧтениеXML.ТипУзла = ТипУзлаXML.НачалоЭлемента Цикл
					ТипXDTO = ФабрикаXDTO.Тип(Пакет.ПространствоИменДанных, ЧтениеXML.Имя);
					ОбъектXDTO = ФабрикаXDTO.ПрочитатьXML(ЧтениеXML, ТипXDTO); 
					Отказ = ЗагрузитьЗаявкуНаСкидкуСтруктура(ОбъектXDTO);
				КонецЦикла;
				ЧтениеXML.Закрыть();
				УдалитьФайлы(ИмяВременногоФайла);
				Если Не Отказ Тогда
					МассивОбработанных.Добавить(Пакет.МоментВремени);
				КонецЕсли;

			КонецЦикла;
		Если Выборка.Бренд = Справочники.CRM_МаркаАвтомобиля.LADA Тогда
			ПараметрыЗапроса = Новый Структура();
			ПараметрыЗапроса.Вставить("Array", МассивОбработанных);
			ПараметрыЗапроса.Вставить("idDealer", Строка(Выборка.Ссылка.УникальныйИдентификатор()));
			ЗаписьJSON = Новый ЗаписьJSON();
			ЗаписьJSON.УстановитьСтроку();
			ЗаписатьJSON(ЗаписьJSON, ПараметрыЗапроса);
			ТелоЗапроса = ЗаписьJSON.Закрыть();
			
			ВыполнитьPOSTЗапрос(ТелоЗапроса, Настройки, "/hs/Fleet/ConfirmProcessingClient");
		Иначе
			Если Прокси = Неопределено Тогда 
				Прокси = RenaultFlotte_ОбщегоНазначения.ПолучитьПрокси();;
			КонецЕсли;
			
			МассивОбработанныхОбъектXDTO = СериализаторXDTO.ЗаписатьXDTO(МассивОбработанных);
			Прокси.ConfirmProcessingClient(МассивОбработанныхОбъектXDTO,Выборка.Ссылка.УникальныйИдентификатор(), Выборка.BIR);
		КонецЕсли;
		КонецЦикла;
	Исключение
		Инфо = ИнформацияОбОшибке();
		ЗаписьЖурналаРегистрации(
		"КорпЗагрузкаДанных.ЗагрузитьЗаявкиНаСкидку",
		УровеньЖурналаРегистрации.Ошибка,,,
		ПодробноеПредставлениеОшибки(Инфо));
		ВызватьИсключение;
	КонецПопытки;

КонецПроцедуры

Функция ЗагрузитьЗаявкуНаСкидку(ОбъектXDTO)
	
	ТаблицаАвтомобилей = Новый ТаблицаЗначений;
	КвалификаторСтроки = Новый КвалификаторыСтроки(17);
	ТаблицаАвтомобилей.Колонки.Добавить("ВИН", Новый ОписаниеТипов("Строка",,КвалификаторСтроки));
	ТаблицаАвтомобилей.Колонки.Добавить("Автомобиль", Новый ОписаниеТипов("СправочникСсылка.Автомобили"));
	ТаблицаАвтомобилей.Колонки.Добавить("ПроцентСкидки", Новый ОписаниеТипов("Число"));
	ТаблицаАвтомобилей.Колонки.Добавить("ДанныеАвтомобиля", Новый ОписаниеТипов("ХранилищеЗначения"));
	ТаблицаАвтомобилей.Колонки.Добавить("ВВодитьРезерв", Новый ОписаниеТипов("Булево"));
	ТаблицаНовыйхАвтомобилей = Неопределено;
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Контрагенты.Ссылка
	|ИЗ
	|	Справочник.Контрагенты КАК Контрагенты
	|ГДЕ
	|	Контрагенты.ИНН = &ИНН
	|	И Контрагенты.ПометкаУдаления = ЛОЖЬ";
	Запрос.УстановитьПараметр("ИНН", ОбъектXDTO.INNClient);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Контрагент = Выборка.Ссылка;
	Иначе
		Возврат Истина;
	КонецЕсли;
	Клиент = Справочники.Renault_КорпоративныеКлиенты.НайтиПоРеквизиту("Контрагент", Контрагент);
	Если Клиент = Справочники.Renault_КорпоративныеКлиенты.ПустаяСсылка() Тогда
		Возврат Истина;
	КонецЕсли;
	
	Заявка = Документы.Renault_ЗаявкаНаКорпоративнуюСкидку.ПолучитьСсылку(Новый УникальныйИдентификатор(ОбъектXDTO.idRequest));
	ЗаявкаОбъект = Заявка.ПолучитьОбъект();
	Если ЗаявкаОбъект = Неопределено Тогда 
		ЗаявкаОбъект = Документы.Renault_ЗаявкаНаКорпоративнуюСкидку.СоздатьДокумент();
		ЗаявкаОбъект.УстановитьСсылкуНового(Заявка);
	КонецЕсли;
	
	ЗаявкаОбъект.Клиент = Клиент;
	ЗаявкаОбъект.Кузовостроитель = Справочники.Renault_Кузовостроители.ПолучитьСсылку(Новый УникальныйИдентификатор(ОбъектXDTO.Bodybuilding));
	ЗаявкаОбъект.ЛизинговаяКомпания = Справочники.Renault_ЛизинговыеКомпании.ПолучитьСсылку(Новый УникальныйИдентификатор(ОбъектXDTO.LeasingCompany));
	ЗаявкаОбъект.ТипЗаявки = Перечисления.Renault_ТипыЗаявокНаКорпоротивнуюСкидку[ОбъектXDTO.TypeRequest];
	ЗаявкаОбъект.ТипОтгрузки = Перечисления.Renault_ТипыОтгрузокНаКорпоративнуюСкидку[ОбъектXDTO.TypeShipping];
	ЗаявкаОбъект.Автор = ПараметрыСеанса.Пользователь;
	ЗаявкаОбъект.Дата = ТекущаяДата();
	ЗаявкаОбъект.УстановитьНовыйНомер();
	
	ЗаявкаОбъект.ТаблицаВИН.Очистить();
	НаборЗаписи = РегистрыСведений.Renault_СостоянияVINВЗаявках.СоздатьМенеджерЗаписи();
	Для Каждого СтрокаXDTO из ОбъектXDTO.TableVIN Цикл
		СтрокаТЗ = ТаблицаАвтомобилей.Добавить();
		СтрокаТЗ.Автомобиль = Справочники.Автомобили.НайтиПоРеквизиту("VIN",СтрокаXDTO.VIN);
		СтрокаТЗ.ВИН = СтрокаXDTO.VIN;
		СтрокаТЗ.ПроцентСкидки = СтрокаXDTO.SizeDiscounts;
		Сериализатор = Новый СериализаторXDTO(ФабрикаXDTO);
		сДанных = Сериализатор.ПрочитатьXDTO(СтрокаXDTO.DataVin);
		СтрокаТЗ.ДанныеАвтомобиля = Новый ХранилищеЗначения(сДанных);
	КонецЦикла;
	ТаблицаАвтомобилей.ЗаполнитьЗначения(Истина,"ВВодитьРезерв");
	Отбор = Новый Структура;
	Отбор.Вставить("Автомобиль", Справочники.Автомобили.ПустаяСсылка());
	мНовыйхАвтомобилей = ТаблицаАвтомобилей.НайтиСтроки(Отбор);
	Если мНовыйхАвтомобилей.Количество() > 0 Тогда
		Для Каждого строкаНовАвтомобиль из мНовыйхАвтомобилей Цикл
			Если ТаблицаНовыйхАвтомобилей = Неопределено Тогда
				ТаблицаНовыйхАвтомобилей = Новый ТаблицаЗначений;
				сАвтомобиля = строкаНовАвтомобиль.ДанныеАвтомобиля.Получить();
				Для Каждого строкаСоответствия из сАвтомобиля Цикл
					ТаблицаНовыйхАвтомобилей.Колонки.Добавить(строкаСоответствия.Ключ);
				КонецЦикла;
			КонецЕсли;
			сАвтомобиля = строкаНовАвтомобиль.ДанныеАвтомобиля.Получить();
			СтрокаНовАвтомобиля = ТаблицаНовыйхАвтомобилей.Добавить();
			Для Каждого строкаСоответствия из сАвтомобиля Цикл
				СтрокаНовАвтомобиля[строкаСоответствия.Ключ] = строкаСоответствия.Значение;
			КонецЦикла;
		КонецЦикла;
		Renault_ЗагрузкаДанныхОбАвтомобиляхПроизводителя.ЗагрузитьДанныеВИБ(ТаблицаНовыйхАвтомобилей);
		//т.к. в массиве "мНовыйхАвтомобилей" хранятся ссылки на строки таблицы "ТаблицаАвтомобилей", то для заполниния не найденых автомобилей 
		//в таблице "ТаблицаАвтомобилей" используем массив "мНовыйхАвтомобилей"
		Для Каждого строкаНовАвтомобиль из мНовыйхАвтомобилей Цикл
			строкаНовАвтомобиль.Автомобиль = Справочники.Автомобили.НайтиПоРеквизиту("VIN",строкаНовАвтомобиль.ВИН); 
		КонецЦикла;
	КонецЕсли;
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ТаблицаАвтомобилей.ВИН,
	|	ТаблицаАвтомобилей.Автомобиль,
	|	ТаблицаАвтомобилей.ПроцентСкидки
	|ПОМЕСТИТЬ ВТ_Автомобилей
	|ИЗ
	|	&ТаблицаАвтомобилей КАК ТаблицаАвтомобилей
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Автомобилей.ВИН,
	|	ВТ_Автомобилей.Автомобиль,
	|	ВТ_Автомобилей.ПроцентСкидки,
	|	ЕСТЬNULL(CRM_СостояниеАвтомобилейПроизводителя_v2.ЦенаПродажиБаза, 0) + ЕСТЬNULL(CRM_СостояниеАвтомобилейПроизводителя_v2.ЦенаПродажиОпции, 0) КАК ЦенаPVC,
	|	ВЫБОР
	|		КОГДА CRM_СостояниеАвтомобилейПроизводителя_v2.ЦенаПродажиАвтомобиля ЕСТЬ NULL 
	|			ТОГДА 0
	|		ИНАЧЕ (CRM_СостояниеАвтомобилейПроизводителя_v2.ЦенаПродажиБаза + CRM_СостояниеАвтомобилейПроизводителя_v2.ЦенаПродажиОпции) * (100 - ВТ_Автомобилей.ПроцентСкидки) / 100
	|	КОНЕЦ КАК ЦенаFlotte
	|ИЗ
	|	ВТ_Автомобилей КАК ВТ_Автомобилей
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.CRM_СостояниеАвтомобилейПроизводителя_v2 КАК CRM_СостояниеАвтомобилейПроизводителя_v2
	|		ПО ВТ_Автомобилей.ВИН = CRM_СостояниеАвтомобилейПроизводителя_v2.VIN";
	Запрос.УстановитьПараметр("ТаблицаАвтомобилей", ТаблицаАвтомобилей);
	Результат = Запрос.Выполнить().Выгрузить();
		
	ЗаявкаОбъект.ТаблицаВИН.Загрузить(Результат);
	
	ЗаявкаОбъект.Записать();
	
	//@++ Васильев ВА
	ИсточникДанных = Перечисления.Renault_ИсточникДанныхЗаявкиНаКорпоративнуюСкидку.Renault;
	CRM_Сервер.ВыполнитьДвиженияДокументаRenault_ЗаявкаНаКорпоративнуюСкидку(ЗаявкаОбъект.Ссылка, ИсточникДанных);
	//@++
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Renault_УтвержденныеРезервы.Регистратор,
	|	Renault_УтвержденныеРезервы.НомерСтроки,
	|	Renault_УтвержденныеРезервы.Активность,
	|	Renault_УтвержденныеРезервы.VIN,
	|	Renault_УтвержденныеРезервы.Автомобиль,
	|	Renault_УтвержденныеРезервы.Менеджер,
	|	Renault_УтвержденныеРезервы.Комментарий,
	|	Renault_УтвержденныеРезервы.Автор,
	|	Renault_УтвержденныеРезервы.Контролер,
	|	Renault_УтвержденныеРезервы.РабочийЛист,
	|	Renault_УтвержденныеРезервы.SedreNum,
	|	Renault_УтвержденныеРезервы.Клиент
	|ИЗ
	|	РегистрСведений.Renault_УтвержденныеРезервы КАК Renault_УтвержденныеРезервы
	|ГДЕ
	|	Renault_УтвержденныеРезервы.VIN в (&VIN)";
	
	Запрос.УстановитьПараметр("VIN", ТаблицаАвтомобилей.ВыгрузитьКолонку("ВИН"));
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	Пока Выборка.Следующий() Цикл
		СтрокаТЗАвтомобилей = ТаблицаАвтомобилей.Найти(Выборка.VIN, "ВИН");
		Если СтрокаТЗАвтомобилей <> Неопределено Тогда
			СтрокаТЗАвтомобилей.ВВодитьРезерв = Ложь;
		КонецЕсли;
	КонецЦикла;
	
	Для Каждого СтрокаТЗАвтомобилей из ТаблицаАвтомобилей Цикл
		Менеджер = РегистрыСведений.Renault_СостоянияVINВЗаявках.СоздатьМенеджерЗаписи();
		Менеджер.VIN = СтрокаТЗАвтомобилей.Автомобиль;
		Менеджер.Заявка = ЗаявкаОбъект.Ссылка;
		Менеджер.Статус = Перечисления.Renault_СостоянияСогласованияКорпСкидок.Согласован;
		Менеджер.Записать();
		
		Если СтрокаТЗАвтомобилей.ВВодитьРезерв Тогда
			
			НомерРабочегоЛистаРезерва = ПолучитьСоздатьРабочийЛист(ЗаявкаОбъект.Клиент);
			
			НовЗаявка = Документы.Renault_РезервированиеАвтомобилей.СоздатьДокумент();
			
			НовЗаявка.VIN = СтрокаТЗАвтомобилей.ВИН;
			НовЗаявка.Автомобиль = СтрокаТЗАвтомобилей.Автомобиль;
			НовЗаявка.Дата = ТекущаяДата();
			НовЗаявка.Автор = ПараметрыСеанса.Пользователь;
			НовЗаявка.Менеджер = ПараметрыСеанса.Пользователь.Сотрудник;
			НовЗаявка.Клиент = ЗаявкаОбъект.Клиент.Контрагент;
			НовЗаявка.РабочийЛист = НомерРабочегоЛистаРезерва;
			НовЗаявка.СтатусРезерва = Перечисления.CRM_СтатусыРезервовАвтомобилей.ЗаявкаНаРезерв;
			НовЗаявка.ДатаСнятияРезерва = ТекущаяДата() + 3*60*60*24;;
			
			НовЗаявка.Записать(РежимЗаписиДокумента.Проведение);
		КонецЕсли;
	КонецЦикла;
	
	Возврат Ложь;
КонецФункции

Функция ПолучитьСоздатьРабочийЛист (Клиент)
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	Renault_РабочиеЛисты.IDK
	|ИЗ
	|	РегистрСведений.Renault_РабочиеЛисты КАК Renault_РабочиеЛисты
	|ГДЕ
	|	Renault_РабочиеЛисты.Клиент.Ссылка = &Ссылка
	|	И Renault_РабочиеЛисты.ЛистЗакрыт = ЛОЖЬ
	|	И Renault_РабочиеЛисты.ЗапросНаЗакрытие = ЛОЖЬ
	|
	|УПОРЯДОЧИТЬ ПО
	|	Renault_РабочиеЛисты.Важность УБЫВ,
	|	Renault_РабочиеЛисты.ДатаID УБЫВ";
	Запрос.УстановитьПараметр("Ссылка", Клиент.Контрагент);
	Результат = Запрос.Выполнить();
	Если Не Результат.Пустой() Тогда
		Выборка = Результат.Выбрать();
		Выборка.Следующий();
		Возврат Выборка.IDK;
	КонецЕсли;
	
	ТрафикУпущен = Ложь;
	ЕстьЗамечаниеМенеджеру = Ложь;
	МенеджерЗаменен = Ложь;
	СоздаемРЛ = Не ТрафикУпущен;
	ЕстьТД = Ложь;
	Отдел = Renault_РаботаСПравамиПользователя.ОтделПоУмолчанию(ПараметрыСеанса.Пользователь);
	ОтделАвтосалона = Renault_CRM.ПолучитьОтделАвтосалона();
	ВОтделПродаж = (Отдел = ОтделАвтосалона);
	////////////////////////////////////////////////
	//Фиксация НОВОГО трафика
	
	ЗаписьТрафик = РегистрыСведений.Renault_Трафик.СоздатьМенеджерЗаписи();
	
	ЗаписьТрафик.Период = ТекущаяДата();
	ИДТрафика = Новый УникальныйИдентификатор();
	ЗаписьТрафик.ТипТрафика = Справочники.CRM_ТипТрафика.ЛидКорпоратRenault;
	ЗаписьТрафик.Идентификатор = ИДТрафика;
	ЗаписьТрафик.Менеджер = ПараметрыСеанса.Пользователь.Сотрудник;
	ЗаписьТрафик.Администратор = ПараметрыСеанса.Пользователь.Сотрудник;
	ЗаписьТрафик.Отдел = Отдел;
	ЗаписьТрафик.Клиент = Клиент.Контрагент;
	//ЗаписьТрафик.ПервичныйИнтерес = Модель;
	//ЗаписьТрафик.ИсточникИнформации = ИсточникИнформации;
	ЗаписьТрафик.ПервичныйПовторный = Перечисления.CRM_ПервичныйПовторный.Первичный;
	ЗаписьТрафик.Представление = Клиент.Наименование;
	ЗаписьТрафик.Обработан = Истина;
	//ЗаписьТрафик.Комментарий = Комментарий;
	ЗаписьТрафик.ДилерскийЦентр = Отдел.ДилерскийЦентр;
	
	ЗаписьТрафик.Записать();
		
	//Фиксация НОВОГО трафика
	////////////////////////////////////////////////
		
	////////////////////////////////////////////////
	//создание рабочего листа
		
	ЗаписьРЛ = Renault_CRM.СоздатьРабочийЛистПоТрафику(ЗаписьТрафик.Идентификатор);
	Возврат ЗаписьРЛ.IDK;
КонецФункции

//Андрианова 02.03.2017
//Функция формирует таблицу значений с заявками на скидку
//замена функции СформироватьПакетЗаявкиНаСкидку
Функция СформироватьСтруктуруЗаявкиНаСкидку (СтрокаВыборки)
	
	Попытка
		Заявка = СтрокаВыборки.Ссылка;
		ТаблицаVIN = Заявка.ТаблицаВИН.Выгрузить();
		Статус = Перечисления.Renault_СостоянияСогласованияКорпСкидок.НаСогласовании;
	Исключение
		Если СтрокаВыборки.Количество () > 0 Тогда
			СтрокаНабора = СтрокаВыборки[0];
			Заявка = СтрокаНабора.Заявка.Ссылка;
			ТаблицаVIN = Заявка.ТаблицаВИН.НайтиСтроки(Новый Структура("Автомобиль", СтрокаНабора.VIN));
			Статус = СтрокаНабора.Статус;
		КонецЕсли;
	КонецПопытки;
	
	ТаблицаДанных = Новый Структура;
	
	ТаблицаДанных.Вставить("Server", СтрокаСоединенияИнформационнойБазы());	
	ТаблицаДанных.Вставить("INNClient",Заявка.Клиент.Контрагент.ИНН);	
	ТаблицаДанных.Вставить("TypeRequest", Метаданные.Перечисления.Renault_ТипыЗаявокНаКорпоротивнуюСкидку.ЗначенияПеречисления[
										Перечисления.Renault_ТипыЗаявокНаКорпоротивнуюСкидку.Индекс(Заявка.ТипЗаявки)].Имя);
	ТаблицаДанных.Вставить("TypeShipping", Метаданные.Перечисления.Renault_ТипыОтгрузокНаКорпоративнуюСкидку.ЗначенияПеречисления[
										Перечисления.Renault_ТипыОтгрузокНаКорпоративнуюСкидку.Индекс(Заявка.ТипОтгрузки)].Имя);
	ТаблицаДанных.Вставить("Bodybuilding", Заявка.Кузовостроитель.УникальныйИдентификатор());
	ТаблицаДанных.Вставить("BodybuildingName", Заявка.Кузовостроитель.Наименование);	
	ТаблицаДанных.Вставить("LeasingCompany", Заявка.ЛизинговаяКомпания.УникальныйИдентификатор());
	ТаблицаДанных.Вставить("LeasingCompanyName", Заявка.ЛизинговаяКомпания.Наименование);
	ТаблицаДанных.Вставить("Address", Заявка.Адрес);
	ТаблицаДанных.Вставить("idRequest", Заявка.УникальныйИдентификатор());
	Настройки = Renault_РаботаСПравамиПользователя.ПолучитьСписокПрав(Заявка.Автор);
	ТаблицаДанных.Вставить("idDealerCentre", Настройки.ДилерскийЦентр.УникальныйИдентификатор());
	ТаблицаДанных.Вставить("BIR",	            Настройки.ДилерскийЦентр.BIR);
	
	Запрос = Новый Запрос;
	
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	КартинкиИФайлы.Объект,
		|	КартинкиИФайлы.Идентификатор,
		|	КартинкиИФайлы.ИмяФайла,
		|	КартинкиИФайлы.Данные,
		|	КартинкиИФайлы.ДанныеВоВнешнемФайле,
		|	КартинкиИФайлы.Комментарий
		|ИЗ
		|	РегистрСведений.Renault_КартинкиИФайлы КАК КартинкиИФайлы
		|ГДЕ
		|	КартинкиИФайлы.Объект = &Объект";
	
	Запрос.УстановитьПараметр("Объект",Заявка);
	
	Результат = Запрос.Выполнить().Выгрузить();
	
	Отбор = Новый Структура;
	
	Отбор.Вставить("Идентификатор", "Заявка на корпоративную скидку");
	
	ДанныеЗаявки = Результат.НайтиСтроки(Отбор);
	
	Если ДанныеЗаявки.Количество() > 0 Тогда
		
		ТаблицаКартинок = Новый ТаблицаЗначений;
		ТаблицаКартинок.Колонки.Добавить("data");
		ТаблицаКартинок.Колонки.Добавить("coment");
		ТаблицаКартинок.Колонки.Добавить("name");
		ТаблицаКартинок.Колонки.Добавить("type");
		ТаблицаКартинок.Колонки.Добавить("hash");
	
		для х = 0 по ДанныеЗаявки.Количество() - 1 Цикл
			
			НовСтрокаКартинка = ТаблицаКартинок.Добавить();

			Данные = ДанныеЗаявки[х].Данные;
			ИмяФайла = рфПолучитьИмяФайлаИзПолногоИмени (ДанныеЗаявки[х].ИмяФайла);
			Расширение = рфПолучитьРасширениеФайла(ИмяФайла); 
			НовСтрокаКартинка.data = Данные; 
			НовСтрокаКартинка.coment = ДанныеЗаявки[х].Комментарий;
			НовСтрокаКартинка.name = СтрЗаменить(ИмяФайла, "."+ Расширение, ""); 
			НовСтрокаКартинка.type = Расширение;
			Хэш = ПолучитьХэш(Данные);  
			НовСтрокаКартинка.hash = Хэш;		
					
		КонецЦикла; 
		
		ТаблицаДанных.Вставить("DataTable", Новый ХранилищеЗначения(ТаблицаКартинок));
		
	КонецЕсли;
	
	ТаблицаАвто = Новый ТаблицаЗначений;
	ТаблицаАвто.Колонки.Добавить("VIN");
	ТаблицаАвто.Колонки.Добавить("SizeDiscounts");
	ТаблицаАвто.Колонки.Добавить("status");
	ТаблицаАвто.Колонки.Добавить("type");
	ТаблицаАвто.Колонки.Добавить("hash");
	ТаблицаАвто.Колонки.Добавить("DataTable");
	
	Для Каждого СтрокаVIN из ТаблицаVIN Цикл
		
		НовСтрокаVIN = ТаблицаАвто.Добавить();
		
		НовСтрокаVIN.VIN = СтрокаVIN.ВИН;
		НовСтрокаVIN.SizeDiscounts = СтрокаVIN.ПроцентСкидки;
		НовСтрокаVIN.status = Метаданные.Перечисления.Renault_СостоянияСогласованияКорпСкидок.ЗначенияПеречисления[
										Перечисления.Renault_СостоянияСогласованияКорпСкидок.Индекс(Статус)].Имя;
		Отбор = Новый Структура;
		Отбор.Вставить("Идентификатор", СтрокаVIN.ВИН);
		ДанныеЗаявки = Результат.НайтиСтроки(Отбор);
		
		Если ДанныеЗаявки.Количество() > 0 Тогда
			
			TableVIN = Новый ТаблицаЗначений;
			TableVIN.Колонки.Добавить("data");
			TableVIN.Колонки.Добавить("coment");
			TableVIN.Колонки.Добавить("status");
			TableVIN.Колонки.Добавить("name");
			TableVIN.Колонки.Добавить("type");
			TableVIN.Колонки.Добавить("hash");

			Для х = 0 по ДанныеЗаявки.Количество() - 1 Цикл
				
				Стр = TableVIN.Добавить();
				Данныые = ДанныеЗаявки[х].Данные;
				ИмяФайла = рфПолучитьИмяФайлаИзПолногоИмени (ДанныеЗаявки[х].ИмяФайла);
				Расщирение = рфПолучитьРасширениеФайла(ИмяФайла); 
				Стр.data = Данныые; 
				Стр.coment = ДанныеЗаявки[х].Комментарий;
				Стр.name = СтрЗаменить(ИмяФайла, "."+ Расщирение, ""); 
				Стр.type = Расщирение;
				Хэш = ПолучитьХэш(Данныые);
				Стр.hash = Хэш;
				
			КонецЦикла; 
			
			НовСтрокаVIN.DataTable = Новый ХранилищеЗначения(TableVIN);

		КонецЕсли;	
		
	КонецЦикла;
	
	ТаблицаДанных.Вставить("TableVIN", Новый ХранилищеЗначения(ТаблицаАвто));
	
	Возврат СериализаторXDTO.ЗаписатьXDTO(ТаблицаДанных);
		


КонецФункции

//замена процедуры ЗагрузитьЗаявкуНаСкидку
Функция ЗагрузитьЗаявкуНаСкидкуСтруктура(ОбъектXDTO)
	
	Табл = СериализаторXDTO.ПрочитатьXDTO(ОбъектXDTO);

	ТаблицаАвтомобилей = Новый ТаблицаЗначений;
	КвалификаторСтроки = Новый КвалификаторыСтроки(17);
	ТаблицаАвтомобилей.Колонки.Добавить("ВИН", Новый ОписаниеТипов("Строка",,КвалификаторСтроки));
	ТаблицаАвтомобилей.Колонки.Добавить("Автомобиль", Новый ОписаниеТипов("СправочникСсылка.Автомобили"));
	ТаблицаАвтомобилей.Колонки.Добавить("ПроцентСкидки", Новый ОписаниеТипов("Число"));
	ТаблицаАвтомобилей.Колонки.Добавить("ДанныеАвтомобиля", Новый ОписаниеТипов("ХранилищеЗначения"));
	ТаблицаАвтомобилей.Колонки.Добавить("ВВодитьРезерв", Новый ОписаниеТипов("Булево"));
	ТаблицаНовыйхАвтомобилей = Неопределено;
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Контрагенты.Ссылка
	|ИЗ
	|	Справочник.Контрагенты КАК Контрагенты
	|ГДЕ
	|	Контрагенты.ИНН = &ИНН
	|	И Контрагенты.ПометкаУдаления = ЛОЖЬ";
	Запрос.УстановитьПараметр("ИНН", Табл.INNClient);
	Выборка = Запрос.Выполнить().Выбрать();
	Контрагент = Справочники.Контрагенты.НайтиПоКоду(1);
	//Если Выборка.Следующий() Тогда
	//	Контрагент = Выборка.Ссылка;
	//Иначе
	//	Возврат Истина;
	//КонецЕсли;
	Клиент = Справочники.Renault_КорпоративныеКлиенты.НайтиПоРеквизиту("Контрагент", Контрагент);
	//Если Клиент = Справочники.Renault_КорпоративныеКлиенты.ПустаяСсылка() Тогда
	//	Возврат Истина;
	//КонецЕсли;
	
	Заявка = Документы.Renault_ЗаявкаНаКорпоративнуюСкидку.ПолучитьСсылку(Табл.idRequest);
	ЗаявкаОбъект = Заявка.ПолучитьОбъект();
	Если ЗаявкаОбъект = Неопределено Тогда 
		ЗаявкаОбъект = Документы.Renault_ЗаявкаНаКорпоративнуюСкидку.СоздатьДокумент();
		ЗаявкаОбъект.УстановитьСсылкуНового(Заявка);
	КонецЕсли;
	
	ЗаявкаОбъект.Клиент = Клиент;
	ЗаявкаОбъект.Кузовостроитель = Справочники.Renault_Кузовостроители.ПолучитьСсылку(Табл.Bodybuilding);
	ЗаявкаОбъект.ЛизинговаяКомпания = Справочники.Renault_ЛизинговыеКомпании.ПолучитьСсылку(Табл.LeasingCompany);
	ЗаявкаОбъект.ТипЗаявки = Перечисления.Renault_ТипыЗаявокНаКорпоротивнуюСкидку[Табл.TypeRequest];
	ЗаявкаОбъект.ТипОтгрузки = Перечисления.Renault_ТипыОтгрузокНаКорпоративнуюСкидку[Табл.TypeShipping];
	ЗаявкаОбъект.Автор = ПараметрыСеанса.Пользователь;
	ЗаявкаОбъект.Дата = ТекущаяДата();
	ЗаявкаОбъект.УстановитьНовыйНомер();
	
	ЗаявкаОбъект.ТаблицаВИН.Очистить();
	НаборЗаписи = РегистрыСведений.Renault_СостоянияVINВЗаявках.СоздатьМенеджерЗаписи();
	
	Для Каждого СтрокаXDTO из Табл.TableVIN Цикл
		СтрокаТЗ = ТаблицаАвтомобилей.Добавить();
		СтрокаТЗ.Автомобиль = Справочники.Автомобили.НайтиПоРеквизиту("VIN",СтрокаXDTO.VIN);
		СтрокаТЗ.ВИН = СтрокаXDTO.VIN;
		СтрокаТЗ.ПроцентСкидки = СтрокаXDTO.SizeDiscounts;
		сДанных = СтрокаXDTO.DataVin;
		Если ЗначениеЗаполнено(сДанных) Тогда
			СтрокаТЗ.ДанныеАвтомобиля = Новый ХранилищеЗначения(сДанных);
		КонецЕсли;
	КонецЦикла;
	ТаблицаАвтомобилей.ЗаполнитьЗначения(Истина,"ВВодитьРезерв");
	Отбор = Новый Структура;
	Отбор.Вставить("Автомобиль", Справочники.Автомобили.ПустаяСсылка());
	мНовыйхАвтомобилей = ТаблицаАвтомобилей.НайтиСтроки(Отбор);
	Если мНовыйхАвтомобилей.Количество() > 0 Тогда
		Для Каждого строкаНовАвтомобиль из мНовыйхАвтомобилей Цикл
			Если ТаблицаНовыйхАвтомобилей = Неопределено Тогда
				ТаблицаНовыйхАвтомобилей = Новый ТаблицаЗначений;
				сАвтомобиля = строкаНовАвтомобиль.ДанныеАвтомобиля.Получить();
				Для Каждого строкаСоответствия из сАвтомобиля Цикл
					ТаблицаНовыйхАвтомобилей.Колонки.Добавить(строкаСоответствия.Ключ);
				КонецЦикла;
			КонецЕсли;
			сАвтомобиля = строкаНовАвтомобиль.ДанныеАвтомобиля.Получить();
			СтрокаНовАвтомобиля = ТаблицаНовыйхАвтомобилей.Добавить();
			Для Каждого строкаСоответствия из сАвтомобиля Цикл
				СтрокаНовАвтомобиля[строкаСоответствия.Ключ] = строкаСоответствия.Значение;
			КонецЦикла;
		КонецЦикла;
		Renault_ЗагрузкаДанныхОбАвтомобиляхПроизводителя.ЗагрузитьДанныеВИБ(ТаблицаНовыйхАвтомобилей);
		//т.к. в массиве "мНовыйхАвтомобилей" хранятся ссылки на строки таблицы "ТаблицаАвтомобилей", то для заполниния не найденых автомобилей 
		//в таблице "ТаблицаАвтомобилей" используем массив "мНовыйхАвтомобилей"
		Для Каждого строкаНовАвтомобиль из мНовыйхАвтомобилей Цикл
			строкаНовАвтомобиль.Автомобиль = Справочники.Автомобили.НайтиПоРеквизиту("VIN",строкаНовАвтомобиль.ВИН); 
		КонецЦикла;
	КонецЕсли;
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ТаблицаАвтомобилей.ВИН,
	|	ТаблицаАвтомобилей.Автомобиль,
	|	ТаблицаАвтомобилей.ПроцентСкидки
	|ПОМЕСТИТЬ ВТ_Автомобилей
	|ИЗ
	|	&ТаблицаАвтомобилей КАК ТаблицаАвтомобилей
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Автомобилей.ВИН,
	|	ВТ_Автомобилей.Автомобиль,
	|	ВТ_Автомобилей.ПроцентСкидки,
	|	ЕСТЬNULL(CRM_СостояниеАвтомобилейПроизводителя_v2.ЦенаПродажиБаза, 0) + ЕСТЬNULL(CRM_СостояниеАвтомобилейПроизводителя_v2.ЦенаПродажиОпции, 0) КАК ЦенаPVC,
	|	ВЫБОР
	|		КОГДА CRM_СостояниеАвтомобилейПроизводителя_v2.ЦенаПродажиАвтомобиля ЕСТЬ NULL 
	|			ТОГДА 0
	|		ИНАЧЕ (CRM_СостояниеАвтомобилейПроизводителя_v2.ЦенаПродажиБаза + CRM_СостояниеАвтомобилейПроизводителя_v2.ЦенаПродажиОпции) * (100 - ВТ_Автомобилей.ПроцентСкидки) / 100
	|	КОНЕЦ КАК ЦенаFlotte
	|ИЗ
	|	ВТ_Автомобилей КАК ВТ_Автомобилей
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.CRM_СостояниеАвтомобилейПроизводителя_v2 КАК CRM_СостояниеАвтомобилейПроизводителя_v2
	|		ПО ВТ_Автомобилей.ВИН = CRM_СостояниеАвтомобилейПроизводителя_v2.VIN";
	Запрос.УстановитьПараметр("ТаблицаАвтомобилей", ТаблицаАвтомобилей);
	Результат = Запрос.Выполнить().Выгрузить();
		
	ЗаявкаОбъект.ТаблицаВИН.Загрузить(Результат);
				
	ЗаявкаОбъект.Записать();
	
	//@++ Васильев ВА
	ИсточникДанных = Перечисления.Renault_ИсточникДанныхЗаявкиНаКорпоративнуюСкидку.Renault;
	CRM_Сервер.ВыполнитьДвиженияДокументаRenault_ЗаявкаНаКорпоративнуюСкидку(ЗаявкаОбъект.Ссылка, ИсточникДанных);
	//@++
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Renault_УтвержденныеРезервы.Регистратор,
	|	Renault_УтвержденныеРезервы.НомерСтроки,
	|	Renault_УтвержденныеРезервы.Активность,
	|	Renault_УтвержденныеРезервы.VIN,
	|	Renault_УтвержденныеРезервы.Автомобиль,
	|	Renault_УтвержденныеРезервы.Менеджер,
	|	Renault_УтвержденныеРезервы.Комментарий,
	|	Renault_УтвержденныеРезервы.Автор,
	|	Renault_УтвержденныеРезервы.Контролер,
	|	Renault_УтвержденныеРезервы.РабочийЛист,
	|	Renault_УтвержденныеРезервы.SedreNum,
	|	Renault_УтвержденныеРезервы.Клиент
	|ИЗ
	|	РегистрСведений.Renault_УтвержденныеРезервы КАК Renault_УтвержденныеРезервы
	|ГДЕ
	|	Renault_УтвержденныеРезервы.VIN в (&VIN)";
	
	Запрос.УстановитьПараметр("VIN", ТаблицаАвтомобилей.ВыгрузитьКолонку("ВИН"));
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	Пока Выборка.Следующий() Цикл
		СтрокаТЗАвтомобилей = ТаблицаАвтомобилей.Найти(Выборка.VIN, "ВИН");
		Если СтрокаТЗАвтомобилей <> Неопределено Тогда
			СтрокаТЗАвтомобилей.ВВодитьРезерв = Ложь;
		КонецЕсли;
	КонецЦикла;
	
	Для Каждого СтрокаТЗАвтомобилей из ТаблицаАвтомобилей Цикл
		Менеджер = РегистрыСведений.Renault_СостоянияVINВЗаявках.СоздатьМенеджерЗаписи();
		Менеджер.VIN = СтрокаТЗАвтомобилей.Автомобиль;
		Менеджер.Заявка = ЗаявкаОбъект.Ссылка;
		Менеджер.Статус = Перечисления.Renault_СостоянияСогласованияКорпСкидок.Согласован;
		Менеджер.Записать();
		
		Если СтрокаТЗАвтомобилей.ВВодитьРезерв Тогда
			
			НомерРабочегоЛистаРезерва = ПолучитьСоздатьРабочийЛист(ЗаявкаОбъект.Клиент);
			
			НовЗаявка = Документы.Renault_РезервированиеАвтомобилей.СоздатьДокумент();
			
			НовЗаявка.VIN = СтрокаТЗАвтомобилей.ВИН;
			НовЗаявка.Автомобиль = СтрокаТЗАвтомобилей.Автомобиль;
			НовЗаявка.Дата = ТекущаяДата();
			НовЗаявка.Автор = ПараметрыСеанса.Пользователь;
			НовЗаявка.Менеджер = ПараметрыСеанса.Пользователь.Сотрудник;
			НовЗаявка.Клиент = ЗаявкаОбъект.Клиент.Контрагент;
			НовЗаявка.РабочийЛист = НомерРабочегоЛистаРезерва;
			НовЗаявка.СтатусРезерва = Перечисления.CRM_СтатусыРезервовАвтомобилей.ЗаявкаНаРезерв;
			НовЗаявка.ДатаСнятияРезерва = ТекущаяДата() + 3*60*60*24;;
			
			НовЗаявка.Записать(РежимЗаписиДокумента.Проведение);
		КонецЕсли;
	КонецЦикла;
	
	Возврат Ложь;
КонецФункции

Функция ВыполнитьPOSTЗапрос (ТелоСообщения, Подключение, Адрес)
	
	HTTPЗапрос = Новый HTTPЗапрос();
	HTTPЗапрос.Заголовки.Вставить("Content-type", "application/json;  charset=utf-8");
	HTTPЗапрос.УстановитьТелоИзСтроки(ТелоСообщения);
	HTTPЗапрос.АдресРесурса = СтрЗаменить(Подключение.serviceName, "/hs/traffic/", "") + Адрес;
	Соединение = Новый HTTPСоединение(Подключение.URL,Подключение.port,Подключение.login,Подключение.password,,,?(Подключение.SSL, Новый ЗащищенноеСоединениеOpenSSL, Неопределено));
	
	Возврат Соединение.ОтправитьДляОбработки(HTTPЗапрос);
КонецФункции

