
&НаКлиенте
Процедура ПечатьГарантийногоТалона(Команда)
	
	Ответ = ПечатьГарантийногоТалонаНаСервере();
	Если Ответ = Неопределено Тогда
		Возврат;
	КонецЕсли;
	Если ТипЗнч(Ответ) = Тип("Строка") Тогда
		Сообщить(Ответ);
	ИначеЕсли ТипЗнч(Ответ) = Тип("ТабличныйДокумент") Тогда
		Ответ.АвтоМасштаб = Истина;
		Ответ.Напечатать(РежимИспользованияДиалогаПечати.Использовать);
	Иначе
		Сообщить("Не удалось получить гарантийный талон");
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ПечатьГарантийногоТалонаНаСервере()
	
	Если Объект.Статус <> Перечисления.DMS_СтатусыЗаявкиНаПовторнуюПечатьГТ.Согласовано Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	ПараметрыЗаявки = Новый Структура;
	ПараметрыЗаявки.Вставить("VIN", Объект.VIN);
	ПараметрыЗаявки.Вставить("ПараметрыТалона",Неопределено);
	ПараметрыЗаявки.Вставить("ЗаявкаНаПовторнуюПечать", Неопределено);

	
	ДанныеОтСервиса = Неопределено;
	ПакетДляПередачи = DMS_DataExchange.newPackage(ПараметрыЗаявки); 
 	Результат = DMS_DataExchange.sendMessage
		(DMS_ОбщиеПовторныеФункции.ПараметрыHTTPСоединения(),
		"ConsolidationHTTP",
		"DMS_GuaranteeDocs.ПолучитьТабличныйДокумент",
		ПакетДляПередачи,
		ДанныеОтСервиса);
		
	//Если Результат <> Истина или Тип(ДанныеОтСервиса) <> Тип("ТабличныйДокумент") Тогда
	//	Возврат ДанныеОтСервиса;
	//КонецЕсли;
	//           
	Возврат  ДанныеОтСервиса;	
	
КонецФункции

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Объект.Ссылка.Пустая() Тогда
		Объект.Дата = ТекущаяДата();
		Объект.Статус = Перечисления.DMS_СтатусыЗаявкиНаПовторнуюПечатьГТ.Черновик;
		Объект.Менеджер = ПараметрыСеанса.Пользователь;
		Объект.ДилерскийЦентр = ПараметрыСеанса.Renault_ПраваПользователя.ДилерскийЦентр;
	КонецЕсли;
	
	Элементы.ФормаПечатьГарантийногоТалона.Доступность = (Объект.Статус = Перечисления.DMS_СтатусыЗаявкиНаПовторнуюПечатьГТ.Согласовано);
	
	РегистрыСведений.DMS_КомментарииПоЗаявкамНаПовторнуюПечатьГТ.ОтправитьКомментарии(Объект.Ссылка);
	ИсторияКомментариев = РегистрыСведений.DMS_КомментарииПоЗаявкамНаПовторнуюПечатьГТ.ПолучитьИсториюКомментариев(Объект.Ссылка);
	Прочитать();
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	Если Объект.Статус = Перечисления.DMS_СтатусыЗаявкиНаПовторнуюПечатьГТ.Черновик Тогда
		ТекстВопроса = "Отправить заявку на согласование?";
		Ответ = Вопрос(ТекстВопроса, РежимДиалогаВопрос.ДаНет,,, "Печать дубликата ПТС");
		ОтправитьНаСогласование = Ответ = КодВозвратаДиалога.Да;
	КонецЕсли;	
	
КонецПроцедуры


&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	Если ТекущийОбъект.Статус = Перечисления.DMS_СтатусыЗаявкиНаПовторнуюПечатьГТ.Черновик
		И ОтправитьНаСогласование Тогда
		ТекущийОбъект.ДополнительныеСвойства.Вставить("ОтправитьНаСогласование", Истина);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	Если ОтправитьНаСогласование Тогда
		Документы.DMS_ЗаявкаНаСогласование.ОтправитьЗаявкуНаСогласование(ТекущийОбъект.Ссылка);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОтправитьКомментарий(Команда)
	ОтправитьКомментарийНаСервере();
	Прочитать();
КонецПроцедуры

&НаСервере
Процедура ОтправитьКомментарийНаСервере()
	
	//РегистрыСведений.DMS_КомментарииПоЗаявкамНаПовторнуюПечатьГТ.ДобавитьКомментарий(Объект.Ссылка, НовыйКомментарий);
	//РегистрыСведений.DMS_КомментарииПоЗаявкамНаПовторнуюПечатьГТ.ОтправитьКомментарии(Объект.Ссылка);
	//ИсторияКомментариев = РегистрыСведений.DMS_КомментарииПоЗаявкамНаПовторнуюПечатьГТ.ПолучитьИсториюКомментариев(Объект.Ссылка);	
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	УправлениеВидимостьюЭлементов();	
	
КонецПроцедуры

&НаКлиенте
Процедура ВидЗаявкиПриИзменении(Элемент)
	УправлениеВидимостьюЭлементов();
КонецПроцедуры

&НаКлиенте
Процедура УправлениеВидимостьюЭлементов()

	Если Объект.ВидЗаявки = ПредопределенноеЗначение("Перечисление.DMS_ВидыЗаявокНаСогласование.ПовторнаяПечатьГарантийногоТалона") Тогда
		Элементы.ФормаПечатьГарантийногоТалона.Видимость = Истина;
	Иначе
		Элементы.ФормаПечатьГарантийногоТалона.Видимость = Ложь;
	КонецЕсли;
	
КонецПроцедуры // УправлениеВидимостьюЭлементов()



