

Процедура ПередЗаписью(Отказ, Замещение)
	Если ЭтотОбъект.ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если ЭтотОбъект.Количество() = 0 Тогда
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	Renault_ContactCenter.Ссылка
		|ИЗ
		|	ПланОбмена.Renault_ContactCenter КАК Renault_ContactCenter
		|ГДЕ
		|	Renault_ContactCenter.Ссылка <> &ЭтоУзел";
		Запрос.УстановитьПараметр("ЭтоУзел", ПланыОбмена.Renault_ContactCenter.ЭтотУзел());
		Выборка = Запрос.Выполнить().Выбрать();
		Пока Выборка.Следующий() Цикл
			ЭтотОбъект.ОбменДанными.Получатели.Добавить(Выборка.Ссылка);
		КонецЦикла;
	КонецЕсли;
КонецПроцедуры

