&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Список.ЗагрузитьЗначения(Параметры.МассивЗначений);
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
//+Оформление	
	Массив=Новый Массив;
	Массив.Добавить(Элементы.кнОК);
	Renault_ОбщиеФункции.МультибрендОсновноеОформление(Массив);
//-Оформление	
КонецПроцедуры

&НаКлиенте
Процедура кнОК(Команда)
	Закрыть(Элементы.Список.ТекущиеДанные.Значение);
КонецПроцедуры

&НаКлиенте
Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	Закрыть(Элементы.Список.ТекущиеДанные.Значение);
КонецПроцедуры

