Процедура ОбработкаНаСервере() Экспорт
	LastLoadDate = ?(Константы.Renault_Replacement_LastReadDate.Получить()=Дата("00010101"), Дата("20010101"),Константы.Renault_Replacement_LastReadDate.Получить());
	ПолучитьДанные();	
КонецПроцедуры // ОбработкаНаСервере()	

Процедура ПолучитьДанные() Экспорт
	//АдресWS	 = "http://89.108.111.89:8080/renault-webservices-test2/";
	АдресWS	 = Константы.Renault_АдресWebСервисов.Получить();
	ЛогинWS	 = Константы.Renault_ЛогинВебСервиса.Получить();
	ПарольWS = Константы.Renault_ПарольВебСервиса.Получить();	
	//удалим определение документа wsdl - его добавляем автоматически
	АдресWS = СтрЗаменить(АдресWS, "ws/nomexchange.ws?wsdl", "");
	ВСОпределение = Новый WSОпределения(СокрЛП(АдресWS) + "ws/nomexchange.ws?wsdl",
									СокрЛП(ЛогинWS), СокрЛП(ПарольWS));
	ВебСервис = Новый WSПрокси(ВСОпределение, "http://renault-nissan.com/schema/nomen", 
							   "ОбменНоменклатура", "ОбменНоменклатураSoap");
	ВебСервис.Пользователь	 = СокрЛП(ЛогинWS);
	ВебСервис.Пароль		 = СокрЛП(ПарольWS);
	СервисФабрика = ВебСервис.ФабрикаXDTO;
	//Получим реферансы

	Сериализатор = Новый СериализаторXDTO(СервисФабрика);
	ТаблицаДанныхXDTO = ВебСервис.GetZam(LastLoadDate);    
	ТаблицаДанных = Сериализатор.ПрочитатьXDTO(ТаблицаДанныхXDTO);
	//Получим комментарии по ним
	//ТДКомментXDTO = ВебСервис.GetComm(LastLoadDate);
	//ТДКоммент = Сериализатор.ПрочитатьXDTO(ТДКомментXDTO);
	ИдентификаторДилера = Renault_ОбщийМодуль.ПолучитьBIRБазыДанных();
//	ВебСервис.RegOperation(ИдентификаторДилера);
	ЗаписьВРегистры(ТаблицаДанных);
КонецПроцедуры // ПолучитьДанные()

Процедура ЗаписьВРегистры(ТаблицаДанных)
	
	Для каждого стррез из ТаблицаДанных Цикл
		НовЗаписьСрез = РегистрыСведений.Renault_ЗаменыРеферансов.СоздатьМенеджерЗаписи();
		НовЗаписьСрез.АртикулНоменклатуры		= стррез.Original;
		НовЗаписьСрез.АртикулЗамены             = стррез.Dublicate;
		НовЗаписьСрез.Прочитать();
		НовЗаписьСрез.АртикулНоменклатуры 		= стррез.Original;
		НовЗаписьСрез.АртикулЗамены 			= стррез.Dublicate;
		НовЗаписьСрез.ДатаНачала				= стррез.StartDate;
		НовЗаписьСрез.ДатаЗавершения			= стррез.FinishDate;
		НовЗаписьСрез.Записать();
	КонецЦикла;
	
	Константы.Renault_Replacement_LastReadDate.Установить(ТекущаяДата());
	
КонецПроцедуры