
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ТекПользователь = ПараметрыСеанса.Пользователь;
	ТекСотрудник = ТекПользователь.Сотрудник;
	Список.Параметры.УстановитьЗначениеПараметра("Сотрудник", ТекСотрудник);
КонецПроцедуры

&НаКлиенте
Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	Ответ = Новый Структура;
	Ответ.Вставить("Клиент", Элементы.Список.ТекущиеДанные.Клиент);
	Ответ.Вставить("НомерРабочегоЛиста", Элементы.Список.ТекущиеДанные.РЛ);
	Закрыть(Ответ);
КонецПроцедуры
