Процедура ЗаписатьПараметры(СтруктураПараметров) Экспорт	
	МЗ = СоздатьМенеджерЗаписи();
	ЗаполнитьЗначенияСвойств(МЗ,СтруктураПараметров);
	МЗ.Прочитать(); //Всегда считываем
КонецПроцедуры

Функция ПолучитьГарантиюЗавода(ВидРемонта) Экспорт

	Запрос = Новый Запрос("ВЫБРАТЬ
	|	Renault_ВидыРемонтаДопРеквизиты.ГарантияЗавода
	|ИЗ
	|	РегистрСведений.Renault_ВидыРемонтаДопРеквизиты КАК Renault_ВидыРемонтаДопРеквизиты
	|ГДЕ
	|	Renault_ВидыРемонтаДопРеквизиты.ВидРемонта = &ВидРемонта"
	);
	
	Запрос.УстановитьПараметр("ВидРемонта", ВидРемонта);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		Результат = Выборка.ГарантияЗавода;
	Иначе
		Результат = ложь;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ПолучитьEDR_ЛКМ(ВидРемонта) Экспорт

	Запрос = Новый Запрос("ВЫБРАТЬ
	|	Renault_ВидыРемонтаДопРеквизиты.EDR_ЛКМ
	|ИЗ
	|	РегистрСведений.Renault_ВидыРемонтаДопРеквизиты КАК Renault_ВидыРемонтаДопРеквизиты
	|ГДЕ
	|	Renault_ВидыРемонтаДопРеквизиты.ВидРемонта = &ВидРемонта"
	);
	
	Запрос.УстановитьПараметр("ВидРемонта", ВидРемонта);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		Результат = Выборка.EDR_ЛКМ;
	Иначе
		Результат = ложь;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции