
&НаКлиенте
Процедура ИсторияСтатусовВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;  
	Если Поле.Имя = "ИсторияСтатусовКоментарий" Тогда
		Если Вопрос("Отредактировать коментарий", РежимДиалогаВопрос.ДаНет) = КодВозвратаДиалога.Да Тогда
			Текст = Элемент.ТекущиеДанные.Коментарий;
			Подсказка = "Введите текст коментария";
			Если ВвестиСтроку(Текст, Подсказка) Тогда
				ЗаписатьИзмененияНаСервере (Текст, Элемент.ТекущаяСтрока);
				Элементы.ИсторияСтатусов.Обновить();
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ЗаписатьИзмененияНаСервере (Текст, ТекСтрока)
	
	Менеджер = РегистрыСведений.Renault_ИсторияСтатусовPVR.СоздатьМенеджерЗаписи();
	ЗаполнитьЗначенияСвойств(Менеджер, ТекСтрока);
	Менеджер.Прочитать();
	Менеджер.Коментарий = Текст;
	Менеджер.Записать();
	
КонецПроцедуры

&НаКлиенте
Процедура СписокПриАктивизацииСтроки(Элемент)
	Если Элемент.ТекущиеДанные <> Неопределено  Тогда 
		Если Элемент.ТекущиеДанные.Свойство("ТТНСсылка") Тогда
			Если ТекГруппировка = Элемент.ТекущиеДанные.ТТНСсылка Тогда
				Возврат;
			КонецЕсли;
			ИсторияСтатусов.Параметры.УстановитьЗначениеПараметра ("Объект",ПредопределенноеЗначение("Документ.DMS_КартаКачестваПоставки.ПустаяСсылка"));
			СписокПриАктивизацииСтрокиНаСервере (Элемент.ТекущиеДанные.ТТНСсылка);
		Иначе
			Если ТекГруппировка = Элемент.ТекущиеДанные.РодительскаяГруппировкаСтроки Тогда
				Возврат;
			КонецЕсли;
			ИсторияСтатусов.Параметры.УстановитьЗначениеПараметра ("Объект", Элемент.ТекущиеДанные.Ссылка);
			СписокПриАктивизацииСтрокиНаСервере (Элемент.ТекущиеДанные.РодительскаяГруппировкаСтроки);
		КонецЕсли;
	КонецЕсли;
	Элементы.ИсторияСтатусов.Обновить();
КонецПроцедуры

&НаСервере
Процедура СписокПриАктивизацииСтрокиНаСервере (ВыбранныяГруппа)
	
	//ТекГруппировка = ВыбранныяГруппа;
	
КонецПроцедуры

&НаКлиенте
Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	Если ТипЗнч(ВыбраннаяСтрока) = Тип("СтрокаГруппировкиДинамическогоСписка") Тогда
		ФормаПоступления = ВыбраннаяСтрока.Ключ.ПолучитьФорму();
		ФормаПоступления.Открыть();
	Иначе
		сПараметры = Новый Структура;
		сПараметры.Вставить("Ключ", ВыбраннаяСтрока);
		сПараметры.Вставить("Поступление", Элемент.ТекущиеДанные.РодительскаяГруппировкаСтроки.Ключ);
		ОткрытьФорму("Документ.DMS_КартаКачестваПоставки.ФормаОбъекта", сПараметры);
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ОтправитьНаПроверкуНаСервере()
	Если ТипЗнч(Элементы.Список.ТекущаяСтрока)<> Тип("СтрокаГруппировкиДинамическогоСписка") Тогда
		ДокОбъект = Элементы.Список.ТекущаяСтрока.ПолучитьОбъект();
		ДокОбъект.СтатусPVR = Перечисления.Renault_СтатусыPVR.ОжидаетПроверки;
		ДокОбъект.ДокументыPVRОтправлены = Истина;
		ДокОбъект.Записать();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ОтправитьНаПроверку(Команда)
	ОтправитьНаПроверкуНаСервере();
	Элементы.Список.Обновить();
КонецПроцедуры
