
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
		
КонецПроцедуры

&НаСервере
Процедура ПрочитатьКонтакты()
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	КонтактнаяИнформация.Представление,
	               |	КонтактнаяИнформация.Тип,
	               |	КонтактнаяИнформация.Вид
	               |ИЗ
	               |	РегистрСведений.КонтактнаяИнформация КАК КонтактнаяИнформация
	               |ГДЕ
	               |	КонтактнаяИнформация.Объект В (&Объект)";
				   
				   
	Запрос.УстановитьПараметр("Объект", Клиенты);
	
	ЗначениеВДанныеФормы(Запрос.Выполнить().Выгрузить(), ВсеКонтакты);
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Клиент = Параметры.Клиент;
	
	Клиенты = Параметры.Клиенты;
	
	Если Не ЗначениеЗаполнено(Клиент) ИЛИ Не ЗначениеЗаполнено(Клиенты) Тогда
		
		Возврат;
		
	КонецЕсли;
	
	ПрочитатьКонтакты();
	
	
КонецПроцедуры
