
&НаКлиенте
Процедура кнПолучитьФайлы(Команда)
	Если ЗагрузкаОтчетовРНБанка() Тогда 
		Элементы.Список.Обновить();
		Сообщить("Загрузка завершена",СтатусСообщения.Информация);
	Иначе
		Сообщить("Загрузка не состоялась",СтатусСообщения.Информация);
	КонецЕсли;
КонецПроцедуры

&НаСервере
Функция ЗагрузкаОтчетовРНБанка()
	Возврат Renault_РН_БАНК.РегЗадание_ЗагрузкаОтчетовРНБанка();
КонецФункции

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Если Не Renault_РаботаСПравамиПользователя.ЕстьПравоОткрытияОтчетапродаж(ПараметрыСеанса.Пользователь,"Renault_RNB_Reports") тогда
		Сообщить("Недостаточно прав доступа.");
		СтандартнаяОбработка = Ложь;
		Отказ = Истина;
		Возврат;
	КонецЕсли;	
КонецПроцедуры
