
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если ЗначениеЗаполнено(Объект.Ссылка) Тогда
		КлючЗаписиРег = РегистрыСведений.КартинкиИФайлы.СоздатьКлючЗаписи(Новый Структура("Объект,Идентификатор", Объект.Ссылка, "Карта")); 
		Если НЕ КлючЗаписиРег.Пустой() Тогда
			АдресКартинки = ПолучитьНавигационнуюСсылку(КлючЗаписиРег, "Данные")
		КонецЕсли;
	КонецЕсли;
	Если НЕ (РольДоступна("ПолныеПрава") ИЛИ РольДоступна("КП_АдминистраторДилера")) Тогда
		Элементы.Картинка.Гиперссылка = Ложь;
		Элементы.ФормаОчиститьКартинку.Видимость = Ложь;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура КартинкаНажатие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	Диалог = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	Если Диалог.Выбрать() Тогда
		Попытка
			Картинка = Новый Картинка(Диалог.ПолноеИмяФайла);
			ЗаписатьКартинку()
		Исключение
		КонецПопытки;
	КонецЕсли;
	Элементы.Картинка.Обновить();
	
КонецПроцедуры

&НаСервере
Процедура ЗаписатьКартинку()
	
	Менеджер = РегистрыСведений.КартинкиИФайлы.СоздатьМенеджерЗаписи();
	Менеджер.Объект = Объект.Ссылка;
	Менеджер.Идентификатор = "Карта";
	Менеджер.Данные = Новый ХранилищеЗначения(Картинка);
	Менеджер.Записать(Истина);
	КлючЗаписиРег = РегистрыСведений.КартинкиИФайлы.СоздатьКлючЗаписи(Новый Структура("Объект,Идентификатор", Объект.Ссылка, "Карта")); 
	Если НЕ КлючЗаписиРег.Пустой() Тогда
		АдресКартинки = ПолучитьНавигационнуюСсылку(КлючЗаписиРег, "Данные")
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура УдалитьКартинку()
	
	Менеджер = РегистрыСведений.КартинкиИФайлы.СоздатьМенеджерЗаписи();
	Менеджер.Объект = Объект.Ссылка;
	Менеджер.Идентификатор = "Карта";
	Менеджер.Удалить();
	АдресКартинки = "";
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьКартинку(Команда)
	Элементы.Картинка.Обновить();
КонецПроцедуры

&НаКлиенте
Процедура ОчиститьКартинку(Команда)
	
	УдалитьКартинку()
	
КонецПроцедуры
