


// Функция возвращает значение свойства для переданного объекта
//
// Параметры:
//	Объект   			- ДокументСсылка, СправочникСсылка 	- Ссылка на документ или справочник,
//						для которого получается значение свойства
//  Свойство 			- Строка 							- Свойство, значение которого необходимо получить
// 	ЗначениеПоУмолчанию - Неопределено 						- Значение по умолчанию, которое возвращает функция,
//						если значения свойства или свойства не существует
//
// Возвращаемое значение:
//	Неопределено - Значение свойства для данного объекта или переданное значение по умолчанию
//
Функция ПолучитьЗначениеСвойства(Объект,Свойство,ЗначениеПоУмолчанию=Неопределено) Экспорт
	
	Если НЕ ЗначениеЗаполнено(Объект) ИЛИ НЕ ЗначениеЗаполнено(Свойство) Тогда Возврат ЗначениеПоУмолчанию КонецЕсли;
	
	Попытка
		ОбъектСсылка = Объект.Ссылка
	Исключение
		Возврат ЗначениеПоУмолчанию	
	КонецПопытки;
	
	// Найдем ссылку на переданное свойство
	
	ТипЗначения=ТипЗнч(Свойство);
	Если ТипЗначения=Тип("ПланВидовХарактеристикСсылка.СвойстваОбъектов") Тогда
		СвойствоСсылка = Свойство 
	ИначеЕсли ТипЗначения=Тип("Строка") Тогда
		// Поиск предопределенного или по наименованию
		Попытка		СвойствоСсылка = ПланыВидовХарактеристик.СвойстваОбъектов[СокрЛП(Свойство)];
		Исключение	СвойствоСсылка = ПланыВидовХарактеристик.СвойстваОбъектов.НайтиПоНаименованию(СокрЛП(Свойство),Истина);
		КонецПопытки; 
	ИначеЕсли ТипЗначения=Тип("Число") Тогда
		// Поиск по коду
		СвойствоСсылка = ПланыВидовХарактеристик.СвойстваОбъектов.НайтиПоКоду(Свойство);
	Иначе СвойствоСсылка = ПланыВидовХарактеристик.СвойстваОбъектов.ПустаяСсылка()
	КонецЕсли;
	
	Если СвойствоСсылка.Пустая() Тогда Возврат ЗначениеПоУмолчанию КонецЕсли;
	
	// Если свойство найдено, осталось только получить его значение
	СтруктураОтбора = Новый Структура("Объект,Свойство",ОбъектСсылка,СвойствоСсылка);
	ЗначениеСвойства = РегистрыСведений.ЗначенияСвойствОбъектов.Получить(СтруктураОтбора).Значение;
	ВозвратЗначениеПоУмолчанию = ?(ЗначениеПоУмолчанию = Неопределено,ПустоеЗначениеТипа(СвойствоСсылка.ТипЗначения.Типы()[0]),ЗначениеПоУмолчанию);
	
	Возврат ?(ЗначениеСвойства = Неопределено,ВозвратЗначениеПоУмолчанию,ЗначениеСвойства);
	
КонецФункции // ПолучитьЗначениеСвойства()

Функция ПустоеЗначениеТипа(ЗаданныйТип) Экспорт
	
	Если ЗаданныйТип = Тип("Число") Тогда
		Возврат 0;
		
	ИначеЕсли ЗаданныйТип = Тип("Строка") Тогда
		Возврат "";
		
	ИначеЕсли ЗаданныйТип = Тип("Дата") Тогда
		Возврат '00010101000000';
		
	ИначеЕсли ЗаданныйТип = Тип("Булево") Тогда
		Возврат Ложь;
		
	Иначе
		Возврат Новый (ЗаданныйТип);
		
	КонецЕсли;
	
КонецФункции // ПустоеЗначениеТипа();

Процедура НазначитьТип(Значение, ТипЗначения) Экспорт
	
	Если ТипЗнч(ТипЗначения.ПривестиЗначение())<>ТипЗнч(Значение) Тогда
		Значение = ТипЗначения.ПривестиЗначение();
	КонецЕсли;
	
КонецПроцедуры

Функция ПолучитьBIRБазыДанных() Экспорт
	
	Возврат Константы.Renault_BIR_db.Получить();
	
КонецФункции

Функция ПолучитьBIRДилерскогоЦентра(ДилерскийЦентр) Экспорт
	
	Возврат ДилерскийЦентр.BIR;
	
КонецФункции


