//+общие функции
Функция ТекстЗапросИсточникаДанных(ИмяСписка)
	
	Возврат ?(ЭтаФорма[ИмяСписка].ПроизвольныйЗапрос,ЭтаФорма[ИмяСписка].ТекстЗапроса,"");
	
КонецФункции

Функция ПолучитьИсточникНаСервере(ИмяСписка)
	
	Возврат Renault_ОбщиеФункции.ИсточникДанныхФормы(ЭтаФорма,ИмяСписка);
	
КонецФункции

Функция ПолучитьПроизвольныйИсточникНаСервере(ИмяСписка)
	
	Возврат Renault_ОбщиеФункции.ПроизвольныйИсточникДанных(ТекстЗапросИсточникаДанных(ИмяСписка));
	
КонецФункции
//-общие функции

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.РежимВыбора Тогда
		Элементы.Список.РежимВыбора = Истина;
	//Иначе
	//	Элементы.кнВыбрать.Видимость = Ложь;
	КонецЕсли;
	Если Параметры.МножественныйВыбор = Истина Тогда
		Элементы.Список.Подсказка="Множественный выбор клавиша Ctrl";
	КонецЕсли;
	УстановитьОтбор(Параметры);
	УправлениеЭлементами();
	
КонецПроцедуры

Процедура УстановитьОтбор(Параметры)
	
	//владелец
	Если Параметры.Свойство("Владелец") Тогда
		Поле = Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		Поле.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
		Поле.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Владелец");
		Поле.ПравоеЗначение = Параметры.Владелец;
		Поле.Использование = Истина;
	Иначе
		Поле = Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		Поле.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
		Поле.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Владелец");
		//Поле.ПравоеЗначение = Параметры.Владелец;
		Поле.Использование = Ложь;
	КонецЕсли;
	
	//если передана стоимость авто
	Список.Параметры.Элементы.Найти("СтоимостьАвто").Использование=Истина;
	Список.Параметры.Элементы.Найти("СтоимостьАвто").Значение=?(Параметры.Свойство("СтоимостьАвто"),Параметры.СтоимостьАвто,0);
	
	Если Параметры.Свойство("UsedCar") Тогда
		Поле=Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		Поле.Использование=Истина;
		Поле.ВидСравнения=ВидСравненияКомпоновкиДанных.Равно;
		Поле.ЛевоеЗначение=Новый ПолеКомпоновкиДанных("UsedCar");
		Поле.ПравоеЗначение=Параметры.UsedCar;
	КонецЕсли;
	////отбор списка по владельцу - банку
	//Владелец=?(Параметры.Свойство("Банк"),Параметры.Банк,Справочники.Renault_КредитныеПредложения.РНБанк());
	//БанкПредопределен=НЕ Владелец.Пустая();
	//Список.Параметры.Элементы.Найти("Банк").Использование=Истина;
	//Список.Параметры.Элементы.Найти("Банк").Значение=Владелец;
	
	//период действия предложения
	ГруппаОтбораИ=Список.Отбор.Элементы.Добавить(Тип("ГруппаЭлементовОтбораКомпоновкиДанных"));
	ГруппаОтбораИ.Использование=Истина;
	ГруппаОтбораИ.ТипГруппы=ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИ;
	
	Поле=ГруппаОтбораИ.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	Поле.Использование=Истина;
	Поле.ВидСравнения=ВидСравненияКомпоновкиДанных.МеньшеИлиРавно;
	Поле.ЛевоеЗначение=Новый ПолеКомпоновкиДанных("НачалоПериодаДействия");
	Поле.ПравоеЗначение=ТекущаяДата();
	
	Поле=ГруппаОтбораИ.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	Поле.Использование=Истина;
	Поле.ВидСравнения=ВидСравненияКомпоновкиДанных.БольшеИлиРавно;
	Поле.ЛевоеЗначение=Новый ПолеКомпоновкиДанных("ОкончаниеПериодаДействия");
	Поле.ПравоеЗначение=ТекущаяДата();
	
	//модель
	Список.Параметры.Элементы.Найти("ОтборПоМодели").Использование=Истина;
	Список.Параметры.Элементы.Найти("ОтборПоМодели").Значение=Параметры.Свойство("Модель");
	Список.Параметры.Элементы.Найти("Модель").Использование=Истина;
	Если Параметры.Свойство("Модель") Тогда
		Модель=Параметры.Модель;
		Список.Параметры.Элементы.Найти("Модель").Значение=Параметры.Модель;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура МодельПриИзменении(Элемент) 
	Список.Параметры.Элементы.Найти("ОтборПоМодели").Значение=?(Модель.Пустая(),Ложь,Истина);
	Список.Параметры.Элементы.Найти("Модель").Значение=Модель;
КонецПроцедуры

Процедура УправлениеЭлементами()
	//Элементы.грБанк.Видимость=НЕ БанкПредопределен; //Банк.Пустая();
	//Элементы.Банк.Доступность=Банк.Пустая(); - управляем только видимостью при ПриСозданииНаСервере
	Элементы.Владелец.Видимость=не ЗначениеЗаполнено(Владелец);
	//Элементы.Код.Видимость=НЕ Элементы.Список.РежимВыбора; 
	//Элементы.кнОтказатьсяОтРНБанка.Видимость=Владелец=Справочники.Renault_КредитныеПредложения.РНБанк();
	
	//стоимость показана только при переданной цене авто
	Элементы.Стоимость.Видимость=Список.Параметры.Элементы.Найти("СтоимостьАвто").Значение>0;
	
КонецПроцедуры	

&НаКлиенте
Процедура кнОтбор(Команда)
	
	Если Renault_ОбщиеФункции.СтараяПлатформа() Тогда
		Возврат
	КонецЕсли;
	
	ИмяСписка = "Список";
	Источник = ПолучитьИсточникНаСервере(ИмяСписка); 
	
	СтрПараметры = Новый Структура;
	СтрПараметры.Вставить("ИмяСписка",ИмяСписка);
	СтрПараметры.Вставить("ПараметрыСписка",Список.Параметры.Элементы);
	
	Renault_ОбщиеФункции.ОткрытьФормуОтбора(ЭтаФорма,Источник,ЭтаФорма[ИмяСписка].КомпоновщикНастроек,"ОтборСписка",СтрПараметры,,Истина);
	
КонецПроцедуры
&НаКлиенте
Процедура ОтборСписка(КомпНастроек,Параметры) Экспорт
	Если КомпНастроек=Неопределено Тогда Возврат КонецЕсли;		
	ЭтаФорма[Параметры.ИмяСписка].КомпоновщикНастроек.ЗагрузитьФиксированныеНастройки(КомпНастроек.ФиксированныеНастройки);
	Для Н=0 по ЭтаФорма[Параметры.ИмяСписка].Параметры.Элементы.Количество()-1 Цикл
		Эл=ЭтаФорма[Параметры.ИмяСписка].Параметры.Элементы[Н];
		Эл.Значение=Параметры.ПараметрыСписка[Н].Значение;
		Эл.Использование=Параметры.ПараметрыСписка[Н].Использование;
	КонецЦикла;
	//ЭтаФорма[ИмяСписка].КомпоновщикНастроек.ЗагрузитьНастройки(КомпоновщикНастроек.Настройки);
	//ЭтаФорма[ИмяСписка].КомпоновщикНастроек.ЗагрузитьПользовательскиеНастройки(КомпоновщикНастроек.ПользовательскиеНастройки);
	//ЭтаФорма[ИмяСписка].КомпоновщикНастроек.ЗагрузитьФиксированныеНастройки(КомпоновщикНастроек.ФиксированныеНастройки);
КонецПроцедуры

&НаКлиенте
Процедура ВладелецПриИзменении(Элемент, СтандартнаяОбработка = Истина) 
	
	Если Список.Отбор.Элементы.Количество() <> 0 Тогда
		Эл = Список.Отбор.Элементы[0];
		Если Эл.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Владелец") Тогда
			Эл.ПравоеЗначение = Владелец;
			Эл.Использование = ЗначениеЗаполнено(Владелец);
			УправлениеЭлементами();
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура кнОтказатьсяОтРНБанка(Команда)
	Если Не ВвестиСтроку(КомментарийПричиныОтказаОтРНБанка,"Причина отказа от услуг РН Банка",,Истина) Тогда Возврат КонецЕсли;
	БанкПредопределен=Ложь;
	//Если ВладелецФормы<>Неопределено И ВладелецФормы.ИмяФормы="Документ.Renault_РабочийЛистОФУ.Форма.ФормаДокумента" Тогда 
	Попытка ВладелецФормы.Объект.КомментарийПричиныОтказаОтРНБанка=КомментарийПричиныОтказаОтРНБанка Исключение КонецПопытки;	
	//КонецЕсли;	
	Владелец="";
	УправлениеЭлементами();
КонецПроцедуры


