 //Бондаренко++ 20251113
 Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	ЭтоНовыйОбъект = Ложь;
	Попытка
	    ЭтоНовыйОбъект = ЭтотОбъект.ЭтоНовый();
 	Исключение
 	КонецПопытки; 
	Если ЭтоНовыйОбъект Тогда
		Попытка
 			ЭтотОбъект.СМ_Создатель = ПараметрыСеанса.Пользователь;
 		Исключение
		КонецПопытки;
		Попытка
 			ЭтотОбъект.СМ_ДатаСоздания = ТекущаяДата();
 		Исключение
 		КонецПопытки;
	КонецЕсли;
	
	Если обЗначениеНеЗаполнено(ЭтотОбъект.СМ_Создатель) Тогда
		Попытка
 			ЭтотОбъект.СМ_Создатель = ПараметрыСеанса.Пользователь;
 		Исключение
		КонецПопытки;
	КонецЕсли;
	
	Если обЗначениеНеЗаполнено(ЭтотОбъект.СМ_ДатаСоздания) Тогда
		Попытка
 			ЭтотОбъект.СМ_ДатаСоздания = ТекущаяДата();
 		Исключение
		КонецПопытки;
	КонецЕсли;
 	
КонецПроцедуры
//Бондаренко-- 20251113
