Процедура ДобавитьШаблон(Кампания, ДвоичныеДанные) Экспорт

	МенеджерЗаписи = РегистрыСведений.Renault_BP_ШаблоныДокументовРезультатов.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.Кампания = Кампания;
	МенеджерЗаписи.Шаблон = Новый ХранилищеЗначения(ДвоичныеДанные);
	МенеджерЗаписи.Записать();
	
КонецПроцедуры

Функция ПолучитьШаблон(Кампания) Экспорт
	
	МенеджерЗаписи = РегистрыСведений.Renault_BP_ШаблоныДокументовРезультатов.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.Кампания = Кампания;
	МенеджерЗаписи.Прочитать();
	
	Если МенеджерЗаписи.Выбран() Тогда
		Возврат МенеджерЗаписи.Шаблон.Получить();
	Иначе
		Возврат Неопределено;
	КонецЕсли;
	
КонецФункции

Процедура УдалитьШаблон(Кампания) Экспорт
	
	МенеджерЗаписи = РегистрыСведений.Renault_BP_ШаблоныДокументовРезультатов.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.Кампания = Кампания;
	МенеджерЗаписи.Удалить();	
	
КонецПроцедуры