Процедура ПечатьГарантийногоТалона(Ответ, Параметр) Экспорт
	
	VIN = Параметр.АвтомобилиДляВыдачи[0].VIN;
	DMS_DataExchange.sendMessage(DMS_ОбщиеПовторныеФункции.ПараметрыHTTPСоединения(,Справочники.CRM_МаркаАвтомобиля.LADA),"ConsolidationHTTP","VAZ_GuaranteeDocs.ГарантийныйТалон",DMS_DataExchange.newPackage(VIN),Ответ)
	
	//ПараметрыТалона = Новый Структура;
	//
	//ЗаписьНаВыдачу = Неопределено;
	//
	//Если ТипЗнч(Параметр) = Тип("Массив") и ЗначениеЗаполнено(Параметр[0].Основание) Тогда
	//	ЗаписьНаВыдачу = Параметр[0].Основание;  // печать из списка заявки на согласование на основании Выдачи авто или Договора КП
	//ИначеЕсли  ТипЗнч(Параметр) = Тип("ЗадачаСсылка.DMS_ЗаявкаНаСогласование") 
	//	ИЛИ (ТипЗнч(Параметр) = Тип("Массив") И ТипЗнч(Параметр[0]) = Тип("ЗадачаСсылка.DMS_ЗаявкаНаСогласование"))  Тогда
	//	
	//	Если ТипЗнч(Параметр) = Тип("Массив") Тогда
	//		 Параметр = Параметр[0];
	//	 КонецЕсли;
	//	 
	//	Если Параметр.ВидЗаявки = Перечисления.DMS_ВидыЗаявокНаСогласование.ПовторнаяПечатьГарантийногоТалона Тогда // повторная печать - достаточно указать клиента и VIN
	//		ПараметрыТалона.Вставить("ЗаявкаНаПовторнуюПечать",Истина);
	//		ПараметрыТалона.Вставить("VIN", Параметр.Реквизиты.Найти(ПланыВидовХарактеристик.DMS_РеквизитыЗаявкиНаСогласование.Автомобиль,"Реквизит").Значение.VIN);
	//		ПараметрыТалона.Вставить("ClientName", Строка(Параметр.Реквизиты.Найти(ПланыВидовХарактеристик.DMS_РеквизитыЗаявкиНаСогласование.Клиент,"Реквизит").Значение));
	//		ПараметрыТалона.Вставить("Сотрудник", Строка(ПараметрыСеанса.Пользователь));
	//	Иначе
	//		ЗаписьНаВыдачу = Параметр.Основание; // печать из заявки на согласование на основании Выдачи авто или Договора КП
	//	КонецЕсли;
	//ИначеЕсли  ТипЗнч(Параметр) = Тип("ДокументСсылка.CRM_ЗаписьНаВыдачу") Тогда // печать непосредственно на основании выдачи авто
	//	ЗаписьНаВыдачу = Параметр;
	//ИначеЕсли ТипЗнч(Параметр) = Тип("Структура") Тогда
	//	ПараметрыТалона = Параметр;
	//Иначе
	//	ВызватьИсключение "Не настроена печать для указанного параметра: " + ТипЗнч(Параметр);
	//КонецЕсли;
	//
	//Если ТипЗнч(ЗаписьНаВыдачу) = Тип("ДокументСсылка.Renault_Договор") Тогда
	//	Возврат;
	//КонецЕсли;
	//Если ЗначениеЗаполнено(ЗаписьНаВыдачу) Тогда //Самая первая печать талона, заполняем необходимые данные
	//	Договор = ЗаписьНаВыдачу.ДоговорНаПродажуАвтомобиля;
	//	Автомобиль = ЗаписьНаВыдачу.АвтомобилиДляВыдачи[0].Автомобиль;
	//	ДокККП = Документы.DMS_КартаКачестваПоставки.НайтиПоРеквизиту("Автомобиль",Автомобиль);
	//	ДанныеДоговора = Документы.Renault_Договор.ПолучитьДанныеОбъекта(Договор, "");
	//	ПараметрыТалона.Вставить("VIN", Автомобиль.VIN);
	//	ПараметрыТалона.Вставить("pre_sales_date", ДокККП.ДатаПППодготовки);
	//	ПараметрыТалона.Вставить("TransferDate", Договор.ДатаАктаПередачи);
	//	ПараметрыТалона.Вставить("type", "1");
	//	ПараметрыТалона.Вставить("ClientName", ДанныеДоговора.ФИОКлиента);
	//	ПараметрыТалона.Вставить("ClientAddress", ДанныеДоговора.АдресФактический);
	//	ПараметрыТалона.Вставить("phone", ДанныеДоговора.ТелефонСотовый);
	//	ПараметрыТалона.Вставить("date_make_gt", ДокККП.ДатаВыдачиАвто);
	//	ПараметрыТалона.Вставить("inn", Договор.ДилерскийЦентр.ОсновнойКонтрагентДилера.ИНН);
	//	ПараметрыТалона.Вставить("DealerName", Договор.ДилерскийЦентр.НаименованиеДляПечати);
	//	ПараметрыТалона.Вставить("DealerAddress", Договор.ДилерскийЦентр.ОсновнойАдрес);
	//	ПараметрыТалона.Вставить("price_sale", ДанныеДоговора.Сумма);
	//	ПараметрыТалона.Вставить("Сотрудник", Строка(ПараметрыСеанса.Пользователь));
	//КонецЕсли;

	//Ответ = Неопределено;
	//Если Не DMS_DataExchange.sendMessage(DMS_ОбщиеПовторныеФункции.ПараметрыHTTPСоединения(),
	//	"ConsolidationHTTP",
	//	"DMS_GuaranteeDocs.ПолучитьТабличныйДокумент",
	//	DMS_DataExchange.newPackage(ПараметрыТалона),
	//	Ответ) Тогда
	//	Если СтрНайти(Ответ, "300")>0  Тогда
	//		Сообщить(НСтр("ru = 'При печати гарантийного талона произошла ошибка. Не найдены данные гарантийного талона.'"));
	//	ИначеЕсли СтрНайти(Ответ, "301")>0 Тогда
	//		Сообщить(НСтр("ru = 'При печати гарантийного талона произошла ошибка.
	//		|Данные ранее выданного гарантийного талона не соответствуют введенным данным.
	//		|Воспользуйтесь функцией оформления дубликата гарантийного талона.'")); 
	//	КонецЕсли;
	//Иначе
	//	ТабДок = Ответ;
	//КонецЕсли;

КонецПроцедуры
