
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	Если ДанныеЗаполнения=Неопределено Тогда Возврат КонецЕсли;
	
	ЗаполнитьЗначенияСвойств(ЭтотОбъект,ДанныеЗаполнения);
	Основание=ДанныеЗаполнения;
	Дата=ТекущаяДата();
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.DMS_Утилизация") Тогда
		ВидЗаявки=Перечисления.DMS_ВидыЗаявокНаСогласование.Утилизация;
	КонецЕсли;
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ)
	Если ОбменДанными.Загрузка Тогда Возврат КонецЕсли; 
	
	//проверка заполнения реквизитов
	Запрос=Новый Запрос("Выбрать Ссылка Из ПланВидовХарактеристик.DMS_РеквизитыЗаявкиНаСогласование.ВидыЗаявок ГДЕ ВидЗаявкиНаСогласование=&ВидЗаявки И Обязательный");
	Запрос.УстановитьПараметр("ВидЗаявки",ВидЗаявки);
	Для Каждого Реквизит Из Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка") Цикл
		Строка=Реквизиты.Найти(Реквизит,"Реквизит");
		Если Строка=Неопределено ИЛИ Не ЗначениеЗаполнено(Строка.Значение) Тогда
			Сообщить("Не заполнен обязательный реквизит "+Реквизит);
			Отказ=Истина;
		КонецЕсли;	
	КонецЦикла;	
	
КонецПроцедуры

