Процедура Renault_ЗаказНарядФактВыполненияТОПриЗаписи(Источник, Отказ, РежимПроведения) Экспорт
	
	#Если НЕ КЛИЕНТ ТОГДА
		
		Возврат;
		
	#КонецЕсли
	
	Если Отказ = Истина Тогда 
		
		Возврат;
		
	КонецЕсли;
	
	Запрос = Новый Запрос();
	 
	Запрос.Текст = "ВЫБРАТЬ
	                |	ЗаказНарядРаботы.Работа.Артикул,
	                |	Renault_КодировкиТО.ВидТО
	                |ИЗ
	                |	Документ.ЗаказНаряд.Работы КАК ЗаказНарядРаботы
	                |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.Renault_КодировкиТО КАК Renault_КодировкиТО
	                |		ПО ЗаказНарядРаботы.Работа.Артикул = Renault_КодировкиТО.АртикулРаботы
	                |ГДЕ
	                |	ЗаказНарядРаботы.Ссылка = &Ссылка";
					
	Запрос.УстановитьПараметр("Ссылка", Источник.Ссылка);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		
		Если ЗначениеЗаполнено(Выборка.ВидТО) Тогда
			
			ВидТО = Выборка.ВидТО;
			
			Запрос = Новый Запрос;
			
			Запрос.Текст = "ВЫБРАТЬ
			               |	Renault_ВыполнениеТОСрезПоследних.Период,
			               |	Renault_ВыполнениеТОСрезПоследних.Автомобиль,
			               |	Renault_ВыполнениеТОСрезПоследних.ВидТО,
			               |	Renault_ВыполнениеТОСрезПоследних.СкоростьПробега,
			               |	Renault_ВыполнениеТОСрезПоследних.ДатаПлан,
			               |	Renault_ВыполнениеТОСрезПоследних.ДатаФакт
			               |ИЗ
			               |	РегистрСведений.Renault_ВыполнениеТО.СрезПоследних КАК Renault_ВыполнениеТОСрезПоследних
			               |ГДЕ
			               |	Renault_ВыполнениеТОСрезПоследних.Автомобиль = &Автомобиль
			               |	И Renault_ВыполнениеТОСрезПоследних.ВидТО = &ВидТО
			               |	И Renault_ВыполнениеТОСрезПоследних.ДатаФакт = &ПустаяДата";
						   
						   Запрос.УстановитьПараметр("ВидТО", Выборка.ВидТО);
						   Запрос.УстановитьПараметр("Автомобиль", Источник.Автомобиль);
						   Запрос.УстановитьПараметр("ПустаяДата", ДАТА(1,1,1));
						   
			Выборка = Запрос.Выполнить().Выбрать();
			
			Если Выборка.Следующий() Тогда
				
				Запись = РегистрыСведений.Renault_ВыполнениеТО.СоздатьМенеджерЗаписи();
				
				ЗаполнитьЗначенияСвойств(Запись, Выборка);
				
				Запись.Прочитать();
				
				Если Запись.Выбран() Тогда
					
					Запись.ЗаказНаряд = Источник.Ссылка;
					Запись.ДатаФакт = ТекущаяДата();
					Запись.Записать();
					
				Иначе
					
					Запись.Автомобиль = Источник.Автомобиль;
					Запись.Период = ТекущаяДата();
					Запись.ВидТО = ВидТО;
					Запись.ЗаказНаряд = Источник.Ссылка;
					Запись.ДатаПлан = ДобавитьМесяц(ТекущаяДата(), (-12));
					Запись.ДатаФакт = ТекущаяДата();
					Запись.Записать();
					
				КонецЕсли;
				
			Иначе
				
				Запись = РегистрыСведений.Renault_ВыполнениеТО.СоздатьМенеджерЗаписи();
				Запись.Период = ТекущаяДата();
				Запись.Автомобиль = Источник.Автомобиль;
				Запись.ВидТО = ВидТО;
				Запись.ЗаказНаряд = Источник.Ссылка;
				Запись.ДатаПлан = ДобавитьМесяц(ТекущаяДата(), (-12));
				Запись.ДатаФакт = ТекущаяДата();
				Запись.Записать();

				
			КонецЕсли;
				
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры