&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	XML();
	ИмяМакета=?(Объект.Стандартные,Объект.Правила,"");
	УправлениеЭлементами();
КонецПроцедуры
Процедура УправлениеЭлементами()
	Элементы.Группа1.Видимость=Не Объект.Стандартные;
	Элементы.ИмяМакета.Видимость=Объект.Стандартные;
КонецПроцедуры	

&НаКлиенте
Процедура ПравилаПриИзменении(Элемент) XML() КонецПроцедуры
Процедура XML()
	Если Объект.Правила="" или Объект.Стандартные Тогда ПросмотрXML=""
	Иначе
		Преобразование=Новый ПреобразованиеXSL;
	    Преобразование.ЗагрузитьИзСтроки(Обработки.DMS_Диалог.ПолучитьМакет("ПреобразованиеXSL").ПолучитьТекст());
	    ПросмотрXML=Преобразование.ПреобразоватьИзСтроки("<?xml version='1.0' encoding='UTF-8'?>"+Объект.Правила);
	КонецЕсли;
КонецПроцедуры	

&НаКлиенте
Процедура СтандартныеПриИзменении(Элемент) 
	Если Не Объект.Стандартные И СтрНайти(Объект.Правила,"ПолучитьМакет(")>0 Тогда Объект.Правила="" КонецЕсли;
	УправлениеЭлементами() 
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	Если Объект.Стандартные Тогда Объект.Правила=ИмяМакета КонецЕсли;
КонецПроцедуры

