
&НаКлиенте
Процедура ОК(Команда)
	
	ПараметрыВставки = Новый Структура;
	
	ПараметрыВставки.Вставить("Параметр", ИмяВставки);
	ПараметрыВставки.Вставить("Формула", Формула);
	ПараметрыВставки.Вставить("ЭтоФункция", ЭтоФункция);
	
	Закрыть(ПараметрыВставки);
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	РеквизитыКонтрагента = Метаданные.Справочники.Контрагенты.Реквизиты;
	
	Для Каждого Стр Из РеквизитыКонтрагента Цикл
		
		НовСтр           = СписокРеквизитов.Добавить();
		НовСтр.Параметр  = Стр.Имя;
		
	КонецЦикла;

КонецПроцедуры

&НаКлиенте
Процедура СписокРеквизитовВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	Формула = Формула+" "+"Контрагент["""+СписокРеквизитов[ВыбраннаяСтрока].Параметр+"""]";

КонецПроцедуры

&НаКлиенте
Процедура КонтрагентПриИзменении(Элемент)
	КонтрагентПриИзмененииНаСервере();                                                            
КонецПроцедуры

&НаСервере
Процедура КонтрагентПриИзмененииНаСервере()
	
	ПараметрДляВычисления = "";
	
	Попытка
		Если ЭтоФункция Тогда
			ВЫПОЛНИТЬ(Формула);
			Результат = ПараметрДляВычисления;
		Иначе
			Результат = Вычислить(Формула);
		КонецЕсли;
	Исключение
		Сообщить("В формуле есть ошибка, невозможно вычислить результат для выбранного контрагента");
	КонецПопытки;
	
КонецПроцедуры

&НаКлиенте
Процедура ФормулаОкончаниеВводаТекста(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, СтандартнаяОбработка)
	
	Если ЭтоФункция Тогда
		Если Найти(Текст, "ПараметрДляВычисления")=Неопределено Тогда
			Сообщить("Не указано чему равен ПараметрДляВычисления");
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры
