
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ЭтаФорма.ЗакрыватьПриЗакрытииВладельца=Истина;
	Таб = ХранилищеОбщихНастроек.Загрузить("ПомощникАвтобизнеса","УровниЦен");
	
	Если ТипЗнч(Таб)=Тип("ТаблицаЗначений") И Таб.Количество()>0 Тогда
		УровниЦен.Загрузить(Таб);
	Иначе
		Нов=УровниЦен.Добавить();
		Нов.Наименование="Закупочная";
		Нов.Наценка=0;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура Сохранить(Команда)
	Мас=СохранитьНаСервере();
	ЭтаФорма.ВладелецФормы.Элементы.УровеньЦен.СписокВыбора.ЗагрузитьЗначения(Мас);
	ЭтаФорма.ВладелецФормы.Элементы.УровеньЦенЕмекс.СписокВыбора.ЗагрузитьЗначения(Мас);
	ЭтаФорма.Закрыть();
КонецПроцедуры
	
&НаСервере
Функция СохранитьНаСервере()
	Таб=УровниЦен.Выгрузить();
	Мас=Таб.ВыгрузитьКолонку("Наименование");
	ХранилищеОбщихНастроек.Сохранить("ПомощникАвтобизнеса","УровниЦен",Таб);
	Возврат Мас;
КонецФункции


