// Общий журнал
Перем Права Экспорт;
Перем Организация Экспорт;

Функция ПолучитьСписокПечатныхФорм() Экспорт
	Возврат Новый СписокЗначений();	
КонецФункции
//Конец необходимых для общих журналов

Процедура ОбработкаПроведения(Отказ, Режим)
	
	ОтказУд = ложь;
	ОбработкаУдаленияПроведения(ОтказУд);
	
	НаборЗаявка = РегистрыСведений.CRM_ВоронкаПродаж.СоздатьНаборЗаписей();
	НаборЗаявка.Отбор.IDK.Установить(РабочийЛист);
	НаборЗаявка.Отбор.ЭтапПродаж.Установить(Справочники.CRM_ЭтапыПродаж.ЗаявкаНаТрейдИн);
	НаборЗаявкаОдобрена = РегистрыСведений.CRM_ВоронкаПродаж.СоздатьНаборЗаписей();
	НаборЗаявкаОдобрена.Отбор.IDK.Установить(РабочийЛист);
	НаборЗаявкаОдобрена.Отбор.ЭтапПродаж.Установить(Справочники.CRM_ЭтапыПродаж.ЗаявкаНаТрейдИнОдобрена);
	НаборЗаявкаВыполнена = РегистрыСведений.CRM_ВоронкаПродаж.СоздатьНаборЗаписей();
	НаборЗаявкаВыполнена.Отбор.IDK.Установить(РабочийЛист);
	НаборЗаявкаВыполнена.Отбор.ЭтапПродаж.Установить(Справочники.CRM_ЭтапыПродаж.ЗаявкаНаТрейдИнВыполнена);
	НаборЗаявкаДиагностика = РегистрыСведений.CRM_ВоронкаПродаж.СоздатьНаборЗаписей();
	НаборЗаявкаДиагностика.Отбор.IDK.Установить(РабочийЛист);
	НаборЗаявкаДиагностика.Отбор.ЭтапПродаж.Установить(Справочники.CRM_ЭтапыПродаж.ЗаявкаНаТрейдИнДиагностикаВСервисе);
	НаборЗаявкаКоммерческоеПредложение = РегистрыСведений.CRM_ВоронкаПродаж.СоздатьНаборЗаписей();
	НаборЗаявкаКоммерческоеПредложение.Отбор.IDK.Установить(РабочийЛист);
	НаборЗаявкаКоммерческоеПредложение.Отбор.ЭтапПродаж.Установить(Справочники.CRM_ЭтапыПродаж.ЗаявкаНаТрейдИнКоммерческоеПредложение);
	
	Если Статус = Перечисления.Renault_CRM_СтатусЗаявокТрейдИн.Черновик Тогда
		Нов = НаборЗаявка.Добавить();
		Нов.IDK = РабочийЛист;
		Нов.Объект = ЭтотОбъект.Ссылка;
		Нов.ДатаВыполнения = ЭтотОбъект.Дата;
		Нов.ДилерскийЦентр = ЭтотОбъект.ДилерскийЦентр;
		Нов.ЭтапПродаж = Справочники.CRM_ЭтапыПродаж.ЗаявкаНаТрейдИн;
		НаборЗаявка.Записать();

		НаборЗаявкаВыполнена.Записать();
		НаборЗаявкаОдобрена.Записать();
	Иначе
		Нов = НаборЗаявка.Добавить();
		Нов.IDK = РабочийЛист;
		Нов.Объект = ЭтотОбъект.Ссылка;
		Нов.ДатаВыполнения = ЭтотОбъект.Дата;
		Нов.ДилерскийЦентр = ЭтотОбъект.ДилерскийЦентр;
		Нов.ЭтапПродаж = Справочники.CRM_ЭтапыПродаж.ЗаявкаНаТрейдИн;
		НаборЗаявка.Записать();
		
		Если Статус = Перечисления.Renault_CRM_СтатусЗаявокТрейдИн.ВыполненаОценка Тогда
			Нов = НаборЗаявкаОдобрена.Добавить();
			Нов.IDK = РабочийЛист;
			Нов.Объект = ЭтотОбъект.Ссылка;
			Нов.ДатаВыполнения = ЭтотОбъект.Дата;
			Нов.ДилерскийЦентр = ЭтотОбъект.ДилерскийЦентр;
			Нов.ЭтапПродаж = Справочники.CRM_ЭтапыПродаж.ЗаявкаНаТрейдИнОдобрена;
			НаборЗаявкаОдобрена.Записать();
			
		ИначеЕсли Статус = Перечисления.Renault_CRM_СтатусЗаявокТрейдИн.НаправленаНаДиагностику Тогда
			Нов = НаборЗаявкаДиагностика.Добавить();
			Нов.IDK = РабочийЛист;
			Нов.Объект = ЭтотОбъект.Ссылка;
			Нов.ДатаВыполнения = ЭтотОбъект.Дата;
			Нов.ДилерскийЦентр = ЭтотОбъект.ДилерскийЦентр;
			Нов.ЭтапПродаж = Справочники.CRM_ЭтапыПродаж.ЗаявкаНаТрейдИнДиагностикаВСервисе;
			НаборЗаявкаОдобрена.Записать();
			
		//ИначеЕсли Статус = Перечисления.Renault_CRM_СтатусЗаявокТрейдИн.КоммерческоеПредложение Тогда
		//	Нов = НаборЗаявкаДиагностика.Добавить();
		//	Нов.IDK = РабочийЛист;
		//	Нов.Объект = ЭтотОбъект.Ссылка;
		//	Нов.ДатаВыполнения = ЭтотОбъект.Дата;
		//	Нов.ДилерскийЦентр = ЭтотОбъект.ДилерскийЦентр;
		//	Нов.ЭтапПродаж = Справочники.CRM_ЭтапыПродаж.ЗаявкаНаТрейдИнКоммерческоеПредложение;
			
		ИначеЕсли Статус = Перечисления.Renault_CRM_СтатусЗаявокТрейдИн.ОформлениеЗавершено Тогда
			
			Нов = НаборЗаявкаОдобрена.Добавить();
			Нов.IDK = РабочийЛист;
			Нов.Объект = ЭтотОбъект.Ссылка;
			Нов.ДатаВыполнения = ЭтотОбъект.Дата;
			Нов.ДилерскийЦентр = ЭтотОбъект.ДилерскийЦентр;
			Нов.ЭтапПродаж = Справочники.CRM_ЭтапыПродаж.ЗаявкаНаТрейдИнОдобрена;
			НаборЗаявкаОдобрена.Записать();
	
			Нов = НаборЗаявкаВыполнена.Добавить();
			Нов.IDK = РабочийЛист;
			Нов.Объект = ЭтотОбъект.Ссылка;
			Нов.ДатаВыполнения = ЭтотОбъект.Дата;
			Нов.ДилерскийЦентр = ЭтотОбъект.ДилерскийЦентр;
			Нов.ЭтапПродаж = Справочники.CRM_ЭтапыПродаж.ЗаявкаНаТрейдИнВыполнена;
			НаборЗаявкаВыполнена.Записать();

		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаУдаленияПроведения(Отказ)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	CRM_ВоронкаПродаж.IDK,
	               |	CRM_ВоронкаПродаж.ЭтапПродаж,
	               |	CRM_ВоронкаПродаж.ДатаВыполнения,
	               |	CRM_ВоронкаПродаж.Объект
	               |ИЗ
	               |	РегистрСведений.CRM_ВоронкаПродаж КАК CRM_ВоронкаПродаж
	               |ГДЕ
	               |	CRM_ВоронкаПродаж.Объект = &Объект";
	Запрос.УстановитьПараметр("Объект", Ссылка);
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Запись = РегистрыСведений.CRM_ВоронкаПродаж.СоздатьМенеджерЗаписи();
		ЗаполнитьЗначенияСвойств(Запись, Выборка);
		Запись.Прочитать();
		Если Запись.Выбран() Тогда
			Запись.Удалить();
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

Процедура УстановитьСтатус(вхСтатус) Экспорт
	
	Статус = вхСтатус;
	
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	Если ЭтоНовый() Тогда
		Статус = Перечисления.Renault_CRM_СтатусЗаявокТрейдИн.Черновик;
		СостояниеШин = Истина;
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриУстановкеНовогоНомера(СтандартнаяОбработка, Префикс)	
	Префикс = DMS_ОбщегоНазначенияСервер.ПолучитьПрефикс();
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)    	
	Если ОбменДанными.Загрузка Тогда 		
		Возврат;  		
	КонецЕсли;
	
	//Если Статус = Перечисления.Renault_CRM_СтатусЗаявокТрейдИн.КоммерческоеПредложение
	//	Или Статус = Перечисления.Renault_CRM_СтатусЗаявокТрейдИн.НаДиагностике
	//	Или Статус = Перечисления.Renault_CRM_СтатусЗаявокТрейдИн.НаРассмотрении
	//	Или Статус = Перечисления.Renault_CRM_СтатусЗаявокТрейдИн.Одобрена Тогда
	//	
	//	ВРаботе = Истина;
	//	
	//Иначе
	//	
	//	ВРаботе = Ложь; 
	//	
	//КонецЕсли;
	
	//для новых заявок и при изменении менеджера трейд-ин по заявке - отправим сообщение менеджеру.
	
	Если ЭтоНовый() Тогда
		ИспользоватьКалькулятор = Истина;
	КонецЕсли;
	
	Если (ЭтотОбъект.ЭтоНовый() и ЗначениеЗаполнено(МенеджерТрейдИн)) 
		ИЛИ (ЗначениеЗаполнено(Ссылка) И ЗначениеЗаполнено(МенеджерТрейдИн) И (МенеджерТрейдИн <> Ссылка.МенеджерТрейдИн)) 
		ИЛИ (ЗначениеЗаполнено(Ссылка) И ЗначениеЗаполнено(Отдел) И (Отдел <> Ссылка.Отдел) И Не ЗначениеЗаполнено(МенеджерТрейдИн))
		ИЛИ (ЭтотОбъект.ЭтоНовый() И ЗначениеЗаполнено(Отдел) и НЕ ЗначениеЗаполнено(МенеджерТрейдИн))  Тогда
		Напоминание = Справочники.Renault_СообщенияПользователю.СоздатьЭлемент();
		Напоминание.Отправитель = ПараметрыСеанса.Пользователь;
		Если ЗначениеЗаполнено(МенеджерТрейдИн) Тогда
			Напоминание.Адресаты.Добавить().Сотрудник = МенеджерТрейдИн;
		Иначе
			Напоминание.Адресаты.Добавить().Отдел = Отдел;
        КонецЕсли;
		Напоминание.ДатаОтправки = ТекущаяДата();
		Напоминание.Комментарий = "Вам назначена заявка по трейд-ин";
		Напоминание.ВидСообщения = Справочники.Renault_ВидСообщения.ЗаявкаНаТрейдИн;
		Напоминание.ПоказыватьС = ТекущаяДата();
		Напоминание.Наименование ="Заявка по трейд-ин";
		Напоминание.Сообщение = "Вам назначена заявка по трейд-ин";
		Напоминание.ИдентификаторОбъекта = Строка(Формат(РабочийЛист,"ЧГ="));
		Напоминание.Записать();
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	
	Клиент = Неопределено;
	РабочийЛист = Неопределено;
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	// НАЧАЛО DMSCOR-1448 05.09.2019
	ПроверкаНаличияПодобнойЗаявки(Отказ);
	// КОНЕЦ DMSCOR-1448 05.09.2019
	
	Если Не ПустаяСтрока(VIN) Тогда
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	Renault_РазмещениеАвтоНаКанале.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.Renault_РазмещениеАвтоНаКанале КАК Renault_РазмещениеАвтоНаКанале
		|ГДЕ
		|	Renault_РазмещениеАвтоНаКанале.Владелец.VIN = &VIN
		|	И Renault_РазмещениеАвтоНаКанале.СтатусОбъявления <> 2";
		
		Запрос.УстановитьПараметр("VIN", VIN);
		Результат = Запрос.Выполнить();
		
		Если Результат.Пустой() Тогда
			Запрос = Новый Запрос;
			Запрос.Текст = 
			"ВЫБРАТЬ
			|	Автомобили.Ссылка
			|ИЗ
			|	Справочник.Автомобили КАК Автомобили
			|ГДЕ
			|	Автомобили.VIN = &VIN";
			
			Запрос.УстановитьПараметр("VIN", VIN);
			Выборка = Запрос.Выполнить().Выбрать();
			
			Если Выборка.Следующий() Тогда
				РазмещениеОбъект = Справочники.Renault_РазмещениеАвтоНаКанале.СоздатьЭлемент();
				РазмещениеОбъект.Владелец          = Выборка.Ссылка;
				РазмещениеОбъект.RenaultSelection  = ПрограммаRenaultSelection;
				РазмещениеОбъект.СтатусОбъяввления = 1;
				РазмещениеОбъект.ЗаявкаТрейдИн     = Ссылка;
				
				Если ЗначениеЗаполнено(ОценкаСостояния) Тогда
					Если ОценкаСостояния = Перечисления.Renault_СостояниеАвтоUsedCars.Отлично Тогда
						РазмещениеОбъект.СостояниеАвтомобиля = 2;
					ИначеЕсли ОценкаСостояния = Перечисления.Renault_СостояниеАвтоUsedCars.Хорошо Тогда
						РазмещениеОбъект.СостояниеАвтомобиля = 3;
					ИначеЕсли ОценкаСостояния = Перечисления.Renault_СостояниеАвтоUsedCars.Удовлетворительно Тогда
						РазмещениеОбъект.СостояниеАвтомобиля = 4;
					КонецЕсли;
				КонецЕсли;
				
				Попытка
					РазмещениеОбъект.Записать();
				Исключение
					Сообщить("Не удалось записать элемент справочника ""Размещение авто на канале""!" + Символы.ПС + ОписаниеОшибки());
				КонецПопытки;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры

// НАЧАЛО DMSCOR-1448 05.09.2019
Процедура ПроверкаНаличияПодобнойЗаявки(Отказ)
	
	Если НЕ ЗначениеЗаполнено(Автомобиль) Тогда
		Если НЕ ПустаяСтрока(VIN) Тогда
			Автомобиль = Справочники.Автомобили.НайтиПоРеквизиту("VIN", VIN);
		Иначе
			Возврат;
		КонецЕсли;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Renault_ЗаявкаНаТрейдИн.Ссылка
	|ИЗ
	|	Документ.Renault_ЗаявкаНаТрейдИн КАК Renault_ЗаявкаНаТрейдИн
	|ГДЕ
	|	(Renault_ЗаявкаНаТрейдИн.Автомобиль = &Автомобиль
	|			ИЛИ Renault_ЗаявкаНаТрейдИн.VIN = &VIN)
	|	И Renault_ЗаявкаНаТрейдИн.Статус = &Статус
	|	И Renault_ЗаявкаНаТрейдИн.Ссылка <> &Ссылка";
	Запрос.УстановитьПараметр("Автомобиль", Автомобиль);
	Запрос.УстановитьПараметр("VIN", VIN);
	Запрос.УстановитьПараметр("Статус", Перечисления.Renault_CRM_СтатусЗаявокТрейдИн.ОформлениеЗавершено);
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	ВыборкаЗаявка = Запрос.Выполнить().Выбрать();
	ЕстьЗаявка = ВыборкаЗаявка.Следующий();
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ОстаткиАвтомобилейОстатки.Автомобиль,
	|	ОстаткиАвтомобилейОстатки.КоличествоОстаток
	|ИЗ
	|	РегистрНакопления.ОстаткиАвтомобилей.Остатки(&Дата, Автомобиль = &Автомобиль) КАК ОстаткиАвтомобилейОстатки";
	Запрос.УстановитьПараметр("Дата", Дата);
	Запрос.УстановитьПараметр("Автомобиль", Автомобиль);
	
	ВыборкаОстаток = Запрос.Выполнить().Выбрать();
	ЕстьОстаток = Ложь;
	
	Если ВыборкаОстаток.Следующий() И ВыборкаОстаток.КоличествоОстаток Тогда
		ЕстьОстаток = Истина;
	КонецЕсли;
	
	Если ЕстьЗаявка И ЕстьОстаток Тогда
		Отказ = Истина;
		Сообщить("Для автомобиля уже создана заявка на трейд-ин: " + ВыборкаЗаявка.Ссылка);
	КонецЕсли;
	
КонецПроцедуры
// КОНЕЦ DMSCOR-1448 05.09.2019
