
&НаСервере
Процедура ЗаполнитьНаСервере()
	
	ДатаОбработки = ТекущаяДата();
	
	Для сч = 1 По 11 Цикл
		Элементы["ТоварыПродажиВПредыдущемМесяце" + сч].Заголовок = "Продажи за " + Формат(ДобавитьМесяц(ДатаОбработки, -сч),"ДФ=MMMM");    	
	КонецЦикла;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Renault_СоставГруппАнализаСкладов.Склад
	|ПОМЕСТИТЬ ВТ_Склады
	|ИЗ
	|	РегистрСведений.Renault_СоставГруппАнализаСкладов КАК Renault_СоставГруппАнализаСкладов
	|ГДЕ
	|	Renault_СоставГруппАнализаСкладов.ГруппаАнализа = &ГруппаАнализа
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПродажиОбороты.Период,
	|	ПродажиОбороты.Номенклатура,
	|	ПродажиОбороты.КоличествоОборот КАК Показатель
	|ПОМЕСТИТЬ ВТ_Продажи
	|ИЗ
	|	РегистрНакопления.Продажи.Обороты(
	|			ДОБАВИТЬКДАТЕ(НАЧАЛОПЕРИОДА(&ТекущаяДата, МЕСЯЦ), ГОД, -1),
	|			,
	|			Месяц,
	|			&ГруппаАнализа = ЗНАЧЕНИЕ(Справочник.Renault_ГруппыАнализаСкладов.ПустаяСсылка)
	|				ИЛИ СкладКомпании В
	|					(ВЫБРАТЬ
	|						Таб.Склад
	|					ИЗ
	|						ВТ_Склады КАК Таб)
	|				ИЛИ СкладКомпании.СкладКомпании В
	|					(ВЫБРАТЬ
	|						Таб.Склад
	|					ИЗ
	|						ВТ_Склады КАК Таб)) КАК ПродажиОбороты
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Продажи.Номенклатура,
	|	ВТ_Продажи.Показатель
	|ПОМЕСТИТЬ ПродажиВТекущемМесяце
	|ИЗ
	|	ВТ_Продажи КАК ВТ_Продажи
	|ГДЕ
	|	ВТ_Продажи.Период = НАЧАЛОПЕРИОДА(&ТекущаяДата, МЕСЯЦ)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Продажи.Номенклатура,
	|	ВТ_Продажи.Показатель
	|ПОМЕСТИТЬ ПродажиВПредыдущемМесяце1
	|ИЗ
	|	ВТ_Продажи КАК ВТ_Продажи
	|ГДЕ
	|	ВТ_Продажи.Период = ДОБАВИТЬКДАТЕ(НАЧАЛОПЕРИОДА(&ТекущаяДата, МЕСЯЦ), МЕСЯЦ, -1)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Продажи.Номенклатура,
	|	ВТ_Продажи.Показатель
	|ПОМЕСТИТЬ ПродажиВПредыдущемМесяце2
	|ИЗ
	|	ВТ_Продажи КАК ВТ_Продажи
	|ГДЕ
	|	ВТ_Продажи.Период = ДОБАВИТЬКДАТЕ(НАЧАЛОПЕРИОДА(&ТекущаяДата, МЕСЯЦ), МЕСЯЦ, -2)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Продажи.Номенклатура,
	|	ВТ_Продажи.Показатель
	|ПОМЕСТИТЬ ПродажиВПредыдущемМесяце3
	|ИЗ
	|	ВТ_Продажи КАК ВТ_Продажи
	|ГДЕ
	|	ВТ_Продажи.Период = ДОБАВИТЬКДАТЕ(НАЧАЛОПЕРИОДА(&ТекущаяДата, МЕСЯЦ), МЕСЯЦ, -3)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Продажи.Номенклатура,
	|	ВТ_Продажи.Показатель
	|ПОМЕСТИТЬ ПродажиВПредыдущемМесяце4
	|ИЗ
	|	ВТ_Продажи КАК ВТ_Продажи
	|ГДЕ
	|	ВТ_Продажи.Период = ДОБАВИТЬКДАТЕ(НАЧАЛОПЕРИОДА(&ТекущаяДата, МЕСЯЦ), МЕСЯЦ, -4)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Продажи.Номенклатура,
	|	ВТ_Продажи.Показатель
	|ПОМЕСТИТЬ ПродажиВПредыдущемМесяце5
	|ИЗ
	|	ВТ_Продажи КАК ВТ_Продажи
	|ГДЕ
	|	ВТ_Продажи.Период = ДОБАВИТЬКДАТЕ(НАЧАЛОПЕРИОДА(&ТекущаяДата, МЕСЯЦ), МЕСЯЦ, -5)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Продажи.Номенклатура,
	|	ВТ_Продажи.Показатель
	|ПОМЕСТИТЬ ПродажиВПредыдущемМесяце6
	|ИЗ
	|	ВТ_Продажи КАК ВТ_Продажи
	|ГДЕ
	|	ВТ_Продажи.Период = ДОБАВИТЬКДАТЕ(НАЧАЛОПЕРИОДА(&ТекущаяДата, МЕСЯЦ), МЕСЯЦ, -6)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Продажи.Номенклатура,
	|	ВТ_Продажи.Показатель
	|ПОМЕСТИТЬ ПродажиВПредыдущемМесяце7
	|ИЗ
	|	ВТ_Продажи КАК ВТ_Продажи
	|ГДЕ
	|	ВТ_Продажи.Период = ДОБАВИТЬКДАТЕ(НАЧАЛОПЕРИОДА(&ТекущаяДата, МЕСЯЦ), МЕСЯЦ, -7)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Продажи.Номенклатура,
	|	ВТ_Продажи.Показатель
	|ПОМЕСТИТЬ ПродажиВПредыдущемМесяце8
	|ИЗ
	|	ВТ_Продажи КАК ВТ_Продажи
	|ГДЕ
	|	ВТ_Продажи.Период = ДОБАВИТЬКДАТЕ(НАЧАЛОПЕРИОДА(&ТекущаяДата, МЕСЯЦ), МЕСЯЦ, -8)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Продажи.Номенклатура,
	|	ВТ_Продажи.Показатель
	|ПОМЕСТИТЬ ПродажиВПредыдущемМесяце9
	|ИЗ
	|	ВТ_Продажи КАК ВТ_Продажи
	|ГДЕ
	|	ВТ_Продажи.Период = ДОБАВИТЬКДАТЕ(НАЧАЛОПЕРИОДА(&ТекущаяДата, МЕСЯЦ), МЕСЯЦ, -9)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Продажи.Номенклатура,
	|	ВТ_Продажи.Показатель
	|ПОМЕСТИТЬ ПродажиВПредыдущемМесяце10
	|ИЗ
	|	ВТ_Продажи КАК ВТ_Продажи
	|ГДЕ
	|	ВТ_Продажи.Период = ДОБАВИТЬКДАТЕ(НАЧАЛОПЕРИОДА(&ТекущаяДата, МЕСЯЦ), МЕСЯЦ, -10)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Продажи.Номенклатура,
	|	ВТ_Продажи.Показатель
	|ПОМЕСТИТЬ ПродажиВПредыдущемМесяце11
	|ИЗ
	|	ВТ_Продажи КАК ВТ_Продажи
	|ГДЕ
	|	ВТ_Продажи.Период = ДОБАВИТЬКДАТЕ(НАЧАЛОПЕРИОДА(&ТекущаяДата, МЕСЯЦ), МЕСЯЦ, -11)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ОстаткиТоваровКомпанииОстатки.Номенклатура,
	|	ОстаткиТоваровКомпанииОстатки.КоличествоОстаток,
	|	ОстаткиТоваровКомпанииОстатки.РезервОстаток
	|ПОМЕСТИТЬ Остатки
	|ИЗ
	|	РегистрНакопления.ОстаткиТоваровКомпании.Остатки(
	|			,
	|			&ГруппаАнализа = ЗНАЧЕНИЕ(Справочник.Renault_ГруппыАнализаСкладов.ПустаяСсылка)
	|				ИЛИ СкладКомпании В
	|					(ВЫБРАТЬ
	|						Таб.Склад
	|					ИЗ
	|						ВТ_Склады КАК Таб)) КАК ОстаткиТоваровКомпанииОстатки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЗаказыПоставщикамОстатки.Номенклатура,
	|	ЗаказыПоставщикамОстатки.ЗаказаноОстаток
	|ПОМЕСТИТЬ Заказано
	|ИЗ
	|	РегистрНакопления.ЗаказыПоставщикам.Остатки КАК ЗаказыПоставщикамОстатки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Renault_ЗначенияТочкиЗаказаСрезПоследних.Номенклатура,
	|	Renault_ЗначенияТочкиЗаказаСрезПоследних.ТочкаЗаказа,
	|	Renault_ЗначенияТочкиЗаказаСрезПоследних.СтраховойЗапас,
	|	Renault_ЗначенияТочкиЗаказаСрезПоследних.Классификация,
	|	Renault_ЗначенияТочкиЗаказаСрезПоследних.СреднедневныеПродажи,
	|	ЕСТЬNULL(Остатки.КоличествоОстаток, 0) КАК Остаток,
	|	ЕСТЬNULL(Остатки.РезервОстаток, 0) КАК Резерв,
	|	ЕСТЬNULL(Заказано.ЗаказаноОстаток, 0) КАК Заказано,
	|	ЕСТЬNULL(Остатки.КоличествоОстаток, 0) - ЕСТЬNULL(Остатки.РезервОстаток, 0) + ЕСТЬNULL(Заказано.ЗаказаноОстаток, 0) КАК Итог,
	|	ПродажиВТекущемМесяце.Показатель КАК ПродажиВТекущемМесяце,
	|	ПродажиВПредыдущемМесяце1.Показатель КАК ПродажиВПредыдущемМесяце1,
	|	ПродажиВПредыдущемМесяце2.Показатель КАК ПродажиВПредыдущемМесяце2,
	|	ПродажиВПредыдущемМесяце3.Показатель КАК ПродажиВПредыдущемМесяце3,
	|	ПродажиВПредыдущемМесяце4.Показатель КАК ПродажиВПредыдущемМесяце4,
	|	ПродажиВПредыдущемМесяце5.Показатель КАК ПродажиВПредыдущемМесяце5,
	|	ПродажиВПредыдущемМесяце6.Показатель КАК ПродажиВПредыдущемМесяце6,
	|	ПродажиВПредыдущемМесяце7.Показатель КАК ПродажиВПредыдущемМесяце7,
	|	ПродажиВПредыдущемМесяце8.Показатель КАК ПродажиВПредыдущемМесяце8,
	|	ПродажиВПредыдущемМесяце9.Показатель КАК ПродажиВПредыдущемМесяце9,
	|	ПродажиВПредыдущемМесяце10.Показатель КАК ПродажиВПредыдущемМесяце10,
	|	ПродажиВПредыдущемМесяце11.Показатель КАК ПродажиВПредыдущемМесяце11,
	|	Renault_ЗначенияТочкиЗаказаСрезПоследних.ТочкаЗаказа + &ПериодЗаказа * Renault_ЗначенияТочкиЗаказаСрезПоследних.СреднедневныеПродажи КАК Заказ,
	|	Renault_КаталогРеферансов.Сегмент КАК СегментНоменклатуры,
	|	Renault_КаталогРеферансов.ТехСемья КАК СемьяНоменклатуры,
	|	ЕСТЬNULL(Renault_ТарифЦен.Цена, 0) КАК ЦенаPNC,
	|	ВЫБОР
	|		КОГДА Renault_СтатусыНоменклатурыСрезПоследних.Статус В (ЗНАЧЕНИЕ(Справочник.Renault_СтатусыНоменклатуры.OFF), ЗНАЧЕНИЕ(Справочник.Renault_СтатусыНоменклатуры.KEY))
	|				ИЛИ Renault_ABCКлассификацияНоменклатурыСрезПоследних.Класс = ЗНАЧЕНИЕ(Перечисление.Renault_ABCКлассификация.DКласс)
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ КАК Заказывать,
	|	Renault_СтатусыНоменклатурыСрезПоследних.Статус,
	|	Renault_ABCКлассификацияНоменклатурыСрезПоследних.Класс КАК ABCКласс,
	|	Renault_XYZКлассификацияНоменклатурыСрезПоследних.Класс КАК XYZКласс,
	|	Renault_ЗначенияТочкиЗаказаСрезПоследних.Сигма,
	|	Renault_ЗначенияТочкиЗаказаСрезПоследних.СредниеПродажи
	|ИЗ
	|	РегистрСведений.Renault_ЗначенияТочкиЗаказа.СрезПоследних(
	|			,
	|			СкладКомпании В
	|				(ВЫБРАТЬ
	|					Таб.Склад
	|				ИЗ
	|					ВТ_Склады КАК Таб)) КАК Renault_ЗначенияТочкиЗаказаСрезПоследних
	|		ЛЕВОЕ СОЕДИНЕНИЕ Остатки КАК Остатки
	|		ПО Renault_ЗначенияТочкиЗаказаСрезПоследних.Номенклатура = Остатки.Номенклатура
	|		ЛЕВОЕ СОЕДИНЕНИЕ Заказано КАК Заказано
	|		ПО Renault_ЗначенияТочкиЗаказаСрезПоследних.Номенклатура = Заказано.Номенклатура
	|		ЛЕВОЕ СОЕДИНЕНИЕ ПродажиВТекущемМесяце КАК ПродажиВТекущемМесяце
	|		ПО Renault_ЗначенияТочкиЗаказаСрезПоследних.Номенклатура = ПродажиВТекущемМесяце.Номенклатура
	|		ЛЕВОЕ СОЕДИНЕНИЕ ПродажиВПредыдущемМесяце1 КАК ПродажиВПредыдущемМесяце1
	|		ПО Renault_ЗначенияТочкиЗаказаСрезПоследних.Номенклатура = ПродажиВПредыдущемМесяце1.Номенклатура
	|		ЛЕВОЕ СОЕДИНЕНИЕ ПродажиВПредыдущемМесяце2 КАК ПродажиВПредыдущемМесяце2
	|		ПО Renault_ЗначенияТочкиЗаказаСрезПоследних.Номенклатура = ПродажиВПредыдущемМесяце2.Номенклатура
	|		ЛЕВОЕ СОЕДИНЕНИЕ ПродажиВПредыдущемМесяце3 КАК ПродажиВПредыдущемМесяце3
	|		ПО Renault_ЗначенияТочкиЗаказаСрезПоследних.Номенклатура = ПродажиВПредыдущемМесяце3.Номенклатура
	|		ЛЕВОЕ СОЕДИНЕНИЕ ПродажиВПредыдущемМесяце4 КАК ПродажиВПредыдущемМесяце4
	|		ПО Renault_ЗначенияТочкиЗаказаСрезПоследних.Номенклатура = ПродажиВПредыдущемМесяце4.Номенклатура
	|		ЛЕВОЕ СОЕДИНЕНИЕ ПродажиВПредыдущемМесяце5 КАК ПродажиВПредыдущемМесяце5
	|		ПО Renault_ЗначенияТочкиЗаказаСрезПоследних.Номенклатура = ПродажиВПредыдущемМесяце5.Номенклатура
	|		ЛЕВОЕ СОЕДИНЕНИЕ ПродажиВПредыдущемМесяце6 КАК ПродажиВПредыдущемМесяце6
	|		ПО Renault_ЗначенияТочкиЗаказаСрезПоследних.Номенклатура = ПродажиВПредыдущемМесяце6.Номенклатура
	|		ЛЕВОЕ СОЕДИНЕНИЕ ПродажиВПредыдущемМесяце7 КАК ПродажиВПредыдущемМесяце7
	|		ПО Renault_ЗначенияТочкиЗаказаСрезПоследних.Номенклатура = ПродажиВПредыдущемМесяце7.Номенклатура
	|		ЛЕВОЕ СОЕДИНЕНИЕ ПродажиВПредыдущемМесяце8 КАК ПродажиВПредыдущемМесяце8
	|		ПО Renault_ЗначенияТочкиЗаказаСрезПоследних.Номенклатура = ПродажиВПредыдущемМесяце8.Номенклатура
	|		ЛЕВОЕ СОЕДИНЕНИЕ ПродажиВПредыдущемМесяце9 КАК ПродажиВПредыдущемМесяце9
	|		ПО Renault_ЗначенияТочкиЗаказаСрезПоследних.Номенклатура = ПродажиВПредыдущемМесяце9.Номенклатура
	|		ЛЕВОЕ СОЕДИНЕНИЕ ПродажиВПредыдущемМесяце10 КАК ПродажиВПредыдущемМесяце10
	|		ПО Renault_ЗначенияТочкиЗаказаСрезПоследних.Номенклатура = ПродажиВПредыдущемМесяце10.Номенклатура
	|		ЛЕВОЕ СОЕДИНЕНИЕ ПродажиВПредыдущемМесяце11 КАК ПродажиВПредыдущемМесяце11
	|		ПО Renault_ЗначенияТочкиЗаказаСрезПоследних.Номенклатура = ПродажиВПредыдущемМесяце11.Номенклатура
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.Renault_КаталогРеферансов КАК Renault_КаталогРеферансов
	|		ПО Renault_ЗначенияТочкиЗаказаСрезПоследних.Номенклатура.Артикул = Renault_КаталогРеферансов.Артикул
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.Renault_ТарифЦен КАК Renault_ТарифЦен
	|		ПО Renault_ЗначенияТочкиЗаказаСрезПоследних.Номенклатура.Артикул = Renault_ТарифЦен.Артикул
	|			И (Renault_ТарифЦен.ТипЦены = ЗНАЧЕНИЕ(Справочник.ТипыЦен.ОсновнойТипЦенЗакупки))
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.Renault_СтатусыНоменклатуры.СрезПоследних КАК Renault_СтатусыНоменклатурыСрезПоследних
	|		ПО Renault_ЗначенияТочкиЗаказаСрезПоследних.Номенклатура = Renault_СтатусыНоменклатурыСрезПоследних.Номенклатура
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.Renault_XYZКлассификацияНоменклатуры.СрезПоследних КАК Renault_XYZКлассификацияНоменклатурыСрезПоследних
	|		ПО Renault_ЗначенияТочкиЗаказаСрезПоследних.Номенклатура = Renault_XYZКлассификацияНоменклатурыСрезПоследних.Номенклатура
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.Renault_ABCКлассификацияНоменклатуры.СрезПоследних КАК Renault_ABCКлассификацияНоменклатурыСрезПоследних
	|		ПО Renault_ЗначенияТочкиЗаказаСрезПоследних.Номенклатура = Renault_ABCКлассификацияНоменклатурыСрезПоследних.Номенклатура";
	
	Запрос.УстановитьПараметр("ГруппаАнализа", Объект.ГруппаАнализа);
    Запрос.УстановитьПараметр("Скл", Объект.ГруппаАнализа);
	Запрос.УстановитьПараметр("ТекущаяДата", ДатаОбработки);
	Запрос.УстановитьПараметр("ПериодЗаказа", Объект.ПериодЗаказа);
	Результат = Запрос.Выполнить();
	
	Выборка = Результат.Выбрать();
	

	
	Товары = Объект.Товары;
	Пока Выборка.Следующий() Цикл
		
		Нстр = Товары.Добавить();
		ЗаполнитьЗначенияСвойств(Нстр, Выборка);		
		Нстр.КЗаказу = ?(Выборка.Заказывать, Выборка.Заказ, 0); 
		Нстр.СтоимостьЗаказа = Нстр.КЗаказу*Нстр.ЦенаPNC;
		
		ОтобразитьОтклонениеПродаж(Выборка.СредниеПродажи, Выборка.ПродажиВТекущемМесяце, Выборка.Сигма, Нстр.ПродажиВТекущемМесяцеКартинка);
		Для сч=1 По 11 Цикл
			ОтобразитьОтклонениеПродаж(Выборка.СредниеПродажи, Выборка["ПродажиВТекущемМесяце"+сч], Выборка.Сигма, Выборка["ПродажиВТекущемМесяце"+сч+ "Картинка"]);
		КонецЦикла;
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура Заполнить(Команда)
	ЗаполнитьНаСервере();
КонецПроцедуры

&НаСервере
Процедура ОтобразитьОтклонениеПродаж(СредниеПродажи, ПродажиВМесяце, Сигма, Картинка)
	
	если  СредниеПродажи > ПродажиВМесяце Тогда 
		Отклонение = СредниеПродажи - ПродажиВМесяце;
		Если Отклонение > 1.5*Сигма Тогда
			Картинка = 5;			
		ИначеЕсли Отклонение > 0.5*Сигма Тогда
			Картинка = 1;
		Иначе 	
			Картинка = 0;
		КонецЕсли;
	иначе
		Отклонение = ПродажиВМесяце - СредниеПродажи;
		Если Отклонение > 1.5*Сигма Тогда
			Картинка = 8;			
		ИначеЕсли Отклонение > 0.5*Сигма Тогда
			Картинка = 4;
		Иначе 	
			Картинка = 0
		КонецЕсли;			
	КонецЕсли;
	
КонецПроцедуры 
