
Процедура ПриУстановкеНовогоКода(СтандартнаяОбработка, Префикс)
	Префикс = DMS_ОбщегоНазначенияСервер.ПолучитьПрефикс();
	//Если НЕ спПриУстановкеНовогоКода(ЭтотОбъект, СтандартнаяОбработка, Префикс) Тогда Возврат; КонецЕсли;
КонецПроцедуры

Процедура ПередЗаписью(Отказ)	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
КонецПроцедуры

Процедура ФормированиеНаименованияЧерновикаАвтомобиля(ГосНомер,ИмяРеквизитаНаименования=Неопределено) Экспорт
	НовоеНаименование="";
	НовоеНаименованиеПолное="";
	Если НЕ обЗначениеНеЗаполнено(Модель) Тогда
		Если НЕ ПустаяСтрока(НовоеНаименование) Тогда
			НовоеНаименование=НовоеНаименование+" ";
		КонецЕсли; 
		НовоеНаименование=НовоеНаименование+СокрЛП(Модель);
		Если НЕ ПустаяСтрока(НовоеНаименованиеПолное) Тогда
			НовоеНаименованиеПолное=НовоеНаименованиеПолное+" ";
		КонецЕсли;
		Если ПустаяСтрока(СокрЛП(Модель.НаименованиеПолное)) Тогда
			НовоеНаименованиеПолное=НовоеНаименованиеПолное+СокрЛП(Модель.Наименование);
		Иначе
			НовоеНаименованиеПолное=НовоеНаименованиеПолное+СокрЛП(Модель.НаименованиеПолное);
		КонецЕсли; 
	КонецЕсли;
	Если НЕ обЗначениеНеЗаполнено(Цвет) Тогда
		Если НЕ ПустаяСтрока(НовоеНаименование) Тогда
			НовоеНаименование=НовоеНаименование+" ";
		КонецЕсли; 
		НовоеНаименование=НовоеНаименование+СокрЛП(Цвет);
		Если НЕ ПустаяСтрока(НовоеНаименованиеПолное) Тогда
			НовоеНаименованиеПолное=НовоеНаименованиеПолное+" ";
		КонецЕсли; 
		НовоеНаименованиеПолное=НовоеНаименованиеПолное+СокрЛП(Цвет);
	КонецЕсли; 
	Если НЕ обЗначениеНеЗаполнено(ГосНомер) Тогда
		Если НЕ ПустаяСтрока(НовоеНаименование) Тогда
			НовоеНаименование=НовоеНаименование+" ";
		КонецЕсли; 
		НовоеНаименование=НовоеНаименование+"№ "+СокрЛП(ГосНомер);
		Если НЕ ПустаяСтрока(НовоеНаименованиеПолное) Тогда
			НовоеНаименованиеПолное=НовоеНаименованиеПолное+" ";
		КонецЕсли; 
		НовоеНаименованиеПолное=НовоеНаименованиеПолное+"№ "+СокрЛП(ГосНомер);
	КонецЕсли;
	Если НЕ обЗначениеНеЗаполнено(VIN) Тогда
		Если НЕ ПустаяСтрока(НовоеНаименование) Тогда
			НовоеНаименование=НовоеНаименование+" ";
		КонецЕсли; 
		НовоеНаименование=НовоеНаименование+"VIN "+СокрЛП(VIN);
		Если НЕ ПустаяСтрока(НовоеНаименованиеПолное) Тогда
			НовоеНаименованиеПолное=НовоеНаименованиеПолное+" ";
		КонецЕсли; 
		НовоеНаименованиеПолное=НовоеНаименованиеПолное+"VIN "+СокрЛП(VIN);
	КонецЕсли;
	Если ИмяРеквизитаНаименования=Неопределено ИЛИ ИмяРеквизитаНаименования="Наименование" Тогда
		Если НЕ ПустаяСтрока(НовоеНаименование) Тогда
			Наименование=НовоеНаименование;
		КонецЕсли; 
	КонецЕсли; 
	Если ИмяРеквизитаНаименования=Неопределено ИЛИ ИмяРеквизитаНаименования="НаименованиеПолное" Тогда
		Если НЕ ПустаяСтрока(НовоеНаименованиеПолное) Тогда
			НаименованиеПолное=НовоеНаименованиеПолное;
		КонецЕсли; 
	КонецЕсли; 
КонецПроцедуры
