
Функция ПолучитьТаблицуОткрытогоТрафика(ТаблицаТрафика = Неопределено, СтруктураНастроекСписка = Неопределено, НастройкиКонтактЦентра = Неопределено, ПраваПользователя, НачалоПериода, КонецПериода, ПоказатьТрафикПоМенеджерам = Ложь) Экспорт
	
	//ТаблицаТрафика = новый ТаблицаЗначений();
	Запрос = Новый Запрос;
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	НастройкиКонтактЦентра.ДилерскийЦентр,
	|	НастройкиКонтактЦентра.ТипТрафика,
	|	НастройкиКонтактЦентра.ТипЛида,
	|	НастройкиКонтактЦентра.ПереводТрафика,
	|	НастройкиКонтактЦентра.СозданиеРЛ,
	|	НастройкиКонтактЦентра.ВидимостьСвой,
	|	НастройкиКонтактЦентра.ВидимостьЧужой,
	|	НастройкиКонтактЦентра.ВидимостьОбщий
	|ПОМЕСТИТЬ НастройкиКонтактЦентра
	|ИЗ
	|	&НастройкиКонтактЦентра КАК НастройкиКонтактЦентра
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Renault_ТрафикПоСотрудникам.ИдТрафика
	|ПОМЕСТИТЬ ОтветыЛИД
	|ИЗ
	|	РегистрСведений.Renault_ТрафикПоСотрудникам КАК Renault_ТрафикПоСотрудникам
	|ГДЕ
	|	Renault_ТрафикПоСотрудникам.Отвечен = ИСТИНА
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Renault_ПользователиЧата.id_user,
	|	ВЫБОР
	|		КОГДА Renault_ОК_НовыйНеПросмотренныйТрафикСрезПоследних.Идентификатор ЕСТЬ NULL 
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ КАК ЕстьНовыеСообщения,
	|	Renault_ТрафикСрезПоследних.Период КАК Время,
	|	Renault_ТрафикСрезПоследних.Идентификатор КАК Идентификатор,
	|	Renault_ТрафикСрезПоследних.ТипТрафика КАК ТипТрафика,
	|	Renault_ТрафикСрезПоследних.Обработан КАК Обработан,
	|	Renault_ТрафикСрезПоследних.Отдел КАК Отдел,
	|	Renault_ТрафикСрезПоследних.Менеджер КАК Менеджер,
	|	Renault_ТрафикСрезПоследних.Администратор КАК Администратор,
	|	Renault_ТрафикСрезПоследних.Клиент КАК Клиент,
	|	Renault_ТрафикСрезПоследних.Клиент КАК Имя,
	|	Renault_ТрафикСрезПоследних.ПервичныйПовторный КАК ПервичныйПовторный,
	|	Renault_ТрафикСрезПоследних.ДилерскийЦентр КАК ДилерскийЦентр,
	|	Renault_ТрафикСрезПоследних.Представление КАК Представление,
	|	Renault_ТрафикСрезПоследних.Комментарий КАК Комментарий,
	|	Renault_ТрафикСрезПоследних.ПервичныйИнтерес КАК ПервичныйИнтерес,
	|	Renault_ТрафикСрезПоследних.ИсточникИнформации КАК ИсточникИнформации,
	|	ВЫБОР
	|		КОГДА Renault_ОК_ПользователиОнлайн.id_user ЕСТЬ NULL 
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ КАК ПользовательОнлайн,
	|	""Онлайн Консультант"" КАК ВидУслуги,
	|	ВЫБОР
	|		КОГДА Renault_ОК_Сообщения.IDТрафика ЕСТЬ NULL 
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ КАК ОтветОтправлен,
	|	НастройкиКонтактЦентра.ВидимостьСвой КАК ВидимостьСвой,
	|	NULL КАК ПодТип,
	|	ДОБАВИТЬКДАТЕ(Renault_ТрафикСрезПоследних.Период, ЧАС, 24) КАК ОбработатьДО,
	|	ЛОЖЬ КАК Синхронизация
	|ИЗ
	|	РегистрСведений.Renault_ПользователиЧата КАК Renault_ПользователиЧата
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.Renault_Трафик.СрезПоследних(
	|				,
	|				ТипТрафика = ЗНАЧЕНИЕ(Справочник.CRM_ТипТрафика.OnlineКонсультант)
	|					И Закрытый = ЛОЖЬ) КАК Renault_ТрафикСрезПоследних
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.Renault_ОК_НовыйНеПросмотренныйТрафик.СрезПоследних(, ) КАК Renault_ОК_НовыйНеПросмотренныйТрафикСрезПоследних
	|			ПО Renault_ТрафикСрезПоследних.Идентификатор = Renault_ОК_НовыйНеПросмотренныйТрафикСрезПоследних.Идентификатор
	|			ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ РАЗЛИЧНЫЕ
	|				Renault_ОК_Сообщения.IDТрафика КАК IDТрафика
	|			ИЗ
	|				РегистрСведений.Renault_ОК_Сообщения КАК Renault_ОК_Сообщения
	|			ГДЕ
	|				Renault_ОК_Сообщения.is_from = 2) КАК Renault_ОК_Сообщения
	|			ПО Renault_ТрафикСрезПоследних.Идентификатор = Renault_ОК_Сообщения.IDТрафика
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ НастройкиКонтактЦентра КАК НастройкиКонтактЦентра
	|			ПО Renault_ТрафикСрезПоследних.ДилерскийЦентр = НастройкиКонтактЦентра.ДилерскийЦентр
	|				И (НастройкиКонтактЦентра.ТипТрафика = Renault_ТрафикСрезПоследних.ТипТрафика)
	|		ПО (Renault_ТрафикСрезПоследних.Клиент = Renault_ПользователиЧата.Клиент)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.Renault_ОК_ПользователиОнлайн КАК Renault_ОК_ПользователиОнлайн
	|		ПО Renault_ПользователиЧата.id_user = Renault_ОК_ПользователиОнлайн.id_user
	|ГДЕ
	|	&ПоказыватьОК = ИСТИНА
	|	И ВЫБОР
	|			КОГДА ГОД(&НачалоПериода) > 1
	|				ТОГДА Renault_ТрафикСрезПоследних.Период >= &НачалоПериода
	|						ИЛИ &ВыводитьВсеНеобработанные = ИСТИНА
	|							И Renault_ТрафикСрезПоследних.Обработан = ЛОЖЬ
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ
	|	И ВЫБОР
	|			КОГДА ГОД(&КонецПериода) > 1
	|				ТОГДА Renault_ТрафикСрезПоследних.Период <= &КонецПериода
	|						ИЛИ &ВыводитьВсеНеобработанные = ИСТИНА
	|							И Renault_ТрафикСрезПоследних.Обработан = ЛОЖЬ
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ
	|	И Renault_ТрафикСрезПоследних.Менеджер = ЗНАЧЕНИЕ(Справочник.Сотрудники.ПустаяСсылка)
	|	И ВЫБОР
	|			КОГДА НастройкиКонтактЦентра.ВидимостьОбщий = ЛОЖЬ
	|				ТОГДА ЛОЖЬ
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	"""",
	|	ВЫБОР
	|		КОГДА ТрафикПросмотр.ИдТрафика ЕСТЬ NULL 
	|				ИЛИ ТрафикПросмотр.Просмотрен = ЛОЖЬ
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ,
	|	Renault_Лид.ДатаЗаогрузки,
	|	Renault_ТрафикСрезПоследних.Идентификатор,
	|	Renault_ТрафикСрезПоследних.ТипТрафика,
	|	Renault_ТрафикСрезПоследних.Обработан,
	|	Renault_ТрафикСрезПоследних.Отдел,
	|	Renault_ТрафикСрезПоследних.Менеджер,
	|	Renault_ТрафикСрезПоследних.Администратор,
	|	Renault_ТрафикСрезПоследних.Клиент,
	|	Renault_ТрафикСрезПоследних.Клиент,
	|	Renault_ТрафикСрезПоследних.ПервичныйПовторный,
	|	Renault_ТрафикСрезПоследних.ДилерскийЦентр,
	|	Renault_ТрафикСрезПоследних.Представление,
	|	Renault_ТрафикСрезПоследних.Комментарий,
	|	Renault_ТрафикСрезПоследних.ПервичныйИнтерес,
	|	Renault_ТрафикСрезПоследних.ИсточникИнформации,
	|	ЛОЖЬ,
	|	ПРЕДСТАВЛЕНИЕ(Renault_Лид.ВидУслуги.Классификация),
	|	ВЫБОР
	|		КОГДА ТрафикОтвечен.ИдТрафика ЕСТЬ NULL 
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ,
	|	ЛОЖЬ,
	|	ПРЕДСТАВЛЕНИЕ(Renault_Лид.ВидУслуги.Тип),
	|	Renault_Лид.КритическаяДата,
	|	ВЫБОР
	|		КОГДА НЕ ВложенныйЗапрос.ДатаОтвета ЕСТЬ NULL 
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ
	|ИЗ
	|	РегистрСведений.Renault_Трафик.СрезПоследних(
	|			,
	|			ТипТрафика = ЗНАЧЕНИЕ(Справочник.CRM_ТипТрафика.ЛидRenault)
	|				И Закрытый = ЛОЖЬ) КАК Renault_ТрафикСрезПоследних
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.Renault_ТрафикПоСотрудникам КАК ТрафикПросмотр
	|		ПО Renault_ТрафикСрезПоследних.Идентификатор = ТрафикПросмотр.ИдТрафика
	|			И (ТрафикПросмотр.Сотрудник = &Сотрудник)
	|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ РАЗЛИЧНЫЕ
	|			ОтветыЛИД.ИдТрафика КАК ИдТрафика
	|		ИЗ
	|			ОтветыЛИД КАК ОтветыЛИД) КАК ТрафикОтвечен
	|		ПО Renault_ТрафикСрезПоследних.Идентификатор = ТрафикОтвечен.ИдТрафика
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.Renault_Лид КАК Renault_Лид
	|		ПО Renault_ТрафикСрезПоследних.Идентификатор = Renault_Лид.ТрафикИД
	|		ЛЕВОЕ СОЕДИНЕНИЕ НастройкиКонтактЦентра КАК НастройкиКонтактЦентра
	|		ПО Renault_ТрафикСрезПоследних.ДилерскийЦентр = НастройкиКонтактЦентра.ДилерскийЦентр
	|			И (НастройкиКонтактЦентра.ТипТрафика = Renault_ТрафикСрезПоследних.ТипТрафика)
	|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|			Renault_ОтветыНаЛиды.ИдТрафика КАК ИдТрафика,
	|			Renault_ОтветыНаЛиды.ДатаОтвета КАК ДатаОтвета
	|		ИЗ
	|			РегистрСведений.Renault_ОтветыНаЛиды КАК Renault_ОтветыНаЛиды
	|				ВНУТРЕННЕЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|					Renault_ОтветыНаЛиды.ИдТрафика КАК ИдТрафика,
	|					МАКСИМУМ(Renault_ОтветыНаЛиды.ДатаОтвета) КАК ДатаОтвета
	|				ИЗ
	|					РегистрСведений.Renault_ОтветыНаЛиды КАК Renault_ОтветыНаЛиды
	|				ГДЕ
	|					Renault_ОтветыНаЛиды.ВидСообщения <> 10
	|				
	|				СГРУППИРОВАТЬ ПО
	|					Renault_ОтветыНаЛиды.ИдТрафика) КАК ВложенныйЗапрос
	|				ПО Renault_ОтветыНаЛиды.ИдТрафика = ВложенныйЗапрос.ИдТрафика
	|					И Renault_ОтветыНаЛиды.ДатаОтвета = ВложенныйЗапрос.ДатаОтвета
	|		ГДЕ
	|			Renault_ОтветыНаЛиды.Отправлен) КАК ВложенныйЗапрос
	|		ПО Renault_ТрафикСрезПоследних.Идентификатор = ВложенныйЗапрос.ИдТрафика
	|ГДЕ
	|	&ПоказыватьЛиды = ИСТИНА
	|	И ВЫБОР
	|			КОГДА ГОД(&НачалоПериода) > 1
	|				ТОГДА Renault_Лид.ДатаЗаогрузки >= &НачалоПериода
	|						ИЛИ &ВыводитьВсеНеобработанные = ИСТИНА
	|							И Renault_ТрафикСрезПоследних.Обработан = ЛОЖЬ
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ
	|	И ВЫБОР
	|			КОГДА ГОД(&КонецПериода) > 1
	|				ТОГДА Renault_Лид.ДатаЗаогрузки <= &КонецПериода
	|						ИЛИ &ВыводитьВсеНеобработанные = ИСТИНА
	|							И Renault_ТрафикСрезПоследних.Обработан = ЛОЖЬ
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ
	|	И Renault_ТрафикСрезПоследних.Менеджер = ЗНАЧЕНИЕ(Справочник.Сотрудники.ПустаяСсылка)
	|	И ВЫБОР
	|			КОГДА НастройкиКонтактЦентра.ВидимостьОбщий = ЛОЖЬ
	|				ТОГДА ЛОЖЬ
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ
	|	И НастройкиКонтактЦентра.ТипЛида = Renault_Лид.ВидУслуги.Тип
	|	И Renault_Лид.ТрафикОбработан = ЛОЖЬ
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	"""",
	|	ВЫБОР
	|		КОГДА Renault_ТрафикПисьма.ТрафикПросмотрен = 0
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ,
	|	Renault_ТрафикСрезПоследних.Период,
	|	Renault_ТрафикСрезПоследних.Идентификатор,
	|	Renault_ТрафикСрезПоследних.ТипТрафика,
	|	Renault_ТрафикСрезПоследних.Обработан,
	|	Renault_ТрафикСрезПоследних.Отдел,
	|	Renault_ТрафикСрезПоследних.Менеджер,
	|	Renault_ТрафикСрезПоследних.Администратор,
	|	Renault_ТрафикСрезПоследних.Клиент,
	|	Renault_ТрафикСрезПоследних.Клиент,
	|	Renault_ТрафикСрезПоследних.ПервичныйПовторный,
	|	Renault_ТрафикСрезПоследних.ДилерскийЦентр,
	|	Renault_ТрафикСрезПоследних.Представление,
	|	Renault_ТрафикСрезПоследних.Комментарий,
	|	Renault_ТрафикСрезПоследних.ПервичныйИнтерес,
	|	Renault_ТрафикСрезПоследних.ИсточникИнформации,
	|	ЛОЖЬ,
	|	""Электронное письмо"",
	|	ВЫБОР
	|		КОГДА Renault_ОтветыНаПисьмо.ИдТрафика ЕСТЬ NULL 
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ,
	|	ЛОЖЬ,
	|	NULL,
	|	ДОБАВИТЬКДАТЕ(Renault_ТрафикСрезПоследних.Период, ЧАС, 24),
	|	ЛОЖЬ
	|ИЗ
	|	РегистрСведений.Renault_Трафик.СрезПоследних(
	|			,
	|			ТипТрафика = ЗНАЧЕНИЕ(Справочник.CRM_ТипТрафика.email)
	|				И Закрытый = ЛОЖЬ) КАК Renault_ТрафикСрезПоследних
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|			Renault_ТрафикПисьма.ИдТрафика КАК ИдТрафика,
	|			Renault_ТрафикПисьма.УчетнаяЗапись КАК УчетнаяЗапись,
	|			СУММА(ВЫБОР
	|					КОГДА Renault_ТрафикПисьма.ТрафикПросмотрен
	|						ТОГДА 0
	|					ИНАЧЕ 1
	|				КОНЕЦ) КАК ТрафикПросмотрен
	|		ИЗ
	|			РегистрСведений.Renault_ТрафикПисьма КАК Renault_ТрафикПисьма
	|		
	|		СГРУППИРОВАТЬ ПО
	|			Renault_ТрафикПисьма.ИдТрафика,
	|			Renault_ТрафикПисьма.УчетнаяЗапись) КАК Renault_ТрафикПисьма
	|		ПО Renault_ТрафикСрезПоследних.Идентификатор = Renault_ТрафикПисьма.ИдТрафика
	|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ РАЗЛИЧНЫЕ
	|			Renault_ОтветыНаПисьмо.ИдТрафика КАК ИдТрафика
	|		ИЗ
	|			РегистрСведений.Renault_ОтветыНаПисьмо КАК Renault_ОтветыНаПисьмо) КАК Renault_ОтветыНаПисьмо
	|		ПО Renault_ТрафикСрезПоследних.Идентификатор = Renault_ОтветыНаПисьмо.ИдТрафика
	|		ЛЕВОЕ СОЕДИНЕНИЕ НастройкиКонтактЦентра КАК НастройкиКонтактЦентра
	|		ПО Renault_ТрафикСрезПоследних.ДилерскийЦентр = НастройкиКонтактЦентра.ДилерскийЦентр
	|			И (НастройкиКонтактЦентра.ТипТрафика = Renault_ТрафикСрезПоследних.ТипТрафика)
	|ГДЕ
	|	&ПоказыватьПочту = ИСТИНА
	|	И ВЫБОР
	|			КОГДА ГОД(&НачалоПериода) > 1
	|				ТОГДА Renault_ТрафикСрезПоследних.Период >= &НачалоПериода
	|						ИЛИ &ВыводитьВсеНеобработанные = ИСТИНА
	|							И Renault_ТрафикСрезПоследних.Обработан = ЛОЖЬ
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ
	|	И ВЫБОР
	|			КОГДА ГОД(&КонецПериода) > 1
	|				ТОГДА Renault_ТрафикСрезПоследних.Период <= &КонецПериода
	|						ИЛИ &ВыводитьВсеНеобработанные = ИСТИНА
	|							И Renault_ТрафикСрезПоследних.Обработан = ЛОЖЬ
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ
	|	И Renault_ТрафикСрезПоследних.Менеджер = ЗНАЧЕНИЕ(Справочник.Сотрудники.ПустаяСсылка)
	|	И ВЫБОР
	|			КОГДА НастройкиКонтактЦентра.ВидимостьОбщий = ЛОЖЬ
	|				ТОГДА ЛОЖЬ
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ
	|
	|УПОРЯДОЧИТЬ ПО
	|	Время УБЫВ";
	Запрос.УстановитьПараметр("НачалоПериода", НачалоПериода);
	Запрос.УстановитьПараметр("КонецПериода", КонецПериода);
	Запрос.УстановитьПараметр("Сотрудник", ПараметрыСеанса.Пользователь.Сотрудник);
	Запрос.УстановитьПараметр("ПоказатьТрафикПоМенеджерам", ПоказатьТрафикПоМенеджерам);
	
	Запрос.УстановитьПараметр("ИспользуетсяОК", ПраваПользователя.РаботаетОнлайнКонсультант);
	Запрос.УстановитьПараметр("ИспользуютсяЛиды", ПраваПользователя.РаботаютЛиды);
	Запрос.УстановитьПараметр("ИспользуетсяПочта", ПраваПользователя.РаботаетПочта);
	
	Запрос.УстановитьПараметр("ПоказыватьОК", СтруктураНастроекСписка.ОтображаемыеТипыТрафика.ПоказыватьОК);
	Запрос.УстановитьПараметр("ПоказыватьПочту", СтруктураНастроекСписка.ОтображаемыеТипыТрафика.ПоказыватьПочту);
	Запрос.УстановитьПараметр("ПоказыватьЛиды", СтруктураНастроекСписка.ОтображаемыеТипыТрафика.ПоказыватьЛиды);
	Запрос.УстановитьПараметр("ВыводитьВсеНеобработанные", СтруктураНастроекСписка.ВыводитьВсеНеобработанные);
	
	Запрос.УстановитьПараметр("НастройкиКонтактЦентра", НастройкиКонтактЦентра);
	//СтрокаПараметра = ПараметрыОК.ПочтовыеАдреса.Найти(ПараметрыСеанса.Пользователь.Сотрудник, "Сотрудник");
	//Если СтрокаПараметра <> Неопределено Тогда
	//	Запрос.УстановитьПараметр("ТекущаяУчетнаяЗапись", СтрокаПараметра.УчетнаяЗапись);
	//Иначе
	//	Запрос.УстановитьПараметр("ТекущаяУчетнаяЗапись", Справочники.Renault_НастройкиОнлайнКонсультанта.ПустаяСсылка());
	//КонецЕсли;
	
	ТаблицаТрафика = Запрос.Выполнить().Выгрузить();
	Возврат ТаблицаТрафика;
	
КонецФункции

Функция ПолучитьТаблицуОткрытогоТрафикаПоМенеджерам(СтруктураНастроекСписка = Неопределено, НастройкиКонтактЦентра = Неопределено, ПраваПользователя, НачалоПериода, КонецПериода, ПоказатьТрафикПоМенеджерам = Ложь) Экспорт
	
	ТаблицаТрафика = новый ТаблицаЗначений();
	Запрос = Новый Запрос;
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	НастройкиКонтактЦентра.ДилерскийЦентр,
	|	НастройкиКонтактЦентра.ТипТрафика,
	|	НастройкиКонтактЦентра.ТипЛида,
	|	НастройкиКонтактЦентра.ПереводТрафика,
	|	НастройкиКонтактЦентра.СозданиеРЛ,
	|	НастройкиКонтактЦентра.ВидимостьСвой,
	|	НастройкиКонтактЦентра.ВидимостьЧужой,
	|	НастройкиКонтактЦентра.ВидимостьОбщий
	|ПОМЕСТИТЬ НастройкиКонтактЦентра
	|ИЗ
	|	&НастройкиКонтактЦентра КАК НастройкиКонтактЦентра
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Renault_ТрафикПоСотрудникам.ИдТрафика
	|ПОМЕСТИТЬ ОтветыЛИД
	|ИЗ
	|	РегистрСведений.Renault_ТрафикПоСотрудникам КАК Renault_ТрафикПоСотрудникам
	|ГДЕ
	|	Renault_ТрафикПоСотрудникам.Отвечен = ИСТИНА
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Renault_ПользователиЧата.id_user,
	|	ВЫБОР
	|		КОГДА Renault_ОК_НовыйНеПросмотренныйТрафикСрезПоследних.Идентификатор ЕСТЬ NULL 
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ КАК ЕстьНовыеСообщения,
	|	Renault_ТрафикСрезПоследних.Период КАК Время,
	|	Renault_ТрафикСрезПоследних.Идентификатор КАК Идентификатор,
	|	Renault_ТрафикСрезПоследних.ТипТрафика КАК ТипТрафика,
	|	Renault_ТрафикСрезПоследних.Обработан КАК Обработан,
	|	Renault_ТрафикСрезПоследних.Отдел КАК Отдел,
	|	Renault_ТрафикСрезПоследних.Менеджер КАК Менеджер,
	|	Renault_ТрафикСрезПоследних.Администратор КАК Администратор,
	|	Renault_ТрафикСрезПоследних.Клиент КАК Клиент,
	|	Renault_ТрафикСрезПоследних.Клиент КАК Имя,
	|	Renault_ТрафикСрезПоследних.ПервичныйПовторный КАК ПервичныйПовторный,
	|	Renault_ТрафикСрезПоследних.ДилерскийЦентр КАК ДилерскийЦентр,
	|	Renault_ТрафикСрезПоследних.Представление КАК Представление,
	|	Renault_ТрафикСрезПоследних.Комментарий КАК Комментарий,
	|	Renault_ТрафикСрезПоследних.ПервичныйИнтерес КАК ПервичныйИнтерес,
	|	Renault_ТрафикСрезПоследних.ИсточникИнформации КАК ИсточникИнформации,
	|	ВЫБОР
	|		КОГДА Renault_ОК_ПользователиОнлайн.id_user ЕСТЬ NULL 
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ КАК ПользовательОнлайн,
	|	""Онлайн Консультант"" КАК ВидУслуги,
	|	ВЫБОР
	|		КОГДА Renault_ОК_Сообщения.IDТрафика ЕСТЬ NULL 
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ КАК ОтветОтправлен,
	|	НастройкиКонтактЦентра.ВидимостьСвой КАК ВидимостьСвой,
	|	NULL КАК ПодТип,
	|	ДОБАВИТЬКДАТЕ(Renault_ТрафикСрезПоследних.Период, ЧАС, 24) КАК ОбработатьДО,
	|	ЛОЖЬ КАК Синхронизация
	|ИЗ
	|	РегистрСведений.Renault_ПользователиЧата КАК Renault_ПользователиЧата
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.Renault_Трафик.СрезПоследних(
	|				,
	|				ТипТрафика = ЗНАЧЕНИЕ(Справочник.CRM_ТипТрафика.OnlineКонсультант)
	|					И Закрытый = ЛОЖЬ) КАК Renault_ТрафикСрезПоследних
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.Renault_ОК_НовыйНеПросмотренныйТрафик.СрезПоследних(, ) КАК Renault_ОК_НовыйНеПросмотренныйТрафикСрезПоследних
	|			ПО Renault_ТрафикСрезПоследних.Идентификатор = Renault_ОК_НовыйНеПросмотренныйТрафикСрезПоследних.Идентификатор
	|			ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ РАЗЛИЧНЫЕ
	|				Renault_ОК_Сообщения.IDТрафика КАК IDТрафика
	|			ИЗ
	|				РегистрСведений.Renault_ОК_Сообщения КАК Renault_ОК_Сообщения
	|			ГДЕ
	|				Renault_ОК_Сообщения.is_from = 2) КАК Renault_ОК_Сообщения
	|			ПО Renault_ТрафикСрезПоследних.Идентификатор = Renault_ОК_Сообщения.IDТрафика
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ НастройкиКонтактЦентра КАК НастройкиКонтактЦентра
	|			ПО Renault_ТрафикСрезПоследних.ДилерскийЦентр = НастройкиКонтактЦентра.ДилерскийЦентр
	|				И (НастройкиКонтактЦентра.ТипТрафика = Renault_ТрафикСрезПоследних.ТипТрафика)
	|		ПО (Renault_ТрафикСрезПоследних.Клиент = Renault_ПользователиЧата.Клиент)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.Renault_ОК_ПользователиОнлайн КАК Renault_ОК_ПользователиОнлайн
	|		ПО Renault_ПользователиЧата.id_user = Renault_ОК_ПользователиОнлайн.id_user
	|ГДЕ
	|	&ПоказыватьОК = ИСТИНА
	|	И ВЫБОР
	|			КОГДА ГОД(&НачалоПериода) > 1
	|				ТОГДА Renault_ТрафикСрезПоследних.Период >= &НачалоПериода
	|						ИЛИ &ВыводитьВсеНеобработанные = ИСТИНА
	|							И Renault_ТрафикСрезПоследних.Обработан = ЛОЖЬ
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ
	|	И ВЫБОР
	|			КОГДА ГОД(&КонецПериода) > 1
	|				ТОГДА Renault_ТрафикСрезПоследних.Период <= &КонецПериода
	|						ИЛИ &ВыводитьВсеНеобработанные = ИСТИНА
	|							И Renault_ТрафикСрезПоследних.Обработан = ЛОЖЬ
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ
	|	И Renault_ТрафикСрезПоследних.Менеджер <> ЗНАЧЕНИЕ(Справочник.Сотрудники.ПустаяСсылка)
	|	И ВЫБОР
	|			КОГДА НастройкиКонтактЦентра.ВидимостьСвой = ЛОЖЬ
	|					И Renault_ТрафикСрезПоследних.Менеджер = &Сотрудник
	|				ТОГДА ЛОЖЬ
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ
	|	И ВЫБОР
	|			КОГДА НастройкиКонтактЦентра.ВидимостьЧужой = ЛОЖЬ
	|					И Renault_ТрафикСрезПоследних.Менеджер <> &Сотрудник
	|				ТОГДА ЛОЖЬ
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	"""",
	|	ВЫБОР
	|		КОГДА ТрафикПросмотр.ИдТрафика ЕСТЬ NULL 
	|				ИЛИ ТрафикПросмотр.Просмотрен = ЛОЖЬ
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ,
	|	Renault_Лид.ДатаЗаогрузки,
	|	Renault_ТрафикСрезПоследних.Идентификатор,
	|	Renault_ТрафикСрезПоследних.ТипТрафика,
	|	Renault_ТрафикСрезПоследних.Обработан,
	|	Renault_ТрафикСрезПоследних.Отдел,
	|	Renault_ТрафикСрезПоследних.Менеджер,
	|	Renault_ТрафикСрезПоследних.Администратор,
	|	Renault_ТрафикСрезПоследних.Клиент,
	|	Renault_ТрафикСрезПоследних.Клиент,
	|	Renault_ТрафикСрезПоследних.ПервичныйПовторный,
	|	Renault_ТрафикСрезПоследних.ДилерскийЦентр,
	|	Renault_ТрафикСрезПоследних.Представление,
	|	Renault_ТрафикСрезПоследних.Комментарий,
	|	Renault_ТрафикСрезПоследних.ПервичныйИнтерес,
	|	Renault_ТрафикСрезПоследних.ИсточникИнформации,
	|	ЛОЖЬ,
	|	Представление(Renault_Лид.ВидУслуги.Классификация),
	|	ВЫБОР
	|		КОГДА ТрафикОтвечен.ИдТрафика ЕСТЬ NULL 
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ,
	|	ЛОЖЬ,
	|	Представление(Renault_Лид.ВидУслуги.Тип),
	|	Renault_Лид.КритическаяДата,
	|	ВЫБОР
	|		КОГДА НЕ ВложенныйЗапрос.ДатаОтвета ЕСТЬ NULL 
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ
	|ИЗ
	|	РегистрСведений.Renault_Трафик.СрезПоследних(
	|			,
	|			ТипТрафика = ЗНАЧЕНИЕ(Справочник.CRM_ТипТрафика.ЛидRenault)
	|				И Закрытый = ЛОЖЬ) КАК Renault_ТрафикСрезПоследних
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.Renault_ТрафикПоСотрудникам КАК ТрафикПросмотр
	|		ПО Renault_ТрафикСрезПоследних.Идентификатор = ТрафикПросмотр.ИдТрафика
	|			И (ТрафикПросмотр.Сотрудник = &Сотрудник)
	|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ РАЗЛИЧНЫЕ
	|			ОтветыЛИД.ИдТрафика КАК ИдТрафика
	|		ИЗ
	|			ОтветыЛИД КАК ОтветыЛИД) КАК ТрафикОтвечен
	|		ПО Renault_ТрафикСрезПоследних.Идентификатор = ТрафикОтвечен.ИдТрафика
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.Renault_Лид КАК Renault_Лид
	|		ПО Renault_ТрафикСрезПоследних.Идентификатор = Renault_Лид.ТрафикИД
	|		ЛЕВОЕ СОЕДИНЕНИЕ НастройкиКонтактЦентра КАК НастройкиКонтактЦентра
	|		ПО Renault_ТрафикСрезПоследних.ДилерскийЦентр = НастройкиКонтактЦентра.ДилерскийЦентр
	|			И (НастройкиКонтактЦентра.ТипТрафика = Renault_ТрафикСрезПоследних.ТипТрафика)
	|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|			Renault_ОтветыНаЛиды.ИдТрафика КАК ИдТрафика,
	|			Renault_ОтветыНаЛиды.ДатаОтвета КАК ДатаОтвета
	|		ИЗ
	|			РегистрСведений.Renault_ОтветыНаЛиды КАК Renault_ОтветыНаЛиды
	|				ВНУТРЕННЕЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|					Renault_ОтветыНаЛиды.ИдТрафика КАК ИдТрафика,
	|					МАКСИМУМ(Renault_ОтветыНаЛиды.ДатаОтвета) КАК ДатаОтвета
	|				ИЗ
	|					РегистрСведений.Renault_ОтветыНаЛиды КАК Renault_ОтветыНаЛиды
	|				ГДЕ
	|					Renault_ОтветыНаЛиды.ВидСообщения <> 10
	|				
	|				СГРУППИРОВАТЬ ПО
	|					Renault_ОтветыНаЛиды.ИдТрафика) КАК ВложенныйЗапрос
	|				ПО Renault_ОтветыНаЛиды.ИдТрафика = ВложенныйЗапрос.ИдТрафика
	|					И Renault_ОтветыНаЛиды.ДатаОтвета = ВложенныйЗапрос.ДатаОтвета
	|		ГДЕ
	|			Renault_ОтветыНаЛиды.Отправлен) КАК ВложенныйЗапрос
	|		ПО Renault_ТрафикСрезПоследних.Идентификатор = ВложенныйЗапрос.ИдТрафика
	|ГДЕ
	|	&ПоказыватьЛиды = ИСТИНА
	|	И ВЫБОР
	|			КОГДА ГОД(&НачалоПериода) > 1
	|				ТОГДА Renault_Лид.ДатаЗаогрузки >= &НачалоПериода
	|						ИЛИ &ВыводитьВсеНеобработанные = ИСТИНА
	|							И Renault_ТрафикСрезПоследних.Обработан = ЛОЖЬ
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ
	|	И ВЫБОР
	|			КОГДА ГОД(&КонецПериода) > 1
	|				ТОГДА Renault_Лид.ДатаЗаогрузки <= &КонецПериода
	|						ИЛИ &ВыводитьВсеНеобработанные = ИСТИНА
	|							И Renault_ТрафикСрезПоследних.Обработан = ЛОЖЬ
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ
	|	И Renault_ТрафикСрезПоследних.Менеджер <> ЗНАЧЕНИЕ(Справочник.Сотрудники.ПустаяСсылка)
	|	И ВЫБОР
	|			КОГДА НастройкиКонтактЦентра.ВидимостьСвой = ЛОЖЬ
	|					И Renault_ТрафикСрезПоследних.Менеджер = &Сотрудник
	|				ТОГДА ЛОЖЬ
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ
	|	И ВЫБОР
	|			КОГДА НастройкиКонтактЦентра.ВидимостьЧужой = ЛОЖЬ
	|					И Renault_ТрафикСрезПоследних.Менеджер <> &Сотрудник
	|				ТОГДА ЛОЖЬ
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ
	|	И НастройкиКонтактЦентра.ТипЛида = Renault_Лид.ВидУслуги.Тип
	|	И Renault_Лид.ТрафикОбработан = ЛОЖЬ
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	"""",
	|	ВЫБОР
	|		КОГДА Renault_ТрафикПисьма.ТрафикПросмотрен = 0
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ,
	|	Renault_ТрафикСрезПоследних.Период,
	|	Renault_ТрафикСрезПоследних.Идентификатор,
	|	Renault_ТрафикСрезПоследних.ТипТрафика,
	|	Renault_ТрафикСрезПоследних.Обработан,
	|	Renault_ТрафикСрезПоследних.Отдел,
	|	Renault_ТрафикСрезПоследних.Менеджер,
	|	Renault_ТрафикСрезПоследних.Администратор,
	|	Renault_ТрафикСрезПоследних.Клиент,
	|	Renault_ТрафикСрезПоследних.Клиент,
	|	Renault_ТрафикСрезПоследних.ПервичныйПовторный,
	|	Renault_ТрафикСрезПоследних.ДилерскийЦентр,
	|	Renault_ТрафикСрезПоследних.Представление,
	|	Renault_ТрафикСрезПоследних.Комментарий,
	|	Renault_ТрафикСрезПоследних.ПервичныйИнтерес,
	|	Renault_ТрафикСрезПоследних.ИсточникИнформации,
	|	ЛОЖЬ,
	|	""Электронное письмо"",
	|	ВЫБОР
	|		КОГДА Renault_ОтветыНаПисьмо.ИдТрафика ЕСТЬ NULL 
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ,
	|	ЛОЖЬ,
	|	NULL,
	|	ДОБАВИТЬКДАТЕ(Renault_ТрафикСрезПоследних.Период, ЧАС, 24),
	|	ЛОЖЬ
	|ИЗ
	|	РегистрСведений.Renault_Трафик.СрезПоследних(
	|			,
	|			ТипТрафика = ЗНАЧЕНИЕ(Справочник.CRM_ТипТрафика.email)
	|				И Закрытый = ЛОЖЬ) КАК Renault_ТрафикСрезПоследних
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|			Renault_ТрафикПисьма.ИдТрафика КАК ИдТрафика,
	|			Renault_ТрафикПисьма.УчетнаяЗапись КАК УчетнаяЗапись,
	|			СУММА(ВЫБОР
	|					КОГДА Renault_ТрафикПисьма.ТрафикПросмотрен
	|						ТОГДА 0
	|					ИНАЧЕ 1
	|				КОНЕЦ) КАК ТрафикПросмотрен
	|		ИЗ
	|			РегистрСведений.Renault_ТрафикПисьма КАК Renault_ТрафикПисьма
	|		
	|		СГРУППИРОВАТЬ ПО
	|			Renault_ТрафикПисьма.ИдТрафика,
	|			Renault_ТрафикПисьма.УчетнаяЗапись) КАК Renault_ТрафикПисьма
	|		ПО Renault_ТрафикСрезПоследних.Идентификатор = Renault_ТрафикПисьма.ИдТрафика
	|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ РАЗЛИЧНЫЕ
	|			Renault_ОтветыНаПисьмо.ИдТрафика КАК ИдТрафика
	|		ИЗ
	|			РегистрСведений.Renault_ОтветыНаПисьмо КАК Renault_ОтветыНаПисьмо) КАК Renault_ОтветыНаПисьмо
	|		ПО Renault_ТрафикСрезПоследних.Идентификатор = Renault_ОтветыНаПисьмо.ИдТрафика
	|		ЛЕВОЕ СОЕДИНЕНИЕ НастройкиКонтактЦентра КАК НастройкиКонтактЦентра
	|		ПО Renault_ТрафикСрезПоследних.ДилерскийЦентр = НастройкиКонтактЦентра.ДилерскийЦентр
	|			И (НастройкиКонтактЦентра.ТипТрафика = Renault_ТрафикСрезПоследних.ТипТрафика)
	|ГДЕ
	|	&ПоказыватьПочту = ИСТИНА
	|	И ВЫБОР
	|			КОГДА ГОД(&НачалоПериода) > 1
	|				ТОГДА Renault_ТрафикСрезПоследних.Период >= &НачалоПериода
	|						ИЛИ &ВыводитьВсеНеобработанные = ИСТИНА
	|							И Renault_ТрафикСрезПоследних.Обработан = ЛОЖЬ
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ
	|	И ВЫБОР
	|			КОГДА ГОД(&КонецПериода) > 1
	|				ТОГДА Renault_ТрафикСрезПоследних.Период <= &КонецПериода
	|						ИЛИ &ВыводитьВсеНеобработанные = ИСТИНА
	|							И Renault_ТрафикСрезПоследних.Обработан = ЛОЖЬ
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ
	|	И Renault_ТрафикСрезПоследних.Менеджер <> ЗНАЧЕНИЕ(Справочник.Сотрудники.ПустаяСсылка)
	|	И ВЫБОР
	|			КОГДА НастройкиКонтактЦентра.ВидимостьСвой = ЛОЖЬ
	|					И Renault_ТрафикСрезПоследних.Менеджер = &Сотрудник
	|				ТОГДА ЛОЖЬ
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ
	|	И ВЫБОР
	|			КОГДА НастройкиКонтактЦентра.ВидимостьЧужой = ЛОЖЬ
	|					И Renault_ТрафикСрезПоследних.Менеджер <> &Сотрудник
	|				ТОГДА ЛОЖЬ
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ
	|
	|УПОРЯДОЧИТЬ ПО
	|	Время УБЫВ";
	Запрос.УстановитьПараметр("НачалоПериода", НачалоПериода);
	Запрос.УстановитьПараметр("КонецПериода", КонецПериода);
	Запрос.УстановитьПараметр("Сотрудник", ПараметрыСеанса.Пользователь.Сотрудник);
	Запрос.УстановитьПараметр("ПоказатьТрафикПоМенеджерам", ПоказатьТрафикПоМенеджерам);
	
	Запрос.УстановитьПараметр("ИспользуетсяОК", ПраваПользователя.РаботаетОнлайнКонсультант);
	Запрос.УстановитьПараметр("ИспользуютсяЛиды", ПраваПользователя.РаботаютЛиды);
	Запрос.УстановитьПараметр("ИспользуетсяПочта", ПраваПользователя.РаботаетПочта);
	
	Запрос.УстановитьПараметр("ПоказыватьОК", СтруктураНастроекСписка.ОтображаемыеТипыТрафика.ПоказыватьОК);
	Запрос.УстановитьПараметр("ПоказыватьПочту", СтруктураНастроекСписка.ОтображаемыеТипыТрафика.ПоказыватьПочту);
	Запрос.УстановитьПараметр("ПоказыватьЛиды", СтруктураНастроекСписка.ОтображаемыеТипыТрафика.ПоказыватьЛиды);
	Запрос.УстановитьПараметр("ВыводитьВсеНеобработанные", СтруктураНастроекСписка.ВыводитьВсеНеобработанные);
	
	Запрос.УстановитьПараметр("НастройкиКонтактЦентра", НастройкиКонтактЦентра);
	//СтрокаПараметра = ПараметрыОК.ПочтовыеАдреса.Найти(ПараметрыСеанса.Пользователь.Сотрудник, "Сотрудник");
	//Если СтрокаПараметра <> Неопределено Тогда
	//	Запрос.УстановитьПараметр("ТекущаяУчетнаяЗапись", СтрокаПараметра.УчетнаяЗапись);
	//Иначе
	//	Запрос.УстановитьПараметр("ТекущаяУчетнаяЗапись", Справочники.Renault_НастройкиОнлайнКонсультанта.ПустаяСсылка());
	//КонецЕсли;
	
	ТаблицаТрафика = Запрос.Выполнить().Выгрузить();
	Возврат ТаблицаТрафика;
	
КонецФункции

Функция ПолучитьТаблицуЗакрытогоТрафика(СтруктураНастроекСписка = Неопределено, НастройкиКонтактЦентра = Неопределено, ПраваПользователя, НачалоПериода, КонецПериода, ЕстьПравоАдминистратора = Ложь, ЕстьПравоМенеджера = Ложь) Экспорт
		
	ТаблицаТрафика = новый ТаблицаЗначений();
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	НастройкиКонтактЦентра.ДилерскийЦентр,
	|	НастройкиКонтактЦентра.ТипТрафика,
	|	НастройкиКонтактЦентра.ТипЛида,
	|	НастройкиКонтактЦентра.ПереводТрафика,
	|	НастройкиКонтактЦентра.СозданиеРЛ,
	|	НастройкиКонтактЦентра.ВидимостьСвой,
	|	НастройкиКонтактЦентра.ВидимостьЧужой,
	|	НастройкиКонтактЦентра.ВидимостьОбщий
	|ПОМЕСТИТЬ НастройкиКонтактЦентра
	|ИЗ
	|	&НастройкиКонтактЦентра КАК НастройкиКонтактЦентра
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Renault_ТрафикПоСотрудникам.ИдТрафика
	|ПОМЕСТИТЬ ОтветыЛИД
	|ИЗ
	|	РегистрСведений.Renault_ТрафикПоСотрудникам КАК Renault_ТрафикПоСотрудникам
	|ГДЕ
	|	Renault_ТрафикПоСотрудникам.Отвечен = ИСТИНА
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Renault_ПользователиЧата.id_user,
	|	ВЫБОР
	|		КОГДА Renault_ОК_НовыйНеПросмотренныйТрафикСрезПоследних.Идентификатор ЕСТЬ NULL 
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ КАК ЕстьНовыеСообщения,
	|	Renault_ТрафикСрезПоследних.Период КАК Время,
	|	Renault_ТрафикСрезПоследних.Идентификатор КАК Идентификатор,
	|	Renault_ТрафикСрезПоследних.ТипТрафика КАК ТипТрафика,
	|	ВЫБОР
	|		КОГДА Renault_ТрафикСрезПоследних.Обработан ЕСТЬ NULL 
	|				ИЛИ Renault_ТрафикСрезПоследних.Обработан = ЛОЖЬ
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ КАК Обработан,
	|	Renault_ТрафикСрезПоследних.Отдел КАК Отдел,
	|	Renault_ТрафикСрезПоследних.Менеджер КАК Менеджер,
	|	Renault_ТрафикСрезПоследних.Администратор КАК Администратор,
	|	Renault_ТрафикСрезПоследних.Клиент КАК Клиент,
	|	Renault_ТрафикСрезПоследних.Клиент КАК Имя,
	|	Renault_ТрафикСрезПоследних.ПервичныйПовторный КАК ПервичныйПовторный,
	|	Renault_ТрафикСрезПоследних.ДилерскийЦентр КАК ДилерскийЦентр,
	|	Renault_ТрафикСрезПоследних.Представление КАК Представление,
	|	Renault_ТрафикСрезПоследних.Комментарий КАК Комментарий,
	|	Renault_ТрафикСрезПоследних.ПервичныйИнтерес КАК ПервичныйИнтерес,
	|	Renault_ТрафикСрезПоследних.ИсточникИнформации КАК ИсточникИнформации,
	|	ВЫБОР
	|		КОГДА Renault_ОК_ПользователиОнлайн.id_user ЕСТЬ NULL 
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ КАК ПользовательОнлайн,
	|	""Онлайн Консультант"" КАК ВидУслуги,
	|	Renault_ТрафикСрезПоследних.Комментарий КАК РезультатОбработки,
	|	ВЫБОР
	|		КОГДА Renault_ОК_Сообщения.IDТрафика = NULL
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ КАК ОтветОтправлен,
	|	NULL КАК ПодТип,
	|	ДОБАВИТЬКДАТЕ(Renault_ТрафикСрезПоследних.Период, ЧАС, 24) КАК ОбработатьДО,
	|	ЛОЖЬ КАК Синхронизация
	|ИЗ
	|	РегистрСведений.Renault_ПользователиЧата КАК Renault_ПользователиЧата
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.Renault_Трафик.СрезПоследних(
	|				,
	|				ТипТрафика = ЗНАЧЕНИЕ(Справочник.CRM_ТипТрафика.OnlineКонсультант)
	|					И Закрытый = ИСТИНА) КАК Renault_ТрафикСрезПоследних
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.Renault_ОК_НовыйНеПросмотренныйТрафик.СрезПоследних(, ) КАК Renault_ОК_НовыйНеПросмотренныйТрафикСрезПоследних
	|			ПО Renault_ТрафикСрезПоследних.Идентификатор = Renault_ОК_НовыйНеПросмотренныйТрафикСрезПоследних.Идентификатор
	|			ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ РАЗЛИЧНЫЕ
	|				Renault_ОК_Сообщения.IDТрафика КАК IDТрафика
	|			ИЗ
	|				РегистрСведений.Renault_ОК_Сообщения КАК Renault_ОК_Сообщения
	|			ГДЕ
	|				Renault_ОК_Сообщения.is_from = 2) КАК Renault_ОК_Сообщения
	|			ПО Renault_ТрафикСрезПоследних.Идентификатор = Renault_ОК_Сообщения.IDТрафика
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ НастройкиКонтактЦентра КАК НастройкиКонтактЦентра
	|			ПО Renault_ТрафикСрезПоследних.ДилерскийЦентр = НастройкиКонтактЦентра.ДилерскийЦентр
	|				И (НастройкиКонтактЦентра.ТипТрафика = Renault_ТрафикСрезПоследних.ТипТрафика)
	|		ПО (Renault_ТрафикСрезПоследних.Клиент = Renault_ПользователиЧата.Клиент)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.Renault_ОК_ПользователиОнлайн КАК Renault_ОК_ПользователиОнлайн
	|		ПО Renault_ПользователиЧата.id_user = Renault_ОК_ПользователиОнлайн.id_user
	|ГДЕ
	|	&ПоказыватьОК = ИСТИНА
	|	И ВЫБОР
	|			КОГДА ГОД(&НачалоПериода) > 1
	|				ТОГДА Renault_ТрафикСрезПоследних.Период >= &НачалоПериода
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ
	|	И ВЫБОР
	|			КОГДА ГОД(&КонецПериода) > 1
	|				ТОГДА Renault_ТрафикСрезПоследних.Период <= &КонецПериода
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ
	|	И ВЫБОР
	|			КОГДА &ЕстьПравоАдминистратора = ИСТИНА
	|					И НастройкиКонтактЦентра.ВидимостьОбщий = ИСТИНА
	|				ТОГДА ИСТИНА
	|			ИНАЧЕ ВЫБОР
	|					КОГДА &ЕстьПравоМенеджера = ИСТИНА
	|							И Renault_ТрафикСрезПоследних.Менеджер = &Сотрудник
	|							И НастройкиКонтактЦентра.ВидимостьСвой = ИСТИНА
	|						ТОГДА ИСТИНА
	|					ИНАЧЕ ЛОЖЬ
	|				КОНЕЦ
	|		КОНЕЦ
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	"""",
	|	ВЫБОР
	|		КОГДА ТрафикПросмотр.Просмотрен ЕСТЬ NULL 
	|				ИЛИ ТрафикПросмотр.Просмотрен = ЛОЖЬ
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ,
	|	Renault_Лид.ДатаЗаогрузки,
	|	Renault_ТрафикСрезПоследних.Идентификатор,
	|	Renault_ТрафикСрезПоследних.ТипТрафика,
	|	ВЫБОР
	|		КОГДА Renault_ТрафикСрезПоследних.Обработан ЕСТЬ NULL 
	|				ИЛИ Renault_ТрафикСрезПоследних.Обработан = ЛОЖЬ
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ,
	|	Renault_ТрафикСрезПоследних.Отдел,
	|	Renault_ТрафикСрезПоследних.Менеджер,
	|	Renault_ТрафикСрезПоследних.Администратор,
	|	Renault_ТрафикСрезПоследних.Клиент,
	|	Renault_ТрафикСрезПоследних.Клиент,
	|	Renault_ТрафикСрезПоследних.ПервичныйПовторный,
	|	Renault_ТрафикСрезПоследних.ДилерскийЦентр,
	|	Renault_ТрафикСрезПоследних.Представление,
	|	Renault_ТрафикСрезПоследних.Комментарий,
	|	Renault_ТрафикСрезПоследних.ПервичныйИнтерес,
	|	Renault_ТрафикСрезПоследних.ИсточникИнформации,
	|	ЛОЖЬ,
	|	Представление(Renault_Лид.ВидУслуги.Классификация),
	|	Renault_Лид.РезультатОбработки.Наименование,
	|	ВЫБОР
	|		КОГДА ТрафикОтвечен.ИдТрафика ЕСТЬ NULL 
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ,
	|	Представление(Renault_Лид.ВидУслуги.Тип),
	|	Renault_Лид.КритическаяДата,
	|	ВЫБОР
	|		КОГДА НЕ ВложенныйЗапрос.ДатаОтвета ЕСТЬ NULL 
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ
	|ИЗ
	|	РегистрСведений.Renault_Трафик.СрезПоследних(
	|			,
	|			ТипТрафика = ЗНАЧЕНИЕ(Справочник.CRM_ТипТрафика.ЛидRenault)
	|				И Закрытый = ИСТИНА) КАК Renault_ТрафикСрезПоследних
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.Renault_ТрафикПоСотрудникам КАК ТрафикПросмотр
	|		ПО Renault_ТрафикСрезПоследних.Идентификатор = ТрафикПросмотр.ИдТрафика
	|			И (ТрафикПросмотр.Сотрудник = &Сотрудник)
	|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ РАЗЛИЧНЫЕ
	|			ОтветыЛИД.ИдТрафика КАК ИдТрафика
	|		ИЗ
	|			ОтветыЛИД КАК ОтветыЛИД) КАК ТрафикОтвечен
	|		ПО Renault_ТрафикСрезПоследних.Идентификатор = ТрафикОтвечен.ИдТрафика
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.Renault_Лид КАК Renault_Лид
	|		ПО Renault_ТрафикСрезПоследних.Идентификатор = Renault_Лид.ТрафикИД
	|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|			Renault_ОтветыНаЛиды.ИдТрафика КАК ИдТрафика,
	|			Renault_ОтветыНаЛиды.ДатаОтвета КАК ДатаОтвета
	|		ИЗ
	|			РегистрСведений.Renault_ОтветыНаЛиды КАК Renault_ОтветыНаЛиды
	|				ВНУТРЕННЕЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|					Renault_ОтветыНаЛиды.ИдТрафика КАК ИдТрафика,
	|					МАКСИМУМ(Renault_ОтветыНаЛиды.ДатаОтвета) КАК ДатаОтвета
	|				ИЗ
	|					РегистрСведений.Renault_ОтветыНаЛиды КАК Renault_ОтветыНаЛиды
	|				ГДЕ
	|					Renault_ОтветыНаЛиды.ВидСообщения <> 10
	|				
	|				СГРУППИРОВАТЬ ПО
	|					Renault_ОтветыНаЛиды.ИдТрафика) КАК ВложенныйЗапрос
	|				ПО Renault_ОтветыНаЛиды.ИдТрафика = ВложенныйЗапрос.ИдТрафика
	|					И Renault_ОтветыНаЛиды.ДатаОтвета = ВложенныйЗапрос.ДатаОтвета
	|		ГДЕ
	|			Renault_ОтветыНаЛиды.Отправлен) КАК ВложенныйЗапрос
	|		ПО Renault_ТрафикСрезПоследних.Идентификатор = ВложенныйЗапрос.ИдТрафика
	|		ЛЕВОЕ СОЕДИНЕНИЕ НастройкиКонтактЦентра КАК НастройкиКонтактЦентра
	|		ПО Renault_ТрафикСрезПоследних.ДилерскийЦентр = НастройкиКонтактЦентра.ДилерскийЦентр
	|			И (НастройкиКонтактЦентра.ТипТрафика = Renault_ТрафикСрезПоследних.ТипТрафика)
	|ГДЕ
	|	&ПоказыватьЛиды = ИСТИНА
	|	И ВЫБОР
	|			КОГДА ГОД(&НачалоПериода) > 1
	|				ТОГДА Renault_Лид.ДатаЗаогрузки >= &НачалоПериода
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ
	|	И ВЫБОР
	|			КОГДА ГОД(&КонецПериода) > 1
	|				ТОГДА Renault_Лид.ДатаЗаогрузки <= &КонецПериода
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ
	|	И ВЫБОР
	|			КОГДА &ЕстьПравоАдминистратора = ИСТИНА
	|					И НастройкиКонтактЦентра.ВидимостьОбщий = ИСТИНА
	|				ТОГДА ИСТИНА
	|			ИНАЧЕ ВЫБОР
	|					КОГДА &ЕстьПравоМенеджера = ИСТИНА
	|							И Renault_ТрафикСрезПоследних.Менеджер = &Сотрудник
	|							И НастройкиКонтактЦентра.ВидимостьСвой = ИСТИНА
	|						ТОГДА ИСТИНА
	|					ИНАЧЕ ЛОЖЬ
	|				КОНЕЦ
	|		КОНЕЦ
	|	И НЕ Renault_Лид.РезультатОбработки = ЗНАЧЕНИЕ(Справочник.Renault_РезультатОбработки.ПомеченКакСпам)
	|	И НастройкиКонтактЦентра.ТипЛида = Renault_Лид.ВидУслуги.Тип
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	"""",
	|	ВЫБОР
	|		КОГДА Renault_ТрафикПисьма.ТрафикПросмотрен = 0
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ,
	|	Renault_ТрафикСрезПоследних.Период,
	|	Renault_ТрафикСрезПоследних.Идентификатор,
	|	Renault_ТрафикСрезПоследних.ТипТрафика,
	|	ВЫБОР
	|		КОГДА Renault_ТрафикСрезПоследних.Обработан ЕСТЬ NULL 
	|				ИЛИ Renault_ТрафикСрезПоследних.Обработан = ЛОЖЬ
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ,
	|	Renault_ТрафикСрезПоследних.Отдел,
	|	Renault_ТрафикСрезПоследних.Менеджер,
	|	Renault_ТрафикСрезПоследних.Администратор,
	|	Renault_ТрафикСрезПоследних.Клиент,
	|	Renault_ТрафикСрезПоследних.Клиент,
	|	Renault_ТрафикСрезПоследних.ПервичныйПовторный,
	|	Renault_ТрафикСрезПоследних.ДилерскийЦентр,
	|	Renault_ТрафикСрезПоследних.Представление,
	|	Renault_ТрафикСрезПоследних.Комментарий,
	|	Renault_ТрафикСрезПоследних.ПервичныйИнтерес,
	|	Renault_ТрафикСрезПоследних.ИсточникИнформации,
	|	ЛОЖЬ,
	|	""Электронное письмо"",
	|	ВЫБОР
	|		КОГДА Renault_ТрафикПисьма.РезультатОбработки ЕСТЬ NULL 
	|			ТОГДА """"
	|		ИНАЧЕ Renault_ТрафикПисьма.РезультатОбработки.Наименование
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА Renault_ОтветыНаПисьмо.ИдТрафика ЕСТЬ NULL 
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ,
	|	NULL,
	|	ДОБАВИТЬКДАТЕ(Renault_ТрафикСрезПоследних.Период, ЧАС, 24),
	|	ЛОЖЬ
	|ИЗ
	|	РегистрСведений.Renault_Трафик.СрезПоследних(
	|			,
	|			ТипТрафика = ЗНАЧЕНИЕ(Справочник.CRM_ТипТрафика.email)
	|				И Закрытый = ИСТИНА) КАК Renault_ТрафикСрезПоследних
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|			Renault_ТрафикПисьма.ИдТрафика КАК ИдТрафика,
	|			Renault_ТрафикПисьма.УчетнаяЗапись КАК УчетнаяЗапись,
	|			Renault_ТрафикПисьма.РезультатОбработки КАК РезультатОбработки,
	|			СУММА(ВЫБОР
	|					КОГДА Renault_ТрафикПисьма.ТрафикПросмотрен
	|						ТОГДА 0
	|					ИНАЧЕ 1
	|				КОНЕЦ) КАК ТрафикПросмотрен
	|		ИЗ
	|			РегистрСведений.Renault_ТрафикПисьма КАК Renault_ТрафикПисьма
	|		
	|		СГРУППИРОВАТЬ ПО
	|			Renault_ТрафикПисьма.ИдТрафика,
	|			Renault_ТрафикПисьма.УчетнаяЗапись,
	|			Renault_ТрафикПисьма.РезультатОбработки) КАК Renault_ТрафикПисьма
	|		ПО Renault_ТрафикСрезПоследних.Идентификатор = Renault_ТрафикПисьма.ИдТрафика
	|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ РАЗЛИЧНЫЕ
	|			Renault_ОтветыНаПисьмо.ИдТрафика КАК ИдТрафика
	|		ИЗ
	|			РегистрСведений.Renault_ОтветыНаПисьмо КАК Renault_ОтветыНаПисьмо) КАК Renault_ОтветыНаПисьмо
	|		ПО Renault_ТрафикСрезПоследних.Идентификатор = Renault_ОтветыНаПисьмо.ИдТрафика
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ НастройкиКонтактЦентра КАК НастройкиКонтактЦентра
	|		ПО Renault_ТрафикСрезПоследних.ДилерскийЦентр = НастройкиКонтактЦентра.ДилерскийЦентр
	|			И (НастройкиКонтактЦентра.ТипТрафика = Renault_ТрафикСрезПоследних.ТипТрафика)
	|ГДЕ
	|	&ПоказыватьПочту = ИСТИНА
	|	И ВЫБОР
	|			КОГДА ГОД(&НачалоПериода) > 1
	|				ТОГДА Renault_ТрафикСрезПоследних.Период >= &НачалоПериода
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ
	|	И ВЫБОР
	|			КОГДА ГОД(&КонецПериода) > 1
	|				ТОГДА Renault_ТрафикСрезПоследних.Период <= &КонецПериода
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ
	|	И ВЫБОР
	|			КОГДА &ЕстьПравоАдминистратора = ИСТИНА
	|					И НастройкиКонтактЦентра.ВидимостьОбщий = ИСТИНА
	|				ТОГДА ИСТИНА
	|			ИНАЧЕ ВЫБОР
	|					КОГДА &ЕстьПравоМенеджера = ИСТИНА
	|							И Renault_ТрафикСрезПоследних.Менеджер = &Сотрудник
	|							И НастройкиКонтактЦентра.ВидимостьСвой = ИСТИНА
	|						ТОГДА ИСТИНА
	|					ИНАЧЕ ЛОЖЬ
	|				КОНЕЦ
	|		КОНЕЦ
	|
	|УПОРЯДОЧИТЬ ПО
	|	Время УБЫВ";
	Запрос.УстановитьПараметр("НачалоПериода", НачалоПериода);
	Запрос.УстановитьПараметр("КонецПериода", КонецПериода);
	Запрос.УстановитьПараметр("Сотрудник", ПараметрыСеанса.Пользователь.Сотрудник);
	
	Запрос.УстановитьПараметр("ИспользуетсяОК", ПраваПользователя.РаботаетОнлайнКонсультант);
	Запрос.УстановитьПараметр("ИспользуютсяЛиды", ПраваПользователя.РаботаютЛиды);
	Запрос.УстановитьПараметр("ИспользуетсяПочта", ПраваПользователя.РаботаетПочта);
	
	Запрос.УстановитьПараметр("ПоказыватьОК", СтруктураНастроекСписка.ОтображаемыеТипыТрафика.ПоказыватьОК);
	Запрос.УстановитьПараметр("ПоказыватьПочту", СтруктураНастроекСписка.ОтображаемыеТипыТрафика.ПоказыватьПочту);
	Запрос.УстановитьПараметр("ПоказыватьЛиды", СтруктураНастроекСписка.ОтображаемыеТипыТрафика.ПоказыватьЛиды);
	
	Запрос.УстановитьПараметр("НастройкиКонтактЦентра", НастройкиКонтактЦентра);
	Запрос.УстановитьПараметр("ЕстьПравоАдминистратора", ЕстьПравоАдминистратора);
	Запрос.УстановитьПараметр("ЕстьПравоМенеджера", ЕстьПравоМенеджера);
	
	ТаблицаТрафика = Запрос.Выполнить().Выгрузить();
	
	Возврат ТаблицаТрафика;
	
КонецФункции

Процедура МодульОбъектаЗаполнитьНастройкиПодключения() Экспорт
	
	Параметры = Renault_ОнлайнКонсультант.ПолучитьПараметрыПоУмолчанию(Renault_РаботаСПравамиПользователя.ДилерскийЦентрПоУмолчанию(ПараметрыСеанса.Пользователь));
	Сервер = Параметры.Сервер;
	База = Параметры.База;
	Логин = Параметры.ЛогинБД;
	Пароль = Параметры.ПарольБД;
	ЗадержкаОбновленияСекунд = Параметры.ЗадержкаОбновленияСекунд;
	РазницаВремени = Число(?(Параметры.РазницаВремени = "", 0, Параметры.РазницаВремени));
	ИмяДрайвера = Параметры.ИмяДрайвера;
	ИдОператора = Параметры.ИдОператора;
	Оператор = "Contact center Renault";
	
КонецПроцедуры

Процедура ДобавитьТэгШтмл(КодШтмл, Тэг, УровеньТэга = 0, СтруктураПараметров = Неопределено, СтрокаСодержимогоТэга = "", ТребуетЗакрытия = Ложь) Экспорт
	
	НачалоТега = "<" + Тэг;
	АтрибутыТега = "";
	КонецТега = ">";
	Если НЕ(СтруктураПараметров = Неопределено) Тогда
		Для Каждого СоответсвиеПараметра Из СтруктураПараметров Цикл
			АтрибутыТега = АтрибутыТега + " " + СоответсвиеПараметра.Ключ + "=" + СоответсвиеПараметра.Значение;
		КонецЦикла;
	КонецЕсли;
	КодШтмл = КодШтмл + Символы.ПС;
	Если (УровеньТэга >= 0) И (УровеньТэга <= 8)Тогда 
		Для ит = 0 по УровеньТэга Цикл
			КодШтмл = КодШтмл + Символы.Таб;
		КонецЦикла;
	КонецЕсли;
	КодШтмл = КодШтмл + НачалоТега + АтрибутыТега + КонецТега;
	Если СтрДлина(СтрокаСодержимогоТэга)> 0 Тогда
	   КодШтмл =КодШтмл + СтрокаСодержимогоТэга;
	КонецЕсли;
	Если ТребуетЗакрытия Тогда
		КодШтмл = КодШтмл + "</" + Тэг + КонецТега;
	КонецЕсли;
	
КонецПроцедуры

Функция СтруктураПараметровКартинки(СсылкаНаКартинку = "", Ширина = "", Высота = "", Класс = "") Экспорт
	
	Ответ = Новый Структура();
	Если ЗначениеЗаполнено(СсылкаНаКартинку) Тогда
		Ответ.Вставить("src", СсылкаНаКартинку);
	КонецЕсли;
	Если ЗначениеЗаполнено(Ширина) Тогда
		Ответ.Вставить("width", Ширина);
	КонецЕсли;
	Если ЗначениеЗаполнено(Высота) Тогда
		Ответ.Вставить("height", Высота);
	КонецЕсли;
	Если ЗначениеЗаполнено(Класс) Тогда
		Ответ.Вставить("class", Класс);
	КонецЕсли;
	Если ЗначениеЗаполнено(Ответ) Тогда
		Возврат Ответ;
	Иначе
		Возврат Неопределено;
	КонецЕсли;
	
КонецФункции

Функция СтруктураПараметровТаблицы(Ширина = "", Высота = "", Класс= "") Экспорт
	
	Ответ = Новый Структура();
	Если ЗначениеЗаполнено(Ширина) Тогда
		Ответ.Вставить("width", Ширина);
	КонецЕсли;
	Если ЗначениеЗаполнено(Высота) Тогда
		Ответ.Вставить("height", Высота);
	КонецЕсли;
	Если ЗначениеЗаполнено(Класс) Тогда
		Ответ.Вставить("class", Класс);
	КонецЕсли;
	Если ЗначениеЗаполнено(Ответ) Тогда
		Возврат Ответ;
	Иначе
		Возврат Неопределено;
	КонецЕсли;
	
КонецФункции

Функция СтруктураПараметровЯчейки(Ширина = "", Высота = "", Класс = "", ВыравниваниеПоГоризонтали = "", ВыравниваниеПоВертикали = "") Экспорт
	
	Ответ = Новый Структура();
	Если ЗначениеЗаполнено(Ширина) Тогда
		Ответ.Вставить("width", Ширина);
	КонецЕсли;
	Если ЗначениеЗаполнено(Высота) Тогда
		Ответ.Вставить("height", Высота);
	КонецЕсли;
	Если ЗначениеЗаполнено(Класс) Тогда
		Ответ.Вставить("class", Класс);
	КонецЕсли;
	Если ЗначениеЗаполнено(ВыравниваниеПоГоризонтали) Тогда
		Ответ.Вставить("align", ВыравниваниеПоГоризонтали);
	КонецЕсли;
	Если ЗначениеЗаполнено(ВыравниваниеПоВертикали) Тогда
		Ответ.Вставить("valign", ВыравниваниеПоВертикали);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Ответ) Тогда
		Возврат Ответ;
	Иначе
		Возврат Неопределено;
	КонецЕсли;
	
КонецФункции

Функция СтруктураПараметровТелаДокумента(Класс = "", ПриЗагрузке = "") Экспорт
	
	Ответ = Новый Структура();
	Если ЗначениеЗаполнено(Класс) Тогда
		Ответ.Вставить("class", Класс);
	КонецЕсли;
	Если ЗначениеЗаполнено(ПриЗагрузке) Тогда
		Ответ.Вставить("onload", ПриЗагрузке);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Ответ) Тогда
		Возврат Ответ;
	Иначе
		Возврат Неопределено;
	КонецЕсли;
	
КонецФункции

Функция СтруктураПараметровМета(Кодировка = "") Экспорт
	
	Ответ = Новый Структура();
	Если ЗначениеЗаполнено(Кодировка) Тогда
		Ответ.Вставить("charset", Кодировка);
	КонецЕсли;
	Если ЗначениеЗаполнено(Ответ) Тогда
		Возврат Ответ;
	Иначе
		Возврат Неопределено;
	КонецЕсли;
	
КонецФункции

Функция ОписаниеКласса(ИмяКласса, Параметры, УровеньТэга = 0) Экспорт
	
	Ответ = "";
	Если (УровеньТэга >= 0) И (УровеньТэга <= 8) Тогда 
		Для ит = 0 по УровеньТэга Цикл
			Ответ = Ответ + Символы.Таб;
		КонецЦикла;
	КонецЕсли;
	Ответ = Ответ + "." + ИмяКласса + " {" + Символы.ПС + Параметры + Символы.ПС + "}";
	Возврат Ответ;
	
КонецФункции

Функция ОписаниеФункции(ИмяФункции, Параметры, УровеньТэга = 0) Экспорт
	
	Ответ = "";
	Если (УровеньТэга >= 0) И (УровеньТэга <= 8) Тогда 
		Для ит = 0 по УровеньТэга Цикл
			Ответ = Ответ + Символы.Таб;
		КонецЦикла;
	КонецЕсли;
	Ответ = Ответ + "function " + ИмяФункции + " {" + Символы.ПС + Параметры + Символы.ПС + "}";
	Возврат Ответ;
	
КонецФункции

Процедура ЗакрытьТрафик(ИдТрафика, ПричинаЗакрытия = Неопределено, ТипТрафика = Неопределено) Экспорт
	
	Если ТипТрафика = Справочники.CRM_ТипТрафика.ЛидRenault Тогда
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	Renault_Лид.Ссылка
		|ИЗ
		|	Документ.Renault_Лид КАК Renault_Лид
		|ГДЕ
		|	Renault_Лид.ТрафикИД = &Идентификатор
		|	И Renault_Лид.Проведен = ИСТИНА";
		Запрос.УстановитьПараметр("Идентификатор", ИдТрафика);
		Выборка = Запрос.Выполнить().Выбрать();
		Если Выборка.Следующий() Тогда
			Попытка
				ДокСсылка = Выборка.Ссылка.ПолучитьОбъект();
				ДокСсылка.ТрафикОбработан = Истина;
				ДокСсылка.РезультатОбработки = ПричинаЗакрытия;
				ДокСсылка.Записать();
				Запись = Renault_КонтактЦентр_Общий.ПолучитьЗаписьТрафикаПоID(ИдТрафика);
				//Запись.Обработан = Истина;
				Запись.Закрытый = Истина;
				Запись.Записать();
			Исключение
				Сообщить(ОписаниеОшибки());
			КонецПопытки;
		КонецЕсли;
	ИначеЕсли ТипТрафика = Справочники.CRM_ТипТрафика.OnlineКонсультант Тогда
		Запись = Renault_КонтактЦентр_Общий.ПолучитьЗаписьТрафикаПоID(ИдТрафика);
		//Запись.Обработан = Истина;
		Если ЗначениеЗаполнено(ПричинаЗакрытия) Тогда
			Запись.Комментарий = Строка(ПричинаЗакрытия.Наименование);
		КонецЕсли;
		Запись.Закрытый = Истина;
		Запись.Записать();
		
		Renault_ОнлайнКонсультант.ЗакрытьСоединениеСКлиентом();
		
	ИначеЕсли ТипТрафика = Справочники.CRM_ТипТрафика.Email Тогда
		Запись = Renault_КонтактЦентр_Общий.ПолучитьЗаписьТрафикаПоID(ИдТрафика);
		//Запись.Обработан = Истина;
		Запись.Закрытый = Истина;
		Запись.Записать();
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ *
		|ИЗ РегистрСведений.Renault_ТрафикПисьма КАК Renault_ТрафикПисьма
		|ГДЕ
		|	Renault_ТрафикПисьма.ИдТрафика = &ID";
		Запрос.УстановитьПараметр("ID", ИдТрафика);
		Выборка = Запрос.Выполнить().Выбрать();
		Пока Выборка.Следующий() Цикл
			Запись = РегистрыСведений.Renault_ТрафикПисьма.СоздатьМенеджерЗаписи();
			ЗаполнитьЗначенияСвойств(Запись, Выборка);
			Запись.РезультатОбработки = ПричинаЗакрытия;
			Запись.Записать();
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

Процедура ОтметитьТрафикПоказаннымДо(ДатаОбновления, ИдТрафика) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	Renault_ОК_НовыйНеПросмотренныйТрафик.Период,
	|	Renault_ОК_НовыйНеПросмотренныйТрафик.Идентификатор
	|ИЗ
	|	РегистрСведений.Renault_ОК_НовыйНеПросмотренныйТрафик КАК Renault_ОК_НовыйНеПросмотренныйТрафик
	|ГДЕ
	|	Renault_ОК_НовыйНеПросмотренныйТрафик.Период <= &Период
	|	И Renault_ОК_НовыйНеПросмотренныйТрафик.Идентификатор = &Идентификатор";
	Запрос.УстановитьПараметр("Период", ДатаОбновления);
	Запрос.УстановитьПараметр("Идентификатор", ИдТрафика);
	Таблица = Запрос.Выполнить().Выгрузить();
	Для Каждого Запись из Таблица Цикл
		Попытка
			Менеджер = РегистрыСведений.Renault_ОК_НовыйНеПросмотренныйТрафик.СоздатьМенеджерЗаписи();
			ЗаполнитьЗначенияСвойств(Менеджер, Запись);
			Менеджер.Прочитать();
			Если Менеджер.Выбран() тогда
				Менеджер.Удалить();
			КонецЕсли;
		Исключение
		КонецПопытки;
	КонецЦикла;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ОК_Сообщения.id_mess
	|ИЗ РегистрСведений.Renault_ОК_Сообщения КАК ОК_Сообщения
	|ГДЕ
	|	ОК_Сообщения.IDТрафика = &Идентификатор
	|	И ГОД(ДатаВремяПрочтения) = 1";
	Запрос.УстановитьПараметр("Идентификатор", ИдТрафика);
	Таблица = Запрос.Выполнить().Выгрузить();
	Для Каждого Запись из Таблица Цикл
		Попытка
			Менеджер = РегистрыСведений.Renault_ОК_Сообщения.СоздатьМенеджерЗаписи();
			ЗаполнитьЗначенияСвойств(Менеджер, Запись);
			Менеджер.Прочитать();
			Если Менеджер.Выбран() Тогда
				Менеджер.ДатаВремяПрочтения = ТекущаяДата();
				Менеджер.Записать();
			КонецЕсли;
		Исключение
		КонецПопытки;
	КонецЦикла;
	
КонецПроцедуры

Процедура ОтметитьТрафикЛМТПоказанным(ид) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ *
	|ИЗ
	|	РегистрСведений.Renault_ТрафикПоСотрудникам КАК Renault_ТрафикПоСотрудникам
	|ГДЕ
	|	Renault_ТрафикПоСотрудникам.ИдТрафика = &id
	|	И Renault_ТрафикПоСотрудникам.Сотрудник = &Сотрудник";
	Запрос.УстановитьПараметр("id", Ид);
	Запрос.УстановитьПараметр("Сотрудник", ПараметрыСеанса.Пользователь.Сотрудник);
	Табл = Запрос.Выполнить().Выгрузить();
	Мен = РегистрыСведений.Renault_ТрафикПоСотрудникам.СоздатьМенеджерЗаписи();
	Если Табл.Количество()>0 Тогда
		Описание = Табл[0];
		ЗаполнитьЗначенияСвойств(Мен,описание);
		Мен.Прочитать();
	Иначе
		Мен.Сотрудник = ПараметрыСеанса.Пользователь.Сотрудник;
		Мен.ИдТрафика = ид;
	КонецЕсли;
	Мен.Просмотрен = Истина;
	Мен.ДатаПросмотра = ТекущаяДата();
	Мен.Записать();
	
КонецПроцедуры

Функция ТрафикЛМТПочтаОтвеченный(Ид) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Renault_ТрафикПоСотрудникам.Отвечен
	|ИЗ
	|	РегистрСведений.Renault_ТрафикПоСотрудникам КАК Renault_ТрафикПоСотрудникам
	|ГДЕ
	|	Renault_ТрафикПоСотрудникам.ИдТрафика = &id
	|	И Renault_ТрафикПоСотрудникам.Сотрудник = &Сотрудник";
	Запрос.УстановитьПараметр("id", Ид);
	Запрос.УстановитьПараметр("Сотрудник", ПараметрыСеанса.Пользователь.Сотрудник);
	Табл = Запрос.Выполнить().Выгрузить();
	Если Табл.Количество()>0 Тогда
		Возврат Табл[0].Отвечен;
	Иначе
		Возврат Ложь;
	КонецЕсли;
	
КонецФункции

Процедура ОтметитьТрафикЛМТПочтаОтвеченным(Ид) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ *
	|ИЗ
	|	РегистрСведений.Renault_ТрафикПоСотрудникам КАК Renault_ТрафикПоСотрудникам
	|ГДЕ
	|	Renault_ТрафикПоСотрудникам.ИдТрафика = &id
	|	И Renault_ТрафикПоСотрудникам.Сотрудник = &Сотрудник";
	Запрос.УстановитьПараметр("id", Ид);
	Запрос.УстановитьПараметр("Сотрудник", ПараметрыСеанса.Пользователь.Сотрудник);
	Табл = Запрос.Выполнить().Выгрузить();
	Запись = РегистрыСведений.Renault_ТрафикПоСотрудникам.СоздатьМенеджерЗаписи();
	Если Табл.Количество() > 0 Тогда
		Описание = Табл[0];
		ЗаполнитьЗначенияСвойств(Запись, Описание);
		Запись.Прочитать();
	Иначе
		Запись.Сотрудник = ПараметрыСеанса.Пользователь.Сотрудник;
		Запись.ИдТрафика = ид;
	КонецЕсли;
	Запись.Отвечен = Истина;
	Запись.Записать();
	
КонецПроцедуры

Процедура ОтметитьТрафикПисьмаПоказанным(ид) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Renault_ТрафикПисьма.ИдентификаторПисьма,
	|	Renault_ТрафикПисьма.ИдТрафика,
	|	Renault_ТрафикПисьма.ДатаПоступления,
	|	Renault_ТрафикПисьма.ТемаПисьма,
	|	Renault_ТрафикПисьма.ТекстПисьма,
	|	Renault_ТрафикПисьма.ПочтаКлиента,
	|	Renault_ТрафикПисьма.ТрафикПросмотрен
	|ИЗ
	|	РегистрСведений.Renault_ТрафикПисьма КАК Renault_ТрафикПисьма
	|ГДЕ
	|	Renault_ТрафикПисьма.ИдТрафика = &ИдТрафика
	|	И Renault_ТрафикПисьма.ТрафикПросмотрен = ЛОЖЬ";
	Запрос.УстановитьПараметр("ИдТрафика", Ид);
	Табл = Запрос.Выполнить().Выгрузить();
	Для Каждого Описание Из Табл Цикл
		Мен = РегистрыСведений.Renault_ТрафикПисьма.СоздатьМенеджерЗаписи();
		ЗаполнитьЗначенияСвойств(Мен,описание);
		Мен.Прочитать();
		Если Мен.Выбран() Тогда
			ЗаполнитьЗначенияСвойств(Мен,описание);
			Мен.ТрафикПросмотрен = Истина;
			Мен.ДатаПросмотра = ТекущаяДата();
			Мен.Записать();
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

Процедура ЗаписатьОтветВТрафик(Ид, Текст, ОбработкаТрафика = Истина, вхВидСообщения = 2) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ *
	|ИЗ
	|	РегистрСведений.Renault_Трафик КАК Renault_Трафик
	|ГДЕ
	|	Renault_Трафик.Идентификатор = &Идентификатор";
	Запрос.УстановитьПараметр("Идентификатор", Ид);
	Табл = Запрос.Выполнить().Выгрузить();
	Для Каждого Описание Из Табл Цикл
		Менеджер = РегистрыСведений.Renault_Трафик.СоздатьМенеджерЗаписи();
		ЗаполнитьЗначенияСвойств(Менеджер, Описание);
		Менеджер.Прочитать();
		Если Менеджер.Выбран() тогда
			ЗаполнитьЗначенияСвойств(Менеджер, Описание);
			Менеджер.Комментарий = Менеджер.Комментарий + Символы.ПС + "Ответ от " + Формат(ТекущаяДата(), "ДФ=""дд.ММ.гггг ЧЧ:мм:сс""") + ?(ОбработкаТрафика, "", " не отправлен") + ": "+ Символы.ПС + Текст;
				Если НЕ ЗначениеЗаполнено(Менеджер.Администратор) Тогда
					Менеджер.Администратор = ПараметрыСеанса.Пользователь.Сотрудник;
				КонецЕсли;
			Менеджер.Обработан = Истина;
			Менеджер.Записать();
		КонецЕсли;
		Если ОбработкаТрафика Тогда
			Если Менеджер.ТипТрафика = Справочники.CRM_ТипТрафика.ЛидRenault Тогда
				Менеджер = РегистрыСведений.Renault_ОтветыНаЛиды.СоздатьМенеджерЗаписи();
			ИначеЕсли Менеджер.ТипТрафика = Справочники.CRM_ТипТрафика.Email Тогда
				Менеджер = РегистрыСведений.Renault_ОтветыНаПисьмо.СоздатьМенеджерЗаписи();
			Иначе
				//Тип трафика отличен от ожидаемого
				Продолжить;
			КОнецЕсли;
			Менеджер.ДатаОтвета = ТекущаяДата();
			Менеджер.ИдТрафика = Ид;
			Менеджер.Ответ = Текст;
			Менеджер.ВидСообщения = вхВидСообщения;
			Менеджер.Записать();
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

Процедура ЗаписатьСообщениеВременно(Ид, Текст, ИдПользователя) Экспорт
	
	Запись = РегистрыСведений.Renault_ОК_Сообщения.СоздатьМенеджерЗаписи();
	Запись.id_mess = 9999999999;
	Запись.Прочитать();
	Индекс = 0;
	Пока Запись.Выбран() Цикл
		Если Индекс = 1000 Тогда // если уже 1000 временных, прерываем попытку записи, 
			Возврат;			 // периодическое выполнение очистки рег.заданием должно удалять все врем.записи
		КонецЕсли;
		Запись.id_mess = Запись.id_mess - 1;
		Индекс = Индекс + 1;
		Запись.Прочитать();
	КонецЦикла;
	Запись.id_mess = 9999999999 - Индекс;
	Запись.id_user = ИдПользователя;
	Запись.IDТрафика = Ид;
	Запись.Внутренний = Истина;
	Запись.is_for = 1;
	Запись.is_from = 2;
	Запись.wr_date = ТекущаяДата();
	Запись.messages = Текст;
	Запись.Записать();
	
КонецПроцедуры

Процедура СохранитьОтветНаЛид(Ид, ТекстОтвета) Экспорт
	
	Менеджер = РегистрыСведений.Renault_ОтветыНаЛиды.СоздатьМенеджерЗаписи();
	Менеджер.ДатаОтвета = ТекущаяДата();
	Менеджер.ИдТрафика = Ид;
	Менеджер.Ответ = ТекстОтвета;
	Менеджер.ВидСообщения = 10;
	Менеджер.Записать();
	
КонецПроцедуры

Функция ЗагрузитьСохраненныйОтвет(Ид) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Renault_ОтветыНаЛиды.Ответ
	|ИЗ
	|	РегистрСведений.Renault_ОтветыНаЛиды КАК Renault_ОтветыНаЛиды
	|ГДЕ
	|	Renault_ОтветыНаЛиды.ИдТрафика = &Ид
	|	И Renault_ОтветыНаЛиды.ВидСообщения = &ВидСохраненногоСообщения";
	Запрос.УстановитьПараметр("Ид", Ид);
	Запрос.УстановитьПараметр("ВидСохраненногоСообщения", 10);
	Табл = Запрос.Выполнить().Выбрать();
	Если Табл.Следующий() Тогда
		возврат Табл.Ответ;
	Иначе
		возврат "";
	КонецЕсли;
	
КонецФункции

Функция ПолучитьИсториюЛидов(Ид) Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Renault_Трафик.Клиент.Наименование КАК Отправитель,
	|	Renault_Лид.Сообщение КАК Сообщение,
	|	Представление(Renault_Лид.ВидУслуги.Классификация) КАК Тип,
	|	Представление(Renault_Лид.ВидУслуги.Тип) КАК ПодТип,
	|	Renault_Трафик.Период КАК ДатаСообщения,
	|	Renault_Лид.Комментарий,
	|	1 КАК ВидСообщения
	|ИЗ
	|	Документ.Renault_Лид КАК Renault_Лид
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.Renault_Трафик КАК Renault_Трафик
	|		ПО Renault_Лид.ТрафикИД = Renault_Трафик.Идентификатор
	|ГДЕ
	|	Renault_Лид.ТрафикИД = &ИдТрафика
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Renault_Трафик.Менеджер.Наименование,
	|	Renault_ОтветыНаЛиды.Ответ,
	|	"""",
	|	"""",
	|	Renault_ОтветыНаЛиды.ДатаОтвета,
	|	Renault_Трафик.Комментарий,
	|	Renault_ОтветыНаЛиды.ВидСообщения
	|ИЗ
	|	РегистрСведений.Renault_ОтветыНаЛиды КАК Renault_ОтветыНаЛиды
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.Renault_Трафик КАК Renault_Трафик
	|		ПО Renault_ОтветыНаЛиды.ИдТрафика = Renault_Трафик.Идентификатор
	|ГДЕ
	|	Renault_ОтветыНаЛиды.ИдТрафика = &ИдТрафика
	|	И НЕ Renault_ОтветыНаЛиды.ВидСообщения = 10
	|
	|УПОРЯДОЧИТЬ ПО
	|	ДатаСообщения";
	Запрос.УстановитьПараметр("ИдТрафика", Ид);
	Табл = Запрос.Выполнить().Выгрузить();
	
	Возврат Табл;
	
КонецФункции

Функция ПолучитьИсториюПоЛиду (Ид) Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Renault_Трафик.Клиент.Наименование КАК Отправитель,
	|	Renault_Лид.Сообщение КАК Сообщение,
	|	Представление(Renault_Лид.ВидУслуги.Классификация) КАК Тип,
	|	Представление(Renault_Лид.ВидУслуги.Тип) КАК ПодТип,
	|	Renault_Трафик.Период КАК ДатаСообщения,
	|	Renault_Лид.Комментарий,
	|	1 КАК ВидСообщения
	|ИЗ
	|	Документ.Renault_Лид КАК Renault_Лид
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.Renault_Трафик КАК Renault_Трафик
	|		ПО Renault_Лид.ТрафикИД = Renault_Трафик.Идентификатор
	|ГДЕ
	|	Renault_Лид.ТрафикИД = &ИдТрафика
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Renault_Трафик.Менеджер.Наименование,
	|	Renault_ОтветыНаЛиды.Ответ,
	|	"""",
	|	"""",
	|	Renault_ОтветыНаЛиды.ДатаОтвета,
	|	Renault_Трафик.Комментарий,
	|	Renault_ОтветыНаЛиды.ВидСообщения
	|ИЗ
	|	РегистрСведений.Renault_ОтветыНаЛиды КАК Renault_ОтветыНаЛиды
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.Renault_Трафик КАК Renault_Трафик
	|		ПО Renault_ОтветыНаЛиды.ИдТрафика = Renault_Трафик.Идентификатор
	|ГДЕ
	|	Renault_ОтветыНаЛиды.ИдТрафика = &ИдТрафика
	|	И НЕ Renault_ОтветыНаЛиды.ВидСообщения = 10
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	"""",
	|	Reneult_ИсторияИзмененийЛидов.Менеджер.Наименование,
	|	""Изменен менеджер:"",
	|	"""",
	|	Reneult_ИсторияИзмененийЛидов.Период,
	|	"""",
	|	""11""
	|ИЗ
	|	РегистрСведений.Reneult_ИсторияИзмененийЛидов КАК Reneult_ИсторияИзмененийЛидов
	|ГДЕ
	|	Reneult_ИсторияИзмененийЛидов.ИДТрафика = &ИдТрафика
	|
	|УПОРЯДОЧИТЬ ПО
	|	ДатаСообщения";
	Запрос.УстановитьПараметр("ИдТрафика", Ид);
	Табл = Запрос.Выполнить().Выгрузить();
	
	Возврат Табл;
	
КонецФункции
