Функция ПолучитьСоответствияМоделейПоVIN() Экспорт
	
	Модели = Новый Соответствие;
	Модели.Вставить("AF","Master");
	Модели.Вставить("B0","Symbol");
	Модели.Вставить("B1","Clio");
	Модели.Вставить("BL","Latitude");
	Модели.Вставить("BU","Master");
	Модели.Вставить("BV","Symbol");
	Модели.Вставить("CV","Другое");
	Модели.Вставить("DC","Master");
	Модели.Вставить("G5","Laguna");
	Модели.Вставить("GG","Laguna");
	Модели.Вставить("J0","Vel Satis");
	Модели.Вставить("K1","Espace");
	Модели.Вставить("LB","Trafic VP");
	Модели.Вставить("LJ","Trafic VU");
	
	//Модели.Вставить("M1","Scenic");
	Модели.Вставить("P0","Modus");
	Модели.Вставить("R2","Clio 3");
	Модели.Вставить("R4","Clio 4");
	
	Модели.Вставить("T3","Laguna");
	
	Модели.Вставить("Y0","Koleos");
	Модели.Вставить("ZG","Koleos 2");

	//M
	МоделиM0 = Новый Соответствие;
	МоделиM0.Вставить("L","Megane sedan");
	МоделиM0.Вставить("B","Megane hatchback");
	МоделиM0.Вставить("K","Megane hatchback");
	МоделиM0.Вставить("J","Scenic");
	//Модели.Вставить("M0",МоделиM0);
	Модели.Вставить("M",МоделиM0);
	
	//SR
	МоделиSR = Новый Соответствие;
	МоделиSR.Вставить("H","Duster");
	МоделиSR.Вставить("A","Kaptur");
	МоделиSR.Вставить("L","Logan");
	МоделиSR.Вставить("4","Logan 2");
	МоделиSR.Вставить("B","Sandero");
	МоделиSR.Вставить("5","Sandero 2");
	МоделиSR.Вставить("8","Dokker Fourgon");
	МоделиSR.Вставить("0","Dokker Passager");
	Модели.Вставить("SR",МоделиSR);
	
	МоделиT1 = Новый Соответствие;
	МоделиT1.Вставить("B","Laguna");
	МоделиT1.Вставить("K","Laguna");
	Модели.Вставить("T1",МоделиT1);
	
	МоделиW0 = Новый Соответствие;
	МоделиW0.Вставить("K","Kangoo VP");
	МоделиW0.Вставить("F","Kangoo VU");
	Модели.Вставить("W0",МоделиW0);
	
	МоделиZ1 = Новый Соответствие;
	МоделиZ1.Вставить("D","Megane coupe");
	МоделиZ1.Вставить("J","Scenic 3");
	Модели.Вставить("Z1",МоделиZ1);
	
	МоделиZA = Новый Соответствие;
	МоделиZA.Вставить("X7L","Megane hatchback");
	МоделиZA.Вставить("VF1","Megane hatchback");
	Модели.Вставить("ZA",МоделиZA);
	
	МоделиZB = Новый Соответствие;
	МоделиZB.Вставить("X7L","Fluence");
	МоделиZB.Вставить("VF1","Fluence");
	Модели.Вставить("ZB",МоделиZB);
	Модели.Вставить("ZL",МоделиZB);	
	Возврат Модели;
	
КонецФункции

Процедура ЗаполнитьМодельПоVIN(НоваяСтрока,Модели) Экспорт
	
	Если НЕ ЗначениеЗаполнено(НоваяСтрока.VIN) Тогда
		Возврат;
	КонецЕсли;
	
	КодМодели = Сред(НоваяСтрока.VIN,5,2);
	Если Лев(КодМодели,1) = "M" Тогда
		КодМодели = "M";
	КонецЕсли;   	
	ТипКузова = Сред(НоваяСтрока.VIN,4,1);
	КодИзготовителя = Лев(НоваяСтрока.VIN,3);
	OTTC = Сред(НоваяСтрока.VIN,4,6);
	Модель = Модели.Получить(КодМодели);
	Если Модель <> Неопределено Тогда
		Если КодМодели = "M" 
			ИЛИ КодМодели = "SR" 
			ИЛИ КодМодели = "T1"
			ИЛИ КодМодели = "W0"
			ИЛИ КодМодели = "Z1" Тогда
			  Модель = Модель.Получить(ТипКузова);
			  // --- DMSREN-1125
			  если ТипКузова = "H" тогда
				  Модель = ПолучитьВерсиюДастера(OTTC);
			  КонецЕсли;
			  // DMSREN-1125 ---
		ИначеЕсли КодМодели = "ZA" 
			ИЛИ КодМодели = "ZB"
			ИЛИ КодМодели = "ZL" Тогда
			Модель = Модель.Получить(КодИзготовителя);		
		КонецЕсли;
	КонецЕсли;
	
	Если Модель <> Неопределено Тогда 
		НоваяСтрока.Модель = Модель;
	КонецЕсли;
	
КонецПроцедуры 

Функция ПолучитьТаблицуАртикуловМотрио() Экспорт
		
	Макет = ПолучитьМакет("MOTRIO");
	ПостроительЗапроса = Новый ПостроительЗапроса;
	ПостроительЗапроса.ИсточникДанных = Новый ОписаниеИсточникаДанных(Макет.Область("Область1"));
	ПостроительЗапроса.Выполнить();
	Возврат ПостроительЗапроса.Результат.Выгрузить();
	
КонецФункции

Функция ПолучитьТаблицуАртикуловСвечей() Экспорт
		
	Макет = ПолучитьМакет("Свечи");
				
	ПостроительЗапроса = Новый ПостроительЗапроса;
	ПостроительЗапроса.ИсточникДанных = Новый ОписаниеИсточникаДанных(Макет.Область("Область1"));
	ПостроительЗапроса.Выполнить();
	
	Возврат ПостроительЗапроса.Результат.Выгрузить();
	
КонецФункции

Функция ПолучитьТаблицуАвтоработМакета() Экспорт
	
	Макет = ПолучитьМакет("Автоработы");
				
	ПостроительЗапроса = Новый ПостроительЗапроса;
	ПостроительЗапроса.ИсточникДанных = Новый ОписаниеИсточникаДанных(Макет.Область("Область1"));
	ПостроительЗапроса.Выполнить();
	Таблица = ПостроительЗапроса.Результат.Выгрузить(); 
	Таблица.Колонки.Добавить("Приоритет",Новый ОписаниеТипов("Число",,,Новый КвалификаторыЧисла(10)));
	Таблица.Индексы.Добавить("Артикул");
	Таблица.Индексы.Добавить("ТипРаботы");
	Для каждого стр из Таблица Цикл
		стр.Приоритет = Число(Стр.ПриоритетСтр);
	КонецЦикла;
	
	Возврат Таблица;
	
КонецФункции

Функция ПолучитьТаблицуАвтоработDialogys() Экспорт
	Если ЭтоКонфигурацияDMS	Тогда
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	СоставАвторабот.Авторабота.Артикул КАК Артикул
		|ИЗ
		|	Справочник.DMS_РесурсныеСпецификации.СоставАвторабот КАК СоставАвторабот
		|ГДЕ
		|	СоставАвторабот.Ссылка.ПометкаУдаления = ЛОЖЬ";
		
		Таблица = Запрос.Выполнить().Выгрузить();
		Таблица.Индексы.Добавить("Артикул");
		
	Иначе
		Таблица = Новый ТаблицаЗначений;
		Таблица.Колонки.Добавить("Артикул");
	КонецЕсли;
	
	Возврат Таблица;
	
КонецФункции

Функция ПолучитьОбщийТекстЗапросаDMS() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |	ТаблицаСоответствийВидовРемонта.ВидРемонта,
	               |	ТаблицаСоответствийВидовРемонта.ТипРаботVOC,
	               |	ЛОЖЬ КАК Внутренний
	               |ПОМЕСТИТЬ ТабВидовРемонта
	               |ИЗ
	               |	&ТаблицаСоответствийВидовРемонта КАК ТаблицаСоответствийВидовРемонта
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |	ТабСвечи.Артикул
	               |ПОМЕСТИТЬ ТабСвечи
	               |ИЗ
	               |	&ТабСвечи КАК ТабСвечи
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |	ТабМотрио.Артикул
	               |ПОМЕСТИТЬ ТабМотрио
	               |ИЗ
	               |	&ТабМотрио КАК ТабМотрио
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ЗаказНаряд.Ссылка КАК ЗаказНаряд,
	               |	ЗаказНаряд.Номер,
	               |	ЗаказНаряд.Заказчик,
	               |	ЗаказНаряд.Автомобиль,
	               |	ЗаказНаряд.ВидРемонта,
	               |	ВЫБОР
	               |		КОГДА ЗаказНаряд.Состояние = ЗНАЧЕНИЕ(Справочник.ВидыСостоянийЗаказНарядов.Выполнен)
	               |			ТОГДА ЗаказНаряд.ДатаОкончания
	               |		ИНАЧЕ ЗаказНаряд.ДатаЗакрытия
	               |	КОНЕЦ КАК ДатаЗакрытия,
	               |	ЗаказНаряд.Пробег,
	               |	ВЫБОР
	               |		КОГДА Модели.НаименованиеПолное ПОДОБНО ""%Clio%""
	               |			ТОГДА ""Clio""
	               |		КОГДА Модели.НаименованиеПолное ПОДОБНО ""%Dokker Combi%""
	               |			ТОГДА ""Dokker Combi""
	               |		КОГДА Модели.НаименованиеПолное ПОДОБНО ""%Dokker Fourgon%""
	               |			ТОГДА ""Dokker Fourgon""
	               |		КОГДА Модели.НаименованиеПолное ПОДОБНО ""%Duster%""
	               |			ТОГДА ""Duster""
	               |		КОГДА Модели.НаименованиеПолное ПОДОБНО ""%Espace%""
	               |			ТОГДА ""Espace""
	               |		КОГДА Модели.НаименованиеПолное ПОДОБНО ""%Fluence%""
	               |			ТОГДА ""Fluence""
	               |		КОГДА Модели.НаименованиеПолное ПОДОБНО ""%Kangoo VP%""
	               |			ТОГДА ""Kangoo VP""
	               |		КОГДА Модели.НаименованиеПолное ПОДОБНО ""%Kangoo VU%""
	               |			ТОГДА ""Kangoo VU""
	               |		КОГДА Модели.НаименованиеПолное ПОДОБНО ""%Kaptur%""
	               |			ТОГДА ""Kaptur""
	               |		КОГДА Модели.НаименованиеПолное ПОДОБНО ""%Koleos%""
	               |			ТОГДА ""Koleos""
	               |		КОГДА Модели.НаименованиеПолное ПОДОБНО ""%Laguna%""
	               |			ТОГДА ""Laguna""
	               |		КОГДА Модели.НаименованиеПолное ПОДОБНО ""%Latitude%""
	               |			ТОГДА ""Latitude""
	               |		КОГДА Модели.НаименованиеПолное ПОДОБНО ""%Logan 2%""
	               |			ТОГДА ""Logan 2""
	               |		КОГДА Модели.НаименованиеПолное ПОДОБНО ""%Logan%""
	               |			ТОГДА ""Logan""
	               |		КОГДА Модели.НаименованиеПолное ПОДОБНО ""%Master%""
	               |			ТОГДА ""Master""
	               |		КОГДА Модели.НаименованиеПолное ПОДОБНО ""%Megane coupe%""
	               |			ТОГДА ""Megane coupe""
	               |		КОГДА Модели.НаименованиеПолное ПОДОБНО ""%Megane hatchback%""
	               |			ТОГДА ""Megane hatchback""
	               |		КОГДА Модели.НаименованиеПолное ПОДОБНО ""%Megane sedan%""
	               |			ТОГДА ""Megane sedan""
	               |		КОГДА Модели.НаименованиеПолное ПОДОБНО ""%Modus%""
	               |			ТОГДА ""Modus""
	               |		КОГДА Модели.НаименованиеПолное ПОДОБНО ""%Sandero 2%""
	               |			ТОГДА ""Sandero 2""
	               |		КОГДА Модели.НаименованиеПолное ПОДОБНО ""%Sandero%""
	               |			ТОГДА ""Sandero""
	               |		КОГДА Модели.НаименованиеПолное ПОДОБНО ""%Scenic%""
	               |			ТОГДА ""Scenic""
	               |		КОГДА Модели.НаименованиеПолное ПОДОБНО ""%Symbol%""
	               |			ТОГДА ""Symbol""
	               |		КОГДА Модели.НаименованиеПолное ПОДОБНО ""%Trafic VP%""
	               |			ТОГДА ""Trafic VP""
	               |		КОГДА Модели.НаименованиеПолное ПОДОБНО ""%Trafic TFP%""
	               |			ТОГДА ""Trafic VP""
	               |		КОГДА Модели.НаименованиеПолное ПОДОБНО ""%Trafic VU%""
	               |			ТОГДА ""Trafic VU""
	               |		КОГДА Модели.НаименованиеПолное ПОДОБНО ""%Trafic TFU%""
	               |			ТОГДА ""Trafic VU""
	               |		КОГДА Модели.НаименованиеПолное ПОДОБНО ""%Twingo%""
	               |			ТОГДА ""Twingo""
	               |		КОГДА Модели.НаименованиеПолное ПОДОБНО ""%Vel Satis%""
	               |			ТОГДА ""Vel Satis""
	               |		КОГДА Модели.НаименованиеПолное ПОДОБНО ""%Arkana%""
	               |			ТОГДА ""Arkana""
	               |		ИНАЧЕ ""Другое""
	               |	КОНЕЦ КАК Модель,
	               |	ЗаказНаряд.Заказчик.НаименованиеПолное КАК ПолноеНаименованиеКлиента,
	               |	ЗаказНаряд.Мастер,
	               |	ЕСТЬNULL(ТабВидовРемонта.ТипРаботVOC, ""Другое"") КАК ТипРаботы,
	               |	ЗаказНаряд.Автор,
	               |	ЗаказНаряд.Контрагент,
	               |	ТабВидовРемонта.Внутренний КАК ВнутреннийВР
	               |ПОМЕСТИТЬ ВсеЗаказНаряды
	               |ИЗ
	               |	Документ.ЗаказНаряд КАК ЗаказНаряд
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Модели КАК Модели
	               |		ПО ЗаказНаряд.Автомобиль.Модель = Модели.Ссылка
	               |		ЛЕВОЕ СОЕДИНЕНИЕ ТабВидовРемонта КАК ТабВидовРемонта
	               |		ПО ЗаказНаряд.ВидРемонта = ТабВидовРемонта.ВидРемонта
	               |ГДЕ
	               |	(ЗаказНаряд.Состояние = ЗНАЧЕНИЕ(Справочник.ВидыСостоянийЗаказНарядов.Закрыт)
	               |				И (ЗаказНаряд.ДатаЗакрытия МЕЖДУ &НачалоПериода И &КонецПериода)
	               |				И (&ДнейНаОплатуЗН = 0
	               |					ИЛИ РАЗНОСТЬДАТ(ЗаказНаряд.ДатаОкончания, ЗаказНаряд.ДатаЗакрытия, ДЕНЬ) < &ДнейНаОплатуЗН)
	               |			ИЛИ &ВыгружатьВыполненныеЗН
	               |				И (ЗаказНаряд.Состояние = ЗНАЧЕНИЕ(Справочник.ВидыСостоянийЗаказНарядов.Выполнен)
	               |					И (ТабВидовРемонта.ТипРаботVOC = ЗНАЧЕНИЕ(Перечисление.Renault_КлассификацияВидовРемонта.ГарантияСлесарныйРемонт)
	               |						ИЛИ ТабВидовРемонта.ТипРаботVOC = ЗНАЧЕНИЕ(Перечисление.Renault_КлассификацияВидовРемонта.ГарантияКузовнойЦех))
	               |					И (ЗаказНаряд.ДатаОкончания МЕЖДУ &НачалоПериода И &КонецПериода)))
	               |	И ЗаказНаряд.Проведен
	               |	И ЗаказНаряд.Организация В(&СписокОрганизаций)
	               |	И (НЕ &ОтборПодразделений
	               |			ИЛИ ЗаказНаряд.ПодразделениеКомпании В (&Подразделения))
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |	ВТВсеЗаказНарядыРено.ЗаказНаряд,
	               |	СУММА(СуммаДлительностьРабот.СуммаРабот) КАК СуммаРабот,
	               |	СУММА(СуммаДлительностьРабот.ДлительностьРабот) КАК ДлительностьРабот
	               |ПОМЕСТИТЬ Работы
	               |ИЗ
	               |	ВсеЗаказНаряды КАК ВТВсеЗаказНарядыРено
	               |		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	               |			ВТВсеЗаказНарядыРено.ЗаказНаряд КАК ЗаказНаряд,
	               |			СУММА(ЗаказНарядРаботы.СуммаВсего) КАК СуммаРабот,
	               |			СУММА(ВЫБОР
	               |					КОГДА ЗаказНарядРаботы.Цена = 0
	               |						ТОГДА 0
	               |					ИНАЧЕ ЗаказНарядРаботы.СуммаВсего / ЗаказНарядРаботы.Цена
	               |				КОНЕЦ) КАК ДлительностьРабот
	               |		ИЗ
	               |			ВсеЗаказНаряды КАК ВТВсеЗаказНарядыРено
	               |				ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЗаказНаряд.Работы КАК ЗаказНарядРаботы
	               |				ПО ВТВсеЗаказНарядыРено.ЗаказНаряд = ЗаказНарядРаботы.Ссылка
	               |		
	               |		СГРУППИРОВАТЬ ПО
	               |			ВТВсеЗаказНарядыРено.ЗаказНаряд) КАК СуммаДлительностьРабот
	               |		ПО ВТВсеЗаказНарядыРено.ЗаказНаряд = СуммаДлительностьРабот.ЗаказНаряд
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ВТВсеЗаказНарядыРено.ЗаказНаряд
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |	ВТЗаказНаряды.ЗаказНаряд,
	               |	МАКСИМУМ(ВЫБОР
	               |			КОГДА ЕСТЬNULL(ТабМотрио.Артикул, 0) = 0
	               |				ТОГДА 0
	               |			ИНАЧЕ 1
	               |		КОНЕЦ) КАК ЕстьМОТРИО,
	               |	МАКСИМУМ(ВЫБОР
	               |			КОГДА ЕСТЬNULL(ТабСвечи.Артикул, 0) = 0
	               |				ТОГДА 0
	               |			ИНАЧЕ 1
	               |		КОНЕЦ) КАК ЕстьСвечи,
	               |	СУММА(ЗаказНарядТовары.СуммаВсего) КАК СуммаЗЧ
	               |ПОМЕСТИТЬ МотриоИСвечи
	               |ИЗ
	               |	Работы КАК ВТЗаказНаряды
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ЗаказНаряд.Товары КАК ЗаказНарядТовары
	               |			ЛЕВОЕ СОЕДИНЕНИЕ ТабСвечи КАК ТабСвечи
	               |			ПО (ПОДСТРОКА(ТабСвечи.Артикул, 0, 10) = ПОДСТРОКА(ЗаказНарядТовары.Номенклатура.Артикул, 0, 10))
	               |			ЛЕВОЕ СОЕДИНЕНИЕ ТабМотрио КАК ТабМотрио
	               |			ПО (ПОДСТРОКА(ТабМотрио.Артикул, 0, 10) = ПОДСТРОКА(ЗаказНарядТовары.Номенклатура.Артикул, 0, 10))
	               |		ПО ВТЗаказНаряды.ЗаказНаряд = ЗаказНарядТовары.Ссылка
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ВТЗаказНаряды.ЗаказНаряд
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	МАКСИМУМ(Renault_СертификатКонтроля.Ссылка) КАК Сертификат,
	               |	Renault_СертификатКонтроля.ЗаказНаряд
	               |ПОМЕСТИТЬ Сертификаты
	               |ИЗ
	               |	Документ.Renault_СертификатКонтроля КАК Renault_СертификатКонтроля
	               |ГДЕ
	               |	Renault_СертификатКонтроля.ЗаказНаряд В
	               |			(ВЫБРАТЬ
	               |				ВсеЗаказНаряды.ЗаказНаряд
	               |			ИЗ
	               |				ВсеЗаказНаряды КАК ВсеЗаказНаряды)
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	Renault_СертификатКонтроля.ЗаказНаряд
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	КонтИнформацияТел.Объект КАК Объект,
	               |	МАКСИМУМ(ВЫРАЗИТЬ(КонтИнформацияТел.Представление КАК СТРОКА(50))) КАК Представление
	               |ПОМЕСТИТЬ КонтИнформацияТел
	               |ИЗ
	               |	РегистрСведений.КонтактнаяИнформация КАК КонтИнформацияТел
	               |ГДЕ
	               |	КонтИнформацияТел.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.Телефон)
	               |	И КонтИнформацияТел.ЗначениеПоУмолчанию = ИСТИНА
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	КонтИнформацияТел.Объект
	               |
	               |ИНДЕКСИРОВАТЬ ПО
	               |	Объект
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	КонтактнаяИнфЭлПочта.Объект КАК Объект,
	               |	МАКСИМУМ(ВЫРАЗИТЬ(КонтактнаяИнфЭлПочта.Представление КАК СТРОКА(100))) КАК Представление
	               |ПОМЕСТИТЬ КонтактнаяИнфЭлПочта
	               |ИЗ
	               |	РегистрСведений.КонтактнаяИнформация КАК КонтактнаяИнфЭлПочта
	               |ГДЕ
	               |	КонтактнаяИнфЭлПочта.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.АдресЭлектроннойПочты)
	               |	И КонтактнаяИнфЭлПочта.ЗначениеПоУмолчанию = ИСТИНА
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	КонтактнаяИнфЭлПочта.Объект
	               |
	               |ИНДЕКСИРОВАТЬ ПО
	               |	Объект
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВсеЗаказНаряды.ЗаказНаряд,
	               |	ВЫРАЗИТЬ(ВсеЗаказНаряды.ПолноеНаименованиеКлиента КАК СТРОКА(200)) КАК ФИОКлиента,
	               |	ВЫБОР
	               |		КОГДА Renault_СоответствияВидовРемонта.ТипРаботVOC = ЗНАЧЕНИЕ(Перечисление.Renault_КлассификацияВидовРемонта.ВнутреннийРемонт)
	               |			ТОГДА ""внутренний заезд""
	               |		КОГДА ВсеЗаказНаряды.Контрагент.Наименование ПОДОБНО ""%Рено Россия%""
	               |			ТОГДА ВЫБОР
	               |					КОГДА ВсеЗаказНаряды.Заказчик.ФормаСобственности = ЗНАЧЕНИЕ(Перечисление.ФормыСобственности.Юридическоелицо)
	               |							ИЛИ ВсеЗаказНаряды.Заказчик.ФормаСобственности = ЗНАЧЕНИЕ(Перечисление.ФормыСобственности.ЧастныйПредприниматель)
	               |							ИЛИ ВсеЗаказНаряды.Заказчик.ФормаСобственности = ЗНАЧЕНИЕ(Перечисление.ФормыСобственности.Прочее)
	               |								И ВсеЗаказНаряды.Заказчик.ИНН <> """"
	               |						ТОГДА ""юридическое лицо""
	               |					ИНАЧЕ ""физическое лицо""
	               |				КОНЕЦ
	               |		КОГДА ВсеЗаказНаряды.Контрагент.ФормаСобственности = ЗНАЧЕНИЕ(Перечисление.ФормыСобственности.Юридическоелицо)
	               |				ИЛИ ВсеЗаказНаряды.Контрагент.ФормаСобственности = ЗНАЧЕНИЕ(Перечисление.ФормыСобственности.ЧастныйПредприниматель)
	               |				ИЛИ ВсеЗаказНаряды.Контрагент.ФормаСобственности = ЗНАЧЕНИЕ(Перечисление.ФормыСобственности.Прочее)
	               |					И ВсеЗаказНаряды.Контрагент.ИНН <> """"
	               |			ТОГДА ВЫБОР
	               |					КОГДА ВсеЗаказНаряды.Контрагент В
	               |							(ВЫБРАТЬ
	               |								Справочник.CRM_ДилерскиеЦентры.Автосервис_Контрагент
	               |							ИЗ
	               |								Справочник.CRM_ДилерскиеЦентры)
	               |						ТОГДА ВЫБОР
	               |								КОГДА ВсеЗаказНаряды.Заказчик.ФормаСобственности = ЗНАЧЕНИЕ(Перечисление.ФормыСобственности.Юридическоелицо)
	               |										ИЛИ ВсеЗаказНаряды.Заказчик.ФормаСобственности = ЗНАЧЕНИЕ(Перечисление.ФормыСобственности.ЧастныйПредприниматель)
	               |										ИЛИ ВсеЗаказНаряды.Заказчик.ФормаСобственности = ЗНАЧЕНИЕ(Перечисление.ФормыСобственности.Прочее)
	               |											И ВсеЗаказНаряды.Заказчик.ИНН <> """"
	               |									ТОГДА ""юридическое лицо""
	               |								ИНАЧЕ ""физическое лицо""
	               |							КОНЕЦ
	               |					ИНАЧЕ ""юридическое лицо""
	               |				КОНЕЦ
	               |		ИНАЧЕ ""физическое лицо""
	               |	КОНЕЦ КАК ТипКлиента,
	               |	ВсеЗаказНаряды.Автомобиль.VIN КАК VIN,
	               |	ВсеЗаказНаряды.Модель КАК Модель,
	               |	ЕСТЬNULL(КонтИнформацияТел.Представление, """") КАК Телефон,
	               |	ЕСТЬNULL(КонтактнаяИнфЭлПочта.Представление, """") КАК Email,
	               |	ВсеЗаказНаряды.Номер КАК НомерЗаказНаряда,
	               |	ВсеЗаказНаряды.ДатаЗакрытия КАК ДатаЗакрытия,
	               |	ВЫБОР
	               |		КОГДА ВсеЗаказНаряды.Мастер <> ЗНАЧЕНИЕ(Справочник.Сотрудники.ПустаяСсылка)
	               |			ТОГДА ВсеЗаказНаряды.Мастер.Наименование
	               |		ИНАЧЕ ВсеЗаказНаряды.Автор.Наименование
	               |	КОНЕЦ КАК Бригада,
	               |	ВЫБОР
	               |		КОГДА &ПереключательСогласие = 0
	               |			ТОГДА ВЫБОР
	               |					КОГДА ВсеЗаказНаряды.Заказчик.СогласиеНаОбработкуПерсональныхДанных = ЗНАЧЕНИЕ(Перечисление.ВариантыОтветов.Да)
	               |						ТОГДА ""согласен""
	               |					ИНАЧЕ ""не согласен""
	               |				КОНЕЦ
	               |		ИНАЧЕ ВЫБОР
	               |				КОГДА ВсеЗаказНаряды.Заказчик.СогласиеНаПолучениеSMS
	               |					ТОГДА ""согласен""
	               |				ИНАЧЕ ""не согласен""
	               |			КОНЕЦ
	               |	КОНЕЦ КАК Согласие,
	               |	ВсеЗаказНаряды.Автомобиль,
	               |	ВсеЗаказНаряды.ВидРемонта,
	               |	МотриоИСвечи.ЕстьМОТРИО,
	               |	МотриоИСвечи.ЕстьСвечи,
	               |	ЕСТЬNULL(МотриоИСвечи.СуммаЗЧ, 0) КАК ТоварооборотЗЧ,
	               |	Работы.СуммаРабот КАК ОборотПоРаботам,
	               |	Работы.ДлительностьРабот КАК ДлительностьНЧ,
	               |	ВсеЗаказНаряды.Пробег,
	               |	ВсеЗаказНаряды.Заказчик,
	               |	ВсеЗаказНаряды.Заказчик.ИНН КАК ИНН,
	               |	ВсеЗаказНаряды.ТипРаботы,
	               |	1000 КАК Приоритет,
	               |	Сертификаты.Сертификат,
	               |	ВсеЗаказНаряды.ЗаказНаряд.Комментарий КАК Комментарий,
	               |	ВсеЗаказНаряды.ЗаказНаряд.Организация КАК Организация,
	               |	ВсеЗаказНаряды.ЗаказНаряд.Рекомендации КАК Рекомендации
	               |ИЗ
	               |	ВсеЗаказНаряды КАК ВсеЗаказНаряды
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Работы КАК Работы
	               |		ПО ВсеЗаказНаряды.ЗаказНаряд = Работы.ЗаказНаряд
	               |		ЛЕВОЕ СОЕДИНЕНИЕ МотриоИСвечи КАК МотриоИСвечи
	               |		ПО ВсеЗаказНаряды.ЗаказНаряд = МотриоИСвечи.ЗаказНаряд
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Сертификаты КАК Сертификаты
	               |		ПО ВсеЗаказНаряды.ЗаказНаряд = Сертификаты.ЗаказНаряд
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.Renault_СоответствияВидовРемонта КАК Renault_СоответствияВидовРемонта
	               |		ПО (Renault_СоответствияВидовРемонта.ВидРемонта = ВсеЗаказНаряды.ВидРемонта)
	               |		ЛЕВОЕ СОЕДИНЕНИЕ КонтИнформацияТел КАК КонтИнформацияТел
	               |		ПО (ВЫБОР
	               |				КОГДА &ПереключательКонтакты = 0
	               |					ТОГДА ВсеЗаказНаряды.Заказчик = КонтИнформацияТел.Объект
	               |				ИНАЧЕ ВсеЗаказНаряды.Контрагент = КонтИнформацияТел.Объект
	               |			КОНЕЦ)
	               |		ЛЕВОЕ СОЕДИНЕНИЕ КонтактнаяИнфЭлПочта КАК КонтактнаяИнфЭлПочта
	               |		ПО (ВЫБОР
	               |				КОГДА &ПереключательКонтакты = 0
	               |					ТОГДА ВсеЗаказНаряды.Заказчик = КонтактнаяИнфЭлПочта.Объект
	               |				ИНАЧЕ ВсеЗаказНаряды.Контрагент = КонтактнаяИнфЭлПочта.Объект
	               |			КОНЕЦ)
	               |ГДЕ
	               |	(&ВыгружатьНулевыеЗН
	               |			ИЛИ ЕСТЬNULL(Работы.СуммаРабот, 0) + ЕСТЬNULL(МотриоИСвечи.СуммаЗЧ, 0) > 0)
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	ДатаЗакрытия";
				   
				   
	Если Метаданные.Справочники.Найти("Сотрудники") <> Неопределено 
		И Метаданные.Справочники.Сотрудники.Реквизиты.Найти("Псевдоним") <> Неопределено Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст,"ВсеЗаказНаряды.Мастер.Наименование","ВЫБОР КОГДА ВсеЗаказНаряды.Мастер.Псевдоним = """" ТОГДА ВсеЗаказНаряды.Мастер.Наименование ИНАЧЕ ВсеЗаказНаряды.Мастер.Псевдоним КОНЕЦ");
	КонецЕсли;

	Возврат Запрос.Текст;
		
КонецФункции

Функция ПолучитьОбщийТекстЗапросаАльфаАвто( )Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |	ТаблицаСоответствийВидовРемонта.ВидРемонта,
	               |	ТаблицаСоответствийВидовРемонта.ТипРаботVOC,
	               |	 Ложь как Внутренний
	               |ПОМЕСТИТЬ ТабВидовРемонта
	               |ИЗ
	               |	&ТаблицаСоответствийВидовРемонта КАК ТаблицаСоответствийВидовРемонта
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |	ТабСвечи.Артикул
	               |ПОМЕСТИТЬ ТабСвечи
	               |ИЗ
	               |	&ТабСвечи КАК ТабСвечи
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |	ТабМотрио.Артикул
	               |ПОМЕСТИТЬ ТабМотрио
	               |ИЗ
	               |	&ТабМотрио КАК ТабМотрио
	               |;
				   //|
				   //|////////////////////////////////////////////////////////////////////////////////
				   //|ВЫБРАТЬ РАЗЛИЧНЫЕ
				   //|	ТаблицаВнутреннихКонтрагентовДилера.Контрагент
				   //|ПОМЕСТИТЬ ТабВнутрКонтрагентов
				   //|ИЗ
				   //|	&ТаблицаВнутреннихКонтрагентовДилера КАК ТаблицаВнутреннихКонтрагентовДилера
				   //|;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ЗаказНаряд.Ссылка КАК ЗаказНаряд,
	               |	ЗаказНаряд.Номер,
	               |	ЗаказНаряд.Заказчик,
	               |	ЗаказНаряд.Автомобиль,
	               |	ЗаказНаряд.ВидРемонта,
	               |	ВЫБОР
	               |		КОГДА ЗаказНаряд.Состояние = ЗНАЧЕНИЕ(Справочник.ВидыСостоянийЗаказНарядов.Выполнен)
	               |			ТОГДА ЗаказНаряд.ДатаОкончания
	               |		ИНАЧЕ ЗаказНаряд.ДатаЗакрытия
	               |	КОНЕЦ КАК ДатаЗакрытия,
	               |	ЗаказНаряд.Пробег,
	               |	ВЫБОР
	               |		КОГДА Модели.НаименованиеПолное ПОДОБНО ""%Clio%""
	               |			ТОГДА ""Clio""
	               |		КОГДА Модели.НаименованиеПолное ПОДОБНО ""%Dokker Combi%""
	               |			ТОГДА ""Dokker Combi""
	               |		КОГДА Модели.НаименованиеПолное ПОДОБНО ""%Dokker Fourgon%""
	               |			ТОГДА ""Dokker Fourgon""
	               |		КОГДА Модели.НаименованиеПолное ПОДОБНО ""%Duster%""
	               |			ТОГДА ""Duster""
	               |		КОГДА Модели.НаименованиеПолное ПОДОБНО ""%Espace%""
	               |			ТОГДА ""Espace""
	               |		КОГДА Модели.НаименованиеПолное ПОДОБНО ""%Fluence%""
	               |			ТОГДА ""Fluence""
	               |		КОГДА Модели.НаименованиеПолное ПОДОБНО ""%Kangoo VP%""
	               |			ТОГДА ""Kangoo VP""
	               |		КОГДА Модели.НаименованиеПолное ПОДОБНО ""%Kangoo VU%""
	               |			ТОГДА ""Kangoo VU""
	               |		КОГДА Модели.НаименованиеПолное ПОДОБНО ""%Kaptur%""
	               |			ТОГДА ""Kaptur""
	               |		КОГДА Модели.НаименованиеПолное ПОДОБНО ""%Koleos%""
	               |			ТОГДА ""Koleos""
	               |		КОГДА Модели.НаименованиеПолное ПОДОБНО ""%Laguna%""
	               |			ТОГДА ""Laguna""
	               |		КОГДА Модели.НаименованиеПолное ПОДОБНО ""%Latitude%""
	               |			ТОГДА ""Latitude""
	               |		КОГДА Модели.НаименованиеПолное ПОДОБНО ""%Logan 2%""
	               |			ТОГДА ""Logan 2""
	               |		КОГДА Модели.НаименованиеПолное ПОДОБНО ""%Logan%""
	               |			ТОГДА ""Logan""
	               |		КОГДА Модели.НаименованиеПолное ПОДОБНО ""%Master%""
	               |			ТОГДА ""Master""
	               |		КОГДА Модели.НаименованиеПолное ПОДОБНО ""%Megane coupe%""
	               |			ТОГДА ""Megane coupe""
	               |		КОГДА Модели.НаименованиеПолное ПОДОБНО ""%Megane hatchback%""
	               |			ТОГДА ""Megane hatchback""
	               |		КОГДА Модели.НаименованиеПолное ПОДОБНО ""%Megane sedan%""
	               |			ТОГДА ""Megane sedan""
	               |		КОГДА Модели.НаименованиеПолное ПОДОБНО ""%Modus%""
	               |			ТОГДА ""Modus""
	               |		КОГДА Модели.НаименованиеПолное ПОДОБНО ""%Sandero 2%""
	               |			ТОГДА ""Sandero 2""
	               |		КОГДА Модели.НаименованиеПолное ПОДОБНО ""%Sandero%""
	               |			ТОГДА ""Sandero""
	               |		КОГДА Модели.НаименованиеПолное ПОДОБНО ""%Scenic%""
	               |			ТОГДА ""Scenic""
	               |		КОГДА Модели.НаименованиеПолное ПОДОБНО ""%Symbol%""
	               |			ТОГДА ""Symbol""
	               |		КОГДА Модели.НаименованиеПолное ПОДОБНО ""%Trafic VP%""
	               |			ТОГДА ""Trafic VP""
	               |		КОГДА Модели.НаименованиеПолное ПОДОБНО ""%Trafic TFP%""
	               |			ТОГДА ""Trafic VP""
	               |		КОГДА Модели.НаименованиеПолное ПОДОБНО ""%Trafic VU%""
	               |			ТОГДА ""Trafic VU""
	               |		КОГДА Модели.НаименованиеПолное ПОДОБНО ""%Trafic TFU%""
	               |			ТОГДА ""Trafic VU""
	               |		КОГДА Модели.НаименованиеПолное ПОДОБНО ""%Twingo%""
	               |			ТОГДА ""Twingo""
	               |		КОГДА Модели.НаименованиеПолное ПОДОБНО ""%Vel Satis%""
	               |			ТОГДА ""Vel Satis""
	               |		КОГДА Модели.НаименованиеПолное ПОДОБНО ""%Arkana%""
	               |			ТОГДА ""Arkana""				   
	               |		ИНАЧЕ ""Другое""
	               |	КОНЕЦ КАК Модель,
	               |	ЗаказНаряд.Заказчик.НаименованиеПолное КАК ПолноеНаименованиеКлиента,
	               |	ЗаказНаряд.Мастер,
	               |	ЕСТЬNULL(ТабВидовРемонта.ТипРаботVOC, ""Другое"") КАК ТипРаботы,
	               |	ЗаказНаряд.Автор,
	               |	ЗаказНаряд.Контрагент,
	               |	ТабВидовРемонта.Внутренний КАК ВнутреннийВР
	               |ПОМЕСТИТЬ ВсеЗаказНаряды
	               |ИЗ
	               |	Документ.ЗаказНаряд КАК ЗаказНаряд
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Модели КАК Модели
	               |		ПО ЗаказНаряд.Автомобиль.Модель = Модели.Ссылка
	               |		ЛЕВОЕ СОЕДИНЕНИЕ ТабВидовРемонта КАК ТабВидовРемонта
	               |		ПО ЗаказНаряд.ВидРемонта = ТабВидовРемонта.ВидРемонта
	               |ГДЕ
	               |	(ЗаказНаряд.Состояние = ЗНАЧЕНИЕ(Справочник.ВидыСостоянийЗаказНарядов.Закрыт)
	               |				И (ЗаказНаряд.ДатаЗакрытия МЕЖДУ &НачалоПериода И &КонецПериода)
	               |				И (&ДнейНаОплатуЗН = 0 ИЛИ РАЗНОСТЬДАТ(ЗаказНаряд.ДатаОкончания, ЗаказНаряд.ДатаЗакрытия, ДЕНЬ) < &ДнейНаОплатуЗН)
	               |			ИЛИ &ВыгружатьВыполненныеЗН
	               |				И (ЗаказНаряд.Состояние = ЗНАЧЕНИЕ(Справочник.ВидыСостоянийЗаказНарядов.Выполнен)
				   |					И (ТабВидовРемонта.ТипРаботVOC = ЗНАЧЕНИЕ(Перечисление.Renault_КлассификацияВидовРемонта.ГарантияСлесарныйРемонт)
				   |					ИЛИ ТабВидовРемонта.ТипРаботVOC = ЗНАЧЕНИЕ(Перечисление.Renault_КлассификацияВидовРемонта.ГарантияКузовнойЦех))
	               |					И (ЗаказНаряд.ДатаОкончания МЕЖДУ &НачалоПериода И &КонецПериода)))
	               |	И ЗаказНаряд.Проведен
	               |	И ЗаказНаряд.Организация В(&СписокОрганизаций)
	               |	И (НЕ &ОтборПодразделений
	               |			ИЛИ ЗаказНаряд.ПодразделениеКомпании В (&Подразделения))
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |	ВТВсеЗаказНарядыРено.ЗаказНаряд,
	               |	СУММА(СуммаДлительностьРабот.СуммаРабот) КАК СуммаРабот,
	               |	СУММА(СуммаДлительностьРабот.ДлительностьРабот) КАК ДлительностьРабот
	               |ПОМЕСТИТЬ Работы
	               |ИЗ
	               |	ВсеЗаказНаряды КАК ВТВсеЗаказНарядыРено
	               |		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	               |			ВТВсеЗаказНарядыРено.ЗаказНаряд КАК ЗаказНаряд,
	               |			СУММА(ЗаказНарядРаботы.СуммаВсего) КАК СуммаРабот,
	               |			СУММА(ВЫБОР
	               |					КОГДА ЗаказНарядРаботы.Цена = 0
	               |						ТОГДА 0
	               |					ИНАЧЕ ЗаказНарядРаботы.СуммаВсего / ЗаказНарядРаботы.Цена
	               |				КОНЕЦ) КАК ДлительностьРабот
	               |		ИЗ
	               |			ВсеЗаказНаряды КАК ВТВсеЗаказНарядыРено
	               |				ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЗаказНаряд.Работы КАК ЗаказНарядРаботы
	               |				ПО ВТВсеЗаказНарядыРено.ЗаказНаряд = ЗаказНарядРаботы.Ссылка
	               |		
	               |		СГРУППИРОВАТЬ ПО
	               |			ВТВсеЗаказНарядыРено.ЗаказНаряд) КАК СуммаДлительностьРабот
	               |		ПО ВТВсеЗаказНарядыРено.ЗаказНаряд = СуммаДлительностьРабот.ЗаказНаряд
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ВТВсеЗаказНарядыРено.ЗаказНаряд
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |	ВТЗаказНаряды.ЗаказНаряд,
	               |	МАКСИМУМ(ВЫБОР
	               |			КОГДА ЕСТЬNULL(ТабМотрио.Артикул, 0) = 0
	               |				ТОГДА 0
	               |			ИНАЧЕ 1
	               |		КОНЕЦ) КАК ЕстьМОТРИО,
	               |	МАКСИМУМ(ВЫБОР
	               |			КОГДА ЕСТЬNULL(ТабСвечи.Артикул, 0) = 0
	               |				ТОГДА 0
	               |			ИНАЧЕ 1
	               |		КОНЕЦ) КАК ЕстьСвечи,
	               |	СУММА(ЗаказНарядТовары.СуммаВсего) КАК СуммаЗЧ  //DMSREN-380
	               |ПОМЕСТИТЬ МотриоИСвечи
	               |ИЗ
	               |	Работы КАК ВТЗаказНаряды
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ЗаказНаряд.Товары КАК ЗаказНарядТовары
	               |			ЛЕВОЕ СОЕДИНЕНИЕ ТабСвечи КАК ТабСвечи
	               |			ПО (ПОДСТРОКА(ТабСвечи.Артикул, 0, 10) = ПОДСТРОКА(ЗаказНарядТовары.Номенклатура.Артикул, 0, 10))
	               |			ЛЕВОЕ СОЕДИНЕНИЕ ТабМотрио КАК ТабМотрио
	               |			ПО (ПОДСТРОКА(ТабМотрио.Артикул, 0, 10) = ПОДСТРОКА(ЗаказНарядТовары.Номенклатура.Артикул, 0, 10))
	               |		ПО ВТЗаказНаряды.ЗаказНаряд = ЗаказНарядТовары.Ссылка
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ВТЗаказНаряды.ЗаказНаряд
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	КонтИнформацияТел.Объект КАК Объект,
	               |	МАКСИМУМ(ВЫРАЗИТЬ(КонтИнформацияТел.Представление КАК СТРОКА(50))) КАК Представление
	               |ПОМЕСТИТЬ КонтИнформацияТел
	               |ИЗ
	               |	РегистрСведений.КонтактнаяИнформация КАК КонтИнформацияТел
	               |ГДЕ
	               |	КонтИнформацияТел.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.Телефон)
	               |	И КонтИнформацияТел.ЗначениеПоУмолчанию = ИСТИНА
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	КонтИнформацияТел.Объект
	               |
	               |ИНДЕКСИРОВАТЬ ПО
	               |	Объект
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	КонтактнаяИнфЭлПочта.Объект КАК Объект,
	               |	МАКСИМУМ(ВЫРАЗИТЬ(КонтактнаяИнфЭлПочта.Представление КАК СТРОКА(100))) КАК Представление
	               |ПОМЕСТИТЬ КонтактнаяИнфЭлПочта
	               |ИЗ
	               |	РегистрСведений.КонтактнаяИнформация КАК КонтактнаяИнфЭлПочта
	               |ГДЕ
	               |	КонтактнаяИнфЭлПочта.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.АдресЭлектроннойПочты)
	               |	И КонтактнаяИнфЭлПочта.ЗначениеПоУмолчанию = ИСТИНА
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	КонтактнаяИнфЭлПочта.Объект
	               |
	               |ИНДЕКСИРОВАТЬ ПО
	               |	Объект
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВсеЗаказНаряды.ЗаказНаряд,
	               |	ВЫРАЗИТЬ(ВсеЗаказНаряды.ПолноеНаименованиеКлиента КАК СТРОКА(200)) КАК ФИОКлиента,
	               |	ВЫБОР
	               //|		КОГДА НЕ ТабВнутрКонтрагентов.Контрагент ЕСТЬ NULL
	               |				КОГДА ВсеЗаказНаряды.ВнутреннийВР
	               |			ТОГДА ""внутренний заезд""
	               |		КОГДА ВсеЗаказНаряды.Заказчик.ФормаСобственности = ЗНАЧЕНИЕ(Перечисление.ФормыСобственности.Юридическоелицо)
	               |				ИЛИ ВсеЗаказНаряды.Заказчик.ФормаСобственности = ЗНАЧЕНИЕ(Перечисление.ФормыСобственности.ЧастныйПредприниматель)
	               |				ИЛИ ВсеЗаказНаряды.Заказчик.ФормаСобственности = ЗНАЧЕНИЕ(Перечисление.ФормыСобственности.Прочее)
	               |					И ВсеЗаказНаряды.Заказчик.ИНН <> """"
	               |			ТОГДА ""юридическое лицо""
	               |		ИНАЧЕ ""физическое лицо""
	               |	КОНЕЦ КАК ТипКлиента,
	               |	ВсеЗаказНаряды.Автомобиль.VIN КАК VIN,
	               |	ВсеЗаказНаряды.Модель КАК Модель,
	               |	ЕСТЬNULL(КонтИнформацияТел.Представление, """") КАК Телефон,
	               |	ЕСТЬNULL(КонтактнаяИнфЭлПочта.Представление, """") КАК Email,
	               |	ВсеЗаказНаряды.Номер КАК НомерЗаказНаряда,
	               |	ВсеЗаказНаряды.ДатаЗакрытия КАК ДатаЗакрытия,
	               |	ВЫБОР
	               |		КОГДА ВсеЗаказНаряды.Мастер <> ЗНАЧЕНИЕ(Справочник.Сотрудники.ПустаяСсылка)
	               |			ТОГДА ВсеЗаказНаряды.Мастер.Наименование
	               |		ИНАЧЕ ВсеЗаказНаряды.Автор.Наименование
	               |	КОНЕЦ КАК Бригада,
	               |	ВЫБОР
	               |		КОГДА &ПереключательСогласие = 0
	               |			ТОГДА ВЫБОР
	               |					КОГДА ВсеЗаказНаряды.Заказчик.СогласиеНаОбработкуПерсональныхДанных = ЗНАЧЕНИЕ(Перечисление.ВариантыОтветов.Да)
	               |						ТОГДА ""согласен""
	               |					ИНАЧЕ ""не согласен""
	               |				КОНЕЦ
	               |		ИНАЧЕ ВЫБОР
	               |				КОГДА ВсеЗаказНаряды.Заказчик.СогласиеНаПолучениеSMS 
	               |					ТОГДА ""согласен""
	               |				ИНАЧЕ ""не согласен""
	               |			КОНЕЦ
	               |	КОНЕЦ КАК Согласие,
	               |	ВсеЗаказНаряды.Автомобиль,
	               |	ВсеЗаказНаряды.ВидРемонта,
	               |	МотриоИСвечи.ЕстьМОТРИО,
	               |	МотриоИСвечи.ЕстьСвечи,
	               |	МотриоИСвечи.СуммаЗЧ КАК ТоварооборотЗЧ,
	               |	Работы.СуммаРабот КАК ОборотПоРаботам,
	               |	Работы.ДлительностьРабот КАК ДлительностьНЧ,
	               |	ВсеЗаказНаряды.Пробег,
	               |	ВсеЗаказНаряды.Заказчик,
	               |	ВсеЗаказНаряды.Заказчик.ИНН КАК ИНН,
	               |	ВсеЗаказНаряды.ТипРаботы,
	               |	1000 КАК Приоритет,
	               |	НЕОПРЕДЕЛЕНО КАК Сертификат,
	               |	ВсеЗаказНаряды.ЗаказНаряд.Комментарий КАК Комментарий,
	               |	ВсеЗаказНаряды.ЗаказНаряд.Организация КАК Организация,
	               |	ВсеЗаказНаряды.ЗаказНаряд.Рекомендации КАК Рекомендации
	               |ИЗ
	               |	ВсеЗаказНаряды КАК ВсеЗаказНаряды
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Работы КАК Работы
	               |		ПО ВсеЗаказНаряды.ЗаказНаряд = Работы.ЗаказНаряд
	               |		ЛЕВОЕ СОЕДИНЕНИЕ МотриоИСвечи КАК МотриоИСвечи
	               |		ПО ВсеЗаказНаряды.ЗаказНаряд = МотриоИСвечи.ЗаказНаряд
				   //|		ЛЕВОЕ СОЕДИНЕНИЕ ТабВнутрКонтрагентов КАК ТабВнутрКонтрагентов
				   //|		ПО ВсеЗаказНаряды.Заказчик = ТабВнутрКонтрагентов.Контрагент
	               |		ЛЕВОЕ СОЕДИНЕНИЕ КонтИнформацияТел КАК КонтИнформацияТел
	               |		ПО (ВЫБОР
	               |				КОГДА &ПереключательКонтакты = 0
	               |					ТОГДА ВсеЗаказНаряды.Заказчик = КонтИнформацияТел.Объект
	               |				ИНАЧЕ ВсеЗаказНаряды.Контрагент = КонтИнформацияТел.Объект
	               |			КОНЕЦ)
	               |		ЛЕВОЕ СОЕДИНЕНИЕ КонтактнаяИнфЭлПочта КАК КонтактнаяИнфЭлПочта
	               |		ПО (ВЫБОР
	               |				КОГДА &ПереключательКонтакты = 0
	               |					ТОГДА ВсеЗаказНаряды.Заказчик = КонтактнаяИнфЭлПочта.Объект
	               |				ИНАЧЕ ВсеЗаказНаряды.Контрагент = КонтактнаяИнфЭлПочта.Объект
	               |			КОНЕЦ)
	               |ГДЕ
	               |	(&ВыгружатьНулевыеЗН
	               |			ИЛИ ЕСТЬNULL(Работы.СуммаРабот, 0) + ЕСТЬNULL(МотриоИСвечи.СуммаЗЧ, 0) > 0)
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	ДатаЗакрытия";
				   
				   
	Если Метаданные.Справочники.Найти("Сотрудники") <> Неопределено 
		И Метаданные.Справочники.Сотрудники.Реквизиты.Найти("Псевдоним") <> Неопределено Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст,"ВсеЗаказНаряды.Мастер.Наименование","ВЫБОР КОГДА ВсеЗаказНаряды.Мастер.Псевдоним = """" ТОГДА ВсеЗаказНаряды.Мастер.Наименование ИНАЧЕ ВсеЗаказНаряды.Мастер.Псевдоним КОНЕЦ");
	КонецЕсли;

	Возврат Запрос.Текст;
		
КонецФункции

Функция ПолучитьОбщийТекстЗапросаDMSПродажи() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	Заявки.VIN КАК VIN,
	               |	Заявки.Ссылка.ТипЗаявки КАК ТипЗаявки
	               |ПОМЕСТИТЬ Заявки
	               |ИЗ
	               |	(ВЫБРАТЬ
	               |		DMS_ЗаявкаНаАвтомобиль.VIN КАК VIN,
	               |		МАКСИМУМ(DMS_ЗаявкаНаАвтомобиль.Ссылка) КАК Ссылка
	               |	ИЗ
	               |		Документ.DMS_ЗаявкаНаАвтомобиль КАК DMS_ЗаявкаНаАвтомобиль
	               |	ГДЕ
	               |		DMS_ЗаявкаНаАвтомобиль.ПометкаУдаления = ЛОЖЬ
	               |	
	               |	СГРУППИРОВАТЬ ПО
	               |		DMS_ЗаявкаНаАвтомобиль.VIN) КАК Заявки
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	РеализацияАвтомобилейАвтомобили.Ссылка КАК Реализация,
	               |	РеализацияАвтомобилейАвтомобили.Ссылка.Контрагент КАК Контрагент,
	               |	РеализацияАвтомобилейАвтомобили.Автомобиль КАК Автомобиль,
	               |	РеализацияАвтомобилейАвтомобили.Автомобиль.VIN КАК VIN,
	               |	CRM_СостояниеАвтомобилейПроизводителя_v2.DATEOFSALE КАК ДатаПродажи,
	               |	РеализацияАвтомобилейАвтомобили.Ссылка.Контрагент.ФормаСобственности КАК ТипКлиента,
	               |	ВЫБОР
	               |		КОГДА &ПереключательСогласие = 0
	               |			ТОГДА ВЫБОР
	               |					КОГДА РеализацияАвтомобилейАвтомобили.Ссылка.Контрагент.СогласиеНаОбработкуПерсональныхДанных = ЗНАЧЕНИЕ(Перечисление.ВариантыОтветов.Да)
	               |						ТОГДА ""согласен""
	               |					ИНАЧЕ ""не согласен""
	               |				КОНЕЦ
	               |		ИНАЧЕ ВЫБОР
	               |				КОГДА РеализацияАвтомобилейАвтомобили.Ссылка.Контрагент.СогласиеНаПолучениеSMS
	               |					ТОГДА ""согласен""
	               |				ИНАЧЕ ""не согласен""
	               |			КОНЕЦ
	               |	КОНЕЦ КАК Согласие,
	               |	ЕСТЬNULL(Renault_ДоговорСоставДоговора.ЗаявкаНаТрейдИн, ЗНАЧЕНИЕ(Документ.Renault_ЗаявкаНаТрейдИн.ПустаяСсылка)) <> ЗНАЧЕНИЕ(Документ.Renault_ЗаявкаНаТрейдИн.ПустаяСсылка) КАК ТрейдИн,
	               |	МАКСИМУМ(Renault_ДоговорСоставДоговора.Ссылка) КАК Ссылка,
	               |	DMS_ЗаявкаНаАвтомобиль.ТипЗаявки КАК ТипЗаявки,
	               |	CRM_СостояниеАвтомобилейПроизводителя_v2.CLIENTTYPE КАК ТипКлиентаПоРегиструСостоянияАвто,
	               |	ВЫБОР
	               |		КОГДА НЕ РеализацияАвтомобилейАвтомобили.Ссылка ЕСТЬ NULL
	               |			ТОГДА ВЫБОР
	               |					КОГДА РеализацияАвтомобилейАвтомобили.Ссылка.Контрагент.ФормаСобственности = ЗНАЧЕНИЕ(Перечисление.ФормыСобственности.Юридическоелицо)
	               |							ИЛИ РеализацияАвтомобилейАвтомобили.Ссылка.Контрагент.ФормаСобственности = ЗНАЧЕНИЕ(Перечисление.ФормыСобственности.ЧастныйПредприниматель)
	               |							ИЛИ РеализацияАвтомобилейАвтомобили.Ссылка.Контрагент.ФормаСобственности = ЗНАЧЕНИЕ(Перечисление.ФормыСобственности.Прочее)
	               //|								И РеализацияАвтомобилейАвтомобили.Ссылка.Контрагент.ИНН <> """"
	               |						ТОГДА ""малый корпоративный клиент""
	               |					ИНАЧЕ ""физическое лицо""
	               |				КОНЕЦ
	               |	КОНЕЦ КАК ТипКлиентаПоРеализации,
				   |	ЕСТЬNULL(Renault_ДоговорСоставДоговора.Ссылка.Менеджер, РеализацияАвтомобилейАвтомобили.Ссылка.Менеджер) КАК Менеджер
	               |ПОМЕСТИТЬ ВсеПродажи
	               |ИЗ
	               |	Документ.РеализацияАвтомобилей.Автомобили КАК РеализацияАвтомобилейАвтомобили
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.CRM_СостояниеАвтомобилейПроизводителя_v2 КАК CRM_СостояниеАвтомобилейПроизводителя_v2
	               |		ПО РеализацияАвтомобилейАвтомобили.Автомобиль.VIN = CRM_СостояниеАвтомобилейПроизводителя_v2.VIN
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Документ.Renault_Договор.СоставДоговора КАК Renault_ДоговорСоставДоговора
	               |		ПО РеализацияАвтомобилейАвтомобили.Автомобиль.VIN = Renault_ДоговорСоставДоговора.VIN
	               |			И (Renault_ДоговорСоставДоговора.Ссылка.ПометкаУдаления = ЛОЖЬ)
	               |			И (Renault_ДоговорСоставДоговора.Ссылка.СтатусДоговора = ЗНАЧЕНИЕ(перечисление.CRM_СтатусыДоговоровНаПродажуАвтомобиля.Подписан))
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Заявки КАК DMS_ЗаявкаНаАвтомобиль
	               |		ПО РеализацияАвтомобилейАвтомобили.Автомобиль.VIN = DMS_ЗаявкаНаАвтомобиль.VIN
	               |ГДЕ
	               |	РеализацияАвтомобилейАвтомобили.Ссылка.Дата МЕЖДУ &НачалоПериода И &КонецПериода
	               |	И РеализацияАвтомобилейАвтомобили.Ссылка.Проведен
	               |	И (НЕ &ОтбиратьПоСкладам
	               |			ИЛИ РеализацияАвтомобилейАвтомобили.Ссылка.СкладКомпании В (&СписокСкладов))
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ЕСТЬNULL(Renault_ДоговорСоставДоговора.ЗаявкаНаТрейдИн, ЗНАЧЕНИЕ(Документ.Renault_ЗаявкаНаТрейдИн.ПустаяСсылка)) <> ЗНАЧЕНИЕ(Документ.Renault_ЗаявкаНаТрейдИн.ПустаяСсылка),
	               |	РеализацияАвтомобилейАвтомобили.Автомобиль,
	               |	CRM_СостояниеАвтомобилейПроизводителя_v2.DATEOFSALE,
	               |	DMS_ЗаявкаНаАвтомобиль.ТипЗаявки,
	               |	РеализацияАвтомобилейАвтомобили.Ссылка.Контрагент.ФормаСобственности,
	               |	РеализацияАвтомобилейАвтомобили.Ссылка,
	               |	РеализацияАвтомобилейАвтомобили.Ссылка.Контрагент,
	               |	РеализацияАвтомобилейАвтомобили.Автомобиль.VIN,
	               |	ВЫБОР
	               |		КОГДА &ПереключательСогласие = 0
	               |			ТОГДА ВЫБОР
	               |					КОГДА РеализацияАвтомобилейАвтомобили.Ссылка.Контрагент.СогласиеНаОбработкуПерсональныхДанных = ЗНАЧЕНИЕ(Перечисление.ВариантыОтветов.Да)
	               |						ТОГДА ""согласен""
	               |					ИНАЧЕ ""не согласен""
	               |				КОНЕЦ
	               |		ИНАЧЕ ВЫБОР
	               |				КОГДА РеализацияАвтомобилейАвтомобили.Ссылка.Контрагент.СогласиеНаПолучениеSMS
	               |					ТОГДА ""согласен""
	               |				ИНАЧЕ ""не согласен""
	               |			КОНЕЦ
	               |	КОНЕЦ,
	               |	CRM_СостояниеАвтомобилейПроизводителя_v2.CLIENTTYPE,
	               |	ВЫБОР
	               |		КОГДА НЕ РеализацияАвтомобилейАвтомобили.Ссылка ЕСТЬ NULL
	               |			ТОГДА ВЫБОР
	               |					КОГДА РеализацияАвтомобилейАвтомобили.Ссылка.Контрагент.ФормаСобственности = ЗНАЧЕНИЕ(Перечисление.ФормыСобственности.Юридическоелицо)
	               |							ИЛИ РеализацияАвтомобилейАвтомобили.Ссылка.Контрагент.ФормаСобственности = ЗНАЧЕНИЕ(Перечисление.ФормыСобственности.ЧастныйПредприниматель)
	               |							ИЛИ РеализацияАвтомобилейАвтомобили.Ссылка.Контрагент.ФормаСобственности = ЗНАЧЕНИЕ(Перечисление.ФормыСобственности.Прочее)
	               //|								И РеализацияАвтомобилейАвтомобили.Ссылка.Контрагент.ИНН <> """"
	               |						ТОГДА ""малый корпоративный клиент""
	               |					ИНАЧЕ ""физическое лицо""
	               |				КОНЕЦ
	               |	КОНЕЦ,
				   |	ЕСТЬNULL(Renault_ДоговорСоставДоговора.Ссылка.Менеджер, РеализацияАвтомобилейАвтомобили.Ссылка.Менеджер)
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	КонтИнформацияТел.Объект КАК Объект,
	               |	МАКСИМУМ(ВЫРАЗИТЬ(КонтИнформацияТел.Представление КАК СТРОКА(50))) КАК Представление
	               |ПОМЕСТИТЬ КонтИнформацияТел
	               |ИЗ
	               |	РегистрСведений.КонтактнаяИнформация КАК КонтИнформацияТел
	               |ГДЕ
	               |	КонтИнформацияТел.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.Телефон)
	               |	И КонтИнформацияТел.ЗначениеПоУмолчанию = ИСТИНА
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	КонтИнформацияТел.Объект
	               |
	               |ИНДЕКСИРОВАТЬ ПО
	               |	Объект
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	КонтИнформацияТел.Объект КАК Объект,
	               |	МАКСИМУМ(ВЫРАЗИТЬ(КонтИнформацияТел.Представление КАК СТРОКА(200))) КАК Представление
	               |ПОМЕСТИТЬ КонтИнформацияАдрес
	               |ИЗ
	               |	РегистрСведений.КонтактнаяИнформация КАК КонтИнформацияТел
	               |ГДЕ
	               |	КонтИнформацияТел.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.Адрес)
	               |	И КонтИнформацияТел.ЗначениеПоУмолчанию = ИСТИНА
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	КонтИнформацияТел.Объект
	               |
	               |ИНДЕКСИРОВАТЬ ПО
	               |	Объект
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	КонтактнаяИнфЭлПочта.Объект КАК Объект,
	               |	МАКСИМУМ(ВЫРАЗИТЬ(КонтактнаяИнфЭлПочта.Представление КАК СТРОКА(200))) КАК Представление
	               |ПОМЕСТИТЬ КонтактнаяИнфЭлПочта
	               |ИЗ
	               |	РегистрСведений.КонтактнаяИнформация КАК КонтактнаяИнфЭлПочта
	               |ГДЕ
	               |	КонтактнаяИнфЭлПочта.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.АдресЭлектроннойПочты)
	               |	И КонтактнаяИнфЭлПочта.ЗначениеПоУмолчанию = ИСТИНА
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	КонтактнаяИнфЭлПочта.Объект
	               |
	               |ИНДЕКСИРОВАТЬ ПО
	               |	Объект
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ЕСТЬNULL(КонтИнформацияТел.Представление, """") КАК Телефон,
	               |	ЕСТЬNULL(КонтактнаяИнфЭлПочта.Представление, """") КАК Email,
	               |	ВсеПродажи.Автомобиль КАК Автомобиль,
	               |	ВсеПродажи.Реализация КАК Реализация,
	               |	ЕСТЬNULL(КонтИнформацияАдрес.Представление, """") КАК АдресКлиента,
	               |	ПРЕДСТАВЛЕНИЕ(ВсеПродажи.Контрагент) КАК ФИОКлиента,
	               |	ВсеПродажи.VIN КАК VIN,
	               |	ВсеПродажи.Контрагент.ДатаРождения КАК ДатаРождения,
	               |	ВсеПродажи.Реализация.Дата КАК ФактическаяДатаВыдачиАвто,
	               |	ВсеПродажи.ДатаПродажи КАК ДатаЗанесенияПродажиВDistri,
	               //|	ВсеПродажи.Реализация.Менеджер.Наименование КАК Продавец,
				   |	ВсеПродажи.Менеджер.Наименование КАК Продавец,
	               |	ВсеПродажи.ТипКлиента КАК ТипКлиента,
	               |	ВсеПродажи.Согласие КАК Согласие,
	               |	ВсеПродажи.ТрейдИн КАК ТрейдИн,
	               |	ВсеПродажи.Ссылка КАК Ссылка,
	               |	ВсеПродажи.Автомобиль.Модель.Артикул КАК Модель,
	               |	ВсеПродажи.Контрагент.ИНН КАК ИНН,
	               |	ВсеПродажи.Контрагент КАК КлиентСсылка,
	               |	ВсеПродажи.ТипКлиентаПоРегиструСостоянияАвто КАК ТипКлиентаПоРегиструСостоянияАвто,
	               |	ВсеПродажи.ТипКлиентаПоРеализации КАК ТипКлиентаПоРеализации
	               |ИЗ
	               |	ВсеПродажи КАК ВсеПродажи
	               |		ЛЕВОЕ СОЕДИНЕНИЕ КонтИнформацияТел КАК КонтИнформацияТел
	               |		ПО ВсеПродажи.Контрагент = КонтИнформацияТел.Объект
	               |		ЛЕВОЕ СОЕДИНЕНИЕ КонтактнаяИнфЭлПочта КАК КонтактнаяИнфЭлПочта
	               |		ПО ВсеПродажи.Контрагент = КонтактнаяИнфЭлПочта.Объект
	               |		ЛЕВОЕ СОЕДИНЕНИЕ КонтИнформацияАдрес КАК КонтИнформацияАдрес
	               |		ПО ВсеПродажи.Контрагент = КонтИнформацияАдрес.Объект
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	ФактическаяДатаВыдачиАвто";
	
	Если Метаданные.Справочники.Найти("Сотрудники") <> Неопределено 
		И Метаданные.Справочники.Сотрудники.Реквизиты.Найти("Псевдоним") <> Неопределено Тогда
		//Запрос.Текст = СтрЗаменить(Запрос.Текст,"ВсеПродажи.Реализация.Менеджер.Наименование","ВЫБОР КОГДА ВсеПродажи.Реализация.Менеджер.Псевдоним = """" ТОГДА ВсеПродажи.Реализация.Менеджер.Наименование ИНАЧЕ ВсеПродажи.Реализация.Менеджер.Псевдоним КОНЕЦ");
		Запрос.Текст = СтрЗаменить(Запрос.Текст,"ВсеПродажи.Менеджер.Наименование","ВЫБОР КОГДА ВсеПродажи.Менеджер.Псевдоним = """" ТОГДА ВсеПродажи.Менеджер.Наименование ИНАЧЕ ВсеПродажи.Менеджер.Псевдоним КОНЕЦ");
	КонецЕсли;

	
	Возврат Запрос.Текст;
		
КонецФункции

Функция ПолучитьТекстЗапросаПоРаботам() Экспорт
	
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВТВсеЗаказНарядыРено.ЗаказНаряд,
		|	ЗаказНарядРаботы.Работа КАК Авторабота,
		|	ЗаказНарядРаботы.Работа.Артикул КАК Артикул,
		|	ЗаказНарядРаботы.Сумма КАК Сумма
		|ИЗ
		|	ВсеЗаказНаряды КАК ВТВсеЗаказНарядыРено
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ЗаказНаряд.Работы КАК ЗаказНарядРаботы
		|		ПО ВТВсеЗаказНарядыРено.ЗаказНаряд = ЗаказНарядРаботы.Ссылка
		// Трояновский К.Е. 30.08.2019 16:11:08 {
		// DMSCOR-1423
		|
		|УПОРЯДОЧИТЬ ПО
		|	ЗаказНарядРаботы.Сумма";
		// Трояновский К.Е. 30.08.2019 16:11:08 }
	
	Возврат Запрос.Текст;
	
	
КонецФункции

Функция ПолучитьТаблицуСоответствийВидовРемонта() Экспорт
	
	//Если Строка(ТипЗнч(ЭтотОбъект)) = "Внешняя обработка объект: Renault выгрузка  в VOC" ИЛИ ЭтоКонфигурацияDMS = Ложь Тогда
		//Рез = СоответствияВидовРемонта.Выгрузить();
	//Иначе
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	Renault_СоответствияВидовРемонта.ВидРемонта,
		|	Renault_СоответствияВидовРемонта.ТипРаботVOC
		|ИЗ
		|	РегистрСведений.Renault_СоответствияВидовРемонта КАК Renault_СоответствияВидовРемонта";
		
		Рез =  Запрос.Выполнить().Выгрузить();
	//КонецЕсли;

	//Запрос = Новый Запрос;
	//Запрос.Текст = 
	//	"ВЫБРАТЬ
	//	|	ВидыРемонта.Ссылка
	//	|ИЗ
	//	|	Справочник.ВидыРемонта КАК ВидыРемонта
	//	|ГДЕ
	//	|	ВидыРемонта.ПометкаУдаления = &Ложь";
	//
	//Запрос.УстановитьПараметр("Ложь", Ложь);
	//
	//Если Рез.Количество() = Запрос.Выполнить().Выбрать().Количество() Тогда 
		Возврат Рез;
	//Иначе 
	//	Возврат Неопределено;
	//КонецЕсли;
	
	
КонецФункции	

Функция ПолучитьТаблицуВнутреннихКонтрагентовДилера() Экспорт
	
	Рез = ВнутренниеКонтрагентыДилера.Выгрузить();
	
	Если Рез.Количество() = 0 Тогда
		Возврат Неопределено;
	Иначе
		Возврат Рез;
	КонецЕсли;
		
КонецФункции	

Функция	ПодготовитьТелефон(ТелефонВыборка) Экспорт
	
	Телефон = СтрЗаменить(ТелефонВыборка,"(","");
	Телефон = СтрЗаменить(Телефон,")","");
	Телефон = СтрЗаменить(Телефон,"+","");
	Телефон = СтрЗаменить(Телефон," ","");
	Возврат СтрЗаменить(Телефон,"-","");
	
КонецФункции // ПодготовитьТелефон()

Функция ПодготовитьEmail(Email) Экспорт
	
	Если Найти(Нрег(Email),"нет") > 0 Тогда
		Email = "";
	КонецЕсли;
	
	Возврат Email;
	
КонецФункции

Функция ЗаполнитьТаблицуСоответствийКодовРабот(Параметры)
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	Renault_СоответствиеАртикуловКодамРабот.КодРабот,
	               |	Renault_СоответствиеАртикуловКодамРабот.Артикул,
	               |	1 КАК Приритет
	               |ИЗ
	               |	Справочник.Renault_СоответствиеАртикуловКодамРабот КАК Renault_СоответствиеАртикуловКодамРабот
	               |ГДЕ
	               |	НЕ Renault_СоответствиеАртикуловКодамРабот.ПометкаУдаления
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	Renault_КомплексСервисыАвторабот.КодРабот,
	               |	Renault_КомплексСервисыАвторабот.Артикул,
	               |	0
	               |ИЗ
	               |	Справочник.Renault_КомплексСервисыАвторабот КАК Renault_КомплексСервисыАвторабот
	               |ГДЕ
	               |	НЕ Renault_КомплексСервисыАвторабот.ПометкаУдаления
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	Приритет";
	
	Таблица = Запрос.Выполнить().Выгрузить();
	Параметры.Вставить("ТаблицаСоответствийКодовРабот",Таблица);
КонецФункции	

Процедура ОпределитьТипКодРаботы(Параметры) Экспорт
	
	НоваяСтрока = Параметры.НоваяСтрока;
	ТипРаботыЗН = Строка(Параметры.Выборка.ТипРаботы);
	НоваяСтрока.ТипРаботы = ТипРаботыЗН;
	
	ТаблицаАвтоработМакета = Параметры.ТаблицаАвтоработМакета;
	ТаблицаАвтоработDialogys = Параметры.ТаблицаАвтоработDialogys;
	ТаблицаАвтоработЗН = Параметры.ТаблицаАвтоработЗН;
	
	СтрокиРаботыЗН = ТаблицаАвтоработЗН.НайтиСтроки(Новый Структура("ЗаказНаряд",Параметры.Выборка.ЗаказНаряд));
	
	Для каждого Стр из СтрокиРаботыЗН Цикл //анализируем все работы из заказ-наряда.
		
		Артикул = СокрЛП(Стр.Артикул);
		
		Если Параметры.Выборка.ЕстьМОТРИО = 1 Тогда //Сначала ищем МОТРИО
			//Ищем совпадение по 5-ти первым символам артикула автоработы.
			Отбор = Новый Структура("Артикул,Мотрио",Лев(Артикул,5),Строка(Параметры.Выборка.ЕстьМОТРИО));
			СтрокиТЗ = ТаблицаАвтоработМакета.НайтиСтроки(Отбор);
			Если СтрокиТЗ.Количество()>0 Тогда
				СтрТЗ = СтрокиТЗ[0];
				Если СтрТЗ.ТипРаботы = ТипРаботыЗН Тогда 
					НоваяСтрока.КодРаботы = СтрТЗ.КодРаботы;
					НоваяСтрока.ТипРаботы = СтрТЗ.ТипРаботы;
					Прервать; //Нашли работу с самым высоким приоритетом - сразу выходим из цикла
				Иначе 
					Продолжить; 
				КонецЕсли;  //Если тип работы в заказ-наряде отличается от типа в макете, то не подходит.
			КонецЕсли;
		КонецЕсли;
		
		Если Артикул = "GTC001" Тогда //Проведение ГТО
			НоваяСтрока.КодРаботы = "37";
			НоваяСтрока.Приоритет = 6;
			НоваяСтрока.ТипРаботы = "Другое"; 
			Продолжить;
		ИначеЕсли Лев(Артикул,5) = "TM001" Тогда
			Если НоваяСтрока.Приоритет > 7 Тогда
				НоваяСтрока.КодРаботы = "600";
				НоваяСтрока.Приоритет = 7;
				НоваяСтрока.ТипРаботы = "Обслуживание";
			КонецЕсли;
			Продолжить;
		КонецЕсли;
		
		//Ищем работу среди ТО
		Если Лев(Артикул,2) = "TM" Тогда//ИЛИ Лев(Артикул,2) = "CS" Тогда
			Если Параметры.Выборка.Пробег = 0 Тогда //ТО без указания пробега, будем искать по части артикула ("ТМ" + 3 Символа)
				АртикулПоиска = Лев(Артикул,5);//?(Лев(Артикул,2) = "CS", "TM"+Сред(Артикул,3,3), Лев(Артикул,5));
				Отбор = Новый Структура("Артикул, Свечи", АртикулПоиска,Строка(Параметры.Выборка.ЕстьСвечи)); //выберем работы по артикулу и признаку наличия Свечей в ЗН
				СтрокиТЗ = ТаблицаАвтоработМакета.НайтиСтроки(Отбор);
				Если СтрокиТЗ.Количество()>0 Тогда
					СтрТЗ = СтрокиТЗ[0];
					Если СтрТЗ.Приоритет < НоваяСтрока.Приоритет Тогда
						НоваяСтрока.КодРаботы = СтрТЗ.КодРаботы;
						НоваяСтрока.Приоритет = СтрТЗ.Приоритет;
						НоваяСтрока.ТипРаботы = СтрТЗ.ТипРаботы;
					КонецЕсли;
				КонецЕсли;
			Иначе //ТО Ищем по указанному пробегу
				Отбор = Новый Структура("Свечи",Строка(Параметры.Выборка.ЕстьСвечи)); //выберем работы по признаку наличия Свечей в ЗН
				СтрокиТЗ = ТаблицаАвтоработМакета.НайтиСтроки(Отбор);
				Пробег = Параметры.Выборка.Пробег;
				Для Каждого СтрТЗ из СтрокиТЗ Цикл
					Если Пробег>=Число(СтрТЗ.ПробегОт) И Пробег<=Число(СтрТЗ.ПробегДо) Тогда //Подберем работу по пробегу из ЗН
						Если СтрТЗ.Приоритет < НоваяСтрока.Приоритет Тогда
							НоваяСтрока.КодРаботы = СтрТЗ.КодРаботы;
							НоваяСтрока.Приоритет = СтрТЗ.Приоритет;
							НоваяСтрока.ТипРаботы = СтрТЗ.ТипРаботы;
							Прервать;
						КонецЕсли;
					КонецЕсли;
				КонецЦикла;
			КонецЕсли;
			Продолжить;
		КонецЕсли;
		
		//Ищем совпадение по 5-ти первым символам артикула автоработы, без мотрио
		Отбор = Новый Структура("Артикул,Мотрио",Лев(Артикул,5),"0");
		СтрокиТЗ = ТаблицаАвтоработМакета.НайтиСтроки(Отбор);
		Если СтрокиТЗ.Количество()>0 Тогда
			СтрТЗ = СтрокиТЗ[0];
			Если СтрТЗ.Приоритет < НоваяСтрока.Приоритет Тогда
				НоваяСтрока.КодРаботы = СтрТЗ.КодРаботы;
				НоваяСтрока.Приоритет = СтрТЗ.Приоритет;
				НоваяСтрока.ТипРаботы = СтрТЗ.ТипРаботы;
			КонецЕсли;
			Продолжить;
		КонецЕсли;
		
		//Если Артикул = "AC1" Тогда 
		Если НоваяСтрока.Приоритет > 73 и ТипРаботыЗН = "Установка аксессуаров" Тогда
			НоваяСтрока.КодРаботы = "34";
			НоваяСтрока.Приоритет = 73;
			НоваяСтрока.ТипРаботы = "Установка аксессуаров";
			//Продолжить;
		КонецЕсли;
		
		//КонецЕсли;

		
		//поиск любой кодировки из справочника Диалоджис
		Отбор = Новый Структура("Артикул",Артикул);
		СтрокиТЗ = ТаблицаАвтоработDialogys.НайтиСтроки(Отбор);
		
		Если СтрокиТЗ.Количество()>0 Тогда
			Если НоваяСтрока.Приоритет > 79  Тогда
	 			НоваяСтрока.КодРаботы = "32"; 
				НоваяСтрока.ТипРаботы = "Механический ремонт";
			КонецЕсли;
			Продолжить;
		КонецЕсли;
		
			
		Если НЕ ЗначениеЗаполнено(НоваяСтрока.КодРаботы) И ТипРаботыЗН = "Кузовной ремонт" Тогда 
			Если ЗначениеЗаполнено(Параметры.Выборка.ИНН) Тогда
				НоваяСтрока.КодРаботы = "33-01";
			Иначе
				НоваяСтрока.КодРаботы = "33-03";
			КонецЕсли;
			НоваяСтрока.ТипРаботы = "Кузовной ремонт";
			Продолжить;
		КонецЕсли;
		
	КонецЦикла;
	
	Если НЕ ЗначениеЗаполнено(НоваяСтрока.КодРаботы) Тогда
		Если ТипРаботыЗН = "Механический ремонт" Тогда
	 		НоваяСтрока.КодРаботы = "32"; 
			НоваяСтрока.ТипРаботы = "Механический ремонт";
		Иначе
		//неопределившаяся кодировка
		НоваяСтрока.КодРаботы = "36";
		НоваяСтрока.ТипРаботы = "Другое";
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

Процедура ОпределитьТипКодРаботы_Новый(Параметры) Экспорт
	ТаблицаСоответствий = Параметры.ТаблицаСоответствийКодовРабот;
	НоваяСтрока = Параметры.НоваяСтрока;
	ТипРаботыЗН = Строка(Параметры.Выборка.ТипРаботы);
	НоваяСтрока.ТипРаботы = ТипРаботыЗН;
	
	ТаблицаАвтоработDialogys = Параметры.ТаблицаАвтоработDialogys;
	ТаблицаАвтоработЗН = Параметры.ТаблицаАвтоработЗН;
	
	СтрокиРаботыЗН = ТаблицаАвтоработЗН.НайтиСтроки(Новый Структура("ЗаказНаряд",Параметры.Выборка.ЗаказНаряд));
	ТЧ = ТаблицаАвтоработЗН.Скопировать(СтрокиРаботыЗН);
	ТЧ.Сортировать("Сумма УБЫВ");
	
	Для каждого Стр из ТЧ Цикл //анализируем все работы из заказ-наряда.
		
		Артикул = СокрЛП(Стр.Артикул);
		АртикулПоиска = Лев(Артикул,5);
		
		НайденныеСтроки = ТаблицаСоответствий.НайтиСтроки(Новый Структура("Артикул",Артикул));
		Если НайденныеСтроки.Количество()>0 И НайденныеСтроки[0].КодРабот <> "" Тогда
			НоваяСтрока.КодРаботы = НайденныеСтроки[0].КодРабот;
			Возврат;
		КонецЕСли;
		Если НайденныеСтроки.Количество()=0 тогда
			НайденныеСтроки = ТаблицаСоответствий.НайтиСтроки(Новый Структура("Артикул",АртикулПоиска));
			Если НайденныеСтроки.Количество()>0 И НайденныеСтроки[0].КодРабот <> "" Тогда
				НоваяСтрока.КодРаботы = НайденныеСтроки[0].КодРабот;
				Возврат;
			ИначеЕсли Параметры.Выборка.ТипРаботы = Перечисления.Renault_КлассификацияВидовРемонта.КузовнойРемонт
					ИЛИ Параметры.Выборка.ТипРаботы = Перечисления.Renault_КлассификацияВидовРемонта.ГарантияКузовнойЦех тогда
				НоваяСтрока.КодРаботы  = "33-04";	
			ИначеЕсли Параметры.Выборка.ТипРаботы = Перечисления.Renault_КлассификацияВидовРемонта.СлесарныйРемонт
					ИЛИ Параметры.Выборка.ТипРаботы = Перечисления.Renault_КлассификацияВидовРемонта.РегулярноеТО 
					ИЛИ Параметры.Выборка.ТипРаботы = Перечисления.Renault_КлассификацияВидовРемонта.РегулярноеТОИСлесарныйРемонт 
					ИЛИ Параметры.Выборка.ТипРаботы = Перечисления.Renault_КлассификацияВидовРемонта.Мойка 
					ИЛИ Параметры.Выборка.ТипРаботы = Перечисления.Renault_КлассификацияВидовРемонта.ДополнительноеОборудование 
					ИЛИ Параметры.Выборка.ТипРаботы = Перечисления.Renault_КлассификацияВидовРемонта.ГарантияСлесарныйРемонт 
					ИЛИ Параметры.Выборка.ТипРаботы = Перечисления.Renault_КлассификацияВидовРемонта.ВнутреннийРемонт
					ИЛИ Параметры.Выборка.ТипРаботы = Перечисления.Renault_КлассификацияВидовРемонта.СервисныеПродукты Тогда
				НоваяСтрока.КодРаботы  = "32";	
			КонецЕСли;	
		КонецЕСли;	
	КонецЦикла;
КонецПроцедуры


Процедура ЗаполнитьРекомендованныеРаботы(НоваяСтрока,Выборка) Экспорт
	
	// Трояновский К.Е. 20.08.2019 16:16:17 {
	// DMSREN-230
	
	////DMSCOR-364: заполнять рекомендациями и по типу работ "Другое"
	//Если 
	//	//(НоваяСтрока.ТипРаботы = "Механический ремонт"
	//	//+
	//	//ИЛИ НоваяСтрока.ТипРаботы = "Другое"
	//	//
	//	//ИЛИ НоваяСтрока.ТипРаботы = "Обслуживание" 
	//	//ИЛИ	НоваяСтрока.ТипРаботы = "Установка аксессуаров") И 
	//	//-
	//	НЕ НоваяСтрока.ТипКлиента = "внутренний заезд"  Тогда
	// Трояновский К.Е. 20.08.2019 16:16:17 }
	
	// НАЧАЛО DMSCOR-1481 27.09.2019
	ЗаполнитьПоЗН = Истина;
	Если ЭтоКонфигурацияDMS И ЗначениеЗаполнено(Выборка.Сертификат) И Выборка.Сертификат.Работы.Количество()>0 Тогда
		
		ТЗРабот = Выборка.Сертификат.Работы.Выгрузить();
		ТЗРабот.Сортировать("РекомендуемаяДатаВыполнения возр");
		ЕстьРаботы = Ложь;
		Для каждого стр из ТЗРабот Цикл
			Если стр.РаботаАктуальна Тогда
				НоваяСтрока.РекомендованныеРаботы = НоваяСтрока.РекомендованныеРаботы + "; " + Стр.Работа;
				НоваяСтрока.ДатаКонтактаСКлиентом = Стр.РекомендуемаяДатаВыполнения;
			КонецЕсли;
		КонецЦикла;
		
		Если ЕстьРаботы Тогда
			НоваяСтрока.РекомендованныеРаботы = Прав(НоваяСтрока.РекомендованныеРаботы,СтрДлина(НоваяСтрока.РекомендованныеРаботы)-2);
			ЗаполнитьПоЗН = Ложь;
		КонецЕсли;
		
	КонецЕсли;
	
	Если ЗаполнитьПоЗН Тогда
		
		НоваяСтрока.ДатаКонтактаСКлиентом = Выборка.ДатаЗакрытия + 60*60*24*90;
		Если ДопИсточникРекомендации = 0 Тогда
			НоваяСтрока.РекомендованныеРаботы = Выборка.Комментарий;
		Иначе
			НоваяСтрока.РекомендованныеРаботы = Выборка.Рекомендации;
		КонецЕсли;
		
		Если ПустаяСтрока(СокрЛП(НоваяСтрока.РекомендованныеРаботы)) Тогда
			НоваяСтрока.ДатаКонтактаСКлиентом = Дата(1,1,1);
		КонецЕсли;
		
	КонецЕсли;
	// КОНЕЦ DMSCOR-1481 27.09.2019
		
	// Трояновский К.Е. 20.08.2019 16:17:11 {
	// DMSREN-230
	//КонецЕсли;
	// Трояновский К.Е. 20.08.2019 16:17:11 }

КонецПроцедуры	

Процедура ПроверкаЗначенийСтроки(НоваяСтрока,RegExp) Экспорт
	
	Если ПустаяСтрока(НоваяСтрока.ФИОКлиента) Тогда
		НоваяСтрока.ОписаниеОшибки = "Не заполнено поле ФИОКлиента";
		НоваяСтрока.ОшибкаСтроки = Истина;
		Возврат;
	КонецЕсли;
	
	Если ПустаяСтрока(НоваяСтрока.ТипКлиента) Тогда
		НоваяСтрока.ОписаниеОшибки = "Не заполнено поле ТипКлиента";
		НоваяСтрока.ОшибкаСтроки = Истина;
		Возврат;
	КонецЕсли;
	
	Если ПустаяСтрока(НоваяСтрока.VIN) Тогда
		НоваяСтрока.ОписаниеОшибки = "Не заполнено поле VIN";
		НоваяСтрока.ОшибкаСтроки = Истина;
		Возврат;
	КонецЕсли;
	Если ПустаяСтрока(НоваяСтрока.Бригада) Тогда
		НоваяСтрока.ОписаниеОшибки = "Не заполнено поле Бригада";
		НоваяСтрока.ОшибкаСтроки = Истина;
		Возврат;
	КонецЕсли;
	Если ПустаяСтрока(НоваяСтрока.ДатаЗакрытия) Тогда
		НоваяСтрока.ОписаниеОшибки = "Не заполнено поле ДатаЗакрытия";
		НоваяСтрока.ОшибкаСтроки = Истина;
		Возврат;
	КонецЕсли;
	Если ПустаяСтрока(НоваяСтрока.КодРаботы) Тогда
		НоваяСтрока.ОписаниеОшибки = "Не заполнено поле КодРаботы";
		НоваяСтрока.ОшибкаСтроки = Истина;
		Возврат;
	КонецЕсли;
	Если ПустаяСтрока(НоваяСтрока.Модель) Тогда
		НоваяСтрока.ОписаниеОшибки = "Не заполнено поле Модель";
		НоваяСтрока.ОшибкаСтроки = Истина;
		Возврат;
	КонецЕсли;
	Если ПустаяСтрока(НоваяСтрока.НомерЗаказНаряда) Тогда
		НоваяСтрока.ОписаниеОшибки = "Не заполнено поле НомерЗаказНаряда";
		НоваяСтрока.ОшибкаСтроки = Истина;
		Возврат;
	КонецЕсли;
	Если ПустаяСтрока(НоваяСтрока.Согласие) Тогда
		НоваяСтрока.ОписаниеОшибки = "Не заполнено поле Согласие";
		НоваяСтрока.ОшибкаСтроки = Истина;
		Возврат;
	КонецЕсли;
	
	Если ПустаяСтрока(НоваяСтрока.Телефон) Тогда
		НоваяСтрока.ОписаниеОшибки = "Не заполнено поле Телефон";
		НоваяСтрока.ОшибкаСтроки = Истина;
		Возврат;
	КонецЕсли;
		
	Если ПустаяСтрока(НоваяСтрока.ТипРаботы) Тогда
		НоваяСтрока.ОписаниеОшибки = "Не заполнено поле ТипРаботы";
		НоваяСтрока.ОшибкаСтроки = Истина;
		Возврат;
	КонецЕсли;

	Если НоваяСтрока.ТипКлиента = "физическое лицо" Тогда	
		ФИОДляПроверки = СтрЗаменить(НоваяСтрока.ФИОКлиента, " ","");
		Длина = СтрДлина(ФИОДляПроверки);
		Сч = 1;	
		Пока Сч<=Длина Цикл	
			КодСимволаСтроки =КодСимвола(ФИОДляПроверки,Сч);
			Если КодСимволаСтроки<1040 
				И КодСимволаСтроки<>45 //- 
				И КодСимволаСтроки<>1025 //Ё
				ИЛИ КодСимволаСтроки>1103 
				И КодСимволаСтроки<>1105 Тогда //ё
				НоваяСтрока.ОписаниеОшибки = "Поле ФИО заполнено некорректно";
				НоваяСтрока.ОшибкаСтроки = Истина;
				Возврат;
			КонецЕсли;	
			Сч = Сч+1;
		КонецЦикла;
	КонецЕсли;


	//проверяем длину VIN
	Если СтрДлина(НоваяСтрока.VIN)<17 Тогда
			НоваяСтрока.ОписаниеОшибки = "Поле VIN заполнено некорректно";
			НоваяСтрока.ОшибкаСтроки = Истина;
			Возврат;
		КонецЕсли;
		
		Если Найти(НоваяСтрока.VIN, "O")<>0 Тогда
			НоваяСтрока.ОписаниеОшибки = "Поле VIN заполнено некорректно";
			НоваяСтрока.ОшибкаСтроки = Истина;
			Возврат;
		КонецЕсли;
		
		Если Найти(НоваяСтрока.VIN, "i")<>0 Тогда
			НоваяСтрока.ОписаниеОшибки = "Поле VIN заполнено некорректно";
			НоваяСтрока.ОшибкаСтроки = Истина;
			Возврат;
		КонецЕсли;

		RegExp.Pattern = "\b([0-9A-Za-z]){17}\b"; //шаблон проверки 17 лат. букв и цифр
		Если НЕ RegExp.Test(НоваяСтрока.VIN) Тогда  
			НоваяСтрока.ОписаниеОшибки = "Поле VIN заполнено некорректно";
			НоваяСтрока.ОшибкаСтроки = Истина;
			Возврат;
		КонецЕсли;

		RegExp.Pattern = "\b\d{11}\b"; //шаблон проверки 11 знч только цифры
		Если НЕ RegExp.Test(НоваяСтрока.Телефон) Тогда 
			НоваяСтрока.ОписаниеОшибки = "Поле Телефон заполнено некорректно";
			НоваяСтрока.ОшибкаСтроки = Истина;
			Возврат;
		КонецЕсли;		
		
		Если ЗначениеЗаполнено(НоваяСтрока.Email) Тогда
			RegExp.Pattern = ".+@.+\..+"; //шаблон проверки лат. буквы, цифры, наличие @ и .
			Если НЕ RegExp.Test(НоваяСтрока.Email) Тогда  
				НоваяСтрока.ОписаниеОшибки = "Поле Email заполнено некорректно";
				НоваяСтрока.ОшибкаСтроки = Истина;
				Возврат;
			КонецЕсли;				
		КонецЕсли;
		
		НоваяСтрока.ОшибкаСтроки = Ложь;
		НоваяСтрока.ОписаниеОшибки = "";
		
КонецПроцедуры

Процедура ПроверкаЗначенийСтрокиПродажи(НоваяСтрока,RegExp,ТипКлиентаПоРегиструСостоянияАвто="",ТипКлиентаПоРеализации="") Экспорт
	
	Если ПустаяСтрока(НоваяСтрока.ФИОКлиента) Тогда
		НоваяСтрока.ОписаниеОшибки = "Не заполнено поле ФИОКлиента";
		НоваяСтрока.ОшибкаСтроки = Истина;
		Возврат;
	КонецЕсли;
	
	Если ПустаяСтрока(НоваяСтрока.ТипКлиента) Тогда
		НоваяСтрока.ОписаниеОшибки = "Не заполнено поле ТипКлиента";
		НоваяСтрока.ОшибкаСтроки = Истина;
		Возврат;
	КонецЕсли;

	Если (НоваяСтрока.ТипКлиента = "малый корпоративный клиент" ИЛИ НоваяСтрока.ТипКлиента = "крупный корпоративный клиент") Тогда
		Если СтрДлина(НоваяСтрока.ИНН) = 10 Тогда
			RegExp.Pattern = "\b\d{10}\b"; //шаблон проверки 10 знч только цифры
		ИначеЕсли СтрДлина(НоваяСтрока.ИНН) = 12 Тогда			
			RegExp.Pattern = "\b\d{12}\b"; //шаблон проверки 12 знч только цифры
		Иначе		
			НоваяСтрока.ОписаниеОшибки = "Не корректно заполнен ИНН";
			НоваяСтрока.ОшибкаСтроки = Истина;
			Возврат;
		КонецЕсли;			
		Если НЕ RegExp.Test(НоваяСтрока.ИНН) Тогда 
			НоваяСтрока.ОписаниеОшибки = "Не корректно заполнен ИНН";
			НоваяСтрока.ОшибкаСтроки = Истина;
			Возврат;
		КонецЕсли; 
	КонецЕсли; 
 
	Если ПустаяСтрока(НоваяСтрока.VIN) Тогда
		НоваяСтрока.ОписаниеОшибки = "Не заполнено поле VIN";
		НоваяСтрока.ОшибкаСтроки = Истина;
		Возврат;
	КонецЕсли;
	Если ПустаяСтрока(НоваяСтрока.Продавец) Тогда
		НоваяСтрока.ОписаниеОшибки = "Не заполнено поле Продавец";
		НоваяСтрока.ОшибкаСтроки = Истина;
		Возврат;
	КонецЕсли;
	Если ПустаяСтрока(НоваяСтрока.ДатаРождения) Тогда
		НоваяСтрока.ОписаниеОшибки = "Не заполнено поле ДатаРождения";
		НоваяСтрока.ОшибкаСтроки = Истина;
		Возврат;
	КонецЕсли;
	Если ПустаяСтрока(НоваяСтрока.АдресКлиента) Тогда
		НоваяСтрока.ОписаниеОшибки = "Не заполнено поле АдресКлиента";
		НоваяСтрока.ОшибкаСтроки = Истина;
		Возврат;
	КонецЕсли;
	Если ПустаяСтрока(НоваяСтрока.Модель) Тогда
		НоваяСтрока.ОписаниеОшибки = "Не заполнено поле Модель";
		НоваяСтрока.ОшибкаСтроки = Истина;
		Возврат;
	КонецЕсли;
	Если ПустаяСтрока(НоваяСтрока.ДатаЗанесенияПродажиВDistri) Тогда
		НоваяСтрока.ОписаниеОшибки = "Не заполнено поле ДатаЗанесенияПродажиВDistri";
		НоваяСтрока.ОшибкаСтроки = Истина;
		Возврат;
	КонецЕсли;
	Если ПустаяСтрока(НоваяСтрока.Согласие) Тогда
		НоваяСтрока.ОписаниеОшибки = "Не заполнено поле Согласие";
		НоваяСтрока.ОшибкаСтроки = Истина;
		Возврат;
	КонецЕсли;
	
	Если ПустаяСтрока(НоваяСтрока.Телефон) Тогда
		НоваяСтрока.ОписаниеОшибки = "Не заполнено поле Телефон";
		НоваяСтрока.ОшибкаСтроки = Истина;
		Возврат;
	КонецЕсли;
		
	Если ПустаяСтрока(НоваяСтрока.ФактическаяДатаВыдачиАвто) Тогда
		НоваяСтрока.ОписаниеОшибки = "Не заполнено поле ФактическаяДатаВыдачиАвто";
		НоваяСтрока.ОшибкаСтроки = Истина;
		Возврат;
	КонецЕсли;

	Если НоваяСтрока.ТипКлиента = "физическое лицо" Тогда	
		ФИОДляПроверки = СтрЗаменить(НоваяСтрока.ФИОКлиента, " ","");
		Длина = СтрДлина(ФИОДляПроверки);
		Сч = 1;	
		Пока Сч<=Длина Цикл	
			КодСимволаСтроки =КодСимвола(ФИОДляПроверки,Сч);
			Если КодСимволаСтроки<1040 
				И КодСимволаСтроки<>45 //- 
				И КодСимволаСтроки<>1025 //Ё
				ИЛИ КодСимволаСтроки>1103 
				И КодСимволаСтроки<>1105 Тогда //ё
				НоваяСтрока.ОписаниеОшибки = "Поле ФИО заполнено некорректно";
				НоваяСтрока.ОшибкаСтроки = Истина;
				Возврат;
			КонецЕсли;	
			Сч = Сч+1;
		КонецЦикла;
	КонецЕсли;


	//проверяем длину VIN
	Если СтрДлина(НоваяСтрока.VIN)<17 Тогда
			НоваяСтрока.ОписаниеОшибки = "Поле VIN заполнено некорректно";
			НоваяСтрока.ОшибкаСтроки = Истина;
			Возврат;
		КонецЕсли;
		
		Если Найти(НоваяСтрока.VIN, "O")<>0 Тогда
			НоваяСтрока.ОписаниеОшибки = "Поле VIN заполнено некорректно";
			НоваяСтрока.ОшибкаСтроки = Истина;
			Возврат;
		КонецЕсли;
		
		Если Найти(НоваяСтрока.VIN, "i")<>0 Тогда
			НоваяСтрока.ОписаниеОшибки = "Поле VIN заполнено некорректно";
			НоваяСтрока.ОшибкаСтроки = Истина;
			Возврат;
		КонецЕсли;

		RegExp.Pattern = "\b([0-9A-Za-z]){17}\b"; //шаблон проверки 17 лат. букв и цифр
		Если НЕ RegExp.Test(НоваяСтрока.VIN) Тогда  
			НоваяСтрока.ОписаниеОшибки = "Поле VIN заполнено некорректно";
			НоваяСтрока.ОшибкаСтроки = Истина;
			Возврат;
		КонецЕсли;

		RegExp.Pattern = "\b\d{11}\b"; //шаблон проверки 11 знч только цифры
		Если НЕ RegExp.Test(НоваяСтрока.Телефон) Тогда 
			НоваяСтрока.ОписаниеОшибки = "Поле Телефон заполнено некорректно";
			НоваяСтрока.ОшибкаСтроки = Истина;
			Возврат;
		КонецЕсли;		
		
		Если ЗначениеЗаполнено(НоваяСтрока.Email) Тогда
			RegExp.Pattern = ".+@.+\..+"; //шаблон проверки лат. буквы, цифры, наличие @ и .
			Если НЕ RegExp.Test(НоваяСтрока.Email) Тогда  
				НоваяСтрока.ОписаниеОшибки = "Поле Email заполнено некорректно";
				НоваяСтрока.ОшибкаСтроки = Истина;
				Возврат;
			КонецЕсли;				
		КонецЕсли;
		
		если ТипКлиентаПоРегиструСостоянияАвто = 1 и ТипКлиентаПоРеализации = "малый корпоративный клиент"
			ИЛИ ТипКлиентаПоРегиструСостоянияАвто = 2 и ТипКлиентаПоРеализации = "физическое лицо"
			ИЛИ ТипКлиентаПоРегиструСостоянияАвто = 3 и ТипКлиентаПоРеализации = "физическое лицо"
			ИЛИ ТипКлиентаПоРегиструСостоянияАвто = 4 и ТипКлиентаПоРеализации = "физическое лицо"
			ИЛИ ТипКлиентаПоРегиструСостоянияАвто = 5 и ТипКлиентаПоРеализации = "малый корпоративный клиент"
			ИЛИ ТипКлиентаПоРегиструСостоянияАвто = 6 и ТипКлиентаПоРеализации = "физическое лицо" тогда
				НоваяСтрока.ОписаниеОшибки = "Расхождение типа клиента в distri.net и документе реализации";
				НоваяСтрока.ОшибкаСтроки = Истина;
				возврат;
		КонецЕсли;
		
		НоваяСтрока.ОшибкаСтроки = Ложь;
		НоваяСтрока.ОписаниеОшибки = "";
		
КонецПроцедуры

Процедура ВыгрузитьЗаказНаряды() Экспорт
	
	ТаблицаСоответствийВидовРемонта = ПолучитьТаблицуСоответствийВидовРемонта();
	Если ТаблицаСоответствийВидовРемонта = Неопределено Тогда
		#Если Клиент Тогда
			Предупреждение("Соответствия видов ремонта заполнены не полностью");
		#КонецЕсли
		Возврат;
	КонецЕсли;
	
	Для Каждого  Стр из ТаблицаСоответствийВидовРемонта Цикл
		Если Стр.ТипРаботVOC = "" Тогда
			#Если Клиент Тогда
				Предупреждение("Соответствия видов ремонта заполнены не полностью");
			#КонецЕсли
			Возврат;
		КонецЕсли;
	КонецЦикла;
	

	//ТаблицаВнутреннихКонтрагентовДилера = ПолучитьТаблицуВнутреннихКонтрагентовДилера();
	//Если ТаблицаВнутреннихКонтрагентовДилера = Неопределено Тогда
	//	#Если Клиент Тогда
	//		Предупреждение("Не указаны внутренние контрагенты дилера!");
	//	#КонецЕсли
	//	Возврат;
	//КонецЕсли;
	
	
	Запрос = Новый Запрос;
	Если ЭтоКонфигурацияDMS Тогда
		Запрос.Текст = ПолучитьОбщийТекстЗапросаDMS();
	Иначе
		Запрос.Текст = ПолучитьОбщийТекстЗапросаАльфаАвто();
	КонецЕсли;
	
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	Запрос.УстановитьПараметр("НачалоПериода", НачалоПериода);
	Запрос.УстановитьПараметр("КонецПериода", КонецДня(КонецПериода));
	Запрос.УстановитьПараметр("ТабМотрио", ПолучитьТаблицуАртикуловМотрио());
	Запрос.УстановитьПараметр("ТабСвечи", ПолучитьТаблицуАртикуловСвечей());
	Запрос.УстановитьПараметр("ОтборПодразделений", ОтборПодразделений);
	Запрос.УстановитьПараметр("Подразделения", СписокПодразделений.ВыгрузитьКолонку("Подразделение"));
	Запрос.УстановитьПараметр("СписокОрганизаций",СписокОрганизаций.ВыгрузитьКолонку("Организация"));
	Запрос.УстановитьПараметр("ТаблицаСоответствийВидовРемонта",ТаблицаСоответствийВидовРемонта);
	//Запрос.УстановитьПараметр("ТаблицаВнутреннихКонтрагентовДилера", ТаблицаВнутреннихКонтрагентовДилера);
	Запрос.УстановитьПараметр("ПереключательКонтакты",ПереключательКонтакты);
	Запрос.УстановитьПараметр("ВыгружатьНулевыеЗН", ВыгружатьНулевыеЗН);
	Запрос.УстановитьПараметр("ВыгружатьВыполненныеЗН",ВыгружатьВыполненныеЗН);
	Запрос.УстановитьПараметр("ДнейНаОплатуЗН", 0);
	Запрос.УстановитьПараметр("ПереключательСогласие", ПереключательСогласие);
	
	РезультатПоЗаказНарядам.Очистить();

	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Количество() = 0 Тогда
		Сообщить("Нет данных по заказ-нарядам");
		Возврат;
	КонецЕсли;
	
	СоответствияМоделей = ПолучитьСоответствияМоделейПоVIN();
	
	Запрос.Текст = ПолучитьТекстЗапросаПоРаботам();
	ТаблицаАвтоработЗН = Запрос.Выполнить().Выгрузить();
	ТаблицаАвтоработЗН.Индексы.Добавить("ЗаказНаряд");
		
	RegExp = Новый COMОбъект("VBScript.RegExp");// создаем объект для работы с регулярными выражениями
	RegExp.MultiLine = Ложь;  // истина — текст многострочный, ложь — одна строка
	RegExp.Global = Истина;     // истина — поиск по всей строке, ложь — до первого совпадения
	RegExp.IgnoreCase = Истина; // истина — игнорировать регистр строки при поиске
	
	Параметры = Новый Структура;
	Параметры.Вставить("ТаблицаАвтоработМакета",ПолучитьТаблицуАвтоработМакета());
	Параметры.Вставить("ТаблицаАвтоработDialogys",ПолучитьТаблицуАвтоработDialogys());
	Параметры.Вставить("ТаблицаАвтоработЗН",ТаблицаАвтоработЗН);
	
	ЗаполнитьТаблицуСоответствийКодовРабот(Параметры);
	
	Пока Выборка.Следующий() Цикл
		
		НоваяСтрока = РезультатПоЗаказНарядам.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);
		Если ЗначениеЗаполнено(Выборка.Сертификат) тогда 
			Структура = ДатаИРекоминдация(Выборка.Сертификат,Выборка.ДатаЗакрытия);
			Если Структура.Дата = "" тогда
				НоваяСтрока.ДатаКонтактаСКлиентом = Дата(1,1,1,0,0,0);
				Если ДопИсточникРекомендации =1 тогда
					НоваяСтрока.РекомендованныеРаботы = Выборка.ЗаказНаряд.Рекомендации; 
				Иначе
					НоваяСтрока.РекомендованныеРаботы = Выборка.ЗаказНаряд.Комментарий;
				КонецЕсли;
			Иначе	
				НоваяСтрока.ДатаКонтактаСКлиентом = Структура.Дата;
				НоваяСтрока.РекомендованныеРаботы = Структура.Наименование
			КонецЕсли;
		Иначе
			НоваяСтрока.ДатаКонтактаСКлиентом = Дата(1,1,1,0,0,0);
			Если ДопИсточникРекомендации =1 тогда
				НоваяСтрока.РекомендованныеРаботы = Выборка.ЗаказНаряд.Рекомендации; 
			Иначе
				НоваяСтрока.РекомендованныеРаботы = Выборка.ЗаказНаряд.Комментарий;
			КонецЕсли;
		КонецЕсли;
		
		
		
		Если Лев(СокрЛ(ВРег(НоваяСтрока.VIN)), 3) = "X7L" ИЛИ Лев(СокрЛ(ВРег(НоваяСтрока.VIN)), 3) = "VF1"
			ИЛИ Лев(СокрЛ(ВРег(НоваяСтрока.VIN)), 3) = "VF3" Тогда
			ЗаполнитьМодельПоVIN(НоваяСтрока,СоответствияМоделей)
		Иначе
			НоваяСтрока.Модель = "Другое"
		КонецЕсли;
		
		НоваяСтрока.ФИОКлиента = СОКРЛП(Выборка.ФИОКлиента);
		Параметры.Вставить("НоваяСтрока",НоваяСтрока);
		Параметры.Вставить("Выборка",Выборка);
		//ОпределитьТипКодРаботы(Параметры);
		
		ОпределитьТипКодРаботы_Новый(Параметры);		
		//ЗаполнитьРекомендованныеРаботы(НоваяСтрока,Выборка);
		//убираем в телефоне лишние символы
		НоваяСтрока.Телефон = ПодготовитьТелефон(Выборка.Телефон);
		НоваяСтрока.Email = ПодготовитьEmail(НоваяСтрока.Email);
		ПроверкаЗначенийСтроки(НоваяСтрока,RegExp);

	КонецЦикла;	
	
КонецПроцедуры

Процедура ВыгрузитьПродажи() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = ПолучитьОбщийТекстЗапросаDMSПродажи();
	
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	Запрос.УстановитьПараметр("НачалоПериода", НачалоПериода);
	Запрос.УстановитьПараметр("КонецПериода", КонецДня(КонецПериода));
	Запрос.УстановитьПараметр("ОтбиратьПоСкладам",ОтбиратьПоСкладам);
	Запрос.УстановитьПараметр("СписокСкладов",СписокСкладов.ВыгрузитьКолонку("Склад"));
	Запрос.УстановитьПараметр("ПереключательСогласие",ПереключательСогласие);
	
	                     
	РезультатПоПродажам.Очистить();
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Количество() = 0 Тогда
		Сообщить("Нет данных по продажам");
		Возврат;
	КонецЕсли;
	
	СоответствияМоделей = ПолучитьСоответствияМоделейПоVIN();
	
		
	RegExp = Новый COMОбъект("VBScript.RegExp");// создаем объект для работы с регулярными выражениями
	RegExp.MultiLine = Ложь;  // истина — текст многострочный, ложь — одна строка
	RegExp.Global = Истина;     // истина — поиск по всей строке, ложь — до первого совпадения
	RegExp.IgnoreCase = Истина; // истина — игнорировать регистр строки при поиске
	
		//Для Каждого Стр Из Результат Цикл
	Пока Выборка.Следующий() Цикл
		
		НоваяСтрока = РезультатПоПродажам.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);	
		//ЗаполнитьМодельПоVIN(НоваяСтрока,СоответствияМоделей);
		НоваяСтрока.ФИОКлиента = СОКРЛП(Выборка.ФИОКлиента);
		//убираем в телефоне лишние символы
		НоваяСтрока.Телефон = ПодготовитьТелефон(Выборка.Телефон);
		НоваяСтрока.Email = ПодготовитьEmail(НоваяСтрока.Email);
		НоваяСтрока.ГородКлиента = ВыделитьГородИзАдреса(НоваяСтрока.АдресКлиента, Выборка.КлиентСсылка);
		ПроверкаЗначенийСтрокиПродажи(НоваяСтрока,RegExp,Выборка.ТипКлиентаПоРегиструСостоянияАвто,Выборка.ТипКлиентаПоРеализации);

	КонецЦикла;	

КонецПроцедуры

Функция ВыделитьГородИзАдреса(АдресКлиента, Клиент = Неопределено) Экспорт
	
	ГородКлиента = "";
	
	Если ЗначениеЗаполнено(Клиент) Тогда
		ГородКлиента = ПолучитьГородКлиента(Клиент);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ГородКлиента) Тогда
		Возврат ГородКлиента;
	КонецЕсли;
	
	ВключатьОбласть = Истина;
	
	ПозицияНачалаНазванияНаселенногоПункта = Найти(нрег(АдресКлиента),"г.");
	
	ПрефиксНаселенногоПункта = "г. ";
	Если ПозицияНачалаНазванияНаселенногоПункта = 0 Тогда
		ПозицияНачалаНазванияНаселенногоПункта = Найти(нрег(АдресКлиента),"с.");
		ПрефиксНаселенногоПункта = "с. ";
	Иначе
		ВключатьОбласть = Ложь;
	КонецЕсли;	
	
	Если ПозицияНачалаНазванияНаселенногоПункта = 0 Тогда
		ПозицияНачалаНазванияНаселенногоПункта = Найти(нрег(АдресКлиента),"пгт.");
		ПрефиксНаселенногоПункта = "пгт. ";
	КонецЕсли;	
	
	Если ПозицияНачалаНазванияНаселенногоПункта = 0 Тогда
		ПозицияНачалаНазванияНаселенногоПункта = Найти(нрег(АдресКлиента),"п.");
		ПрефиксНаселенногоПункта = "п. ";
	КонецЕсли;	
	
	Если ПозицияНачалаНазванияНаселенногоПункта = 0 Тогда
		ПозицияНачалаНазванияНаселенногоПункта = Найти(нрег(АдресКлиента),"село ");
		ПрефиксНаселенногоПункта = "село ";
	КонецЕсли;
	
	Если ПозицияНачалаНазванияНаселенногоПункта = 0 Тогда
		ПозицияНачалаНазванияНаселенногоПункта = Найти(нрег(АдресКлиента),"д.");
		Если ПозицияНачалаНазванияНаселенногоПункта > СтрДлина(АдресКлиента)-12 Тогда  //исключим номер дома 
			Возврат "";
		КонецЕсли;
		ПрефиксНаселенногоПункта = "д. ";
	КонецЕсли;	
	
	Если  ПозицияНачалаНазванияНаселенногоПункта = 0 Тогда
		Возврат "";
	КонецЕсли;
	
	АдресБезОбласти = СокрЛП(Прав(АдресКлиента,СтрДлина(АдресКлиента) - ПозицияНачалаНазванияНаселенногоПункта-1));
	ПозицияКонцаНазванияНаселенногоПункта = Макс(Найти(АдресБезОбласти,","),Найти(АдресБезОбласти," "));
	Если ПозицияКонцаНазванияНаселенногоПункта>0 Тогда
		АдресБезУлицы = ПрефиксНаселенногоПункта + Лев(АдресБезОбласти,ПозицияКонцаНазванияНаселенногоПункта-1);
		Если ВключатьОбласть Тогда
			АдресБезУлицы = Лев(АдресКлиента,ПозицияНачалаНазванияНаселенногоПункта-1) + АдресБезУлицы;
		КонецЕсли;
	Иначе
		АдресБезУлицы = ПрефиксНаселенногоПункта + АдресБезОбласти;
		Если ВключатьОбласть Тогда
			АдресБезУлицы = Лев(АдресКлиента,ПозицияНачалаНазванияНаселенногоПункта-1) + АдресБезУлицы;
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат АдресБезУлицы;

КонецФункции

Процедура ВыгрузитьЗаказНарядыВФаил(ИмяФайла = "", ТаблицаДанных = Неопределено) Экспорт
	
	Если РезультатПоЗаказНарядам.Количество() = 0 Тогда
		Сообщить("Сначала сформируйте таблицу заказ-нарядов");
		Возврат;
	КонецЕсли;
	
	Поиск = Новый Структура;
	Поиск.Вставить("ОшибкаСтроки", Истина);
	
	//СтрокиСОшибками = РезультатПоЗаказНарядам.НайтиСтроки(Поиск);
	//
	//Если СтрокиСОшибками.Количество()>0 Тогда
	//	Сообщить("Существуют строки с ошибками, выгрузка отменена");
	//	Возврат;
	//КонецЕсли;	
	
	ТабДок = Новый Табличныйдокумент; 
	Макет = ПолучитьМакет("МакетЗаказНаряды");
	ОбластьШапка = Макет.ПолучитьОбласть("Шапка");
	
	// { DMSREN-668 Болдарев Д.Е. от 25.03.2020  
	
	Организация = Неопределено;
	//Если ПереключательДЦ = 1 И СписокОрганизаций.Количество() > 0 Тогда
	//	ТаблицаОрг = СписокОрганизаций.Выгрузить(,"Организация");
	//ИначеЕсли ПереключательДЦ = 0 и СписокОрганизаций.Количество() > 0 Тогда 
	//	ТаблицаОрг = СписокОрганизаций.Выгрузить(,"ДилерскийЦентр");
	//КонецЕсли;
	Если ПереключательДЦ = 1 Тогда
		ТаблицаОрг = СписокОрганизаций.Выгрузить(,"Организация");
	ИначеЕсли ПереключательДЦ = 0 Тогда
		МассивТипов = Новый Массив;
		МассивТипов.Добавить(Тип("СправочникСсылка.Организации"));
		ТаблицаОрг = Новый ТаблицаЗначений();
		ТаблицаОрг.Колонки.Добавить("Организация",Новый ОписаниеТипов(МассивТипов));
		Для Каждого Стр Из СписокОрганизаций Цикл 
			НоваяСтрока = ТаблицаОрг.Добавить();
			НоваяСтрока.Организация = Стр.ДилерскийЦентр.Организация;
		КонецЦикла;	
	КонецЕсли;
		
	// } DMSREN-668 Болдарев Д.Е. от 25.03.2020. 
	
	
	
	Запрос = Новый Запрос;
	
	//Запрос.Текст = "ВЫБРАТЬ
	//               |	КонтактнаяИнформация.Поле4 КАК Город,
	//               |	КонтактнаяИнформация.Объект как Организация
	//               |ИЗ
	//               |	РегистрСведений.КонтактнаяИнформация КАК КонтактнаяИнформация
	//               |ГДЕ
	//               |	КонтактнаяИнформация.Объект В(&Объект)
	//               |	И КонтактнаяИнформация.Тип = &Тип
	//               |	И КонтактнаяИнформация.Вид = &Вид";
	
	Запрос.Текст = "ВЫБРАТЬ
	               |	Организации.Организация КАК Организация
	               |ПОМЕСТИТЬ ВтОрганизации
	               |ИЗ
	               |	&ТаблицаОрг КАК Организации
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	КонтактнаяИнформация.Поле4 КАК Город,
	               |	КонтактнаяИнформация.Объект
	               |ПОМЕСТИТЬ ГородВт
	               |ИЗ
	               |	РегистрСведений.КонтактнаяИнформация КАК КонтактнаяИнформация
	               |ГДЕ
	               |	КонтактнаяИнформация.Тип = &Тип
	               |	И КонтактнаяИнформация.Вид = &Вид
	               |	И КонтактнаяИнформация.Объект В
	               |			(ВЫБРАТЬ
	               |				ВтОрганизации.Организация
	               |			ИЗ
	               |				ВтОрганизации КАК ВтОрганизации)
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВтОрганизации.Организация,
	               |	ЕСТЬNULL(ГородВт.Город, """") КАК Город
	               |ИЗ
	               |	ВтОрганизации КАК ВтОрганизации
	               |		ЛЕВОЕ СОЕДИНЕНИЕ ГородВт КАК ГородВт
	               |		ПО ВтОрганизации.Организация = ГородВт.Объект";
	
	//Запрос.УстановитьПараметр("Объект", Организация);		
	Запрос.УстановитьПараметр("ТаблицаОрг", ТаблицаОрг);		
	Запрос.УстановитьПараметр("Тип", Перечисления.ТипыКонтактнойИнформации.Адрес);
	Запрос.УстановитьПараметр("Вид", Справочники.ВидыКонтактнойИнформации.АдресЮридический);
	
	АдресаОрганизаций = Запрос.Выполнить();
	Выборка = АдресаОрганизаций.Выбрать();
	ДиллерШапка = "";
	Пока Выборка.Следующий() Цикл 
		ДиллерШапка = ДиллерШапка + Выборка.Организация.НаименованиеПолное + Выборка.Город + "; ";		
	КонецЦикла;
	
	
	ОбластьШапка.Параметры.Дилер        	= ДиллерШапка;
	ОбластьШапка.Параметры.НачалоПериода 	= Формат(НачалоПериода,"ДФ=dd.MM.yyyy");
	ОбластьШапка.Параметры.КонецПериода  	= Формат(КонецПериода,"ДФ=dd.MM.yyyy");
	ОбластьШапка.Параметры.КодCATI  	 	= КодCATI;
	ТабДок.Вывести(ОбластьШапка);
	
	Если ТаблицаДанных = Неопределено Тогда
		Для Каждого Стр Из РезультатПоЗаказНарядам Цикл
			Если Стр.ОшибкаСтроки Тогда
				ОбластьСтроки = Макет.ПолучитьОбласть("СтрокиОшибка");
			Иначе
				ОбластьСтроки = Макет.ПолучитьОбласть("Строки");
			КонецЕсли;
			ОбластьСтроки.Параметры.Заполнить(Стр);
			ТабДок.Вывести(ОбластьСтроки);
		КонецЦикла;
	Иначе 
		Для Каждого Стр Из ТаблицаДанных Цикл
			Если Стр.ОшибкаСтроки Тогда
				ОбластьСтроки = Макет.ПолучитьОбласть("СтрокиОшибка");
			Иначе
				ОбластьСтроки = Макет.ПолучитьОбласть("Строки");
			КонецЕсли;
			ОбластьСтроки.Параметры.Заполнить(Стр);
			ТабДок.Вывести(ОбластьСтроки);
		КонецЦикла;
	КонецЕсли;

	Если ИмяФайла = "" Тогда
		#Если Клиент Тогда
			ДиалогФайла = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Сохранение);
			ДиалогФайла.Фильтр = "Файл Excel (*.xls)|*.xls";
			Если ДиалогФайла.Выбрать() Тогда
				ТабДок.Записать(ДиалогФайла.ПолноеИмяФайла, ТипФайлаТабличногоДокумента.XLS);
			КонецЕсли;
		#КонецЕсли
	Иначе
		ТабДок.Записать(ИмяФайла, ТипФайлаТабличногоДокумента.XLS);	
	КонецЕсли;
	
КонецПроцедуры

Функция ПолучитьГородКлиента(Клиент) 
	
	ГородКлиента = "";
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	КонтактнаяИнформация.Представление,
	|	КонтактнаяИнформация.Поле2,
	|	КонтактнаяИнформация.Поле4,
	|	КонтактнаяИнформация.Поле5
	|ИЗ
	|	РегистрСведений.КонтактнаяИнформация КАК КонтактнаяИнформация
	|ГДЕ
	|	КонтактнаяИнформация.Объект = &Объект
	|	И КонтактнаяИнформация.Тип = &Тип
	|	И КонтактнаяИнформация.ЗначениеПоУмолчанию = ИСТИНА";
	Запрос.УстановитьПараметр("Объект", Клиент);
    Запрос.УстановитьПараметр("Тип", Перечисления.ТипыКонтактнойИнформации.Адрес);
    Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Если ЗначениеЗаполнено(Выборка.Поле5) Тогда
			ГородКлиента = Выборка.Поле5;
		ИначеЕсли ЗначениеЗаполнено(Выборка.Поле4) Тогда
			ГородКлиента = Выборка.Поле4;
		ИначеЕсли ЗначениеЗаполнено(Выборка.Поле2) Тогда
			ГородКлиента = Выборка.Поле2;
		КонецЕсли;
	КонецЕсли;
	
	Возврат ГородКлиента;
	
КонецФункции

Функция ДатаИРекоминдация(Сертификат,ДатаЗакрытия)
	
	Запрос = Новый Запрос;
	Запрос.Текст =  "ВЫБРАТЬ
	                |	Renault_СертификатКонтроляРаботы.РекомендуемаяДатаВыполнения КАК РекомендуемаяДатаВыполнения,
	                |	ВЫБОР
	                |		КОГДА ТИПЗНАЧЕНИЯ(Renault_СертификатКонтроляРаботы.Работа) = ТИП(справочник.автоработы)
	                |			ТОГДА ПРЕДСТАВЛЕНИЕ(Renault_СертификатКонтроляРаботы.Работа.НаименованиеПолное)
	                |		ИНАЧЕ ВЫРАЗИТЬ(Renault_СертификатКонтроляРаботы.Работа КАК СТРОКА(100))
	                |	КОНЕЦ КАК Наименование
	                |ИЗ
	                |	Документ.Renault_СертификатКонтроля.Работы КАК Renault_СертификатКонтроляРаботы
	                |ГДЕ
	                |	Renault_СертификатКонтроляРаботы.РаботаАктуальна = ИСТИНА
	                |	И Renault_СертификатКонтроляРаботы.Ссылка = &Ссылка
	                |	И Renault_СертификатКонтроляРаботы.РекомендуемаяДатаВыполнения > &ДатаПлан
	                |
	                |ОБЪЕДИНИТЬ ВСЕ
	                |
	                |ВЫБРАТЬ
	                |	Renault_ВыполнениеТОСрезПервых.ДатаПлан,
	                |	ПРЕДСТАВЛЕНИЕ(Renault_ВыполнениеТОСрезПервых.ВидТО)
	                |ИЗ
	                |	РегистрСведений.Renault_ВыполнениеТО.СрезПервых КАК Renault_ВыполнениеТОСрезПервых
	                |ГДЕ
	                |	Renault_ВыполнениеТОСрезПервых.ДатаПлан > &ДатаПлан
	                |	И Renault_ВыполнениеТОСрезПервых.Автомобиль = &Автомобиль
	                |
	                |УПОРЯДОЧИТЬ ПО
	                |	РекомендуемаяДатаВыполнения";
	Запрос.УстановитьПараметр("Ссылка",Сертификат);
	Запрос.УстановитьПараметр("ДатаПлан",ДатаЗакрытия);
	Запрос.УстановитьПараметр("Автомобиль",Сертификат.Автомобиль);
	Таб = Запрос.Выполнить().Выгрузить();
	Структура = новый Структура;
	Если Таб.Количество()>0 Тогда
		Структура.Вставить("Дата",Таб[0].РекомендуемаяДатаВыполнения);
		Структура.Вставить("Наименование",Таб[0].Наименование);
	Иначе
		Структура.Вставить("Дата","");
		Структура.Вставить("Наименование","");
	КонецЕсли;
	
	
	Возврат Структура;		
	
КонецФункции

// DMSREN-1125
функция ПолучитьВерсиюДастера(ОТТС)
	КодыNewDuster = Новый Массив;
	КодыNewDuster.Добавить("HSRE13");
	КодыNewDuster.Добавить("HSREE4");
	КодыNewDuster.Добавить("HSRP34");
	КодыNewDuster.Добавить("HSRP39");
	КодыNewDuster.Добавить("HSRDB4");
	КодыNewDuster.Добавить("HSRES4");
	
	Если КодыNewDuster.Найти(ОТТС) <> Неопределено тогда
		Возврат "Duster 2";
	иначе
		Возврат "Duster";
	КонецЕсли;
КонецФункции
