
&НаСервере
Процедура УдалитьПрочитанныеНаСервере()
	
	НаборЗаписей = РегистрыСведений.Renault_внПодпискиНаСобытия.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Пользователь.Установить(ИмяПользователя());
	НаборЗаписей.Записать();		

КонецПроцедуры

&НаКлиенте
Процедура УдалитьПрочитанные(Команда)
	
	УдалитьПрочитанныеНаСервере();
	Элементы.Список.Обновить();
	
КонецПроцедуры

&НаКлиенте
Процедура СписокПередУдалением(Элемент, Отказ)
	
	Отказ = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура СписокПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа)
	
	Отказ = Истина;
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
		
	Список.Параметры.УстановитьЗначениеПараметра("Пользователь", ИмяПользователя());
	
	// Запишем, что данные просмотрены
	ТекДата			= ТекущаяДата();
	НаборЗаписей	= РегистрыСведений.Renault_внПодпискиНаСобытия.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Пользователь.Установить(ИмяПользователя());
	НаборЗаписей.Прочитать();	
	ДатаИзменения	= ТекДата;
	Для Каждого Запись Из НаборЗаписей Цикл		
		Если НЕ Запись.Прочитано Тогда
			Если ДатаИзменения > Запись.ДатаИзменения Тогда
				ДатаИзменения = Запись.ДатаИзменения;
			КонецЕсли;
			
			Запись.ДатаПросмотра 	= ТекДата;
			Запись.Прочитано		= Истина;
		КонецЕсли;		
	КонецЦикла;	
	НаборЗаписей.Записать(Истина);
	Список.Параметры.УстановитьЗначениеПараметра("ДатаИзменения", ДатаИзменения);
	
КонецПроцедуры
