
Процедура ЗаполнитьЗонамиВыдачиПоУмолчанию(Записывать = Истина) Экспорт
	
	Если ЭтотОбъект.ЗоныВыдачи.Количество() = 0 Тогда
		
		Итог = Справочники.Renault_ЗоныВыдачиАвтомобилей.НайтиПоНаименованию(ЭтотОбъект.Наименование);
		Если (Итог = неопределено)ИЛИ (Итог = Справочники.Renault_ЗоныВыдачиАвтомобилей.ПустаяСсылка()) тогда
			звоб = Справочники.Renault_ЗоныВыдачиАвтомобилей.СоздатьЭлемент();
			звоб.Наименование = ЭтотОбъект.Наименование;
			звоб.Записать();
			Итог = звоб.Ссылка;
		КонецЕсли;
		НовСТр  =ЭтотОбъект.ЗоныВыдачи.Добавить();
		НовСТр.ЗонаВыдачи = Итог;
		Если Записывать Тогда
			ЭтотОбъект.Записать();
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗаполнитьФотоПоСтарымНастройкам(Записывать = Истина)  Экспорт
	
	Если ЭтотОбъект.СотрудникиДляОтображенияВСтатусБареАдминистартора.Количество() = 0 Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЗначенияСвойствОбъектов.Объект КАК Сотрудник
		|ИЗ
		|	РегистрСведений.ЗначенияСвойствОбъектов КАК ЗначенияСвойствОбъектов
		|ГДЕ
		|	ЗначенияСвойствОбъектов.Свойство = ЗНАЧЕНИЕ(ПланВидовХарактеристик.СвойстваОбъектов.CRM_ПоказыватьФотоВАРМReception)
		|	И ЗначенияСвойствОбъектов.Значение = ИСТИНА";
		ТаблицаФотоCRM = Запрос.Выполнить().Выгрузить();
		Для Каждого Фото Из ТаблицаФотоCRM Цикл
			Нов = ЭтотОбъект.СотрудникиДляОтображенияВСтатусБареАдминистартора.Добавить();
			Нов.Сотрудник = Фото.Сотрудник;
		КонецЦикла;
		
		Если Записывать Тогда
			ЭтотОбъект.Записать();
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриУстановкеНовогоКода(СтандартнаяОбработка, Префикс)
	Префикс = DMS_ОбщегоНазначенияСервер.ПолучитьПрефикс();
	//Если НЕ спПриУстановкеНовогоКода(ЭтотОбъект, СтандартнаяОбработка, Префикс) Тогда Возврат; КонецЕсли;
КонецПроцедуры

Процедура ПередЗаписью(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	DMS_СопоставлениеФормСобственности.Свернуть("ФормаСобственности,ЮрФизЛицо");
	
	Если Автосервис_ИспользуетсяПланшет_v2 и НЕ Ссылка.Автосервис_ИспользуетсяПланшет_v2 Тогда
		Параметры = Новый Массив;
		Параметры.Добавить(Ссылка);
		ФоновыеЗадания.Выполнить("Renault_АвтосервисСерверСинхрСПланшетом.ВыгрузитьДилерскиеЦентрыВПланшет", Параметры, Строка(Новый УникальныйИдентификатор), "Renault_АвтосервисСерверСинхрСПланшетом.ВыгрузитьДилерскиеЦентрыВПланшет");
	КонецЕсли;
	
КонецПроцедуры     

Процедура ПриЗаписи(Отказ)
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
КонецПроцедуры

Функция ПолучитьОнлайнПосты() Экспорт 

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	CRM_ДилерскиеЦентрыАвтосервисЦеха.Цех КАК Цех
		|ИЗ
		|	Справочник.CRM_ДилерскиеЦентры.АвтосервисЦеха КАК CRM_ДилерскиеЦентрыАвтосервисЦеха
		|ГДЕ
		|	CRM_ДилерскиеЦентрыАвтосервисЦеха.ОнлайнЗапись = ИСТИНА
		|	И CRM_ДилерскиеЦентрыАвтосервисЦеха.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	ОнлайнПосты = Запрос.Выполнить().Выгрузить();
	
	Возврат ОнлайнПосты;	
	
КонецФункции


