
&НаКлиенте
Перем РезультатПолученияДопИнформации;
&НаКлиенте
Перем ФормаДлительнойОперации;
&НаКлиенте
Перем ПараметрыОбработчика;


/////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Объект.Ссылка.Пустая() Тогда
		Объект.ТекущийСтатус = Перечисления.Renault_РекламацииСтатусы.Draft;
		Объект.Автор = ПараметрыСеанса.Пользователь.Сотрудник;
		
		Объект.Решение = Неопределено;
		Объект.КлассификацияОтказов = Неопределено;
		Объект.СуммаВозмещения = 0;
		Объект.КоличествоНормоЧасов = 0;
		Объект.ДатаПринятияРешения = Дата("00010101");
		Объект.ОписаниеРешения = "";
	КонецЕсли;
	
	ОбновитьКартинкиИФайлы();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Если Объект.Ссылка.Пустая() Тогда
		Если ЗначениеЗаполнено(Объект.ДокументОснование) И ТипЗнч(Объект.ДокументОснование)=Тип("ДокументСсылка.ПоступлениеТоваров") 
			И Не ЗначениеЗаполнено(Объект.НоменклатураПлан) // если заполнено, значит мы открываем форму уже второй раз (после выбора номенклатуры для рекламации)
			Тогда
			
			ЗаполнитьПоПоступлению(Отказ);
			Если Отказ Тогда Возврат; КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	УстановитьВидимость();
	УстановитьДоступность();
	
	УстановитьРеферансИЕдиницу(Ложь,"");
	УстановитьРеферансИЕдиницу(Ложь,"План");
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	Если Не ПроверитьЗаполнение() Тогда Отказ = Истина; Возврат; КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	УстановитьДоступность();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	Если ИмяСобытия = "ОбновитьКартинкиИФайлы" Тогда ОбновитьКартинкиИФайлы(); КонецЕсли;
КонецПроцедуры

/////////////////////////////////////////////////////////////////////////
// НА КЛИЕНТЕ

&НаКлиенте
Процедура ЗаполнитьПоПоступлению(Отказ)
	Отказ = Истина;
	
	ПФ = Новый Структура();
	ПФ.Вставить("Поступление",Объект.ДокументОснование);
	ОткрытьФорму("Документ.Renault_Рекламация.Форма.ВыборНоменклатурыИзПоступления",ПФ,Новый УникальныйИдентификатор);
КонецПроцедуры

// Трояновский К.Е. 20.02.2019 11:12:30 {
//&НаКлиенте
//Процедура УстановитьСтатус(Команда)
//	ПоказатьВопрос(Новый ОписаниеОповещения("УстановитьСтатусПродолжение", ЭтаФорма), "После смены статус документ будет записан. Продолжить?", РежимДиалогаВопрос.ДаНет);
//КонецПроцедуры

//&НаКлиенте
//Процедура УстановитьСтатусПродолжение(РезультатВопроса, ДополнительныеПараметры) Экспорт
//	Если РезультатВопроса = КодВозвратаДиалога.Нет Тогда Возврат КонецЕсли;
//	
//	СписокСтатусов = ПолучитьСписокЗначенийСтатусов(Объект.ТекущийСтатус);
//	ОткрытьФорму("ОбщаяФорма.Renault_ВыбораИзСписка",Новый Структура("МассивЗначений",СписокСтатусов),ЭтаФорма,,,,Новый ОписаниеОповещения("УстановитьСтатусЗавершение", ЭтаФорма),РежимОткрытияОкнаФормы.БлокироватьОкноВладельца)
//КонецПроцедуры

//&НаКлиенте
//Процедура УстановитьСтатусЗавершение(ВыбранныйСтатус, ДополнительныеПараметры) Экспорт
//	Если ВыбранныйСтатус <> Неопределено Тогда
//		ПредыдущийСтатус = Объект.ТекущийСтатус;
//		Объект.ТекущийСтатус = ВыбранныйСтатус;
//		
//		Записан = Ложь;
//		Попытка Записан = Записать(); Исключение Сообщить(КраткоеПредставлениеОшибки(ИнформацияОбОшибке())); КонецПопытки;
//		Если Не Записан Тогда 
//			Объект.ТекущийСтатус = ПредыдущийСтатус; 
//			Сообщить("Не удалось изменить статус");
//		КонецЕсли;
//		
//		// В тонком клиенте и толстом клиенте обновление 
//		// окна происходит автоматически
//		// а в вебе не происходит. вызываем принудительно
//		#Если ВебКлиент тогда
//			Прочитать();
//		#КонецЕсли
//	КонецЕсли;
//	
//	НастроитьКнопкуСтатуса();
//КонецПроцедуры
// Трояновский К.Е. 20.02.2019 11:12:30 }

&НаКлиенте
Процедура ОбработкаРеквизитаКлиент(Элемент)
	ОбработкаРеквизитаСервер(Элемент.Имя);
КонецПроцедуры

&НаКлиенте
Процедура ДилерскийЦентрПриИзменении(Элемент)
	ОбработкаРеквизитаКлиент(Элемент);
КонецПроцедуры

&НаКлиенте
Процедура ВалютаДокументаПриИзменении(Элемент)
	Если Объект.ВалютаДокумента=ВалютаДокументаСтарая Тогда
		ОбработкаРеквизитаСервер(Элемент.Имя);
	Иначе
		ПоказатьВопрос(Новый ОписаниеОповещения("ВалютаДокументаПриИзмененииЗавершение", ЭтаФорма,Новый Структура("Элемент",Элемент)),"Пересчитать суммовые показатели?",РежимДиалогаВопрос.ДаНет);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ВалютаДокументаПриИзмененииЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	ДопПараметры = Новый Структура;
	
	Если РезультатВопроса=КодВозвратаДиалога.Да Тогда 
		ДопПараметры.Вставить("ПересчитатьСуммыВВалюту",Истина);
	КонецЕсли;
	
	ОбработкаРеквизитаСервер(ДополнительныеПараметры.Элемент.Имя,ДопПараметры);
	
КонецПроцедуры

&НаКлиенте
Процедура ТипЦенПриИзменении(Элемент)
	Если Объект.Цена=0 И Объект.ЦенаПлан=0 Тогда
		ПересчитатьЦеныСервер();
		ОбработкаРеквизитаСервер(Элемент.Имя);
	Иначе
		ПоказатьВопрос(Новый ОписаниеОповещения("ТипЦенПриИзмененииЗавершение", ЭтаФорма,Новый Структура("Элемент",Элемент)),"Пересчитать цены по выбранному типу цен?",РежимДиалогаВопрос.ДаНет);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ТипЦенПриИзмененииЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт
	Если РезультатВопроса=КодВозвратаДиалога.Да Тогда 
		ПересчитатьЦеныСервер();
	КонецЕсли;
	
	ОбработкаРеквизитаСервер(ДополнительныеПараметры.Элемент.Имя,Новый Структура("ВыполнитьПересчет",Ложь));
КонецПроцедуры

&НаКлиенте
Процедура ПересчитатьЦены()
	ПересчитатьЦеныСервер();
КонецПроцедуры

// Трояновский К.Е. 20.02.2019 11:16:59 {
//&НаКлиенте
//Процедура НастроитьКнопкуСтатуса()
//	Элементы.ФормаКнопкаУстановитьСтатус.Заголовок = Строка(Объект.ТекущийСтатус) + " (Изменить статус)";
//КонецПроцедуры
// Трояновский К.Е. 20.02.2019 11:16:59 }

&НаКлиенте
Процедура ВидРекламацииПриИзменении(Элемент)
	УстановитьВидимость();	
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузкаФотографий(Команда)
	
	Если Объект.Ссылка.Пустая() Тогда
		ПоказатьВопрос(Новый ОписаниеОповещения("ЗагрузкаФотографийПродолжение", ЭтаФорма),"Необходимо записать документ. Продолжить?", РежимДиалогаВопрос.ДаНет);
	Иначе
		ЗагрузкаФотографийЗавершение();	
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузкаФотографийПродолжение(РезультатВопроса, ДополнительныеПараметры) Экспорт
	Если РезультатВопроса = КодВозвратаДиалога.Нет Тогда 
		Возврат;
	Иначе
		Записан = Ложь;
		Попытка Записан = Записать(); Исключение Сообщить(КраткоеПредставлениеОшибки(ИнформацияОбОшибке())); КонецПопытки;
		Если Не Записан Тогда Возврат; КонецЕсли;
	КонецЕсли;	
	
	ЗагрузкаФотографийЗавершение();
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузкаФотографийЗавершение()
	ПараметрыФормы = Новый Структура("КартинкиИФайлы", ЭтаФорма.КартинкиИФайлы);
	ПараметрыФормы.Вставить("ВладелецСсылка", Объект.Ссылка);
	ОткрытьФорму("Документ.Renault_Рекламация.Форма.ФормаЗагрузки",ПараметрыФормы, Элементы.КартинкиИФайлы,,,,,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры

&НаКлиенте
Процедура ФотографииОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	//Очищаем таблицу фотографий
	Объект.Фотографии.Очистить();
	
	Для каждого СтрокаВыбора из ВыбранноеЗначение Цикл
		
		НС = Объект.Фотографии.Добавить();
		ЗаполнитьЗначенияСвойств(НС, СтрокаВыбора);
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФайл(Команда)
	
	Если Элементы.КартинкиИФайлы.ТекущиеДанные = Неопределено Тогда Возврат КонецЕсли;
	
	Идентификатор = Элементы.КартинкиИФайлы.ТекущиеДанные.Идентификатор;
	
	Renault_РекламацииКлиент.ОткрытьФайлПоИдентификатору(Идентификатор);
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьВидимость()

	Элементы.АктОПоврежденииСТК.Видимость = Объект.ВидРекламации = ПредопределенноеЗначение("Перечисление.Renault_РекламацииВиды.ПовреждениеПриТранспортировке");

	Если Объект.ТекущийСтатус = Перечисления.Renault_РекламацииСтатусы.Draft ИЛИ
		  Объект.ТекущийСтатус = Перечисления.Renault_РекламацииСтатусы.Returned Тогда
		Элементы.Выгрузить.Видимость = Истина;
	Иначе
		Элементы.Выгрузить.Видимость = Ложь;
	КонецЕсли;

	Если Объект.ТекущийСтатус = Перечисления.Renault_РекламацииСтатусы.Draft ИЛИ
		  Объект.ТекущийСтатус = Перечисления.Renault_РекламацииСтатусы.Closed Тогда
		Элементы.СообщенияДобавитьКомментарий.Видимость = Ложь;
	Иначе
		Элементы.СообщенияДобавитьКомментарий.Видимость = Истина;
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура УстановитьДоступность()

	Если Объект.ТекущийСтатус <> ПредопределенноеЗначение("Перечисление.Renault_РекламацииСтатусы.Draft") И
            Объект.ТекущийСтатус <> ПредопределенноеЗначение("Перечисление.Renault_РекламацииСтатусы.Returned") Тогда

		ЭтаФорма.ТолькоПросмотр = Истина;

	КонецЕсли;

КонецПроцедуры

// Трояновский К.Е. 20.02.2019 11:10:36 {
//&НаКлиенте
//Функция ВозможноИзменитьСтатус()

//	Возврат Объект.ТекущийСтатус = ПредопределенноеЗначение("Перечисление.Renault_РекламацииСтатусы.Draft")
//			ИЛИ Объект.ТекущийСтатус = ПредопределенноеЗначение("Перечисление.Renault_РекламацииСтатусы.ReadyToSent");

//КонецФункции // ВозможноИзменитьСтатус()

//&НаКлиенте
//Функция ВозможноВыгрузить()
//	Возврат Объект.ТекущийСтатус = ПредопределенноеЗначение("Перечисление.Renault_РекламацииСтатусы.ReadyToSent")
//КонецФункции
// Трояновский К.Е. 20.02.2019 11:10:36 }

&НаКлиенте
Процедура УдалитьФото(Команда)
	Если Элементы.КартинкиИФайлы.ТекущиеДанные <> Неопределено Тогда
		ИдентификаторФайла = Элементы.КартинкиИФайлы.ТекущиеДанные.Идентификатор;
		УдалитьСтрокуИЗРегистра(ИдентификаторФайла);
	КонецЕсли;
КонецПроцедуры


/////////////////////////////////////////////////////////////////////////
// НА СЕРВЕРЕ

&НаСервере
Функция неиспользуется_ОтражатьНоменклатуруПоФакту()
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	ВЫБОР
	                      |		КОГДА &ВидРекламации = ЗНАЧЕНИЕ(Перечисление.Renault_РекламацииВиды.Недостача)
	                      |				ИЛИ &ВидРекламации = ЗНАЧЕНИЕ(Перечисление.Renault_РекламацииВиды.Излишки)
	                      |				ИЛИ &ВидРекламации = ЗНАЧЕНИЕ(Перечисление.Renault_РекламацииВиды.Пересорт)
	                      |				ИЛИ &ВидРекламации = ЗНАЧЕНИЕ(Перечисление.Renault_РекламацииВиды.НевернаяОтгрузка)
	                      |				ИЛИ &ВидРекламации = ЗНАЧЕНИЕ(Перечисление.Renault_РекламацииВиды.ПовреждениеПриТранспортировке)
	                      |				ИЛИ &ВидРекламации = ЗНАЧЕНИЕ(Перечисление.Renault_РекламацииВиды.БракПриПроизводстве)
	                      |			ТОГДА ИСТИНА
	                      |		ИНАЧЕ ЛОЖЬ
	                      |	КОНЕЦ КАК ОтображатьГруппуНоменклатураПлан");
	Запрос.УстановитьПараметр("ВидРекламации", Объект.ВидРекламации);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Выборка.Следующий();
	
	Возврат Выборка.ОтображатьГруппуНоменклатураПлан;
КонецФункции

&НаСервере
Процедура УстановитьРеферансИЕдиницу(ОбновитьЕдиницу,План)
	ДокументОбъект = РеквизитФормыВЗначение("Объект");
	ДокументОбъект.УстановитьРеферансИЕдиницу(ОбновитьЕдиницу,План,ЭтаФорма);
	ЗначениеВРеквизитФормы(ДокументОбъект,"Объект");
КонецПроцедуры

&НаСервере
Процедура ОбновитьКартинкиИФайлы()
	
	Запрос = Новый Запрос("ВЫБРАТЬ
	|	КартинкиИФайлы.ИмяФайла,
	|	КартинкиИФайлы.ДатаСохранения,
	|	КартинкиИФайлы.РазмерФайла / 1024 / 1024 КАК РазмерФайла,
	|	КартинкиИФайлы.Комментарий,
	|	КартинкиИФайлы.Идентификатор
	|ИЗ
	|	РегистрСведений.КартинкиИФайлы КАК КартинкиИФайлы
	|ГДЕ
	|	КартинкиИФайлы.Объект = &Объект");
	
	Запрос.УстановитьПараметр("Объект", Объект.Ссылка);
	КартинкиИФайлы.Загрузить(Запрос.Выполнить().Выгрузить());
	
	Элементы.КартинкиИФайлы.Обновить();

КонецПроцедуры

&НаСервере
Процедура УдалитьСтрокуИЗРегистра(ИдентификаторФайла)
	Renault_ОбщийМодульСервер.УдалитьФайлИзРегистра(Объект.Ссылка, ИдентификаторФайла);
	
	ОбновитьКартинкиИФайлы();
КонецПроцедуры

&НаСервере
Процедура ОбработкаРеквизитаСервер(Имя,ДопПараметры=Неопределено)
	ДокументОбъект = РеквизитФормыВЗначение("Объект");
	ДокументОбъект.ОбработкаРеквизита(Имя,ЭтаФорма,ДопПараметры);
	ЗначениеВРеквизитФормы(ДокументОбъект,"Объект");
КонецПроцедуры

&НаСервере
Процедура ПересчитатьЦеныСервер()
	ДокументОбъект = РеквизитФормыВЗначение("Объект");
	ДокументОбъект.ПересчитатьЦены();
	ЗначениеВРеквизитФормы(ДокументОбъект,"Объект");
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьСписокЗначенийСтатусов(ТекущийСтатус)
	
	СписокСтатусов = Новый Массив;
	Если ТекущийСтатус <> Перечисления.Renault_РекламацииСтатусы.Draft Тогда
		СписокСтатусов.Добавить(Перечисления.Renault_РекламацииСтатусы.Draft);	
	КонецЕсли;
	Если ТекущийСтатус <> Перечисления.Renault_РекламацииСтатусы.ReadyToSent Тогда
		СписокСтатусов.Добавить(Перечисления.Renault_РекламацииСтатусы.ReadyToSent);
	КонецЕсли;
	
	Возврат СписокСтатусов;
	
КонецФункции

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ ВЫГРУЗКИ РЕКЛАМАЦИИ В ЦЕНТР

&НаКлиенте
Процедура Выгрузить(Команда)
	
	Если Модифицированность Тогда
		ПоказатьВопрос(Новый ОписаниеОповещения("ВыгрузитьЗавершение",ЭтаФорма),"Документ будет записан. Продолжить?",РежимДиалогаВопрос.ДаНет);
	Иначе
		ВыгрузитьПродолжение();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВыгрузитьЗавершение(РезультатВопроса, ДопПараметры) Экспорт
	Если РезультатВопроса = КодВозвратаДиалога.Нет Тогда
		Возврат;
	КонецЕсли;
	
	ВыгрузитьПродолжение();
КонецПроцедуры

&НаКлиенте
Процедура ВыгрузитьПродолжение()
	
	

	Записан = Ложь;
	Попытка Записан = Записать(); Исключение Сообщить(КраткоеПредставлениеОшибки(ИнформацияОбОшибке())); КонецПопытки;
	Если Не Записан Тогда Возврат; КонецЕсли;
	
	ВыгрузитьНаСервере();
	
	ОбновитьИнтерфейс();
	УстановитьВидимость();
	УстановитьДоступность();

	//
	//ПараметрыВызоваСервера = Новый Массив;
	//ПараметрыВызоваСервера.Добавить(Объект.Ссылка);
	//РезультатПолученияДопИнформации = ВыполнитьЗапрос(ПараметрыВызоваСервера);
	//Если РезультатПолученияДопИнформации.ФоновоеЗадание Тогда
	//	Renault_ДлительныеОперацииКлиент.ИнициализироватьПараметрыОбработчикаОжидания(ПараметрыОбработчика);
	//	ПодключитьОбработчикОжидания("ФоновоеЗаданиеВыгрузкаРекламации", 1, Истина);
	//	ФормаДлительнойОперации = Renault_ДлительныеОперацииКлиент.ОткрытьФормуДлительнойОперации(ЭтаФорма, РезультатПолученияДопИнформации.ФоновоеЗаданиеИдентификатор,"Выполняется выгрузка рекламации в центр...");
	//Иначе
	//	ОбработатьРезультатВыполненияЗадания();
	//КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ФоновоеЗаданиеВыгрузкаРекламации()
	Результат = Новый Структура;
	Результат.Вставить("ФоновоеЗаданиеВыполнено", Ложь);
	Результат.ФоновоеЗаданиеВыполнено = Renault_ДлительныеОперации.ЗаданиеВыполнено(РезультатПолученияДопИнформации.ФоновоеЗаданиеИдентификатор);

	Если Результат.ФоновоеЗаданиеВыполнено Тогда
		Если ФормаДлительнойОперации.Открыта() 
			И ФормаДлительнойОперации.ИдентификаторЗадания = РезультатПолученияДопИнформации.ФоновоеЗаданиеИдентификатор Тогда
				Renault_ДлительныеОперацииКлиент.ЗакрытьФормуДлительнойОперации(ФормаДлительнойОперации);
		КонецЕсли;
		ОбработатьРезультатВыполненияЗадания();
		Иначе
		Renault_ДлительныеОперацииКлиент.ОбновитьПараметрыОбработчикаОжидания(ПараметрыОбработчика);
		ПодключитьОбработчикОжидания("ФоновоеЗаданиеВыгрузкаРекламации", ПараметрыОбработчика.ТекущийИнтервал, Истина);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьРезультатВыполненияЗадания()
	
	Ответ = ПолучитьИзВременногоХранилища(РезультатПолученияДопИнформации.АдресХранилища);
	Если Ответ.ЗавершенУспешно Тогда
		Прочитать();
		
		УстановитьВидимость();
		УстановитьДоступность();
		
		Объект.ТекущийСтатус = ПредопределенноеЗначение("Перечисление.Renault_РекламацииСтатусы.Sent");		
		Объект.ЦентральныйНомер = Ответ.Номер;
		Записать();
		// Трояновский К.Е. 20.02.2019 11:14:30 }
		
		РезультатВыгрузки = "Документ выгружен в центр";
		ОповеститьОбИзменении(Объект.Ссылка);
	Иначе
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = Ответ.ОписаниеОшибок;
		Сообщение.УстановитьДанные(ЭтаФорма);
		Сообщение.Сообщить();
		
		РезультатВыгрузки = "Не удалось выгрузить документ";
	КонецЕсли;
	
	// Трояновский К.Е. 20.02.2019 11:16:23 {
	ОбновитьИнтерфейс();
	// Трояновский К.Е. 20.02.2019 11:16:23 }
	
	ПоказатьПредупреждение(,РезультатВыгрузки);
	
КонецПроцедуры

&НаСервере
Функция ВыполнитьЗапрос (ПараметрыВызоваСервера)
	
	// Трояновский К.Е. 20.02.2019 12:05:39 {
	РезультатФоновогоЗадания = Renault_ДлительныеОперации.ЗапуститьВыполнениеВФоне(УникальныйИдентификатор, 
		"Renault_РекламацииСервер.Выгрузить20", ПараметрыВызоваСервера);
	// Трояновский К.Е. 20.02.2019 12:05:39 }
	Результат = Новый Структура;
	Если РезультатФоновогоЗадания.ЗаданиеВыполнено Тогда
		Результат.Вставить("ФоновоеЗадание", Ложь);
		Результат.Вставить("АдресХранилища", РезультатФоновогоЗадания.АдресХранилища);
	Иначе 
		Результат.Вставить("ФоновоеЗадание", Истина);
		Результат.Вставить("ФоновоеЗаданиеИдентификатор", РезультатФоновогоЗадания.ИдентификаторЗадания);
		Результат.Вставить("АдресХранилища", РезультатФоновогоЗадания.АдресХранилища);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Процедура ВыгрузитьНаСервере()
	
	Массив = Новый Массив;
	Массив.Добавить(Объект.Ссылка);
	
	РезультатВыполнения = Renault_РекламацииСервер.ВыгрузитьСинхронно20(Массив);
	
	Если РезультатВыполнения.ЗавершенУспешно Тогда
		Объект.ТекущийСтатус = ПредопределенноеЗначение("Перечисление.Renault_РекламацииСтатусы.Sent");		
		Объект.ЦентральныйНомер = РезультатВыполнения.Номер;
		Записать();
		Сообщить("Документ успешно выгружен");
	Иначе
		Сообщить("Не удалось выгрузить документ");
		Сообщить(РезультатВыполнения.ОписаниеОшибок);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьКомментарий(Команда)
	
	Оповещение = Новый ОписаниеОповещения("ПослеВводаКомментария", ЭтотОбъект);
 
    ПоказатьВводСтроки(Оповещение,, "Введите комментарий", 0, Истина);

КонецПроцедуры

&НаКлиенте
Процедура ПослеВводаКомментария(Результат, Параметры) Экспорт
 
    Если Не Результат = Неопределено Тогда
        ПослеВводаКомментарияНаСервере(Результат);
    КонецЕсли;
 
КонецПроцедуры

&НаСервере
Процедура ПослеВводаКомментарияНаСервере(Комментарий)

	Результат = Renault_РекламацииСервер.ВыгрузитьКомментарий(Объект.ЦентральныйНомер, Комментарий);
	Если Результат.ЗавершенУспешно Тогда
		Сообщить("Комменатрий успешно добавлен");
	Иначе
		Сообщить("Получена ошибка: " + Результат.ОписаниеОшибок);
	КонецЕсли;

КонецПроцедуры

