&НаКлиенте
Перем ПараметрыОбработчика, РезультатПолученияДопИнформации, ФормаДлительнойОперации;

&НаКлиенте
Процедура ПолучитьДанные(Команда)
	
	ПараметрыВызоваСервера = Новый Структура;
	ПараметрыВызоваСервера.Вставить("Serials",Объект.Serials);	
	
	РезультатПолученияДопИнформации = ВыполнитьЗапрос (ПараметрыВызоваСервера);
	Если РезультатПолученияДопИнформации.ФоновоеЗадание Тогда
		Renault_ДлительныеОперацииКлиент.ИнициализироватьПараметрыОбработчикаОжидания(ПараметрыОбработчика);
		ПодключитьОбработчикОжидания("ФоновоеЗаданиеЗагрузкаФайлаНаКлиенте", 1, Истина);
		ФормаДлительнойОперации = Renault_ДлительныеОперацииКлиент.ОткрытьФормуДлительнойОперации(ЭтаФорма, РезультатПолученияДопИнформации.ФоновоеЗаданиеИдентификатор);
	Иначе
		ОбработатьРезультатВыполненияЗадания();	
	КонецЕсли;
	

КонецПроцедуры

&НаСервере
Функция ВыполнитьЗапрос (ПараметрыВызоваСервера)
	
	РезультатФоновогоЗадания = Renault_ДлительныеОперации.ЗапуститьВыполнениеВФоне(УникальныйИдентификатор, 
	"Обработки.Renault_ПроверкаВебСервераКомАкцииСервиса.ПолучитьДанныеМаркетинговыхАкцийСервиса", ПараметрыВызоваСервера);
	Результат = Новый Структура;
	Если РезультатФоновогоЗадания.ЗаданиеВыполнено Тогда
		Результат.Вставить("ФоновоеЗадание", Ложь);
		Результат.Вставить("АдресХранилища", РезультатФоновогоЗадания.АдресХранилища);
	Иначе 
		Результат.Вставить("ФоновоеЗадание", Истина);
		Результат.Вставить("ФоновоеЗаданиеИдентификатор", РезультатФоновогоЗадания.ИдентификаторЗадания);
		Результат.Вставить("АдресХранилища", РезультатФоновогоЗадания.АдресХранилища);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Процедура ОбработатьРезультатВыполненияЗадания()
	
	ПолучитьРезультат(РезультатПолученияДопИнформации.АдресХранилища)	
	
КонецПроцедуры

&НаКлиенте
Процедура ФоновоеЗаданиеЗагрузкаФайлаНаКлиенте()
	Результат = Новый Структура;
	Результат.Вставить("ФоновоеЗаданиеВыполнено", Ложь);
	Результат.ФоновоеЗаданиеВыполнено = Renault_ДлительныеОперации.ЗаданиеВыполнено(РезультатПолученияДопИнформации.ФоновоеЗаданиеИдентификатор);

	Если Результат.ФоновоеЗаданиеВыполнено Тогда
		Если ФормаДлительнойОперации.Открыта() 
			И ФормаДлительнойОперации.ИдентификаторЗадания = РезультатПолученияДопИнформации.ФоновоеЗаданиеИдентификатор Тогда
				Renault_ДлительныеОперацииКлиент.ЗакрытьФормуДлительнойОперации(ФормаДлительнойОперации);
		КонецЕсли;
		ОбработатьРезультатВыполненияЗадания();
		Иначе
		Renault_ДлительныеОперацииКлиент.ОбновитьПараметрыОбработчикаОжидания(ПараметрыОбработчика);
		ПодключитьОбработчикОжидания("ФоновоеЗаданиеЗагрузкаФайлаНаКлиенте", ПараметрыОбработчика.ТекущийИнтервал, Истина);
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ПолучитьРезультат(Адрес)

	сОтвет = ПолучитьИзВременногоХранилища(Адрес);
	
	//Если сОтвет.Свойство("Ошибка") и сОтвет.Ошибка Тогда

	//Иначе
	
	//Если Элементы.Результат.к Тогда
	
	//	Для Каждого Колонка Из сОтвет.Колонки Цикл
	//        НовыйЭлемент = Элементы.Добавить(Колонка.Имя, Тип("ПолеФормы"), Элементы.Результат);
	//        НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
	//        НовыйЭлемент.ПутьКДанным = "Результат" + Колонка.Имя;
	//    КонецЦикла;
	//
	//КонецЕсли;
	
	
	ЗначениеВРеквизитФормы(сОтвет,"Объект.Результат");

КонецПроцедуры // ()

