Процедура ПриУстановкеНовогоНомера(СтандартнаяОбработка, Префикс)	
	Префикс = DMS_ОбщегоНазначенияСервер.ПолучитьПрефикс();
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)  	
	Если ОбменДанными.Загрузка Тогда 		
		Возврат;  		
	КонецЕсли;
КонецПроцедуры 

Процедура ПриЗаписи(Отказ)    	
	Если ОбменДанными.Загрузка Тогда 		
		Возврат;  		
	КонецЕсли;
	
	// Создаем запись в регистр "Резервы автомобилей"
	Если Статус = Перечисления.CRM_СтатусыЗаявокАвтосклад.Обработана
		И (ЗначениеЗаполнено(VIN) ИЛИ ЗначениеЗаполнено(НомерОрдераSedre))
		И НЕ ВАрхиве Тогда
		
		Если ЗначениеЗаполнено(VIN) Тогда
			
			Запрос = Новый Запрос;
			Запрос.Текст = 
			"ВЫБРАТЬ
			|	CRM_РезервыАвтомобилей.Период,
			|	CRM_РезервыАвтомобилей.VIN,
			|	CRM_РезервыАвтомобилей.Менеджер,
			|	CRM_РезервыАвтомобилей.ЗаявкаНаРезерв
			|ИЗ
			|	РегистрСведений.CRM_РезервыАвтомобилей КАК CRM_РезервыАвтомобилей
			|ГДЕ
			|	CRM_РезервыАвтомобилей.ЗаявкаНаРезерв = &ЗаявкаНаРезерв";
			Запрос.УстановитьПараметр("ЗаявкаНаРезерв", Ссылка);
			Результат = Запрос.Выполнить().Выгрузить();
			Если Результат.Количество() Тогда
				Запись = РегистрыСведений.CRM_РезервыАвтомобилей.СоздатьМенеджерЗаписи();
				ЗаполнитьЗначенияСвойств(Запись, Результат[0]);
				Запись.Прочитать();
			Иначе
				Запись = РегистрыСведений.CRM_РезервыАвтомобилей.СоздатьМенеджерЗаписи();
				Запись.Идентификатор = Новый УникальныйИдентификатор();
			КонецЕсли;
			Запись.VIN = VIN;
			Запись.Менеджер = Менеджер;
			Если ЗначениеЗаполнено(НомерОрдераSedre) Тогда
				Запись.SedreNum = НомерОрдераSedre;
			КонецЕсли;
			Запись.СтатусРезерва = Перечисления.CRM_СтатусыРезервовАвтомобилей.ЗаявкаНаРезерв;
			Запись.Период = ТекущаяДата();
			Запись.Автор = ПараметрыСеанса.Пользователь;
			Запись.Комментарий = КомментарийЛогиста;
			Запись.РабочийЛист = РабочийЛист;
			Запись.ЗаявкаНаРезерв = Ссылка;
			Запись.Записать();
			
		ИначеЕсли ЗначениеЗаполнено(НомерОрдераSedre) Тогда
			
			Запрос = Новый Запрос;
			Запрос.Текст = 
			"ВЫБРАТЬ
			|	CRM_РезервыАвтомобилей.Период,
			|	CRM_РезервыАвтомобилей.VIN,
			|	CRM_РезервыАвтомобилей.Менеджер,
			|	CRM_РезервыАвтомобилей.ЗаявкаНаРезерв
			|ИЗ
			|	РегистрСведений.CRM_РезервыАвтомобилей КАК CRM_РезервыАвтомобилей
			|ГДЕ
			|	CRM_РезервыАвтомобилей.ЗаявкаНаРезерв = &ЗаявкаНаРезерв";
			Запрос.УстановитьПараметр("ЗаявкаНаРезерв", Ссылка);
			Результат = Запрос.Выполнить().Выгрузить();
			Если Результат.Количество() Тогда
				Запись = РегистрыСведений.CRM_РезервыАвтомобилей.СоздатьМенеджерЗаписи();
				ЗаполнитьЗначенияСвойств(Запись, Результат[0]);
				Запись.Прочитать();
			Иначе
				Запись = РегистрыСведений.CRM_РезервыАвтомобилей.СоздатьМенеджерЗаписи();
				Запись.Идентификатор = Новый УникальныйИдентификатор();
			КонецЕсли;
			Запись.VIN = "";
			Запись.Менеджер = Менеджер;
			Запись.SedreNum = НомерОрдераSedre;
			Запись.СтатусРезерва = Перечисления.CRM_СтатусыРезервовАвтомобилей.ЗаявкаНаРезерв;
			Запись.Период = ТекущаяДата();
			Запись.Автор = ПараметрыСеанса.Пользователь;
			Запись.Комментарий = КомментарийЛогиста;
			Запись.РабочийЛист = РабочийЛист;
			Запись.ЗаявкаНаРезерв = Ссылка;
			Запись.Записать();
			
		КонецЕсли;
		
	Иначе
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	CRM_РезервыАвтомобилей.Период,
		|	CRM_РезервыАвтомобилей.VIN,
		|	CRM_РезервыАвтомобилей.Менеджер,
		|	CRM_РезервыАвтомобилей.ЗаявкаНаРезерв
		|ИЗ
		|	РегистрСведений.CRM_РезервыАвтомобилей КАК CRM_РезервыАвтомобилей
		|ГДЕ
		|	CRM_РезервыАвтомобилей.ЗаявкаНаРезерв = &ЗаявкаНаРезерв";
		Запрос.УстановитьПараметр("ЗаявкаНаРезерв", Ссылка);
		Результат = Запрос.Выполнить().Выгрузить();
		Если Результат.Количество() Тогда
			Запись = РегистрыСведений.CRM_РезервыАвтомобилей.СоздатьМенеджерЗаписи();
			ЗаполнитьЗначенияСвойств(Запись, Результат[0]);
			Запись.Прочитать();
			Запись.Удалить();
		КонецЕсли;
		
	КонецЕсли;
	
	
КонецПроцедуры
