&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("Автообновление") Тогда
		СтандартнаяОбработка = Ложь;
		Отказ = Истина;
		//Если НеобходимоОбновление() Тогда 
		Если Не ВыполнитьОбновление(Метаданные.АдресКаталогаОбновлений) Тогда
			СтандартнаяОбработка = Истина;
		КонецЕсли; //при ошибке обновления - открываем форму
		//КонецЕсли;
	КонецЕсли;
	Элементы.грОписание.Видимость = Ложь;
	
КонецПроцедуры

Функция ВыполнитьОбновление(Версия)
	
	Возврат РеквизитФормыВЗначение("Объект").ВыполнитьОбновление(Версия);
	
КонецФункции

&НаКлиенте
Процедура кнНоваяВерсия(Команда)
	
	ВыполнитьОбновление(СтрЗаменить(Прав(Команда.Имя,СтрДлина(Команда.Имя)-1),"_","."));
	
КонецПроцедуры

&НаКлиенте 
Процедура кнПредыдущиеВерсии(Команда)
	
	ОткрытьФорму("Обработка.Renault_ПереходНаНовуюВерсию.Форма.Форма");
	Закрыть();
	
КонецПроцедуры

//Функция НеобходимоОбновление()
//	ВерсияМД=ВерсияВМассив(Метаданные.АдресКаталогаОбновлений);
//	ВерсияИБ=ВерсияВМассив(Константы.Renault_Версия.Получить());
//	
//	Попытка
//		НужноОбновить=Ложь;
//		Для Н=0 По ВерсияМД.Количество()-1 Цикл
//			ТекНомерМД=Число(ВерсияМД[Н]);
//			ТекНомерИБ=?((ВерсияИБ.Количество()-1)<Н,0,Число(ВерсияИБ[Н]));
//			
//			Если ТекНомерМД>ТекНомерИБ Тогда
//				НужноОбновить=Истина;
//				Прервать
//			КонецЕсли;	
//		КонецЦикла;
//		
//	Исключение
//		НужноОбновить=Истина
//	КонецПопытки;	
//	
//	Возврат НужноОбновить
//КонецФункции	
//Функция ВерсияВМассив(СтрВерсия)
//	Массив=Новый Массив;
//	
//	Стр=СтрЗаменить(СтрВерсия,".",Символы.ПС);
//	Стр=СтрЗаменить(Стр,"_",Символы.ПС);
//	Для Н=1 По СтрЧислоСтрок(Стр) Цикл
//		Массив.Добавить(СтрПолучитьСтроку(Стр,Н))
//	КонецЦикла;	
//	
//	Возврат Массив
//КонецФункции	
