#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

// Функция - Получить статус
//
// Параметры:
//  Заказ	 - ДокументСсылка	 - Заказ покупателя
// 
// Возвращаемое значение:
//   - Статус заказа
//
Функция ПолучитьСтатус(Заказ) Экспорт

	Статус = Справочники.Renault_Advanced_ДополнительныеРеквизитыЗаказПокупателя.ПустаяСсылка();
	
	Если Заказ.Пустая() Тогда Возврат Статус; КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Заказ", Заказ);
	Запрос.Текст = "ВЫБРАТЬ
	               |	Renault_Advanced_ДополнительныеРеквизитыЗаказПокупателя.Статус
	               |ИЗ
	               |	РегистрСведений.Renault_Advanced_ДополнительныеРеквизитыЗаказПокупателя КАК Renault_Advanced_ДополнительныеРеквизитыЗаказПокупателя
	               |ГДЕ
	               |	Renault_Advanced_ДополнительныеРеквизитыЗаказПокупателя.Заказ = &Заказ";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Возврат ?(Выборка.Следующий(), Выборка.Статус, Статус);
			
КонецФункции 

Функция ЗаполнитьДопРеквизиты(ЗаказОбъект) Экспорт

	Если ЗаказОбъект.Ссылка.Пустая() Тогда Возврат Истина; КонецЕсли;
	
	Запись = РегистрыСведений.Renault_Advanced_ДополнительныеРеквизитыЗаказПокупателя.СоздатьМенеджерЗаписи();
	Запись.Заказ = ЗаказОбъект.Ссылка;
	Запись.Прочитать();
	Если Запись.Выбран() Тогда ЗаполнитьЗначенияСвойств(ЗаказОбъект, Запись); КонецЕсли;

КонецФункции // ЗаполнитьДопРеквизиты()

Функция ЗаписатьДопРеквизиты(Заказ, СтруктураРеквизитов) Экспорт

	Если Заказ.Пустая() Тогда Возврат Истина; КонецЕсли;
	
	Запись = РегистрыСведений.Renault_Advanced_ДополнительныеРеквизитыЗаказПокупателя.СоздатьМенеджерЗаписи();
	Запись.Заказ = Заказ;
	Запись.Прочитать();
	
	Запись.Заказ = Заказ;
	ЗаполнитьЗначенияСвойств(Запись, СтруктураРеквизитов);
	Запись.Записать();
	
	Возврат Истина;

КонецФункции // ()

#КонецЕсли