Функция НапечататьТОРГ16() Экспорт
	  //Решение = ЭтотОбъект.СхемаКомпоновкиДанных.Параметры.Решение;
	  //ЭлементПараметраДанных = КомпоновщикНастроек.Настройки.ПараметрыДанных.Элементы.Найти("Решение");
	  //

КонецФункции

Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)
	Если Не Renault_РаботаСПравамиПользователя.ЕстьПравоОткрытияПодсистемыСтрахования(ПараметрыСеанса.Пользователь) тогда
		Сообщить("Недостаточно прав доступа.");
		СтандартнаяОбработка = Ложь;
		Возврат;
	КонецЕсли;	
КонецПроцедуры
