
&НаСервере
Процедура ВыполнитьНаСервере()
	Обработка=РеквизитФормыВЗначение("Объект");
	Обработка.ОсвободитьЛицензии(ПользователиЛицензии.НайтиСтроки(Новый Структура("Отключить",Истина)));
	ПользователиЛицензии.Очистить();
	ПолучитьПользователей();

КонецПроцедуры

&НаСервере
Процедура ПолучитьПользователей()
	Обработка=РеквизитФормыВЗначение("Объект");
	МассивСоединений = Новый Массив;
	Спис = Обработка.ПолучитьПользователейЛицензии(МассивСоединений);
	ТзВрем = Новый ТаблицаЗначений;
	ТзВрем.Колонки.Добавить("Пользователь");
	ТзВрем.Колонки.Добавить("В1с");
	ТзВрем.Колонки.Добавить("ИД");
	ТзВрем.Колонки.Добавить("Дата");
	Для Каждого Эл ИЗ МассивСоединений Цикл
		Стр = ТзВрем.Добавить();
		Стр.Пользователь = КодироватьURL(Строка(Эл.Пользователь.ПолноеИмя));
		Стр.В1с=Строка(Эл.Пользователь.ПолноеИмя);
		Стр.ИД = Эл.НомерСеанса;
		Стр.Дата = Эл.НачалоСеанса
	КонецЦикла;
	Для Каждого Эл Из Спис Цикл
		Стр = ПользователиЛицензии.Добавить();
		Стр.Пользователь = РаскодироватьСтроку(Эл.user,СпособКодированияСтроки.КодировкаURL);
		Масс = ТзВрем.НайтиСтроки(Новый Структура("Пользователь,ИД,Дата",Эл.user,Эл.id,Эл.data));
		Если Масс.Количество() = 0 Тогда
			Стр.Отключить = Истина;
		Иначе
			Стр.ПользовательВ1С = Масс[0].В1с;
		КонецЕсли;
		Стр.ИдСеанса = Эл.id;
		Стр.НачалоСеанса = Эл.data;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура Выполнить1(Команда)
	ВыполнитьНаСервере();
КонецПроцедуры

&НаСервере
Функция КодироватьURL(Текст)
	Ш16="0123456789ABCDEF";
	С127="37,38,39,42,44,47,58,59,60,61,62,63,91,93,94,96,123,124,125,127";
	Рез="";
	Дл=СтрДлина(Текст);
	Для Поз=1 По Дл Цикл
		КодС=КодСимвола(Текст,Поз);
		Если КодС<45 ИЛИ КодС=47 Тогда
			Рез=Рез+"%"+Сред(Ш16,Цел(КодС/16)+1,1)+Сред(Ш16,КодС%16+1,1);
		ИначеЕсли КодС<128 Тогда
			Если Найти(С127,Строка(КодС))=0 Тогда
				Рез=Рез+Сред(Текст,Поз,1);
			Иначе
				Рез=Рез+"%"+Сред(Ш16,Цел(КодС/16)+1,1)+Сред(Ш16,КодС%16+1,1);
			КонецЕсли;
		Иначе
			Ост=КодС%16;
			КодС=Цел(КодС/16);
			Если КодС<128 Тогда
				КодК=(КодС%4+8)*16+Ост;
				КодС=Цел(КодС/4);
				Ост=КодС%16;
				КодС=Цел(КодС/16);
				КодН=(КодС+12)*16+Ост;
				Рез=Рез+"%"+Сред(Ш16,Цел(КодН/16)+1,1)+Сред(Ш16,КодН%16+1,1)+
				"%"+Сред(Ш16,Цел(КодК/16)+1,1)+Сред(Ш16,КодК%16+1,1);
			Иначе
				КодК=(КодС%4+8)*16+Ост;
				КодС=Цел(КодС/4);
				Ост=КодС%16;
				КодС=Цел(КодС/16);
				КодСр=(КодС%4+8)*16+Ост;
				КодС=Цел(КодС/4);
				Рез=Рез+"%E"+Сред(Ш16,КодС+1,1)+
				"%"+Сред(Ш16,Цел(КодСр/16)+1,1)+Сред(Ш16,КодСр%16+1,1)+
				"%"+Сред(Ш16,Цел(КодК/16)+1,1)+Сред(Ш16,КодК%16+1,1);
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	Возврат Рез;	
КонецФункции

&НаКлиенте
Процедура Обновить(Команда)
	ПользователиЛицензии.Очистить();
	ПолучитьПользователей();
КонецПроцедуры


&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Объект.Ключ = этаформа.ВладелецФормы.Объект.Ключ;
	ПолучитьПользователей();
КонецПроцедуры

