Перем Поступление Экспорт;

Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	СКД = ПолучитьМакет("СКД");
	НастройкиОтчета = КомпоновщикНастроек.ПолучитьНастройки();
	
	Для каждого ЭлПар Из НастройкиОтчета.ПараметрыДанных.Элементы Цикл
		Если ЭлПар.Параметр = Новый ПараметрКомпоновкиДанных("ДокПоступление") Тогда
			ЭлПар.Значение = Поступление;
			ЭлПар.Использование = Истина;
		КонецЕсли; 	
	КонецЦикла;
	
	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
	МакетКомпоновки = КомпоновщикМакета.Выполнить(СКД, НастройкиОтчета);
		
	ПроцессорКомпоновки = Новый ПроцессорКомпоновкиДанных;
	ПроцессорКомпоновки.Инициализировать(МакетКомпоновки,,, Истина);

	ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент;
	ПроцессорВывода.УстановитьДокумент(ДокументРезультат);
	
	ПроцессорВывода.Вывести(ПроцессорКомпоновки);
	
КонецПроцедуры
