Процедура ПроверкаЗаполнения(Отказ)
	
	Если Не ВыгружаемыеДокументы.Количество() Тогда
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Отсутствуют документы к выгрузке!";
		Сообщение.Сообщить(); 
		
		Отказ = Истина;
	КонецЕсли; 
	
	Если Не ЗначениеЗаполнено(ПолноеИмяФайла) Тогда
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Не указан каталог для выгрузки файла!";
		Сообщение.Сообщить(); 
		
		Отказ = Истина;
	КонецЕсли;
	
	ФС = Новый Файл(СокрЛП(КаталогВыгрузки));
	
	Если Не ФС.Существует() Тогда
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Указанный каталог для выгрузки не найден! Измените каталог выгрузки.";
		Сообщение.Сообщить(); 
		
		Отказ = Истина;
	КонецЕсли; 
КонецПроцедуры
 
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	Отказ = Ложь;
	
	ПроверкаЗаполнения(Отказ);
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли; 
	
	ВыгрузитьДокументы();
КонецПроцедуры

//*******************************************************************************************
// Параметры:
// ----------
// 		Параметр1 - описание параметра
// 		Параметр2 - описание параметра
//
// Описание:
// ---------
// 		Описание процедуры
//
//*******************************************************************************************
Процедура ИнициализироватьФильтрКонтактов(СтруктураДопСвойств)
	
	ФильтрыКонтактов = Новый ДеревоЗначений;

	ФильтрыКонтактов.Колонки.Добавить("ТипОбъекта"	,Новый ОписаниеТипов("Строка"));
	ФильтрыКонтактов.Колонки.Добавить("Тип"			,Новый ОписаниеТипов("ПеречислениеСсылка.ТипыКонтактнойИнформации"));
	ФильтрыКонтактов.Колонки.Добавить("Вид"			,Новый ОписаниеТипов("СправочникСсылка.ВидыКонтактнойИнформации"));
	ФильтрыКонтактов.Колонки.Добавить("Синоним"		,Новый ОписаниеТипов("Строка"));
	
	// фильтр для контрагентов..
	//--------------------------
	СтрокаФильтра 			 	= ФильтрыКонтактов.Строки.Добавить();
	СтрокаФильтра.ТипОбъекта 	= Метаданные.Справочники.Контрагенты.Имя;
	
	ПодСтрокаЮрАдрес 	 	 	= СтрокаФильтра.Строки.Добавить();
	ПодСтрокаЮрАдрес.Тип	 	= Перечисления.ТипыКонтактнойИнформации.Адрес;
	ПодСтрокаЮрАдрес.Вид 	 	= Справочники.ВидыКонтактнойИнформации.АдресЮридический;
	ПодСтрокаЮрАдрес.Синоним 	= "ЮридическийАдрес";
	
	ПодСтрокаФактАдрес 			= СтрокаФильтра.Строки.Добавить();
	ПодСтрокаФактАдрес.Тип 		= Перечисления.ТипыКонтактнойИнформации.Адрес;
	ПодСтрокаФактАдрес.Вид 		= Справочники.ВидыКонтактнойИнформации.АдресФактический;
	ПодСтрокаФактАдрес.Синоним 	= "ФактическийАдрес";
	
	ПодСтрокаТелефон   			= СтрокаФильтра.Строки.Добавить();
	ПодСтрокаТелефон.Тип 		= Перечисления.ТипыКонтактнойИнформации.Телефон;
	ПодСтрокаТелефон.Вид 		= Справочники.ВидыКонтактнойИнформации.ТелефонРабочий;
	ПодСтрокаТелефон.Синоним 	= "Телефон";
	
	// фильтр для организаций..
	//-------------------------
	//СтрокаФильтра 			 	= ФильтрыКонтактов.Строки.Добавить();
	//СтрокаФильтра.ТипОбъекта 	= Метаданные.Справочники.Организации.Имя;
	//
	//ПодСтрокаЮрАдрес 	 		= СтрокаФильтра.Строки.Добавить();
	//ПодСтрокаЮрАдрес.Тип		= Перечисления.ТипыКонтактнойИнформации.Адрес;
	//ПодСтрокаЮрАдрес.Вид 		= Справочники.ВидыКонтактнойИнформации.НайтиПоНаименованию("Почтовый адрес");
	//ПодСтрокаЮрАдрес.Синоним 	= "ЮридическийАдрес";
	//
	//ПодСтрокаФактАдрес 			= СтрокаФильтра.Строки.Добавить();
	//ПодСтрокаФактАдрес.Тип 		= Перечисления.ТипыКонтактнойИнформации.Адрес;
	//ПодСтрокаФактАдрес.Вид 		= Справочники.ВидыКонтактнойИнформации.НайтиПоНаименованию("Фактический адрес");
	//ПодСтрокаФактАдрес.Синоним 	= "ФактическийАдрес";
	//
	//ПодСтрокаТелефон   			= СтрокаФильтра.Строки.Добавить();
	//ПодСтрокаТелефон.Тип 		= Перечисления.ТипыКонтактнойИнформации.Телефон;
	//ПодСтрокаТелефон.Вид 		= Справочники.ВидыКонтактнойИнформации.НайтиПоНаименованию("Телефон");
	//ПодСтрокаТелефон.Синоним 	= "Телефон";
	
	СтруктураДопСвойств.Вставить("ФильтрыКонтактов",ФильтрыКонтактов);
КонецПроцедуры // ИнициализироватьФильтрКонтактов()

//*******************************************************************************************
// Параметры:
// ----------
// 		Параметр1 - описание параметра
// 		Параметр2 - описание параметра
//
// Описание:
// ---------
// 		Описание процедуры
//
//*******************************************************************************************
Процедура ИнициализироватьТаблицыДанных(СтруктураДопСвойств)
	
	тОрганизации = Новый ТаблицаЗначений;
	тОрганизации.Колонки.Добавить("ИдУпр");
	тОрганизации.Колонки.Добавить("ИдВладелец");
	тОрганизации.Колонки.Добавить("Приоритет");
	тОрганизации.Колонки.Добавить("Наименование");
	тОрганизации.Колонки.Добавить("НаименованиеПолное");
	тОрганизации.Колонки.Добавить("ЮридическийАдрес");
	тОрганизации.Колонки.Добавить("ФактическийАдрес");
	тОрганизации.Колонки.Добавить("ИНН");
	тОрганизации.Колонки.Добавить("Телефон");
	тОрганизации.Колонки.Добавить("Представление");
	
	тКонтрагенты = Новый ТаблицаЗначений;
	тКонтрагенты.Колонки.Добавить("ИдУпр");
	тКонтрагенты.Колонки.Добавить("ИдВладелец");
	тКонтрагенты.Колонки.Добавить("Приоритет");
	тКонтрагенты.Колонки.Добавить("Наименование");
	тКонтрагенты.Колонки.Добавить("НаименованиеПолное");
	//тКонтрагенты.Колонки.Добавить("ЮрФизЛицо");
	тКонтрагенты.Колонки.Добавить("ЮридическийАдрес");
	тКонтрагенты.Колонки.Добавить("ФактическийАдрес");
	тКонтрагенты.Колонки.Добавить("ИНН");
	тКонтрагенты.Колонки.Добавить("Телефон");
	тКонтрагенты.Колонки.Добавить("Представление");
	
	тДоговоры = Новый ТаблицаЗначений;
	тДоговоры.Колонки.Добавить("ИдУпр");
	тДоговоры.Колонки.Добавить("ИдВладелец");
	тДоговоры.Колонки.Добавить("Приоритет");
	тДоговоры.Колонки.Добавить("Наименование");
	тДоговоры.Колонки.Добавить("НомерДоговора");
	тДоговоры.Колонки.Добавить("ДатаНачала");
	тДоговоры.Колонки.Добавить("Организация");
	//тДоговоры.Колонки.Добавить("ДоговорСумма");
	тДоговоры.Колонки.Добавить("Представление");
	тДоговоры.Колонки.Добавить("ВидДоговора");
	
	тБанковскиеСчета = Новый ТаблицаЗначений;
	тБанковскиеСчета.Колонки.Добавить("ИдУпр");
	тБанковскиеСчета.Колонки.Добавить("ИдВладелец");
	тБанковскиеСчета.Колонки.Добавить("Приоритет");
	тБанковскиеСчета.Колонки.Добавить("Наименование");
	тБанковскиеСчета.Колонки.Добавить("НомерСчета");
	тБанковскиеСчета.Колонки.Добавить("Банк");
	тБанковскиеСчета.Колонки.Добавить("Представление");
		
	тБанки = Новый ТаблицаЗначений;
	тБанки.Колонки.Добавить("Код");
	тБанки.Колонки.Добавить("ИдУпр");
	тБанки.Колонки.Добавить("ИдВладелец");
	тБанки.Колонки.Добавить("Приоритет");
	тБанки.Колонки.Добавить("Наименование");
	тБанки.Колонки.Добавить("КоррСчет");
	тБанки.Колонки.Добавить("Город");
	тБанки.Колонки.Добавить("Представление");
	
	тАвтомобили = Новый ТаблицаЗначений;
	тАвтомобили.Колонки.Добавить("ИдУпр");
	тАвтомобили.Колонки.Добавить("ИдВладелец");
	тАвтомобили.Колонки.Добавить("Приоритет");
	тАвтомобили.Колонки.Добавить("Наименование");
	тАвтомобили.Колонки.Добавить("Артикул");
	тАвтомобили.Колонки.Добавить("НомерГТД");
	тАвтомобили.Колонки.Добавить("СтранаПроисхождения");
	тАвтомобили.Колонки.Добавить("Код");
	тАвтомобили.Колонки.Добавить("Представление");
	
	тНоменклатура = Новый ТаблицаЗначений;
	тНоменклатура.Колонки.Добавить("ИдУпр");
	тНоменклатура.Колонки.Добавить("ИдВладелец");
	тНоменклатура.Колонки.Добавить("Приоритет");
	тНоменклатура.Колонки.Добавить("Наименование");
	тНоменклатура.Колонки.Добавить("БазоваяЕдиницаИзмерения");
	тНоменклатура.Колонки.Добавить("Артикул");
	тНоменклатура.Колонки.Добавить("ЭтоЛКМ");
	тНоменклатура.Колонки.Добавить("Код");
	тНоменклатура.Колонки.Добавить("Представление");
	
	тКассы = Новый ТаблицаЗначений;
	тКассы.Колонки.Добавить("ИдУпр");
	тКассы.Колонки.Добавить("ИдВладелец");
	тКассы.Колонки.Добавить("Приоритет");
	тКассы.Колонки.Добавить("Наименование");
	тКассы.Колонки.Добавить("Код");
	тКассы.Колонки.Добавить("Представление");
	
	тСотрудники = Новый ТаблицаЗначений;
	тСотрудники.Колонки.Добавить("ИдУпр");
	тСотрудники.Колонки.Добавить("ИдВладелец");
	тСотрудники.Колонки.Добавить("Приоритет");
	тСотрудники.Колонки.Добавить("Наименование");
	тСотрудники.Колонки.Добавить("ДатаРождения");
	тСотрудники.Колонки.Добавить("Пол");
	тСотрудники.Колонки.Добавить("Код");
	тСотрудники.Колонки.Добавить("Представление");
	
	тЕдИзм 				= тКассы.СкопироватьКолонки();
	тПодразделения	= тКассы.СкопироватьКолонки();
	тОС 					= тКассы.СкопироватьКолонки();
	
	СоответствиеТаблицСправочников = Новый Соответствие();
	
	СоответствиеТаблицСправочников.Вставить("Организации"			 	,тОрганизации);
	СоответствиеТаблицСправочников.Вставить("Контрагенты"			 	,тКонтрагенты);
	СоответствиеТаблицСправочников.Вставить("ДоговорыВзаиморасчетов",тДоговоры);
	//СоответствиеТаблицСправочников.Вставить("Договоры"					,тДоговоры);
	СоответствиеТаблицСправочников.Вставить("Банки"					 	,тБанки);
	СоответствиеТаблицСправочников.Вставить("БанковскиеСчета"		,тБанковскиеСчета);
	СоответствиеТаблицСправочников.Вставить("Автомобили"			,тАвтомобили);
	СоответствиеТаблицСправочников.Вставить("Номенклатура"			,тНоменклатура);
	СоответствиеТаблицСправочников.Вставить("КлассификаторЕдиницИзмерения",тЕдИзм);
	СоответствиеТаблицСправочников.Вставить("Подразделения"			,тПодразделения);
	СоответствиеТаблицСправочников.Вставить("КассыКомпании"			 		 	,тКассы);
	СоответствиеТаблицСправочников.Вставить("ОсновныеСредства"		,тОС);
	СоответствиеТаблицСправочников.Вставить("ФизическиеЛица"		,тСотрудники);
	
	тДокументов = Новый ТаблицаЗначений;
	тДокументов.Колонки.Добавить("Операция");
	тДокументов.Колонки.Добавить("Представление");
	тДокументов.Колонки.Добавить("ДатаДок");
	тДокументов.Колонки.Добавить("НомерДок");
	тДокументов.Колонки.Добавить("ДатаВхДок");
	тДокументов.Колонки.Добавить("НомерВхДок");
	тДокументов.Колонки.Добавить("НомерСФ");
	тДокументов.Колонки.Добавить("ДатаСФ");
	тДокументов.Колонки.Добавить("ИдДок");
	тДокументов.Колонки.Добавить("ДокОснование");
	тДокументов.Колонки.Добавить("Организация");
	тДокументов.Колонки.Добавить("Контрагент");
	тДокументов.Колонки.Добавить("Договор");
	тДокументов.Колонки.Добавить("ПокупательКомиссии");
	тДокументов.Колонки.Добавить("Автомобиль");
	тДокументов.Колонки.Добавить("Номенклатура");
	тДокументов.Колонки.Добавить("НоменклатураКомплект");
	тДокументов.Колонки.Добавить("Касса");
	тДокументов.Колонки.Добавить("Количество");
	тДокументов.Колонки.Добавить("КоличествоКомплект");
	тДокументов.Колонки.Добавить("Сумма");
	тДокументов.Колонки.Добавить("СуммаНДС");
	тДокументов.Колонки.Добавить("Себестоимость");
	тДокументов.Колонки.Добавить("ЭтоЛКМ");
	тДокументов.Колонки.Добавить("КомплектЭтоЛКМ");
	тДокументов.Колонки.Добавить("ЭтоУслуга");
	тДокументов.Колонки.Добавить("СчетЗатрат");
	тДокументов.Колонки.Добавить("Подразделение");
	тДокументов.Колонки.Добавить("ЭтоКорректировкаПрошлогоПериода");
	тДокументов.Колонки.Добавить("ЭтоГарантия");
	тДокументов.Колонки.Добавить("ЭтоОплатаСтрахования");
	тДокументов.Колонки.Добавить("ЭтоАгентскаяСхема");
	тДокументов.Колонки.Добавить("НомерПолиса");
	тДокументов.Колонки.Добавить("ДатаПолиса");
	тДокументов.Колонки.Добавить("ЭтоЗалог");
	тДокументов.Колонки.Добавить("ЭтоПродленнаяГарантия");
	тДокументов.Колонки.Добавить("ЭтоПродленнаяГарантияКардиф"); //ПАЦ Тишин 24.09.2015
	тДокументов.Колонки.Добавить("ВИН");
	тДокументов.Колонки.Добавить("РасчетныйСчет");
	тДокументов.Колонки.Добавить("Выдать");
	тДокументов.Колонки.Добавить("Приложение");
	тДокументов.Колонки.Добавить("ЭтоСкладТрейдИн");
	
	// данные для отчета по ДЗ в БУ..
	//--------------------------------
	тДокументов.Колонки.Добавить("МаркаАвтомобиля");
	тДокументов.Колонки.Добавить("ГосударственныйНомер");
	тДокументов.Колонки.Добавить("НомерНаправления");
	тДокументов.Колонки.Добавить("НомерЗаказНаряда");
	тДокументов.Колонки.Добавить("ДатаЗакрытияЗаказНаряда");
	
	СтруктураДопСвойств.Вставить("СоответствиеТаблицСправочников"	,СоответствиеТаблицСправочников);
	СтруктураДопСвойств.Вставить("ТаблицаДокументов"			 			,тДокументов);
	СтруктураДопСвойств.Вставить("Организация"								,Организация);
	
	ИнициализироватьФильтрКонтактов(СтруктураДопСвойств);
	
	сзОперации = Новый СписокЗначений();
	//сзОперации.Добавить(Перечисления.Renault_ВидыОперацийДокументовПеремещение.Подмена		,10);
	//сзОперации.Добавить(Перечисления.Renault_ВидыОперацийДокументовПеремещение.ТестДрайв	,10);
	//сзОперации.Добавить(Перечисления.Renault_ВидыОперацийДокументовПеремещение.Консигнация	,11);
	//сзОперации.Добавить(Перечисления.Renault_ВидыОперацийДокументовПеремещение.Комиссия		,18);
	//сзОперации.Добавить(Перечисления.Renault_ВидыОперацийДокументовПеремещение.Агентский	,18);
	//сзОперации.Добавить(Перечисления.Renault_ВидыОперацийДокументовПеремещение.Выкуп		,19);
	//сзОперации.Добавить(Перечисления.Renault_ВидыОперацийДокументовПеремещение.БУ			,19);

	сзОперации.Добавить(Справочники.ХозОперации.ПоступлениеАвтомобилей		,18);
	сзОперации.Добавить(Справочники.ХозОперации.ПоступлениеАвтомобилейКомиссия		,18);

	сзОперацииРКО = Новый СписокЗначений();
	//сзОперацииРКО.Добавить(Перечисления.ВидыОперацийРКО.ВзносНаличнымиВБанк					, 40);
	сзОперацииРКО.Добавить(Справочники.ХозОперации.ВыплатаЗарплатыРаботнику 				, 41);
	//сзОперацииРКО.Добавить(Перечисления.ВидыОперацийРКО.ВозвратДенежныхСредствПокупателю    , 42);
	сзОперацииРКО.Добавить(Справочники.ХозОперации.ВыдачаДенежныхСредствПодотчетнику        , 43);
	сзОперацииРКО.Добавить(Справочники.ХозОперации.РасходныйКассовыйОрдер					, 44);
	
	СтруктураДопСвойств.Вставить("сзОперации"		 	,сзОперации);
	СтруктураДопСвойств.Вставить("сзОперацииРКО"	,сзОперацииРКО);
КонецПроцедуры // ИнициализироватьТаблицыДанных()

//*******************************************************************************************
// Параметры:
// ----------
// 		Параметр1 - описание параметра
// 		Параметр2 - описание параметра
//
// Возвращаемое значение:
// ----------------------
//		Возвращаемое значение
//
// Описание:
// ---------
// 		Описание функции
//
//*******************************************************************************************
Функция ПолучитьУИДУпр(Ссылка)
	
	ПустойУИД = "00000000-0000-0000-0000-000000000000";
	
	Если Не ЗначениеЗаполнено(Ссылка) Тогда
		Возврат ПустойУИД;
	КонецЕсли; 
	
	НаборЗаписей = РегистрыСведений.пэСинхронизацияОбъектовУУ.СоздатьНаборЗаписей();
	
	НаборЗаписей.Отбор.УИД_БУ.Установить(Ссылка.УникальныйИдентификатор());
	НаборЗаписей.Отбор.Ссылка_БУ.Установить(Ссылка);
	
	НаборЗаписей.Прочитать();
	
	Если НаборЗаписей.Количество() = 0 Тогда
		Возврат ПустойУИД;
	КонецЕсли; 
	
	Возврат НаборЗаписей[0].УИД_УУ;
КонецФункции // ПолучитьУИДУпр()

Функция СформироватьНаименованиеУидДоговора(ДокОснование,Сделка,Договор)
	
	СтруктураРезультат = Новый Структура("Наименование,УИД, ВидДоговора","","", "");
	
	ПредставлениеОснование = "";
	НомерОснование				 = "";
	УИД								 = "";
	ВидДоговора                    = "";
	
	Если ТипЗнч(ДокОснование) = Тип("ДокументСсылка.ПоступлениеТоваров") Тогда
	
		ПредставлениеОснование = ДокОснование.Метаданные().Представление() + " ";
	    НомерОснование				 ="№ " + ?(Не ЗначениеЗаполнено(ДокОснование.ВхДокНомер),СокрЛП(ДокОснование.Номер),ДокОснование.ВхДокНомер);
		УИД								 = ДокОснование.УникальныйИдентификатор();
		ВидДоговора                    = Договор.ВидДоговора;
		
	ИначеЕсли Не ЗначениеЗаполнено(Сделка) Тогда
		
	  //  Если ЗначениеЗаполнено(Договор.Автодоговор) Тогда
	  //  	ПредставлениеОснование = СокрЛП(Договор.Автодоговор.Наименование);
	  //  	УИД								 = Договор.Автодоговор.УникальныйИдентификатор();
	  //  	ВидДоговора                   = "С покупателем";
	  //КонецЕсли; 
		
	ИначеЕсли ТипЗнч(Сделка) = Тип("ДокументСсылка.ЗаказПокупателя") Тогда
		
		//ПредставлениеОснование = "Заказ покупателя № ";
		//
		//Если ЗначениеЗаполнено(Сделка.ЗаказНаряд.пацКорректируемыйДокумент) Тогда
		//	
		//	НомерОснование = Сделка.бит_ЗаказНаряд.пацКорректируемыйДокумент.Номер;
		//	УИД					= Сделка.бит_ЗаказНаряд.пацКорректируемыйДокумент.УникальныйИдентификатор();
		//	
		//ИначеЕсли 	ЗначениеЗаполнено(Сделка.бит_ЗаказНаряд) Тогда
		//	
		//	НомерОснование = Сделка.бит_ЗаказНаряд.Номер;
		//	УИД					= Сделка.бит_ЗаказНаряд.УникальныйИдентификатор();
		//	
		//Иначе
		//	
		//	НомерОснование = Сделка.Номер;
		//	УИД					= Сделка.УникальныйИдентификатор();
		//	
		//КонецЕсли; 
		//
		//ВидДоговора                   =  Договор.ВидДоговора;
		
	ИначеЕсли Не Метаданные.НайтиПоТипу(ТипЗнч(Сделка)) =  Неопределено Тогда
		ПредставлениеОснование = "По документу " + Метаданные.НайтиПоТипу(ТипЗнч(Сделка)).Представление() + " № ";
		НомерОснование 			 = Сделка.Номер;
		УИД								 = Сделка.УникальныйИдентификатор();
        ВидДоговора                   = Договор.ВидДоговора;
	КонецЕсли; 
	
	СтруктураРезультат.Вставить("Наименование",ПредставлениеОснование + СокрЛП(НомерОснование));
	СтруктураРезультат.Вставить("УИД",УИД);
	СтруктураРезультат.Вставить("ВидДоговора", ВидДоговора);
	
	Возврат СтруктураРезультат;

КонецФункции // СформироватьНаименованиеДоговора()
 
Функция УбратьСлужебныеСимволы(Знач Стр)
	
	Стр = СтрЗаменить(Стр,"//","\\");
	Стр = СтрЗаменить(Стр,"{","");
	Стр = СтрЗаменить(Стр,"}","");
	Стр = СтрЗаменить(Стр,"|","");
	Стр = СтрЗаменить(Стр,Символ(13),"");
	Стр = СтрЗаменить(Стр,Символ(182),"");
	Стр = СтрЗаменить(Стр,Символы.ПС,"");
	
	Возврат СокрЛП(Стр); 	
КонецФункции

Функция ПолучитьКассуПоПодразделению(Подразделение)
	
	Касса = Справочники.Кассы.ПустаяСсылка();
	
	Если Не ЗначениеЗаполнено(Подразделение) Тогда
		Возврат Касса;
	КонецЕсли; 
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	КассыКомпании.Ссылка КАК Касса
	               |ИЗ
	               |	Справочник.КассыКомпании КАК КассыКомпании
	               |ГДЕ
	               |	КассыКомпании.Подразделение = &Подразделение";
				   
	Запрос.УстановитьПараметр("Подразделение",Подразделение);
	
	ВыборкаЗапроса = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.Прямой);
	
	Пока ВыборкаЗапроса.Следующий() Цикл
		Возврат ВыборкаЗапроса.Касса;
	КонецЦикла; 
		
	Возврат Касса;

КонецФункции // ПолучитьКассуПоПодразделению()

Функция ПолучитьОплатуСтраховогоПолиса(ДокПКО)
	
	ПустойДок = Документы.Renault_ОплатаСтраховогоПолиса.ПустаяСсылка();
	
	Если Не ЗначениеЗаполнено(ДокПКО) Тогда
		Возврат ПустойДок;
	КонецЕсли; 
	
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	ОплатаПолиса.Ссылка
	                      |ИЗ
	                      |	Документ.Renault_ОплатаСтраховогоПолиса КАК ОплатаПолиса
	                      |ГДЕ
	                      |	ОплатаПолиса.ПометкаУдаления = ЛОЖЬ
	                      |	И ОплатаПолиса.ПлатежныйДокумент = &ДокПКО
	                      |
	                      |УПОРЯДОЧИТЬ ПО
	                      |	ОплатаПолиса.Дата УБЫВ");
						  
	Запрос.УстановитьПараметр("ДокПКО",ДокПКО);
	
	Выборка = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.Прямой);
	
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Ссылка;
	КонецЕсли; 
	
	Возврат ПустойДок;
КонецФункции // ПолучитьДокументОплатаСтрахования()

Функция ПолучитьДанныеПоступленияАМ(Автомобиль,ДокСсылка)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЕСТЬNULL(АвтомобилиНаСкладахОбороты.Партия.Контрагент, ЗНАЧЕНИЕ(Справочник.КОнтрагенты.ПустаяСсылка)) КАК Поставщик,
	               |	СтоимостьАвтомобиляОбороты.СуммаОборот КАК Стоимость,
	               |	ЕСТЬNULL(АвтомобилиНаСкладахОбороты.Партия.ДоговорВзаиморасчетов, ЗНАЧЕНИЕ(Справочник.ДоговорыВзаиморасчетов.ПустаяСсылка)) КАК Договор
	               |ИЗ
	               |	РегистрНакопления.ПродажиАвтомобилей.Обороты(, , Регистратор, Автомобиль = &Автомобиль) КАК СтоимостьАвтомобиляОбороты
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ОстаткиАвтомобилей.Обороты КАК АвтомобилиНаСкладахОбороты
	               |		ПО СтоимостьАвтомобиляОбороты.Автомобиль = АвтомобилиНаСкладахОбороты.Автомобиль
	               |ГДЕ
	               |	СтоимостьАвтомобиляОбороты.Регистратор = &Ссылка
	               |	И АвтомобилиНаСкладахОбороты.Партия ССЫЛКА Документ.ПоступлениеАвтомобилей";
				   
	Запрос.УстановитьПараметр("Автомобиль"	,Автомобиль);
	Запрос.УстановитьПараметр("Ссылка"		,ДокСсылка);
	
	Выборка = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.Прямой);
	
	Результат = Новый Структура("Поставщик,Договор,Стоимость",Справочники.Контрагенты.ПустаяСсылка(),Справочники.ДоговорыВзаиморасчетов.ПустаяСсылка(),0);
	Если Выборка.Следующий() Тогда
		
		ЗаполнитьЗначенияСвойств(Результат,Выборка);
		
		Возврат Результат;
	Иначе
		Возврат Результат;
	КонецЕсли;	
	
КонецФункции	

//*******************************************************************************************
// Параметры:
// ----------
// 		Параметр1 - описание параметра
// 		Параметр2 - описание параметра
//
// Описание:
// ---------
// 		Описание процедуры
//
//*******************************************************************************************
Процедура ДобавитьВТаблицу(Ссылка,Приоритет,ДопСвойства,НаименованиеДляВыгрузки = "",УИДДляВыгрузки = "", ВидДоговора = "",ЭтоОС = Ложь,Владелец = Неопределено)
	
	Если Не ЗначениеЗаполнено(Ссылка) Тогда
		Возврат;
	КонецЕсли; 
	
	Тип 			= Метаданные.НайтиПоТипу(ТипЗнч(Ссылка)).Имя;
	
	ЭтоОрганизация 	= Ложь;
	
	Если Тип = "Подразделения" Тогда
		Возврат;
	КонецЕсли; 
	
	Попытка
		
		Если ЭтоОС Тогда
			ТабДанных = ДопСвойства.СоответствиеТаблицСправочников["ОсновныеСредства"];
			
		Иначе	
			ТабДанных = ДопСвойства.СоответствиеТаблицСправочников[Тип];
		КонецЕсли;
		
		СтрокаТЗ   = ТабДанных.Добавить();
		
	Исключение
		Сообщить("Не удалось получить таблицу данных для справочника " + Тип + ": " + ОписаниеОшибки(),СтатусСообщения.Важное);
		Возврат;
	КонецПопытки;
	
	Для каждого Колонка Из ТабДанных.Колонки Цикл
		
		Если Не Ссылка.Метаданные().Реквизиты.Найти(Колонка.Имя) = Неопределено Тогда
			
			Если (Колонка.Имя = "Банк") или (Колонка.Имя = "БанкДляРасчетов") или (Колонка.Имя = "Организация") Или (Колонка.Имя = "БазоваяЕдиницаИзмерения") Тогда
				
				СтрокаТЗ[Колонка.Имя] = Ссылка[Колонка.Имя].УникальныйИдентификатор();
				
			Иначе
								
				Если Колонка.Имя = "ВидДоговора" И ЗначениеЗаполнено(ВидДоговора) Тогда
				    СтрокаТЗ[Колонка.Имя] = ВидДоговора;
				Иначе
					СтрокаТЗ[Колонка.Имя] = Ссылка[Колонка.Имя];
					
				КонецЕсли; 
				
			КонецЕсли;	
			
		Иначе
			
			Если Колонка.Имя = "ИдУпр" Тогда
				
				Если ЗначениеЗаполнено(УидДляВыгрузки) И УИДДляВыгрузки <> "00000000-0000-0000-0000-000000000000" Тогда
					СтрокаТЗ[Колонка.Имя] = УИДДляВыгрузки;
				Иначе	
					СтрокаТЗ[Колонка.Имя] = Ссылка.УникальныйИдентификатор();
				КонецЕсли; 
				
			ИначеЕсли Колонка.Имя = "ИдВладелец" Тогда
				
				Если Не Владелец = Неопределено Тогда
					
					СтрокаТЗ[Колонка.Имя] = Владелец.УникальныйИдентификатор();	
					
				ИначеЕсли Не Ссылка.Владелец = Неопределено Тогда
					
					СтрокаТЗ[Колонка.Имя] = Ссылка.Владелец.УникальныйИдентификатор();	
					
				ИначеЕсли Тип = "Подразделения" И ЗначениеЗаполнено(ДопСвойства.Организация) Тогда
					
					СтрокаТЗ[Колонка.Имя] = ДопСвойства.Организация.УникальныйИдентификатор();
					
				КонецЕсли;
				
			ИначеЕсли Колонка.Имя = "Приоритет" Тогда
				
				СтрокаТЗ[Колонка.Имя] = Приоритет;	
				
			ИначеЕсли Колонка.Имя = "Представление" Тогда
				
				Если ТипЗнч(Ссылка) = Тип("СправочникСсылка.ДоговорыВзаиморасчетов") Тогда 
					СтрокаТЗ[Колонка.Имя] = Справочники.ДоговорыВзаиморасчетов.ПустаяСсылка().Метаданные().Представление();	
				Иначе	
					СтрокаТЗ[Колонка.Имя] = ?(ЭтоОС,"Основные средства",Ссылка.Метаданные().Представление());	
				КонецЕсли;
				
			ИначеЕсли Колонка.Имя = "Наименование" Тогда
				
				Наименование = ?(ЗначениеЗаполнено(НаименованиеДляВыгрузки),СокрЛП(НаименованиеДляВыгрузки),СокрЛП(Ссылка.Наименование));
				
				Если ТипЗнч(Ссылка) = Тип("СправочникСсылка.ДоговорыВзаиморасчетов") Или ТипЗнч(Ссылка) = Тип("СправочникСсылка.Renault_Advanced_Договоры") Тогда
					Наименование = СтрЗаменить(Наименование,"(Подписан)","");
					Наименование = СтрЗаменить(Наименование,"(Расторгнут)","");
				КонецЕсли; 
				
				СтрокаТЗ[Колонка.Имя] = СокрЛП(УбратьСлужебныеСимволы(Наименование));		
				
			ИначеЕсли Колонка.Имя = "Код" Тогда
				
				СтрокаТЗ[Колонка.Имя] = СокрЛП(Ссылка.Код);			
				
			ИначеЕсли Колонка.Имя = "ЮридическийАдрес" или Колонка.Имя = "ФактическийАдрес" или Колонка.Имя = "Телефон" Тогда
				
			 	Продолжить;
				
			ИначеЕсли Колонка.Имя = "НомерГТД" Тогда
				
				//ВыборкаПТС = Справочники.ПаспортаТранспортныхСредств.Выбрать(,Ссылка);
				//
				//Пока ВыборкаПТС.Следующий() Цикл
				//	
				//	Если ВыборкаПТС.Дубликат Тогда
				//		Продолжить;
				//	КонецЕсли;
				//	
				//	СтрокаТЗ.НомерГТД 					= СокрЛП(ВыборкаПТС.НомерГТД);
				//	СтрокаТЗ.НомерГТД						= УбратьСлужебныеСимволы(СтрокаТЗ.НомерГТД);
				//	
				//	СтрокаТЗ.СтранаПроисхождения 	= СокрЛП(ВыборкаПТС.Изготовитель);
				//	
				//	Прервать;
				//КонецЦикла;	
				Продолжить;

			ИначеЕсли Колонка.Имя = "СтранаПроисхождения" Тогда	
				  Продолжить;
				  
			ИначеЕсли Колонка.Имя = "ЭтоЛКМ" Тогда					  
				СтрокаТЗ.ЭтоЛКМ = Число(Ссылка.ВидНоменклатуры = Перечисления.ВидыНоменклатуры.ЛКМ);
				
			ИначеЕсли Колонка.Имя = "ВидДоговора" Тогда
				СтрокаТЗ[Колонка.Имя]  = ВидДоговора;
				
			ИначеЕсли Колонка.Имя = "Артикул" Тогда
				СтрокаТЗ[Колонка.Имя]  = Ссылка.VIN;
				
			Иначе
				
				Сообщить("Непонятен реквизит " + Колонка.Имя + " для справочника " + Тип + "!",СтатусСообщения.Внимание);
			КонецЕсли; 
		КонецЕсли; 
	КонецЦикла;
	
	Если ТипЗнч(Ссылка) = Тип("СправочникСсылка.БанковскиеСчета") Тогда
		
		ДобавитьВТаблицу(Ссылка.Владелец				,1,ДопСвойства);
		ДобавитьВТаблицу(Ссылка.Банк					,2,ДопСвойства);
		ДобавитьВТаблицу(Ссылка.БанкДляРасчетов	,2,ДопСвойства);
		
	ИначеЕсли ТипЗнч(Ссылка) = Тип("СправочникСсылка.ДоговорыВзаиморасчетов") Тогда 	
		ДобавитьВТаблицу(Ссылка.Владелец			,2,ДопСвойства);
		ДобавитьВТаблицу(Ссылка.Организация		,1,ДопСвойства);
		
	ИначеЕсли ТипЗнч(Ссылка) = Тип("СправочникСсылка.Номенклатура") Тогда
		ДобавитьВТаблицу(Ссылка.БазоваяЕдиницаИзмерения,2,ДопСвойства);
	КонецЕсли; 
	
	// контактная информация для контрагентов и организаций..
	//-------------------------------------------------------
	СтрокиФильтра = ДопСвойства.ФильтрыКонтактов.Строки.Найти(Тип,"ТипОбъекта");
	
	Если СтрокиФильтра = Неопределено Тогда
		Возврат;
	КонецЕсли;	
	
	НаборЗаписей = РегистрыСведений.КонтактнаяИнформация.СоздатьНаборЗаписей();
	
	Для каждого Строка Из СтрокиФильтра.Строки Цикл
		НаборЗаписей.Отбор.Объект.Установить(Ссылка);
		НаборЗаписей.Отбор.Тип.Установить(Строка.Тип);
		НаборЗаписей.Отбор.Вид.Установить(Строка.Вид);
		НаборЗаписей.Прочитать();
		
		Если НаборЗаписей.Количество() = 0 Тогда
			Продолжить;
		КонецЕсли;
		
		СтрокаТЗ[Строка.Синоним] = СокрЛП(УбратьСлужебныеСимволы(НаборЗаписей[0].Представление));
	КонецЦикла;
КонецПроцедуры // ДобавитьВТаблицу()
 
//*******************************************************************************************
// Параметры:
// ----------
// 		Параметр1 - описание параметра
// 		Параметр2 - описание параметра
//
// Описание:
// ---------
// 		Описание процедуры
//
//*******************************************************************************************
Процедура ОбработкаДокументаПоступлениеАвтомобилей(ДокОбъект,ДопСвойства);
	
	ЭлементСписка = ДопСвойства.сзОперации.НайтиПоЗначению(ДокОбъект.ХозОперация);
	Операция = "";
	
	Если Не ДокОбъект.ХозОперация = Справочники.ХозОперации.ПоступлениеАвтомобилей
		И Не ДокОбъект.ХозОперация = Справочники.ХозОперации.ПоступлениеАвтомобилейКомиссия Тогда
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = "Ошибка при выгрузке документа <" + ДокОбъект + ">: выгрузка документов с видом операции " + СокрЛП(ДокОбъект.ХозОперация) + " не предусмотрена!";
			Сообщение.Сообщить(); 
		Возврат;
	КонецЕсли; 
	
	Операция = ЭлементСписка.Представление;
	
	Если Операция = "11" и Найти(ДокОбъект.ВхДокНомер,"F") > 0 Тогда
		Операция = "17";
	КонецЕсли;	
	
	ВидДоговора = ?(Операция = "18",Перечисления.ВидыДоговоров.СКомитентом,Перечисления.ВидыДоговоров.Покупка);
		
	Для каждого СтрокаТЧ Из ДокОбъект.Автомобили Цикл
		
		НовСтрока = ДопСвойства.ТаблицаДокументов.Добавить();
		
		НовСтрока.Операция 			= Операция;
		НовСтрока.Представление 	= ДокОбъект.Метаданные().Представление();
		НовСтрока.ДатаДок			= Формат(ДокОбъект.Дата, "ДФ=ггггММддЧЧммсс");
		НовСтрока.НомерДок			= СокрЛП(ДокОбъект.Номер);
		НовСтрока.ДатаВхДок			= ДокОбъект.ВхДокДата;
		НовСтрока.НомерВхДок		= СокрЛП(ДокОбъект.ВхДокНомер);
		НовСтрока.ИдДок			 	= ДокОбъект.Ссылка.УникальныйИдентификатор();
		НовСтрока.Организация 	 	= ДокОбъект.Организация.УникальныйИдентификатор();
		НовСтрока.Контрагент 	 	= ДокОбъект.Контрагент.УникальныйИдентификатор();
		НовСтрока.Номенклатура		= СтрокаТЧ.Автомобиль.УникальныйИдентификатор();
		НовСтрока.Автомобиль 		= СтрокаТЧ.Автомобиль.УникальныйИдентификатор();
		НовСтрока.Сумма				= СтрокаТЧ.Сумма;
		НовСтрока.Количество			= 1;		
		//НовСтрока.ЭтоАгентскаяСхема = Число(ДокОбъект.ВидОперации = Перечисления.ВидыОперацийДокументов.Агентский);
		
		Если Операция = "19" И (СтрокаТЧ.Договор.Владелец = ДокОбъект.Контрагент) Тогда
			
			НовСтрока.ДоговорВзаиморасчетов 	= ДокОбъект.ДоговорВзаиморасчетов.УникальныйИдентификатор();
			ДобавитьВТаблицу(ДокОбъект.ДоговорВзаиморасчетов	,7,ДопСвойства,,,ВидДоговора,,ДокОбъект.Контрагент);		

		ИначеЕсли Не Операция = "18" И (СтрокаТЧ.ДоговорВзаиморасчетов.Владелец = ДокОбъект.Контрагент) Тогда
			
			НовСтрока.Договор 	= СтрокаТЧ.ДоговорВзаиморасчетов.УникальныйИдентификатор();		
			ДобавитьВТаблицу(СтрокаТЧ.ДоговорВзаиморасчетов					,7,ДопСвойства,,,ВидДоговора,,ДокОбъект.Контрагент);		
			
		Иначе
			
			НовСтрока.Договор 	= ДокОбъект.ДоговорВзаиморасчетов.УникальныйИдентификатор();
			ДобавитьВТаблицу(ДокОбъект.ДоговорВзаиморасчетов	,7,ДопСвойства,,,ВидДоговора,,ДокОбъект.Контрагент);		
			
		КонецЕсли;
		
		ДобавитьВТаблицу(СтрокаТЧ.Автомобиль					,2,ДопСвойства);
	КонецЦикла; 
	
	ДобавитьВТаблицу(ДокОбъект.Организация				,1,ДопСвойства);
	ДобавитьВТаблицу(ДокОбъект.Контрагент					,2,ДопСвойства);
КонецПроцедуры // ОбработкаДокументаПоступлениеАвтомобилей()

//*******************************************************************************************
// Параметры:
// ----------
// 		Параметр1 - описание параметра
// 		Параметр2 - описание параметра
//
// Описание:
// ---------
// 		Описание процедуры
//
//*******************************************************************************************
Процедура ОбработкаДокументаРеализацияАвтомобилей(ДокОбъект,ДопСвойства);
	
	Если Не ДокОбъект.ХозОперация = Справочники.ХозОперации.РеализацияАвтомобилей
		И Не ДокОбъект.ХозОперация = Справочники.ХозОперации.РеализацияАвтомобилейКомиссия Тогда
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Ошибка при выгрузке документа <" + ДокОбъект + ">: выгрузка документов с видом операции " + СокрЛП(ДокОбъект.ВидОперации) + " не предусмотрена!";
		Сообщение.Сообщить(); 
		Возврат;
	КонецЕсли; 
	
	Операция = "13";
	
	//Если ДокОбъект.ВидОперации = Перечисления.ВидыОперацийДокументов.ДемоПродажа Тогда
	//	Операция = "45";
	//КонецЕсли;
	
	Контрагент = ДокОбъект.Контрагент;
	
	//Если ДокОбъект.ДоговорВзаиморасчетов.СпособОплаты = Перечисления.СпособыОплаты.Лизинг 
	//								Тогда
	//	Контрагент =	ДокОбъект.Договор.Плательщик;
	//КонецЕсли;	
	
	ДокСФ = Renault_Advanced_УчетНДС.НайтиПодчиненныйДокумент(ДокОбъект, "СчетФактураВыданный");
								
	Для каждого СтрокаТЧ Из ДокОбъект.Автомобили Цикл
		
		НовСтрока = ДопСвойства.ТаблицаДокументов.Добавить();
		
		НовСтрока.Операция 			= Операция;
		НовСтрока.Представление 	= ДокОбъект.Метаданные().Представление();
		НовСтрока.ДатаДок			= Формат(ДокОбъект.Дата, "ДФ=ггггММддЧЧммсс");
		НовСтрока.НомерДок			= СокрЛП(ДокОбъект.Номер);
		НовСтрока.ИдДок			 	= ДокОбъект.Ссылка.УникальныйИдентификатор();
		НовСтрока.Организация 	 	= ДокОбъект.Организация.УникальныйИдентификатор();
		НовСтрока.Контрагент 	 	= Контрагент.УникальныйИдентификатор();
		НовСтрока.Договор 			= ДокОбъект.ДоговорВзаиморасчетов.УникальныйИдентификатор();
		НовСтрока.Номенклатура		= СтрокаТЧ.Автомобиль.УникальныйИдентификатор();		
		НовСтрока.Автомобиль 		= СтрокаТЧ.Автомобиль.УникальныйИдентификатор();
		
		//НовСтрока.ЭтоАгентскаяСхема = Число(ДокОбъект.ВидОперации = Перечисления.ВидыОперацийДокументов.Агентский);
		
		СуммаДО = 0;
		
		//Для каждого СтрокаДог Из ДокОбъект.ДоговорВзаиморасчетов.ДанныеДоговора Цикл
		//	
		//	Если Контрагент.ЮрФизЛицо = Перечисления.ЮрФизЛицо.ФизЛицо Тогда
		//		Прервать;
		//	КонецЕсли;	
		//	
		//	Если ТипЗнч(СтрокаДог.Объект) = Тип("ДокументСсылка.РезервированиеАвтомобиля") Тогда
		//		
		//		Если СтрокаДог.Объект.Автомобиль = СтрокаТЧ.Автомобиль Тогда
		//		
		//			СуммаДО = СтрокаДог.СуммаДопОборудования;
		//			Прервать;
		//		КонецЕсли;	
		//		
		//	ИначеЕсли ТипЗнч(СтрокаДог.Объект) = Тип("СправочникСсылка.бит_ус_Изделия") Тогда
		//		
		//		Если СтрокаДог.Объект = СтрокаТЧ.Автомобиль Тогда
		//		
		//			СуммаДО = СтрокаДог.СуммаДопОборудования;
		//			Прервать;
		//		КонецЕсли;		
		//	КонецЕсли;
		//	
		//КонецЦикла;	
		
		НовСтрока.Сумма		= СтрокаТЧ.Сумма + СуммаДО;
		
		НовСтрока.Количество	= 1;
		
		ДобавитьВТаблицу(СтрокаТЧ.Автомобиль,2,ДопСвойства,,,,Ложь);//ДокОбъект.ВидОперации = Перечисления.ВидыОперацийДокументов.ДемоПродажа
		
		//ДокОбъект.ВидОперации = Перечисления.ВидыОперацийДокументов.БУ
		Если ДокОбъект.ХозОперация = Справочники.ХозОперации.РеализацияАвтомобилей Тогда
			
			ДанныеПоступления = ПолучитьДанныеПоступленияАМ(СтрокаТЧ.Автомобиль, ДокОбъект);
			
			НовСтрока.Операция 	= "49";
			НовСтрока.СуммаНДС 	= (НовСтрока.Сумма - ДанныеПоступления.Стоимость) * 18/118;
			
		ИначеЕсли ДокОбъект.ХозОперация = Справочники.ХозОперации.РеализацияАвтомобилейКомиссия Тогда
					
			НовСтрока.Операция 	= "47";
			
			ДанныеПоступления = ПолучитьДанныеПоступленияАМ(СтрокаТЧ.Автомобиль, ДокОбъект);
			
			НовСтрока2 = ДопСвойства.ТаблицаДокументов.Добавить();
			
			ЗаполнитьЗначенияСвойств(НовСтрока2,НовСтрока);
			
			НовСтрока2.Операция 			= "48";
			НовСтрока2.Представление 		= "Отчет комитенту о продажах";
			НовСтрока2.ПокупательКомиссии	= НовСтрока2.Контрагент;
			НовСтрока2.Контрагент			= ДанныеПоступления.Поставщик.УникальныйИдентификатор();
			НовСтрока2.Договор				= Справочники.ДоговорыВзаиморасчетов.ПустаяСсылка().УникальныйИдентификатор();
			НовСтрока2.Себестоимость  		= ДанныеПоступления.Стоимость;
			
			Если ЗначениеЗаполнено(ДанныеПоступления.Поставщик) Тогда
				ДобавитьВТаблицу(ДанныеПоступления.Поставщик	,2,ДопСвойства);	
			КонецЕсли;	
			
			ДокСФ = Неопределено;
			
		//ИначеЕсли ДокОбъект.ВидОперации = Перечисления.ВидыОперацийДокументов.ДемоПродажа Тогда
		//	
		//	НовСтрока.Представление 	= "Подготовка к передаче ОС";
		//	
		//	
		//	НовСтрока2 = ДопСвойства.ТаблицаДокументов.Добавить();
		//	
		//	ЗаполнитьЗначенияСвойств(НовСтрока2,НовСтрока);
		//	НовСтрока2.Операция 			= "46";
		//	НовСтрока2.Представление 	= "Передача ОС";
			
		Иначе
			
			//Отбор = Новый Структура("Организация,РазделУчета",ДокОбъект.Организация,Перечисления.квРазделыУчетаВзаимоотношенийОрганизаций.Автомобили);
			//ВзаимоотношенияОрганизаций = РегистрыСведений.квВзаимоотношенияОрганизаций.СрезПоследних(ДокОбъект.Дата,Отбор);
			//
			//Если ВзаимоотношенияОрганизаций.Количество() Тогда
			//	
			//	Если ВзаимоотношенияОрганизаций[0].РольОрганизацииПартнера = Перечисления.квРолиОрганизаций.Принципал Тогда
			//		НовСтрока.Операция 	= "47";
			//		НовСтрока.ЭтоСкладТрейдИн = 1;
			//		Продолжить;
			//	КонецЕсли;	
			//КонецЕсли;	
			//
		КонецЕсли;	
		
		Если ЗначениеЗаполнено(ДокСФ) Тогда
			
			НовСтрока.НомерСФ 	= СокрЛП(ДокСФ.Номер);
			НовСтрока.ДатаСФ	= Формат(ДокСФ.Дата, "ДФ=ггггММддЧЧммсс");;
			
		КонецЕсли; 
		
	КонецЦикла; 
	
	ДобавитьВТаблицу(ДокОбъект.Организация,1,ДопСвойства);
	
	ДобавитьВТаблицу(Контрагент					,2,ДопСвойства);	
	
	Если Не ДокОбъект.ХозОперация = Справочники.ХозОперации.РеализацияАвтомобилейКомиссия Тогда	
		ДобавитьВТаблицу(ДокОбъект.ДоговорВзаиморасчетов		,7,ДопСвойства,,,"С покупателем",,Контрагент);
	КонецЕсли;	
	
КонецПроцедуры // ОбработкаДокументаРеализацияАвтомобилей()

//*******************************************************************************************
// Параметры:
// ----------
// 		Параметр1 - описание параметра
// 		Параметр2 - описание параметра
//
// Описание:
// ---------
// 		Описание процедуры
//
//*******************************************************************************************
Процедура ОбработкаДокументаПоступлениеТоваровУслуг(ДокОбъект,ДопСвойства);
	
	Операция = "01";
	
	СтруктураНаименованиеУид = СформироватьНаименованиеУидДоговора(ДокОбъект,ДокОбъект.ДокументОснование,ДокОбъект.ДоговорВзаиморасчетов);
	
	Для каждого СтрокаТЧ Из ДокОбъект.Товары Цикл
		
		НовСтрока = ДопСвойства.ТаблицаДокументов.Добавить();
		
		НовСтрока.Операция 			= Операция;
		НовСтрока.Представление 	= ДокОбъект.Метаданные().Представление();
		НовСтрока.ИдДок			 	= ДокОбъект.Ссылка.УникальныйИдентификатор();
		
		НовСтрока.ДатаДок			= Формат(ДокОбъект.Дата, "ДФ=ггггММддЧЧммсс");
		НовСтрока.НомерДок			= СокрЛП(ДокОбъект.Номер);
		НовСтрока.ДатаВхДок			= ДокОбъект.ВхДокДата;
		НовСтрока.НомерВхДок		= СокрЛП(ДокОбъект.ВхДокНомер);
		
		НовСтрока.Организация 	 	= ДокОбъект.Организация.УникальныйИдентификатор();
		НовСтрока.Контрагент 	 	= ДокОбъект.Контрагент.УникальныйИдентификатор();
		НовСтрока.Договор 			= СтруктураНаименованиеУид.УИД;
		
		НовСтрока.Номенклатура		= СтрокаТЧ.Номенклатура.УникальныйИдентификатор();
		НовСтрока.Количество		= СтрокаТЧ.Количество * СтрокаТЧ.Коэффициент;
		НовСтрока.Сумма				= СтрокаТЧ.СуммаВсего;// + ?(ДокОбъект.СуммаНДС,0,СтрокаТЧ.СуммаНДС);
		НовСтрока.СуммаНДС			= СтрокаТЧ.СуммаНДС;
		НовСтрока.ЭтоЛКМ			= Число(СтрокаТЧ.Номенклатура.ВидНоменклатуры = Перечисления.ВидыНоменклатуры.ЛКМ);
		//= Число(СтрокаТЧ.Номенклатура.ВидНоменклатуры = Справочники.ВидыНоменклатуры.Краска Или СтрокаТЧ.Номенклатура.ВидНоменклатуры.Наименование = "МКЦ Рецепты");
		
		ДобавитьВТаблицу(СтрокаТЧ.Номенклатура					,7,ДопСвойства);
	КонецЦикла; 
	
	ДобавитьВТаблицу(ДокОбъект.Организация					,1,ДопСвойства);
	ДобавитьВТаблицу(ДокОбъект.Контрагент						,2,ДопСвойства);
	ДобавитьВТаблицу(ДокОбъект.ДоговорВзаиморасчетов			,7,ДопСвойства,СтруктураНаименованиеУид.Наименование,СтруктураНаименованиеУид.УИД, СтруктураНаименованиеУид.ВидДоговора,,ДокОбъект.Контрагент);
	
КонецПроцедуры // ОбработкаДокументаПоступлениеТоваровУслуг()

//*******************************************************************************************
// Параметры:
// ----------
// 		Параметр1 - описание параметра
// 		Параметр2 - описание параметра
//
// Описание:
// ---------
// 		Описание процедуры
//
//*******************************************************************************************
Процедура ОбработкаДокументаОприходованиеТоваров(ДокОбъект,ДопСвойства);
	
	Операция = "30";
	
	Для каждого СтрокаТЧ Из ДокОбъект.Товары Цикл
		
		НовСтрока = ДопСвойства.ТаблицаДокументов.Добавить();
		
		НовСтрока.Операция 			= Операция;
		НовСтрока.Представление 	= ДокОбъект.Метаданные().Представление();
		НовСтрока.ИдДок			 	= ДокОбъект.Ссылка.УникальныйИдентификатор();
		
		НовСтрока.ДатаДок			= Формат(ДокОбъект.Дата, "ДФ=ггггММддЧЧммсс");
		НовСтрока.НомерДок			= СокрЛП(ДокОбъект.Номер);
		
		НовСтрока.Организация 	 	= ДокОбъект.Организация.УникальныйИдентификатор();
		
		НовСтрока.Номенклатура		= СтрокаТЧ.Номенклатура.УникальныйИдентификатор();
		НовСтрока.Количество		= СтрокаТЧ.Количество * СтрокаТЧ.Коэффициент;
		НовСтрока.Сумма				= СтрокаТЧ.Сумма;
		НовСтрока.ЭтоЛКМ			= Число(СтрокаТЧ.Номенклатура.ВидНоменклатуры = Перечисления.ВидыНоменклатуры.ЛКМ);
		//Число(СтрокаТЧ.Номенклатура.ВидНоменклатуры = Справочники.ВидыНоменклатуры.Краска Или СтрокаТЧ.Номенклатура.ВидНоменклатуры.Наименование = "МКЦ Рецепты");
		
		ДобавитьВТаблицу(СтрокаТЧ.Номенклатура				,7,ДопСвойства);
	КонецЦикла; 
	
	ДобавитьВТаблицу(ДокОбъект.Организация					,1,ДопСвойства);	
	
КонецПроцедуры // ОбработкаДокументаОприходованиеТоваров()

//*******************************************************************************************
// Параметры:
// ----------
// 		Параметр1 - описание параметра
// 		Параметр2 - описание параметра
//
// Описание:
// ---------
// 		Описание процедуры
//
//*******************************************************************************************
Процедура ОбработкаДокументаСписаниеТоваров(ДокОбъект,ДопСвойства);
	
	Операция = "31";
	
	Для каждого СтрокаТЧ Из ДокОбъект.Товары Цикл
		
		НовСтрока = ДопСвойства.ТаблицаДокументов.Добавить();
		
		НовСтрока.Операция 			= Операция;
		НовСтрока.Представление 	= ДокОбъект.Метаданные().Представление();
		НовСтрока.ИдДок			 	= ДокОбъект.Ссылка.УникальныйИдентификатор();
		
		НовСтрока.ДатаДок			= Формат(ДокОбъект.Дата, "ДФ=ггггММддЧЧммсс");
		НовСтрока.НомерДок			= СокрЛП(ДокОбъект.Номер);
		
		НовСтрока.Организация 	 	= ДокОбъект.Организация.УникальныйИдентификатор();
		
		НовСтрока.Номенклатура		= СтрокаТЧ.Номенклатура.УникальныйИдентификатор();
		НовСтрока.Количество		= СтрокаТЧ.Количество * СтрокаТЧ.Коэффициент;
		НовСтрока.Сумма				= СтрокаТЧ.СуммаРозничная;
		НовСтрока.ЭтоЛКМ			= Число(СтрокаТЧ.Номенклатура.ВидНоменклатуры = Перечисления.ВидыНоменклатуры.ЛКМ); 
		//Краска Или СтрокаТЧ.Номенклатура.ВидНоменклатуры.Наименование = "МКЦ Рецепты");
		
		ДобавитьВТаблицу(СтрокаТЧ.Номенклатура	,7,ДопСвойства);
	КонецЦикла; 

	ДобавитьВТаблицу(ДокОбъект.Организация		,1,ДопСвойства);	
КонецПроцедуры // ОбработкаДокументаСписаниеТоваров()

//*******************************************************************************************
// Параметры:
// ----------
// 		Параметр1 - описание параметра
// 		Параметр2 - описание параметра
//
// Описание:
// ---------
// 		Описание процедуры
//
//*******************************************************************************************
Процедура ОбработкаДокументаКомплектация(ДокОбъект,ДопСвойства);
	
	Операция = "32";
	
	Для каждого СтрокаТЧ Из ДокОбъект.Товары Цикл
		
		НовСтрока = ДопСвойства.ТаблицаДокументов.Добавить();
		
		НовСтрока.Операция 			= Операция;
		НовСтрока.Представление 	= ДокОбъект.Метаданные().Представление();
		НовСтрока.ИдДок			 	= ДокОбъект.Ссылка.УникальныйИдентификатор();
		
		НовСтрока.ДатаДок			= Формат(ДокОбъект.Дата, "ДФ=ггггММддЧЧммсс");
		НовСтрока.НомерДок			= СокрЛП(ДокОбъект.Номер);
		
		НовСтрока.Организация 	 	= ДокОбъект.Организация.УникальныйИдентификатор();
		
		НовСтрока.Номенклатура		    = СтрокаТЧ.Номенклатура.УникальныйИдентификатор();
		НовСтрока.Количество		= СтрокаТЧ.Количество * СтрокаТЧ.Коэффициент;
		НовСтрока.ЭтоЛКМ			= Число(СтрокаТЧ.Номенклатура.ВидНоменклатуры = Перечисления.ВидыНоменклатуры.ЛКМ);
		
		Если ДокОбъект.Товары.Индекс(СтрокаТЧ) = 0 Тогда
			НовСтрока.КоличествоКомплект	= СтрокаТЧ.Количество * СтрокаТЧ.Коэффициент;
		КонецЕсли; 
		
		НовСтрока.НоменклатураКомплект		= ДокОбъект.Комплект.УникальныйИдентификатор();
		НовСтрока.КомплектЭтоЛКМ			= Число(СтрокаТЧ.Номенклатура.ВидНоменклатуры = Перечисления.ВидыНоменклатуры.ЛКМ);
		
		ДобавитьВТаблицу(СтрокаТЧ.Номенклатура	,7,ДопСвойства);
	КонецЦикла; 
	
	ДобавитьВТаблицу(ДокОбъект.Комплект		,7,ДопСвойства);	
	ДобавитьВТаблицу(ДокОбъект.Организация		,1,ДопСвойства);	
	
КонецПроцедуры // ОбработкаДокументаКомплектация()

//*******************************************************************************************
// Параметры:
// ----------
// 		Параметр1 - описание параметра
// 		Параметр2 - описание параметра
//
// Описание:
// ---------
// 		Описание процедуры
//
//*******************************************************************************************
Процедура ОбработкаДокументаРеализацияТоваровУслугПродажа(ДокОбъект,ДопСвойства);
	
	//Если Найти(ДокОбъект.ДокументОснование.Renault_ЗаказНаряд.ВидОбслуживания,"ДОП в ДКП Юр. лица") = 1 Тогда
	//	Возврат;
	//КонецЕсли;	
	
	Операция = "02";
	
	СтруктураНаименованиеУид = СформироватьНаименованиеУидДоговора(ДокОбъект,ДокОбъект.ЗаказПокупателя,ДокОбъект.ДоговорВзаиморасчетов);
	
	ДокСФ = Renault_Advanced_УчетНДС.НайтиПодчиненныйДокумент(ДокОбъект, "СчетФактураВыданный");
	
	Для каждого СтрокаТЧ Из ДокОбъект.Запчасти Цикл
		
		НовСтрока = ДопСвойства.ТаблицаДокументов.Добавить();
		
		НовСтрока.Операция 			= Операция;
		НовСтрока.Представление 	= ДокОбъект.Метаданные().Представление();
		НовСтрока.ИдДок			 	= ДокОбъект.Ссылка.УникальныйИдентификатор();
		
		НовСтрока.ДатаДок			= Формат(ДокОбъект.Дата, "ДФ=ггггММддЧЧммсс");
		НовСтрока.НомерДок			= СокрЛП(ДокОбъект.Номер);

		Если ЗначениеЗаполнено(ДокСФ) Тогда
		
			НовСтрока.НомерСФ 	= СокрЛП(ДокСФ.Номер);
			НовСтрока.ДатаСФ	= СокрЛП(ДокСФ.Дата);
		
		КонецЕсли; 

		НовСтрока.Организация 	= ДокОбъект.Организация.УникальныйИдентификатор();
		НовСтрока.Контрагент 	= ДокОбъект.Контрагент.УникальныйИдентификатор();
		НовСтрока.Договор	    = СтруктураНаименованиеУид.УИД;
		
		НовСтрока.Номенклатура	= СтрокаТЧ.Номенклатура.УникальныйИдентификатор();
		НовСтрока.Количество	= СтрокаТЧ.Количество * СтрокаТЧ.Коэффициент;
		НовСтрока.Сумма			= СтрокаТЧ.Сумма + ?(ДокОбъект.СуммаВключаетНДС,0,СтрокаТЧ.СуммаНДС);
		НовСтрока.СуммаНДС		= СтрокаТЧ.СуммаНДС;
		НовСтрока.ЭтоЛКМ		=  Число(СтрокаТЧ.Номенклатура.ВидНоменклатуры = Перечисления.ВидыНоменклатуры.ЛКМ);
		
		// данные для отчета в БУ..
		//--------------------------
		Если ЗначениеЗаполнено(ДокОбъект.ЗаказПокупателя) И ТипЗнч(ДокОбъект.ЗаказПокупателя) = Тип("ДокументСсылка.ЗаказПокупателя") Тогда
			НовСтрока.МаркаАвтомобиля 			=  СокрЛП(ДокОбъект.Автомобиль.Модель);
			НовСтрока.ГосударственныйНомер 		=  СокрЛП(ДокОбъект.Автомобиль.ГосударственныйНомер);
			НовСтрока.НомерНаправления 			=  СокрЛП(ДокОбъект.НомерНаправления);
			НовСтрока.НомерЗаказНаряда          =  СокрЛП(ДокОбъект.Номер);
			НовСтрока.ДатаЗакрытияЗаказНаряда 	=  Формат(ДокОбъект.ДатаЗакрытия, "ДФ=ггггММддЧЧммсс");
		КонецЕсли; 
		
		// если продаем ЛКМ - его нужно сначала переместить с 10 на 41
		//----------------------------------------------------------------
		Если Число(СтрокаТЧ.Номенклатура.ВидНоменклатуры = Перечисления.ВидыНоменклатуры.ЛКМ) Тогда
				
				НовСтрокаПеремещение = ДопСвойства.ТаблицаДокументов.Добавить();
				ЗаполнитьЗначенияСвойств(НовСтрокаПеремещение,НовСтрока);
				
				НовСтрокаПеремещение.Операция 	= "25";
				НовСтрокаПеремещение.ДатаДок  	= Формат(ДокОбъект.Дата - 1, "ДФ=ггггММддЧЧммсс");
		КонецЕсли; 
		
		ДобавитьВТаблицу(СтрокаТЧ.Номенклатура				,7,ДопСвойства);
	КонецЦикла; 
	
	ДобавитьВТаблицу(ДокОбъект.Организация					,1,ДопСвойства);
	ДобавитьВТаблицу(ДокОбъект.Контрагент					,2,ДопСвойства);
	ДобавитьВТаблицу(ДокОбъект.ДоговорВзаиморасчетов			,7,ДопСвойства,СтруктураНаименованиеУид.Наименование,СтруктураНаименованиеУид.УИД, СтруктураНаименованиеУид.ВидДоговора,,ДокОбъект.Контрагент);
	
КонецПроцедуры // ОбработкаДокументаРеализацияЗЧ()

//*******************************************************************************************
// Параметры:
// ----------
// 		Параметр1 - описание параметра
// 		Параметр2 - описание параметра
//
// Описание:
// ---------
// 		Описание процедуры
//
//*******************************************************************************************
Процедура ОбработкаДокументаРеализацияТоваровУслугЗН(ДокОбъект,ДопСвойства);
	
	Если ДокОбъект.СуммаДокумента = 0 Тогда
		Возврат;	
	КонецЕсли; 
	
	Если Не ЗначениеЗаполнено(ДокОбъект.ДоговорВзаиморасчетов.Владелец) и ЗначениеЗаполнено(ДокОбъект.ДоговорВзаиморасчетов) Тогда
		Сообщить("В документе <" + ДокОбъект + "> не указан владелец в договоре! Документ выгружен не будет!",СтатусСообщения.Важное);
		Возврат;
	КонецЕсли; 
	
	Операция = "20";
	
	СтруктураНаименованиеУид = СформироватьНаименованиеУидДоговора(ДокОбъект,ДокОбъект.ЗаказПокупателя,ДокОбъект.ДоговорВзаиморасчетов);
	
	ДокСФ 		= Renault_Advanced_УчетНДС.НайтиПодчиненныйДокумент(ДокОбъект, "СчетФактураВыданный");
	ЭтоГарантия = (ДокОбъект.Обслуживание = Справочники.Renault_Advanced_ТипыОбслуживания.Гарантийный);
	ЭтоЗалог	= (ДокОбъект.ВидОбслуживания = Справочники.Renault_Advanced_ВидыОбслуживания.Залог); 
	
	Попытка
		ВидыОбслуживанияБезРеализаций = ЗначениеИзСтрокиВнутр(СтрВидыОбслуживанияБезРеализаций);
	Исключение
		ВидыОбслуживанияБезРеализаций = Новый СписокЗначений;
	КонецПопытки;	

	// реализации по данному виду обслуживания не выгружаются..
	//--------------------------------------------------------------
	Если ВидыОбслуживанияБезРеализаций.НайтиПоЗначению(ДокОбъект.ВидОбслуживания) = Неопределено Тогда
		
		НовСтрока 	= ДопСвойства.ТаблицаДокументов.Добавить();
		
		НовСтрока.Операция 			= Операция;
		НовСтрока.Представление 	= ДокОбъект.Метаданные().Представление();
		НовСтрока.ИдДок			 	= ДокОбъект.Ссылка.УникальныйИдентификатор();
		
		НовСтрока.ДатаДок			= Формат(ДокОбъект.Дата, "ДФ=ггггММддЧЧммсс");
		НовСтрока.НомерДок			= СокрЛП(ДокОбъект.Номер);
		
		Если ЗначениеЗаполнено(ДокСФ) Тогда
			
			НовСтрока.НомерСФ 	= СокрЛП(ДокСФ.Номер);
			НовСтрока.ДатаСФ	= СокрЛП(ДокСФ.Дата);
			
		КонецЕсли; 
		
		НовСтрока.Организация 	= ДокОбъект.Организация.УникальныйИдентификатор();
		НовСтрока.Контрагент 	= ДокОбъект.Плательщик.УникальныйИдентификатор();
		НовСтрока.Договор 		= СтруктураНаименованиеУид.УИД;
		
		НовСтрока.Количество	= (ДокОбъект.Запчасти.Итог("Количество") * ДокОбъект.Запчасти.Итог("Коэффициент")) 
		+ ДокОбъект.Работы.Итог("Количество");
		
		НовСтрока.Сумма			= (ДокОбъект.Запчасти.Итог("Сумма")  + ?(ДокОбъект.СуммаВключаетНДС,0,ДокОбъект.Запчасти.Итог("СуммаНДС"))) 
		+ (ДокОбъект.Работы.Итог("Сумма")  + ?(ДокОбъект.СуммаВключаетНДС,0,ДокОбъект.Работы.Итог("СуммаНДС")));
		
		НовСтрока.СуммаНДС		= ?(ЭтоГарантия, 0, ДокОбъект.Запчасти.Итог("СуммаНДС") + ДокОбъект.Работы.Итог("СуммаНДС"));
		НовСтрока.ЭтоУслуга		= 1;		
		НовСтрока.ЭтоГарантия	= Число(ЭтоГарантия);	
		
		// данные для отчета в БУ..
		//--------------------------
		Если ЗначениеЗаполнено(ДокОбъект.ЗаказПокупателя) И ТипЗнч(ДокОбъект.ЗаказПокупателя) = Тип("ДокументСсылка.ЗаказПокупателя") Тогда
			
			НовСтрока.МаркаАвтомобиля 			=  СокрЛП(ДокОбъект.Автомобиль.Модель);
			НовСтрока.ГосударственныйНомер 		=  СокрЛП(ДокОбъект.Автомобиль.ГосударственныйНомер);
			НовСтрока.НомерНаправления 			=  СокрЛП(УбратьСлужебныеСимволы(ДокОбъект.НомерНаправления));
			НовСтрока.НомерЗаказНаряда          =  СокрЛП(ДокОбъект.Номер);
			НовСтрока.ДатаЗакрытияЗаказНаряда 	=  Формат(ДокОбъект.ДатаЗакрытия, "ДФ=ггггММддЧЧммсс");
			
		КонецЕсли; 
		
		ДобавитьВТаблицу(ДокОбъект.Организация				,1,ДопСвойства);
		ДобавитьВТаблицу(ДокОбъект.Плательщик				,2,ДопСвойства);
		ДобавитьВТаблицу(ДокОбъект.ДоговорВзаиморасчетов	,7,ДопСвойства,СтруктураНаименованиеУид.Наименование,СтруктураНаименованиеУид.УИД, СтруктураНаименованиеУид.ВидДоговора,,ДокОбъект.Плательщик);
		
	КонецЕсли;
	
	Если ДокОбъект.Запчасти.Количество() Тогда
	
		ОбработкаДокументаТребованиеНакладная(ДокОбъект,ДопСвойства)
	
	КонецЕсли; 

КонецПроцедуры // ОбработкаДокументаРеализацияЗаказНаряда()

//*******************************************************************************************
// Параметры:
// ----------
// 		Параметр1 - описание параметра
// 		Параметр2 - описание параметра
//
// Описание:
// ---------
// 		Описание процедуры
//
//*******************************************************************************************
Процедура ОбработкаДокументаТребованиеНакладная(ДокОбъект,ДопСвойства);
	
	ОперацияПеремещение = "21";
	ОперацияТН				 = "22";
	
	ИмяТЧ = ?(ТипЗнч(ДокОбъект) = Тип("ДокументСсылка.ТребованиеНакладная"),"Материалы","Товары");
	
	Если Не ДокОбъект[ИмяТЧ].Количество() Тогда
		Возврат;
	КонецЕсли; 
	
	// определяемся со счетом затрат..
	//----------------------------------
	СчетЗатрат = "20";
	//Если ТипЗнч(ДокОбъект) = Тип("ДокументСсылка.ТребованиеНакладная") Тогда
	//	
	//	ДокЗН = Документы.бит_ус_ЗаказНаряд.ПустаяСсылка();
	//	
	//	ДокЗаказ = ДокОбъект.Материалы[0].ЗаказРезерв;
	//	Если ТипЗнч(ДокЗаказ) = Тип("ДокументСсылка.ЗаказПокупателя") Тогда
	//		ДокЗН = ДокЗаказ.бит_ЗаказНаряд;
	//	КонецЕсли;
	//	
	//	Если ЗначениеЗаполнено(ДокЗН) Тогда
	//		СчетЗатрат = ?(ДокЗН.Заказчик = ДокЗН.Плательщик,"26","44");
	//	КонецЕсли; 
	//КонецЕсли;	
	
	Для каждого СтрокаТЧ Из ДокОбъект[ИмяТЧ] Цикл
		
		// отражается списание материалов в НЗП..
		//------------------------------------------
		НовСтрокаТН = ДопСвойства.ТаблицаДокументов.Добавить();
		
		НовСтрокаТН.Операция 		 	= ОперацияТН;
		НовСтрокаТН.Представление 	= ДокОбъект.Метаданные().Представление();
		НовСтрокаТН.ИдДок			 		= ДокОбъект.Ссылка.УникальныйИдентификатор();
			
		НовСтрокаТН.ДатаДок				= Формат(ДокОбъект.Дата - 1, "ДФ=ггггММддЧЧммсс");
		НовСтрокаТН.НомерДок			= СокрЛП(ДокОбъект.Номер);
			
		НовСтрокаТН.Организация 	 	= ДокОбъект.Организация.УникальныйИдентификатор();
			
		НовСтрокаТН.Номенклатура		= СтрокаТЧ.Номенклатура.УникальныйИдентификатор();
		НовСтрокаТН.Количество			= СтрокаТЧ.Количество * СтрокаТЧ.Коэффициент;
		
		НовСтрокаТН.ЭтоЛКМ			 	= Число(СтрокаТЧ.Номенклатура.ВидНоменклатуры = Перечисления.ВидыНоменклатуры.ЛКМ);
		НовСтрокаТН.СчетЗатрат 		 	= СчетЗатрат;
		НовСтрокаТН.Подразделение 	= ДокОбъект.Подразделение.УникальныйИдентификатор();

		// если у нас в ЗН использовались обычные запчасти (не ЛКМ) - 
		// сначала отразим перемещение товаров для производства
		// с 41 счета на 10.01..
		//----------------------------------------------------------
		Если Не (СтрокаТЧ.Номенклатура.ВидНоменклатуры = Справочники.ВидыНоменклатуры.Краска Или СтрокаТЧ.Номенклатура.ВидНоменклатуры.Наименование = "МКЦ Рецепты") Тогда
			
			НовСтрока = ДопСвойства.ТаблицаДокументов.Добавить();
			ЗаполнитьЗначенияСвойств(НовСтрока,НовСтрокаТН);
			НовСтрока.Операция = ОперацияПеремещение;
		КонецЕсли; 
		
		ДобавитьВТаблицу(СтрокаТЧ.Номенклатура				,7,ДопСвойства);		
		
	КонецЦикла; 		

	ДобавитьВТаблицу(ДокОбъект.Организация					,1,ДопСвойства);
	ДобавитьВТаблицу(ДокОбъект.Подразделение				,7,ДопСвойства);	
КонецПроцедуры // ОбработкаДокументаТребованиеНакладная()

//*******************************************************************************************
// Параметры:
// ----------
// 		Параметр1 - описание параметра
// 		Параметр2 - описание параметра
//
// Описание:
// ---------
// 		Описание процедуры
//
//*******************************************************************************************
Процедура ОбработкаДокументаКорректировкаРеализации(ДокОбъект,ДопСвойства);
	
	Если Не ЗначениеЗаполнено(ДокОбъект.ДокументОснование) Тогда
		Сообщить("В документе <" + ДокОбъект + "> не указан корректируемый документ реализации! Документ выгружен не будет!",СтатусСообщения.Внимание);
		Возврат;
	КонецЕсли; 
	
	ЭтоКорректировкаПрошлогоПериода = Не (КонецКвартала(ДокОбъект.Дата) = КонецКвартала(ДокОбъект.ДокументОснование.Дата));
	
	// корректировать документы прошлого периода
	// можно в течение 14 дней после окончания квартала..
	//-------------------------------------------------------
	Если ЭтоКорректировкаПрошлогоПериода 
		И Число(ДокОбъект.Дата - КонецКвартала(ДокОбъект.ДокументОснование.Дата))/86400 > 14 Тогда
		
		Сообщить("Документ <" + ДокОбъект + "> корректирует реализацию <" + ДокОбъект.ДокументОснование + "> - со дня отгрузки прошло более 14 дней! Документ выгружен не будет!",СтатусСообщения.Внимание);
		Возврат;
	КонецЕсли;	
	
	ЭтоКорректировкаРеализацииЗЧ = Истина;
	
	//Если ЗначениеЗаполнено(ДокОбъект.ДокументОснование.Renault_ЗаказНаряд) И
	//		Не (ДокОбъект.ДокументРеализации.Сделка.Renault_ЗаказНаряд.ВидОперации = Перечисления.Renault_Advanced_ВидыОперацийЗаказНаряд.Реализация) Тогда
	//	
	//	ЭтоКорректировкаРеализацииЗЧ = Ложь;
	//КонецЕсли; 
	
	Операция	= ?(ЭтоКорректировкаРеализацииЗЧ,"04","26");
	
	СтруктураНаименованиеУид = СформироватьНаименованиеУидДоговора(ДокОбъект,ДокОбъект.ДокументОснование,ДокОбъект.ДокументОснование.ДоговорВзаиморасчетов);
	
	ДокСФ = Renault_Advanced_УчетНДС.НайтиПодчиненныйДокумент(ДокОбъект, "СчетФактураВыданный");
	
	Для каждого СтрокаТЧ Из ДокОбъект.Товары Цикл
		
		НовСтрока = ДопСвойства.ТаблицаДокументов.Добавить();
		
		НовСтрока.Операция 			= Операция;
		НовСтрока.Представление 	= ДокОбъект.Метаданные().Представление();
		НовСтрока.ИдДок			 	= ДокОбъект.Ссылка.УникальныйИдентификатор();
		НовСтрока.ДокОснование		= ДокОбъект.ДокументОснование.УникальныйИдентификатор();
		
		НовСтрока.ДатаДок				= Формат(ДокОбъект.Дата, "ДФ=ггггММддЧЧммсс");
		НовСтрока.НомерДок			= СокрЛП(ДокОбъект.Номер);

		НовСтрока.Организация 	 	= ДокОбъект.Организация.УникальныйИдентификатор();
		НовСтрока.Контрагент 	 	= ДокОбъект.ДокументОснование.Контрагент.УникальныйИдентификатор();
		НовСтрока.Договор 			= СтруктураНаименованиеУид.УИД;
		
		НовСтрока.Номенклатура		= СтрокаТЧ.Номенклатура.УникальныйИдентификатор();
		НовСтрока.Количество			= 0; 
		НовСтрока.Сумма				= 0;
		НовСтрока.СуммаНДС			= 0;
		НовСтрока.ЭтоЛКМ			= Число(СтрокаТЧ.Номенклатура.ВидНоменклатуры = Перечисления.ВидыНоменклатуры.ЛКМ);
		
		НовСтрока.ЭтоКорректировкаПрошлогоПериода = Число(ЭтоКорректировкаПрошлогоПериода); 
		
		//Если ЭтоКорректировкаРеализацииЗЧ И НовСтрока.ЭтоЛКМ = 1 Тогда
		//	
		//	НовСтрокаПеремещение = ДопСвойства.ТаблицаДокументов.Добавить();
		//	ЗаполнитьЗначенияСвойств(НовСтрокаПеремещение,НовСтрока);
		//		
		//	НовСтрокаПеремещение.Операция 	= "25";
		//КонецЕсли; 
		
		ДобавитьВТаблицу(СтрокаТЧ.Номенклатура										,7,ДопСвойства);
	КонецЦикла; 

	ДобавитьВТаблицу(ДокОбъект.Организация											,1,ДопСвойства);
	ДобавитьВТаблицу(ДокОбъект.ДокументОснование.Контрагент				,2,ДопСвойства);
	ДобавитьВТаблицу(ДокОбъект.ДокументОснование.ДоговорВзаиморасчетов	,7,ДопСвойства,СтруктураНаименованиеУид.Наименование,СтруктураНаименованиеУид.УИД, СтруктураНаименованиеУид.ВидДоговора,,ДокОбъект.ДокументОснование.Контрагент);
	
КонецПроцедуры // ОбработкаДокументаРеализацияЗЧ()

//*******************************************************************************************
// Параметры:
// ----------
// 		Параметр1 - описание параметра
// 		Параметр2 - описание параметра
//
// Описание:
// ---------
// 		Описание процедуры
//
//*******************************************************************************************
Процедура ОбработкаДокументаВозвратТоваровОтПокупателя(ДокОбъект,ДопСвойства);
	
	Если Не ДокОбъект.Товары.Количество() Тогда
		Возврат;
	КонецЕсли; 
	
	ДокОснование = ДокОбъект.Товары[0].Партия;
	
	Если Не ЗначениеЗаполнено(ДокОснование) Тогда
		Сообщить("В документе <" + ДокОбъект + "> не указан документ реализации! Документ выгружен не будет!",СтатусСообщения.Внимание);
		Возврат;
	КонецЕсли; 
	
	ЭтоВозвратЗЧ = Истина;
	
	//Если ЗначениеЗаполнено(ДокОснование.Сделка.бит_ЗаказНаряд) И
	//		Не (ДокОснование.Сделка.бит_ЗаказНаряд.пацВидОперации = Перечисления.пацВидыОперацийЗаказНаряд.Реализация) Тогда
	//	
	//	ЭтоВозвратЗЧ = Ложь;
	//КонецЕсли; 
	
	Операция	= ?(ЭтоВозвратЗЧ,"03","24");
	
	СтруктураНаименованиеУид = СформироватьНаименованиеУидДоговора(ДокОбъект,ДокОснование.Сделка,ДокОснование.ДоговорВзаиморасчетов);
	
	ДокСФ = Renault_Advanced_УчетНДС.НайтиПодчиненныйДокумент(ДокОбъект, "СчетФактураВыданный");
	
	ЭтоКорректировкаПрошлогоПериода = Не (КонецКвартала(ДокОбъект.Дата) = КонецКвартала(ДокОснование.Дата));
	
	Для каждого СтрокаТЧ Из ДокОбъект.Товары Цикл
		
		НовСтрока = ДопСвойства.ТаблицаДокументов.Добавить();
		
		НовСтрока.Операция 			= Операция;
		НовСтрока.Представление 	= ДокОбъект.Метаданные().Представление();
		НовСтрока.ИдДок			 	= ДокОбъект.Ссылка.УникальныйИдентификатор();
		НовСтрока.ДокОснование		= СтрокаТЧ.Партия.УникальныйИдентификатор();
		
		НовСтрока.ДатаДок			= Формат(ДокОбъект.Дата, "ДФ=ггггММддЧЧммсс");
		НовСтрока.НомерДок			= СокрЛП(ДокОбъект.Номер);

		НовСтрока.Организация 	 	= ДокОбъект.Организация.УникальныйИдентификатор();
		НовСтрока.Контрагент 	 	= СтрокаТЧ.Партия.Контрагент.УникальныйИдентификатор();
		НовСтрока.Договор 			= СтруктураНаименованиеУид.УИД;
		
		НовСтрока.Номенклатура		= СтрокаТЧ.Номенклатура.УникальныйИдентификатор();
		НовСтрока.Количество		= СтрокаТЧ.Количество;
		НовСтрока.Сумма				= СтрокаТЧ.СуммаРозничная;
		//НовСтрока.СуммаНДС			= СтрокаТЧ.СуммаНДС;
		НовСтрока.ЭтоЛКМ			= Число(СтрокаТЧ.Номенклатура.ВидНоменклатуры = Перечисления.ВидыНоменклатуры.ЛКМ);
		НовСтрока.Подразделение 	= ДокОбъект.ПодразделениеКомпании.УникальныйИдентификатор();		
		
		НовСтрока.ЭтоКорректировкаПрошлогоПериода = Число(ЭтоКорректировкаПрошлогоПериода); 
		
		// для отражения перемещения запчастей по зн из 10.01 в 41.01..
		//----------------------------------------------------------------
		Если Не ЭтоВозвратЗЧ И (НовСтрока.ЭтоЛКМ = 0) Тогда
			
			НовСтрокаПеремещение = ДопСвойства.ТаблицаДокументов.Добавить();
			ЗаполнитьЗначенияСвойств(НовСтрокаПеремещение,НовСтрока);
			
			НовСтрокаПеремещение.Операция 	= "25";
			НовСтрокаПеремещение.Количество	= СтрокаТЧ.Количество;
		КонецЕсли; 
		
		ДобавитьВТаблицу(СтрокаТЧ.ДокументПартии.Контрагент			,2,ДопСвойства);
		ДобавитьВТаблицу(СтрокаТЧ.ДокументПартии.ДоговорВзаиморасчетов	,7,ДопСвойства,СтруктураНаименованиеУид.Наименование,СтруктураНаименованиеУид.УИД, СтруктураНаименованиеУид.ВидДоговора,,СтрокаТЧ.ДокументПартии.Контрагент);
		ДобавитьВТаблицу(СтрокаТЧ.Номенклатура						,7,ДопСвойства);
	КонецЦикла; 
	
	ДобавитьВТаблицу(ДокОбъект.Организация							,1,ДопСвойства);
	ДобавитьВТаблицу(ДокОбъект.Подразделение						,7,ДопСвойства);
	
	Если ЭтоВозвратЗЧ Тогда
		Возврат;
	КонецЕсли; 
	
КонецПроцедуры // ОбработкаДокументаВозвратТоваровОтПокупателя()

//*******************************************************************************************
// Параметры:
// ----------
// 		Параметр1 - описание параметра
// 		Параметр2 - описание параметра
//
// Описание:
// ---------
// 		Описание процедуры
//
//*******************************************************************************************
Процедура ОбработкаДокументаВозвратТоваровПоставщику(ДокОбъект,ДопСвойства);
	
	Операция = "02";
	
	СтруктураНаименованиеУид = СформироватьНаименованиеУидДоговора(ДокОбъект,ДокОбъект.Сделка,ДокОбъект.ДоговорВзаиморасчетов);
	
	ДокСФ = Renault_Advanced_УчетНДС.НайтиПодчиненныйДокумент(ДокОбъект, "СчетФактураВыданный");
	
	Для каждого СтрокаТЧ Из ДокОбъект.Товары Цикл
		
		НовСтрока = ДопСвойства.ТаблицаДокументов.Добавить();
		
		НовСтрока.Операция 			= Операция;
		НовСтрока.Представление 	= ДокОбъект.Метаданные().Представление();
		НовСтрока.ИдДок			 	= ДокОбъект.Ссылка.УникальныйИдентификатор();
		
		НовСтрока.ДатаДок				= Формат(ДокОбъект.Дата, "ДФ=ггггММддЧЧммсс");
		НовСтрока.НомерДок			= СокрЛП(ДокОбъект.Номер);

		Если ЗначениеЗаполнено(ДокСФ) Тогда
		
			НовСтрока.НомерСФ = СокрЛП(ДокСФ.Номер);
			НовСтрока.ДатаСФ	 = СокрЛП(ДокСФ.Дата);
		
		КонецЕсли; 

		НовСтрока.Организация 	 	= ДокОбъект.Организация.УникальныйИдентификатор();
		НовСтрока.Контрагент 	 		= ДокОбъект.Контрагент.УникальныйИдентификатор();
		НовСтрока.Договор 				= СтруктураНаименованиеУид.УИД;
		
		НовСтрока.Номенклатура		= СтрокаТЧ.Номенклатура.УникальныйИдентификатор();
		НовСтрока.Количество			= СтрокаТЧ.Количество * СтрокаТЧ.Коэффициент;
		НовСтрока.Сумма				= СтрокаТЧ.Сумма + ?(ДокОбъект.СуммаВключаетНДС,0,СтрокаТЧ.СуммаНДС);
		НовСтрока.СуммаНДС			= СтрокаТЧ.СуммаНДС;
		НовСтрока.ЭтоЛКМ			= Число(СтрокаТЧ.Номенклатура.ВидНоменклатуры = Перечисления.ВидыНоменклатуры.ЛКМ);
		
		ДобавитьВТаблицу(СтрокаТЧ.Номенклатура				,7,ДопСвойства);
	КонецЦикла; 

	ДобавитьВТаблицу(ДокОбъект.Организация					,1,ДопСвойства);
	ДобавитьВТаблицу(ДокОбъект.Контрагент						,2,ДопСвойства);
	ДобавитьВТаблицу(ДокОбъект.ДоговорВзаиморасчетов			,7,ДопСвойства,СтруктураНаименованиеУид.Наименование,СтруктураНаименованиеУид.УИД, СтруктураНаименованиеУид.ВидДоговора,,ДокОбъект.Контрагент);
	
КонецПроцедуры // ОбработкаДокументаРеализацияЗЧ()

//*******************************************************************************************
// Параметры:
// ----------
// 		Параметр1 - описание параметра
// 		Параметр2 - описание параметра
//
// Описание:
// ---------
// 		Описание процедуры
//
//*******************************************************************************************
Процедура ОбработкаДокументаПКО(ДокОбъект,ДопСвойства);
	
	Если ТипЗнч(ДокОбъект) = Тип("ДокументСсылка.ПриходныйКассовыйОрдер") Тогда
		
		Если Не ДокОбъект.ХозОперация = Справочники.ХозОперации.ПриходныйКассовыйОрдер Тогда
			
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = "Ошибка при выгрузке документа <" + ДокОбъект + ">: выгрузка документов с видом операции " + СокрЛП(ДокОбъект.ВидОперации) + " не предусмотрена!";
			Сообщение.Сообщить(); 
			Возврат;
			
		КонецЕсли; 
		
		Касса = ДокОбъект.КассаКомпании;	
	КонецЕсли; 
	
	Если ТипЗнч(ДокОбъект) = Тип("ДокументСсылка.ЧекНаОплату") Тогда
		
		Если Не ДокОбъект.ХозОперация = Справочники.ХозОперации.ЧекНаОплату Тогда
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = "Ошибка при выгрузке документа <" + ДокОбъект + ">: выгрузка документов с видом операции " + СокрЛП(ДокОбъект.ВидОперации) + " не предусмотрена!";
			Сообщение.Сообщить(); 
			Возврат;
		КонецЕсли;
		
		Касса = ДокОбъект.КассаКомпании;
		
		Если Не ЗначениеЗаполнено(Касса) Тогда
			Касса = ПолучитьКассуПоПодразделению(ДокОбъект.Подразделение);
		КонецЕсли;	
		
		Если Не ЗначениеЗаполнено(Касса) Тогда
			Сообщить("Не удалось получить кассу для подразделения <" + ДокОбъект.ПодразделениеКомпании + "> в документе <" + ДокОбъект + ">!",СтатусСообщения.Внимание);
			Возврат;
		КонецЕсли; 
	КонецЕсли; 
	
	Операция = "15";
	
	ОплатаПолиса = ПолучитьОплатуСтраховогоПолиса(ДокОбъект);
	
	//Для каждого СтрокаТЧ Из ДокОбъект.Оплата Цикл
		
		СтруктураНаименованиеУид = СформироватьНаименованиеУидДоговора(ДокОбъект,ДокОбъект.Сделка,ДокОбъект.ДоговорВзаиморасчетов);
		
		ЭтоЗалог 				    = Ложь;
		ЭтоПродленнаяГарантия 	    = Ложь;
		ЭтоПродленнаяГарантияКардиф = Ложь;
		
		//Если ТипЗнч(СтрокаТЧ.Сделка)  = Тип("ДокументСсылка.ЗаказПокупателя") Тогда
		//	
		//	ЭтоЗалог 						= (СтрокаТЧ.Сделка.бит_ЗаказНаряд.пацВидОбслуживания = Справочники.пацВидыОбслуживания.Залог); 
		//	ЭтоПродленнаяГарантия 	= (СтрокаТЧ.Сделка.бит_ЗаказНаряд.пацВидОбслуживания = Справочники.пацВидыОбслуживания.Карта) Или (СтрокаТЧ.Сделка.бит_ЗаказНаряд.пацВидОбслуживания = Справочники.пацВидыОбслуживания.КартаПомощь); 
		//	//ПАЦ Тишин 24.09.2015 +++
		//	ЭтоПродленнаяГарантияКардиф = СтрокаТЧ.Сделка.бит_ЗаказНаряд.пацВидОбслуживания.КартаПродленнаяГарантия И СтрокаТЧ.Сделка.бит_ЗаказНаряд.пацВидОбслуживания = Справочники.пацВидыОбслуживания.НайтиПоКоду("000000231"); 
		//	//ПАЦ Тишин 24.09.2015 ---
		//	Если Не ЭтоПродленнаяГарантия И ЗначениеЗаполнено(СписокПодразделенийПродленнаяГарантия) Тогда
		//		
		//		ПодразделенияПродлГарантия = ЗначениеИзСтрокиВнутр(СписокПодразделенийПродленнаяГарантия);
		//		
		//		ЭтоПродленнаяГарантия = Не (ПодразделенияПродлГарантия.НайтиПоЗначению(СтрокаТЧ.Сделка.бит_ЗаказНаряд.Подразделение) = Неопределено);
		//		
		//	КонецЕсли;	
		//
		//КонецЕсли; 
		
		
		НовСтрока = ДопСвойства.ТаблицаДокументов.Добавить();
		
		НовСтрока.Операция 			= Операция;
		НовСтрока.Представление 	= ДокОбъект.Метаданные().Представление();
		НовСтрока.ДатаДок			= Формат(ДокОбъект.Дата, "ДФ=ггггММддЧЧммсс");
		НовСтрока.НомерДок			= СокрЛП(ДокОбъект.Номер);
		НовСтрока.ИдДок			 	= ДокОбъект.Ссылка.УникальныйИдентификатор();
		НовСтрока.Организация 	 	= ДокОбъект.Организация.УникальныйИдентификатор();
		
		// в случае если это оплата страхования - то мы договора
		// будем генерировать по наименованию уже в БУ..
		//---------------------------------------------------------
		Если ЗначениеЗаполнено(ОплатаПолиса) Тогда
			
			Контрагент = ОплатаПолиса.СтраховойПолис.СтраховаяКомпания;
			
			НовСтрока.Контрагент 	 	= Контрагент.УникальныйИдентификатор();
			НовСтрока.Договор			= Справочники.ДоговорыВзаиморасчетов.ПустаяСсылка().УникальныйИдентификатор();
			
		Иначе	
			
			Контрагент = ДокОбъект.Контрагент;
			
			НовСтрока.Контрагент 	 	= ДокОбъект.Контрагент.УникальныйИдентификатор();
			НовСтрока.Договор 			= ?(ЗначениеЗаполнено(СтруктураНаименованиеУид.УИД),СтруктураНаименованиеУид.УИД,ДокОбъект.ДоговорВзаиморасчетов.УникальныйИдентификатор());
			
			ДобавитьВТаблицу(ДокОбъект.ДоговорВзаиморасчетов		,7,ДопСвойства,СтруктураНаименованиеУид.Наименование,СтруктураНаименованиеУид.УИД, СтруктураНаименованиеУид.ВидДоговора	);
		КонецЕсли; 
		
		//НовСтрока.Касса 			= Касса.УникальныйИдентификатор();
		НовСтрока.Сумма				= ДокОбъект.СуммаДокумента;
		
		НовСтрока.ЭтоОплатаСтрахования        = Число(ЗначениеЗаполнено(ОплатаПолиса));
		НовСтрока.НомерПолиса				  = СокрЛП(ОплатаПолиса.СтраховойПолис.Номер);
		НовСтрока.ДатаПолиса				  = Формат(ОплатаПолиса.СтраховойПолис.Дата, "ДФ=ггггММдд");
		НовСтрока.ЭтоЗалог					  = ЭтоЗалог;
		НовСтрока.ЭтоПродленнаяГарантия       = ЭтоПродленнаяГарантия;
		НовСтрока.ЭтоПродленнаяГарантияКардиф = ЭтоПродленнаяГарантияКардиф;
		
		Если ЭтоПродленнаяГарантия ИЛИ ЭтоПродленнаяГарантияКардиф Тогда	
			НовСтрока.ВИН = (НовСтрока.Сделка.Renault_ЗаказНаряд.Автомобиль.VIN);
		КонецЕсли;	
		
	//КонецЦикла; 
	
	ДобавитьВТаблицу(ДокОбъект.Организация				,1,ДопСвойства);
	ДобавитьВТаблицу(Контрагент							,2,ДопСвойства);
	ДобавитьВТаблицу(Касса								,7,ДопСвойства);	
	
КонецПроцедуры // ОбработкаДокументаПКО()

//*******************************************************************************************
// Параметры:
// ----------
// 		Параметр1 - описание параметра
// 		Параметр2 - описание параметра
//
// Описание:
// ---------
// 		Описание процедуры
//
//*******************************************************************************************
Процедура ОбработкаДокументаППИ(ДокОбъект,ДопСвойства);
	
	//ДатаДок = ?(ЗначениеЗаполнено(ДокОбъект.ДатаОплаты),ДокОбъект.ДатаОплаты,ДокОбъект.Дата);
	ДатаДок = ДокОбъект.Дата;
	
	// оплата поставщику за а/м
	// в бух-ии разбивается на 2 документа:
	// возврат товаров поставщику и поступление товаров..
	//---------------------------------------------------
	//Для каждого СтрокаТЧ Из ДокОбъект.Платежи Цикл
		
		НовСтрока = ДопСвойства.ТаблицаДокументов.Добавить();
		
		НовСтрока.Операция 			= "12";
		НовСтрока.Представление 	= ДокОбъект.Метаданные().Представление();
		НовСтрока.ДатаДок			= Формат(ДатаДок, "ДФ=ггггММддЧЧммсс");
		НовСтрока.НомерДок			= СокрЛП(ДокОбъект.Номер);
		НовСтрока.ИдДок			 	= ДокОбъект.Ссылка.УникальныйИдентификатор();
		НовСтрока.Организация 	 	= ДокОбъект.Организация.УникальныйИдентификатор();
		НовСтрока.Контрагент 	 	= ДокОбъект.Контрагент.УникальныйИдентификатор();
		НовСтрока.Договор 			= ДокОбъект.ДоговорВзаиморасчетов.УникальныйИдентификатор();
		//НовСтрока.Номенклатура		= ДокОбъект.Автомобиль.УникальныйИдентификатор();
		//НовСтрока.Автомобиль 		= СтрокаТЧ.Автомобиль.УникальныйИдентификатор();
		НовСтрока.ДокОснование 	    = ДокОбъект.ДокументОснование.УникальныйИдентификатор();   // сделано для того, чтобы по каждому а/м формировался отдельный документ
		НовСтрока.Сумма				= ДокОбъект.СуммаДокумента;
		НовСтрока.Количество		= 1;
		
		НовСтрокаВозврат = ДопСвойства.ТаблицаДокументов.Добавить();
		
		ЗаполнитьЗначенияСвойств(НовСтрокаВозврат,НовСтрока);
		
		НовСтрокаВозврат.Операция 	= "16";
		
		ДобавитьВТаблицу(ДокОбъект.ДоговорВзаиморасчетов						,7,ДопСвойства,,,,,ДокОбъект.Контрагент);
		//ДобавитьВТаблицу(СтрокаТЧ.Автомобиль					,2,ДопСвойства);
	//КонецЦикла; 
	
	ДобавитьВТаблицу(ДокОбъект.Организация				,1,ДопСвойства);
	ДобавитьВТаблицу(ДокОбъект.Контрагент				,2,ДопСвойства);

КонецПроцедуры // ОбработкаДокументаППИ()

//*******************************************************************************************
// Параметры:
// ----------
// 		Параметр1 - описание параметра
// 		Параметр2 - описание параметра
//
// Описание:
// ---------
// 		Описание процедуры
//
//*******************************************************************************************
Процедура ОбработкаДокументаРКО(ДокОбъект,ДопСвойства);
	
	ЭлементСписка = ДопСвойства.сзОперацииРКО.НайтиПоЗначению(ДокОбъект.ХозОперация);
	
	Операция = "";
	Если ЭлементСписка = Неопределено Тогда
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Ошибка при выгрузке документа <" + ДокОбъект + ">: выгрузка документов с видом операции " + СокрЛП(ДокОбъект.ВидОперации) + " не предусмотрена!";
		Сообщение.Сообщить(); 
		Возврат;
	КонецЕсли; 
	
	Операция = ЭлементСписка.Представление;
	
	Касса = ДокОбъект.КассаКомпании;	
	
	//Для каждого СтрокаТЧ Из ДокОбъект.РасшифровкаПлатежа Цикл
		
		СтруктураНаименованиеУид = СформироватьНаименованиеУидДоговора(ДокОбъект,ДокОбъект.Сделка,ДокОбъект.ДоговорВзаиморасчетов);
		
		НовСтрока = ДопСвойства.ТаблицаДокументов.Добавить();
		
		НовСтрока.Операция 			= Операция;
		НовСтрока.Представление 	= ДокОбъект.Метаданные().Представление();
		НовСтрока.ДатаДок			= Формат(ДокОбъект.Дата, "ДФ=ггггММддЧЧммсс");
		НовСтрока.НомерДок			= СокрЛП(ДокОбъект.Номер);
		НовСтрока.ИдДок			 	= ДокОбъект.Ссылка.УникальныйИдентификатор();
		НовСтрока.Организация 	 	= ДокОбъект.Организация.УникальныйИдентификатор();
		НовСтрока.РасчетныйСчет	    = ДокОбъект.Организация.ОсновнойБанковскийСчет.УникальныйИдентификатор();
		НовСтрока.Касса 			= Касса.УникальныйИдентификатор();
		НовСтрока.Сумма				= ДокОбъект.СуммаДокумента;
		
		Если Операция = "40" Тогда // инкассация
			
			НовСтрока.Выдать		= УбратьСлужебныеСимволы(СокрЛП(ДокОбъект.Выдать));
			НовСтрока.Приложение	= УбратьСлужебныеСимволы(СокрЛП(ДокОбъект.Приложение));
		
		ИначеЕсли Операция = "41" Тогда // выдача з/п
			
			НовСтрока.Выдать		= "Сотрудники";
			НовСтрока.Приложение	= "Платежная ведомость";
			
		ИначеЕсли	Операция = "42" Тогда // возрат д/с
			
			Контрагент = ДокОбъект.Контрагент;
			
			//Если ДокОбъект.ДоговорВзаиморасчетов.Автодоговор.СпособОплаты = Перечисления.СпособыОплаты.Лизинг 
			//	И ЗначениеЗаполнено(ДокОбъект.ДоговорВзаиморасчетов.Автодоговор.Плательщик) Тогда
			//	Контрагент =	ДокОбъект.ДоговорВзаиморасчетов.Автодоговор.Плательщик;
			//КонецЕсли;	
			
			Договор = ДокОбъект.ДоговорВзаиморасчетов;

			НовСтрока.Контрагент 		= Контрагент.УникальныйИдентификатор();
			НовСтрока.Договор			= Договор.УникальныйИдентификатор();
				
			НовСтрока.Выдать		= УбратьСлужебныеСимволы(СокрЛП(ДокОбъект.Контрагент.Наименование));
			НовСтрока.Приложение	= "Заявление, касовый чек, договор";
			НовСтрока.СуммаНДС  	= ДокОбъект.СуммаНДС;

			ДобавитьВТаблицу(Контрагент	,2,ДопСвойства);
			ДобавитьВТаблицу(Договор		,7,ДопСвойства,,,"С покупателем",,Контрагент);
			
		ИначеЕсли Операция = "43" Тогда // выдача подотчетнику
			
			НовСтрока.Контрагент = ДокОбъект.Контрагент.УникальныйИдентификатор();
			НовСтрока.Выдать	 = УбратьСлужебныеСимволы(СокрЛП(ДокОбъект.Контрагент.Наименование));
			
			ДобавитьВТаблицу(ДокОбъект.Контрагент,2,ДопСвойства);
			
		ИначеЕсли	Операция = "44" Тогда // оплата поставщику
			
			НовСтрока.Контрагент 		= ДокОбъект.Контрагент.УникальныйИдентификатор();
			НовСтрока.Договор			= ДокОбъект.ДоговорВзаиморасчетов.УникальныйИдентификатор();
			НовСтрока.СуммаНДС  		= ДокОбъект.СуммаНДС;
			НовСтрока.Выдать			= УбратьСлужебныеСимволы(СокрЛП(ДокОбъект.Контрагент.Наименование));

			ДобавитьВТаблицу(Контрагент						,2,ДопСвойства);
			ДобавитьВТаблицу(ДокОбъект.ДоговорВзаиморасчетов	,7,ДопСвойства,,,"С комитентом",,Контрагент);
			
		КонецЕсли;

	//КонецЦикла; 
	
	ДобавитьВТаблицу(ДокОбъект.Организация	,1,ДопСвойства);
	ДобавитьВТаблицу(Касса					,7,ДопСвойства);	
	
КонецПроцедуры // ОбработкаДокументаПКО()

Процедура ОбработкаДокументаПереходПраваСобственности(ДокОбъект,ДопСвойства)
	
	Операция = "13";
	
	Отбор = Новый Структура("Организация,РазделУчета",ДокОбъект.Организация,Перечисления.квРазделыУчетаВзаимоотношенийОрганизаций.Автомобили);
	ВзаимоотношенияОрганизаций = РегистрыСведений.квВзаимоотношенияОрганизаций.СрезПоследних(ДокОбъект.Дата,Отбор);
	
	Если Не ВзаимоотношенияОрганизаций.Количество() Тогда
		Сообщить("Не заданы настройки взаимоотношения организации <" + "> с другими организациями, документ <" + ДокОбъект + "> выгружен не будет!",СтатусСообщения.Внимание);
		Возврат;
	КонецЕсли;	
	
	// разбираемся кто есть кто в этом документе, кто отгружает автомобиль,
	// а кто его приходует..
	//-------------------------------------------------------------------------
	Если ВзаимоотношенияОрганизаций[0].РольОрганизацииПартнера = Перечисления.квРолиОрганизаций.Поставщик Или ВзаимоотношенияОрганизаций[0].РольОрганизацииПартнера = Перечисления.квРолиОрганизаций.Принципал Тогда
		
		ОрганизацияПоставщик 	= ВзаимоотношенияОрганизаций[0].ОрганизацияПартнер;
		КонтрагентПокупатель		= ВзаимоотношенияОрганизаций[0].КонтрагентОрганизации;
		
		ОрганизацияПокупатель	= ВзаимоотношенияОрганизаций[0].Организация;
		КонтрагентПоставщик		= ВзаимоотношенияОрганизаций[0].КонтрагентПартнер;
		
	ИначеЕсли ВзаимоотношенияОрганизаций[0].РольОрганизацииПартнера = Перечисления.квРолиОрганизаций.Покупатель Или ВзаимоотношенияОрганизаций[0].РольОрганизацииПартнера = Перечисления.квРолиОрганизаций.Комитент Тогда
		
		ОрганизацияПоставщик 	= ВзаимоотношенияОрганизаций[0].Организация;
		КонтрагентПокупатель		= ВзаимоотношенияОрганизаций[0].КонтрагентПартнер;
		
		ОрганизацияПокупатель	= ВзаимоотношенияОрганизаций[0].ОрганизацияПартнер;
		КонтрагентПоставщик		= ВзаимоотношенияОрганизаций[0].КонтрагентОрганизации;
		
	КонецЕсли;	
	
	Для каждого СтрокаТЧ Из ДокОбъект.Автомобили Цикл
		
		// реализация отгруженных товаров
		// от принципала..
		//----------------------------------
		НовСтрока = ДопСвойства.ТаблицаДокументов.Добавить();
		
		НовСтрока.Операция 			= "50";
		НовСтрока.Представление 	= "Отгрузка без перехода права собственности";
		НовСтрока.ДатаДок				= Формат(ДокОбъект.Дата, "ДФ=ггггММддЧЧммсс");
		НовСтрока.НомерДок			= СокрЛП(ДокОбъект.Номер);
		НовСтрока.ИдДок			 	= ДокОбъект.Ссылка.УникальныйИдентификатор();
		НовСтрока.Организация 	 	= ОрганизацияПоставщик.УникальныйИдентификатор();
		НовСтрока.Контрагент 	 		= КонтрагентПокупатель.УникальныйИдентификатор();
		//НовСтрока.Договор 			= ДокОбъект.Договор.УникальныйИдентификатор();
		НовСтрока.Номенклатура		= СтрокаТЧ.Автомобиль.УникальныйИдентификатор();		
		НовСтрока.Автомобиль 		= СтрокаТЧ.Автомобиль.УникальныйИдентификатор();
		
		НовСтрока.Сумма				= СтрокаТЧ.Сумма;
		НовСтрока.Количество			= 1;
		НовСтрока.ЭтоСкладТрейдИн= 1;
		
		//НовСтрока.ЭтоАгентскаяСхема = Число(Истина);
		
		// поступление комиссионного товара комитенту..
		//------------------------------------------------
		НовСтрока2 = ДопСвойства.ТаблицаДокументов.Добавить();
		ЗаполнитьЗначенияСвойств(НовСтрока2,НовСтрока);
		
		НовСтрока2.Операция = "18";
		НовСтрока2.Представление 	= "Поступление автомобилей";
		НовСтрока2.Организация 	 	= ОрганизацияПокупатель.УникальныйИдентификатор();
		НовСтрока2.Контрагент 	 	= КонтрагентПоставщик.УникальныйИдентификатор();
		
		ДобавитьВТаблицу(СтрокаТЧ.Автомобиль,2,ДопСвойства,,,,);
		
	КонецЦикла; 
	
	ДобавитьВТаблицу(ОрганизацияПоставщик,1,ДопСвойства);
	ДобавитьВТаблицу(ОрганизацияПокупатель,1,ДопСвойства);
	ДобавитьВТаблицу(КонтрагентПокупатель,2,ДопСвойства);	
	ДобавитьВТаблицу(КонтрагентПоставщик,2,ДопСвойства);	
	
КонецПроцедуры	

Процедура ВыгрузитьВТекст(Таблица,Очищать=Истина,ИмяОбъекта="")

	//----------------------------------------------
	Текст 		= Новый ЗаписьТекста(ПолноеИмяФайла,"windows-1251",,Не Очищать);
	ФайлТекста  = Новый ТекстовыйДокумент;
	
	// проставляем дату и время...
	//----------------------------
	Если Очищать Тогда
		ДатаВремя = "" + ТекущаяДата() + "_" + ИмяПользователя();
		Текст.ЗаписатьСтроку(ДатаВремя);
		
		Текст.ЗаписатьСтроку("~~Справочники~~");
		
	ИначеЕсли ИмяОбъекта = "Документы" Тогда	
		
		Текст.ЗаписатьСтроку("~~Документы~~");
	КонецЕсли;
	
	//----------------------------------------------
	КолСтр = Таблица.Количество();
	Если КолСтр = 0 тогда
		Попытка
			Текст.Закрыть();
		Исключение
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = "Исключение: "+ОписаниеОшибки();
			Сообщение.Сообщить();
		КонецПопытки;
		возврат;
	КонецЕсли;	
	
	// выгрузка структуры таблицы
	//----------------------------------------------
	Стр="{"+ИмяОбъекта;
	Текст.ЗаписатьСтроку(Стр);
	
	//@++
	Для каждого Колонка Из Таблица.Колонки Цикл
		Если ИмяОбъекта = "ДоговорыКонтрагентов" Тогда
			Стр = "//"+Колонка.Имя;
			Если Колонка.Имя = "НомерДоговора" Тогда
				Стр = "//Номер";
			ИначеЕсли Колонка.Имя = "ДатаНачала" Тогда
				Стр = "//Дата";
			КонецЕсли;
		Иначе
			Стр = "//"+Колонка.Имя;	
		КонецЕсли;
		Текст.ЗаписатьСтроку(Стр);
	КонецЦикла; 
	//@--
	
	// знак-разделитель и знак-замена
	//----------------------------------------------
	Знак = "|";
	ЗнакЗамены = "?";
	
	//Индикатор 						= ЭтотОбъект.ПолучитьФорму().ЭлементыФормы.Индикатор;
	//Индикатор.МаксимальноеЗначение 	= Таблица.Количество();

	// проход строк таблицы-параметра
	//----------------------------------------------
	Счетчик = 0;
	Для каждого СтрокаТЗ из Таблица цикл
		
		//Индикатор.Значение = Индикатор.Значение + 1;
		
		// обход колонок строки ТЗ
		//----------------------------------------------
		Стр = "";
		Для Каждого Колонка из Таблица.Колонки цикл
			
			// получили значение из ячейки таблицы
			//----------------------------------------------
			тмпСтр = ""+СтрокаТЗ[Колонка.Имя];
			
			// если в строке есть знак разделитель - меняем 
			//----------------------------------------------
			тмпСтр = СтрЗаменить(тмпСтр,Знак,ЗнакЗамены);
			// суммируем строку
			//----------------------------------------------
			Стр = Стр + "" + Знак + "" + тмпСтр;
		КонецЦикла;	
		
		// добавим в файл
		//----------------------------------------------
		Текст.ЗаписатьСтроку(Стр);

		проц = Окр((Счетчик/Таблица.Количество())*100,0,1);
	КонецЦикла;	
	// конецраздела
	//----------------------------------------------
	Стр="}";
	Текст.ЗаписатьСтроку(Стр);
	
	Попытка
		Текст.Закрыть();
	Исключение
	    Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Исключение: "+ОписаниеОшибки();
		Сообщение.Сообщить();
	КонецПопытки;
КонецПроцедуры

//*******************************************************************************************
// Параметры:
// ----------
// 		Параметр1 - описание параметра
// 		Параметр2 - описание параметра
//
// Описание:
// ---------
// 		Описание процедуры
//
//*******************************************************************************************
Процедура ВыгрузитьДокументы() Экспорт
	
	СтруктураДопСвойств = Новый Структура();
	
	ИнициализироватьТаблицыДанных(СтруктураДопСвойств);
	
	Заголовок 	= "Анализируем выгружаемые документы..";
	
	тДоковКВыгрузке = ВыгружаемыеДокументы.Выгрузить();
	тДоковКВыгрузке.Свернуть("Документ,Контрагент","Сумма");
	 
	Для каждого СтрокаТаб Из тДоковКВыгрузке Цикл
		
		ОбработкаПрерыванияПользователя();
		
		Проц = тДоковКВыгрузке.Индекс(СтрокаТаб) / тДоковКВыгрузке.Количество() * 100;
		Проц = Окр(Проц);
		
		Состояние(Заголовок + " - " + Проц + "%");
		
		Если ТипЗнч(СтрокаТаб.Документ) = Тип("ДокументСсылка.ПоступлениеАвтомобилей") Тогда
			ОбработкаДокументаПоступлениеАвтомобилей(СтрокаТаб.Документ,СтруктураДопСвойств);
			
		ИначеЕсли ТипЗнч(СтрокаТаб.Документ) = Тип("ДокументСсылка.РеализацияАвтомобилей") Тогда
			ОбработкаДокументаРеализацияАвтомобилей(СтрокаТаб.Документ,СтруктураДопСвойств);
			
		ИначеЕсли ТипЗнч(СтрокаТаб.Документ) = Тип("ДокументСсылка.ПриходныйКассовыйОрдер") Тогда
			ОбработкаДокументаПКО(СтрокаТаб.Документ,СтруктураДопСвойств);
			
		ИначеЕсли ТипЗнч(СтрокаТаб.Документ) = Тип("ДокументСсылка.ЧекНаОплату") Тогда
			ОбработкаДокументаПКО(СтрокаТаб.Документ,СтруктураДопСвойств);
			
		ИначеЕсли ТипЗнч(СтрокаТаб.Документ) = Тип("ДокументСсылка.РасходныйКассовыйОрдер") Тогда 	
			ОбработкаДокументаРКО(СтрокаТаб.Документ,СтруктураДопСвойств);
		
		ИначеЕсли ТипЗнч(СтрокаТаб.Документ) = Тип("ДокументСсылка.ПлатежноеПоручение") Тогда 	
			ОбработкаДокументаППИ(СтрокаТаб.Документ,СтруктураДопСвойств);
			
		ИначеЕсли ТипЗнч(СтрокаТаб.Документ) = Тип("ДокументСсылка.ПоступлениеТоваров") Тогда 	
			ОбработкаДокументаПоступлениеТоваровУслуг(СтрокаТаб.Документ,СтруктураДопСвойств);
			
		ИначеЕсли ТипЗнч(СтрокаТаб.Документ) = Тип("ДокументСсылка.Renault_ЗаказНаряд") Тогда 	
			
			ЭтоЗаказНаряд = Ложь;
			
			ЭтоЗаказНаряд = Не СтрокаТаб.Документ.ВидОперации = Перечисления.Renault_Advanced_ВидыОперацийЗаказНаряд.Реализация;

			//Если ЗначениеЗаполнено(СтрокаТаб.Документ.ДокументОснование) 
			//		И ТипЗнч(СтрокаТаб.Документ.ДокументОснование) = Тип("ДокументСсылка.ЗаказПокупателя") Тогда
			//		
			//		//Если ЗначениеЗаполнено(СтрокаТаб.Документ.ДокументОснование.Renault_ЗаказНаряд) Тогда
			//		//	ЭтоЗаказНаряд = Не СтрокаТаб.Документ.ДокументОснование.Renault_ЗаказНаряд.ВидОперации = Перечисления.Renault_Advanced_ВидыОперацийЗаказНаряд.Реализация;
			//		//КонецЕсли;
			//КонецЕсли;	
			
			Если ЭтоЗаказНаряд Тогда
				ОбработкаДокументаРеализацияТоваровУслугЗН(СтрокаТаб.Документ,СтруктураДопСвойств);
			Иначе
				ОбработкаДокументаРеализацияТоваровУслугПродажа(СтрокаТаб.Документ,СтруктураДопСвойств);
			КонецЕсли; 
			
		//ИначеЕсли ТипЗнч(СтрокаТаб.Документ) = Тип("ДокументСсылка.ТребованиеНакладная") Тогда 	
		//	ОбработкаДокументаТребованиеНакладная(СтрокаТаб.Документ,СтруктураДопСвойств);
		//	
		ИначеЕсли ТипЗнч(СтрокаТаб.Документ) = Тип("ДокументСсылка.КорректировкаРеализации") Тогда 	
			ОбработкаДокументаКорректировкаРеализации(СтрокаТаб.Документ,СтруктураДопСвойств);
			
		ИначеЕсли ТипЗнч(СтрокаТаб.Документ) = Тип("ДокументСсылка.ВозвратОтПокупателя") Тогда
			
			ОбработкаДокументаВозвратТоваровОтПокупателя(СтрокаТаб.Документ,СтруктураДопСвойств);
			
		//ИначеЕсли ТипЗнч(СтрокаТаб.Документ) = Тип("ДокументСсылка.ВозвратТоваровПоставщику") Тогда
		//	ОбработкаДокументаВозвратТоваровПоставщику(СтрокаТаб.Документ,СтруктураДопСвойств);
		//	
		//ИначеЕсли ТипЗнч(СтрокаТаб.Документ) = Тип("ДокументСсылка.ОприходованиеТоваров") Тогда 	
		//	ОбработкаДокументаОприходованиеТоваров(СтрокаТаб.Документ,СтруктураДопСвойств);
		//	
		ИначеЕсли ТипЗнч(СтрокаТаб.Документ) = Тип("ДокументСсылка.СписаниеТоваров") Тогда 	
			ОбработкаДокументаСписаниеТоваров(СтрокаТаб.Документ,СтруктураДопСвойств);
			
		ИначеЕсли ТипЗнч(СтрокаТаб.Документ) = Тип("ДокументСсылка.Комплектация") Тогда 	
			ОбработкаДокументаКомплектация(СтрокаТаб.Документ,СтруктураДопСвойств);
			
		//ИначеЕсли ТипЗнч(СтрокаТаб.Документ) = Тип("ДокументСсылка.Пац_ПереходПраваСобственностиАвтомобиля") Тогда
		//	ОбработкаДокументаПереходПраваСобственности(СтрокаТаб.Документ,СтруктураДопСвойств);
			
		Иначе
			Сообщить("Неизвестный вид документа для выгрузки: <" + СтрокаТаб.Документ + ">",СтатусСообщения.Информация);
		КонецЕсли; 
	КонецЦикла; 
	 
	 Если СтруктураДопСвойств.ТаблицаДокументов.Количество() = 0 Тогда
		 Сообщить("Нет данных для выгрузки!",СтатусСообщения.Внимание);
		 Возврат;
	 КонецЕсли; 
	 
	Заголовок = "Выгружаем данные в файл - " + ПолноеИмяФайла;
	 
	СчетчикТаб = 0;
	Для каждого Соответствие Из СтруктураДопСвойств.СоответствиеТаблицСправочников Цикл
		
		ИмяТаб = Соответствие.Ключ;
		
		Если ИмяТаб = "ДоговорыВзаиморасчетов" Тогда
			ИмяТаб = "ДоговорыКонтрагентов"
		ИначеЕсли ИмяТаб = "бит_ус_Изделия" Тогда
			ИмяТаб = "Автомобили"
		ИначеЕсли ИмяТаб = "КассыКомпании" Тогда
			ИмяТаб = "Кассы"
		КонецЕсли; 
		
		СчетчикТаб = СчетчикТаб + 1;
		
		Проц = СчетчикТаб / СтруктураДопСвойств.СоответствиеТаблицСправочников.Количество() * 100;
		Проц = Окр(Проц);
		
		Состояние(Заголовок + " - " + Проц + "%");
		
		ТабДанных = Соответствие.Значение;
		
		СворачиваемыеКолонки = "";
		
		Счетчик = 0;
		Для каждого Колонка Из ТабДанных.Колонки Цикл
			
			Счетчик = Счетчик + 1;
			
			СворачиваемыеКолонки = СворачиваемыеКолонки + Колонка.Имя + ?(Счетчик = ТабДанных.Колонки.Количество(),"",","); 
		КонецЦикла; 
		
		ТабДанных.Свернуть(СворачиваемыеКолонки);
		
		ВыгрузитьВТекст(ТабДанных,?(СчетчикТаб = 1,Истина,Ложь),ИмяТаб);
	КонецЦикла; 
	 
	 ГруппируемыеКолонки = "";
	 СуммируемыеКолонки  = "";
	 
	 // сформируем строки с колонками для свертки таблицы..
	 //--------------------------------------------------------
	 Для каждого Колонка Из СтруктураДопСвойств.ТаблицаДокументов.Колонки Цикл
			 
		 Счетчик = Счетчик + 1;
		 
		 Если Найти(Колонка.Имя,"Сумма") > 0 Или Найти(Колонка.Имя,"Количество") > 0 Или Найти(Колонка.Имя,"Себестоимость") > 0 Тогда
			 СуммируемыеКолонки  = СуммируемыеКолонки + Колонка.Имя + ","; 
		 Иначе
			 ГруппируемыеКолонки = ГруппируемыеКолонки + Колонка.Имя + ","; 
		 КонецЕсли; 
	 КонецЦикла; 
	 
	 // отсекаем последний знак в строке..
	 //-------------------------------------
	 СуммируемыеКолонки  = Лев(СуммируемыеКолонки,СтрДлина(СуммируемыеКолонки) - 1);
	 ГруппируемыеКолонки = Лев(ГруппируемыеКолонки,СтрДлина(ГруппируемыеКолонки) - 1);
		 
	 СтруктураДопСвойств.ТаблицаДокументов.Свернуть(ГруппируемыеКолонки,СуммируемыеКолонки);
	 ВыгрузитьВТекст(СтруктураДопСвойств.ТаблицаДокументов,Ложь,"Документы");
	 
	 Предупреждение("Выгрузка успешно завершена!");
КонецПроцедуры // ВыгрузитьДокументы()

