Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)
	Если Не обЗначениеНеЗаполнено(ПриКомпоновкеРезультата) Тогда 
		Попытка
			ПроцессорКомпоновкиДанных = Новый ПроцессорКомпоновкиДанных;
			Выполнить(ПриКомпоновкеРезультата);
			
			ДокументРезультат.Очистить();
			
			//Выводим результат в табличный документ
			ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент;
			ПроцессорВывода.УстановитьДокумент(ДокументРезультат);
			ПроцессорВывода.Вывести(ПроцессорКомпоновкиДанных);
		Исключение
			Сообщить(ОписаниеОшибки());
			Сообщить(ПриКомпоновкеРезультата);
		КонецПопытки;
	КонецЕсли;
КонецПроцедуры