Функция УбратьЗапрещенныеСимволы(выбСтрока)
	// функция замещает запрещенные символы на _ в строке
	
	РазрешенныеСимволы = "ЙЦУКЕНГШЩЗХЪФЫВАПРОЛДЖЭЯЧСМИТЬБЮQWERTYUIOPASDFGHJKLZXCVBNM1234567890_";
	
	рСТрока = "";
	Для сч=1 по СтрДлина(выбСтрока) Цикл
		нСимвол = Сред(СокрЛП(выбСтрока),сч,1);
		Если Найти(РазрешенныеСимволы,ВРег(нСимвол))=0 Тогда
			рСтрока = рСтрока+"_";
		Иначе
			рСтрока = рСтрока+нСимвол;
		КонецЕсли;			
	КонецЦикла;
	
	Возврат рСтрока;
КонецФункции

Процедура ЗаполнитьНастройкиОтчета(НастройкиОтчета, ЭтоДиаграмма=Ложь) Экспорт
	
	//СписокРесурсов = Новый СписокЗначений;
	//СписокПолей = Новый СписокЗначений;
	//
	//Для Каждого текСтрока Из ДоступныеПоляОтчета Цикл
	//	Если текСтрока.Пометка=Ложь Тогда
	//		Продолжить;
	//	КонецЕсли;
	//	
	//	Если текСтрока.Ресурс Тогда
	//		СписокРесурсов.Добавить(текСтрока.ИмяПоля);
	//	Иначе
	//		СписокПолей.Добавить(текСтрока.ИмяПоля);
	//	КОнецЕсли;
	//КонецЦикла;
	//
	//// добавим выбранные группировки                    
	//Для Каждого текРесурс Из СписокРесурсов Цикл
	//	Если НайтиПолеКомпоновки(текРесурс.Значение, НастройкиОтчета.Выбор.Элементы) Тогда
	//		Продолжить;
	//	КонецЕсли;
	//	
	// 	ПолеРесурса = НастройкиОтчета.Выбор.Элементы.Добавить(Тип("ВыбранноеПолеКомпоновкиДанных"));
	//	ПолеРесурса.Использование = Истина;
	//	ПолеРесурса.Заголовок = текРесурс.Значение;
	//	ПолеРесурса.Поле = Новый ПолеКомпоновкиДанных(текРесурс.Значение);
	//КонецЦикла;
	//
	//НастройкиОтчета.Структура.Очистить();
	//
	//если ЭтоДиаграмма Тогда
	// 	ПолеДиаграммы = НастройкиОтчета.Выбор.Элементы.Добавить(Тип("ВыбранноеПолеКомпоновкиДанных"));
	//	ПолеДиаграммы.Использование = Истина;
	//	ПолеДиаграммы.Заголовок = ГруппировкаДиаграммы;
	//	ПолеДиаграммы.Поле = Новый ПолеКомпоновкиДанных(ГруппировкаДиаграммы);
	//	
	//	График = НастройкиОтчета.Структура.Добавить(Тип("ДиаграммаКомпоновкиДанных"));
	//	График.ПараметрыВывода.УстановитьЗначениеПараметра("ТипДиаграммы",ТипДиаграммы);
	//	АвтополеГрафик = График.Выбор.Элементы.Добавить(Тип("АвтоВыбранноеПолеКомпоновкиДанных")); 
	//	АвтополеГрафик.Использование = Истина; 
	//	
	//	Серии = График.Серии.Добавить();
	//	Серии.ПоляГруппировки.Элементы.Добавить(Тип("ПолеГруппировкиКомпоновкиДанных")).Поле = Новый ПолеКомпоновкиДанных(ГруппировкаДиаграммы);

	//	Автополе = Серии.Выбор.Элементы.Добавить(Тип("АвтоВыбранноеПолеКомпоновкиДанных")); 
	//	Автополе.Использование = Истина; 
	//	Серии.Выбор.Элементы.Добавить(Тип("ВыбранноеПолеКомпоновкиДанных")).Поле = Новый ПолеКомпоновкиДанных("Количество");
	//Иначе
	//    ЭлементСтруктуры = НастройкиОтчета;
	//	Для Каждого Группировка Из Группировки Цикл
	//		// если не указан тип группировки, то установим тип "Элементы"
	//		Если ПустаяСтрока(Группировка.ТипГруппировки) Тогда
	//			Группировка.ТипГруппировки = "Элементы";
	//		КонецЕсли;
	//		
	//		ЭлементСтруктуры = ЭлементСтруктуры.Структура.Добавить(Тип("ГруппировкаКомпоновкиДанных"));
	//		ЭлементГруппировки = ЭлементСтруктуры.ПоляГруппировки.Элементы.Добавить(Тип("ПолеГруппировкиКомпоновкиДанных"));
	//		ЭлементГруппировки.Использование = Истина;
	//		ЭлементГруппировки.Поле =  Новый ПолеКомпоновкиДанных(Группировка.Поле);                                                  
	//		ЭлементГруппировки.ТипГруппировки = ТипГруппировкиКомпоновкиДанных[Группировка.ТипГруппировки];
	//		
	//		ПолеСортировки = ЭлементСтруктуры.Порядок.Элементы.Добавить(Тип("АвтоЭлементПорядкаКомпоновкиДанных"));
	//		ПолеСортировки.Использование = Истина;

	//		ЭлементСтруктуры.Выбор.Элементы.Добавить(Тип("ВыбранноеПолеКомпоновкиДанных")).Поле = Новый ПолеКомпоновкиДанных("Количество");
	//		
	//		ВыбранноеПоле = ЭлементСтруктуры.Выбор.Элементы.Добавить(Тип("АвтоВыбранноеПолеКомпоновкиДанных"));
	//		ВыбранноеПоле.Использование = Истина;

	//	КонецЦикла;
	//	// Группировка <Детальные записи>
	//	ГруппировкаДетальныеПоля = ЭлементСтруктуры.Структура.Добавить(Тип("ГруппировкаКомпоновкиДанных")); 
	//	ГруппировкаДетальныеПоля.Использование = Истина; 

	//	Для Каждого текПоле Из СписокПолей Цикл
	//		ПолеВыбора = ГруппировкаДетальныеПоля.Выбор.Элементы.Добавить(Тип("ВыбранноеПолеКомпоновкиДанных"));
	//		ПолеВыбора.Использование = Истина;
	//		ПолеВыбора.Заголовок = текПоле.Значение;
	//		ПолеВыбора.Поле = Новый ПолеКомпоновкиДанных(УбратьЗапрещенныеСимволы(текПоле.Значение));
	//	КонецЦикла;
	//	
	//	Автополе = ГруппировкаДетальныеПоля.Выбор.Элементы.Добавить(Тип("АвтоВыбранноеПолеКомпоновкиДанных")); 
	//	Автополе.Использование = Истина; 
	//КонецЕсли;
	//
КонецПроцедуры

Процедура СформироватьСхемуКомпоновкиДанных() Экспорт
	// изменим текст запроса
	Для Каждого нДанных Из СхемаКомпоновкиДанных.НаборыДанных Цикл
		Если типЗнч(нДанных) = Тип("НаборДанныхЗапросСхемыКомпоновкиДанных") Тогда
			// меняем только первый набор-запрос
			нДанных.АвтоЗаполнениеДоступныхПолей = Истина;
			
			ТекстЗапроса = "
			|ИЗ
			|	РегистрСведений.Renault_Трафик КАК Renault_Трафик
			|";
			
			ТекстВыбрать = "ВЫБРАТЬ Renault_Трафик.*";
			
			Для Каждого текСтрока Из ДоступныеПоляОтчета Цикл
				Если ТекСтрока.Пометка=Ложь ИЛИ ТекСтрока.ДополнительноеПоле.Пустая() Тогда
					Продолжить;
				КонецЕсли;
				
				ИмяРеквизита = УбратьЗапрещенныеСимволы(ТекСтрока.ДополнительноеПоле.Наименование);
				
				ТекстЗапроса = ТекстЗапроса + "ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
				|	CRM_ЗначенияРеквизитовТрафика.ИдентификаторТрафика,
				|	CRM_ЗначенияРеквизитовТрафика.ЗначениеРеквизита
				|ИЗ
				|	РегистрСведений.CRM_ЗначенияРеквизитовТрафика КАК CRM_ЗначенияРеквизитовТрафика
				|ГДЕ
				|	CRM_ЗначенияРеквизитовТрафика.РеквизитТрафика.Код = "+Символ(34)+ТекСтрока.ДополнительноеПоле.Код+Символ(34)+") КАК "+ИмяРеквизита+"_Выборка
				|ПО "+ИмяРеквизита+"_Выборка.ИдентификаторТрафика=Renault_Трафик.Идентификатор
				|";
				
				ТекстВыбрать = ТекстВыбрать+","+ИмяРеквизита+"_Выборка.ЗначениеРеквизита КАК "+ИмяРеквизита;
				
			КонецЦикла;
			
			нДанных.Запрос = ТекстВыбрать+ТекстЗапроса+"
			|{ГДЕ
			|	(Renault_Трафик.Период МЕЖДУ &НачалоПериода И &КонецПериода)}
			|";
			
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	// итоги
	СхемаКомпоновкиДанных.ПоляИтога.Очистить();
	ПолеРесурса = СхемаКомпоновкиДанных.ПоляИтога.Добавить();
	ПолеРесурса.ПутьКДанным = "Количество";
	ПолеРесурса.Выражение = "Сумма(Количество)";
КонецПроцедуры

Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)
	Если Не Renault_РаботаСПравамиПользователя.ЕстьПравоОткрытияОтчетапродаж(ПараметрыСеанса.Пользователь,"Renault_ТрафикВРазрезах") тогда
		Сообщить("Недостаточно прав доступа.");
		СтандартнаяОбработка = Ложь;
		Отказ = Истина;
		Возврат;
	КонецЕсли;	
	//СтандартнаяОбработка = Ложь;
	//
	//// переработаем СКД на базе выбранных настроек
	//СформироватьСхемуКомпоновкиДанных();

	//НастройкиОтчета = КомпоновщикНастроек.ПолучитьНастройки();
	//
	//ЗаполнитьНастройкиОтчета(НастройкиОтчета);

	////    Далее, устанавливаем значения параметров и загружаем заполненные настройки
	//НастройкиОтчета.ПараметрыДанных.УстановитьЗначениеПараметра("Период",Период);
	//КомпоновщикНастроек.ЗагрузитьНастройки(НастройкиОтчета);
	//
	//КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
	//МакетКомпоновки = КомпоновщикМакета.Выполнить(СхемаКомпоновкиДанных, КомпоновщикНастроек.Настройки);

	//ПроцессорКомпоновкиДанных = Новый ПроцессорКомпоновкиДанных;
	//ПроцессорКомпоновкиДанных.Инициализировать(МакетКомпоновки);
	//
	//ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент;
	//ПроцессорВывода.УстановитьДокумент(ДокументРезультат);
	//ПроцессорВывода.Вывести(ПроцессорКомпоновкиДанных);
	//
	//// диаграмма
	//РезультатДиаграмма.Очистить();
	//НастройкиОтчета = КомпоновщикНастроек.ПолучитьНастройки();
	//ЗаполнитьНастройкиОтчета(НастройкиОтчета, Истина);
	//
	//НастройкиОтчета.ПараметрыДанных.УстановитьЗначениеПараметра("Период",Период);
	//КомпоновщикНастроек.ЗагрузитьНастройки(НастройкиОтчета);
	//
	//КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
	//МакетКомпоновки = КомпоновщикМакета.Выполнить(СхемаКомпоновкиДанных, КомпоновщикНастроек.Настройки);

	//ПроцессорКомпоновкиДанных = Новый ПроцессорКомпоновкиДанных;
	//ПроцессорКомпоновкиДанных.Инициализировать(МакетКомпоновки);
	//
	//ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент;
	//ПроцессорВывода.УстановитьДокумент(РезультатДиаграмма);
	//ПроцессорВывода.Вывести(ПроцессорКомпоновкиДанных);

КонецПроцедуры

Функция НайтиПолеКомпоновки(Имя, Коллекция) Экспорт
	Для Каждого ПолеКомпоновкиДанных Из Коллекция Цикл
		Если ПолеКомпоновкиДанных.Поле = Новый ПолеКомпоновкиДанных(Имя) Тогда
			Возврат Истина;
		Иначе
			Продолжить;
		КонецЕсли;
	КонецЦикла; 
	
	Возврат Ложь;
КонецФункции

Функция ПолучитьСвойства() Экспорт
	
	СтруктураСвойств = Новый Структура;
	
	Возврат СтруктураСвойств;
	
КонецФункции

// Стандартная процедура настройки схемы компоновщика данных
//
Процедура ЗаполнитьНачальныеНастройки() Экспорт

КонецПроцедуры
