Процедура ПриУстановкеНовогоНомера(СтандартнаяОбработка, Префикс)	
	Префикс = DMS_ОбщегоНазначенияСервер.ПолучитьПрефикс();
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)  	
	Если ОбменДанными.Загрузка Тогда 		
		Возврат;  		
	КонецЕсли;
	
	Если РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда
		
		Если НЕ ЗначениеЗаполнено(Организация) Тогда
			Сообщить("Необходимо заполнить организацию!");
			Отказ = Истина;
		КонецЕсли;
		
		Если НЕ ЗначениеЗаполнено(СтарыйСК) Тогда
			Сообщить("Необходимо заполнить СК старого БСО!");
			Отказ = Истина;
		КонецЕсли;
		Если НЕ ЗначениеЗаполнено(СтарыйТип) Тогда
			Сообщить("Необходимо заполнить тип старого БСО!");
			Отказ = Истина;
		КонецЕсли;
		Если НЕ ЗначениеЗаполнено(СтарыйНомер) Тогда
			Сообщить("Необходимо заполнить номер старого БСО!");
			Отказ = Истина;
		КонецЕсли;
		
		Если НЕ ЗначениеЗаполнено(НовыйСК) Тогда
			Сообщить("Необходимо заполнить СК нового БСО!");
			Отказ = Истина;
		КонецЕсли;
		Если НЕ ЗначениеЗаполнено(НовыйТип) Тогда
			Сообщить("Необходимо заполнить тип нового БСО!");
			Отказ = Истина;
		КонецЕсли;
		Если НЕ ЗначениеЗаполнено(НовыйНомер) Тогда
			Сообщить("Необходимо заполнить номер нового БСО!");
			Отказ = Истина;
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры   

Процедура ПриЗаписи(Отказ)  	
	Если ОбменДанными.Загрузка Тогда 		
		Возврат;  		
	КонецЕсли;
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, Режим)
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!

	// регистр Renault_ЗаменыБСО
	Движения.Renault_ЗаменыБСО.Записывать = Истина;
	Движения.Renault_ЗаменыБСО.Очистить();
	Движение = Движения.Renault_ЗаменыБСО.Добавить();
	Движение.Организация = Организация;
	Движение.НовыйСК = НовыйСК;
	Движение.НовыйТип = НовыйТип;
	Движение.НовыйСерия = НовыйСерия;
	Движение.НовыйНомер = НовыйНомер;
	Движение.СтарыйСК = СтарыйСК;
	Движение.СтарыйТип = СтарыйТип;
	Движение.СтарыйСерия = СтарыйСерия;
	Движение.СтарыйНомер = СтарыйНомер;
	Движение.СуммаДоплаты = СуммаДоплаты;
	Движение.АлгоритмЗамены = АлгоритмЗамены;
	Движение.НовыйПолис = НовыйПолис;
	Движение.СтарыйПолис = СтарыйПолис;
	Движение.СтатусСтарогоБСО = СтатусСтарогоБСО;

	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	
	Движения.Renault_СтатусыБСО.Записывать = Истина;
	Движения.Renault_СтатусыБСО.Очистить();
	Если АлгоритмЗамены = Перечисления.Renault_АлгоритмыЗаменыБСО.ОшибкаОформления И СтатусСтарогоБСО = Перечисления.Renault_СтатусыСтарыхБСО.Испорчен Тогда
		Движение = Движения.Renault_СтатусыБСО.Добавить();
		Движение.Период = Дата;
		Движение.Организация = Организация;
		Движение.СтраховаяКомпания = СтарыйСК;
		Движение.ТипБСО = СтарыйТип;
		Движение.СерияБСО = СтарыйСерия;
		Движение.НомерБСО = СтарыйНомер;
		Движение.Статус = Перечисления.Renault_СтатусыБСО.Испорчен;
	КонецЕсли;	
	
	Если АлгоритмЗамены = Перечисления.Renault_АлгоритмыЗаменыБСО.ЗаменаКвитанции Тогда
		
		Движение = Движения.Renault_СтатусыБСО.Добавить();
		Движение.Период = Дата;
		Движение.Организация = Организация;
		Движение.СтраховаяКомпания = СтарыйСК;
		Движение.ТипБСО = СтарыйТип;
		Движение.СерияБСО = СтарыйСерия;
		Движение.НомерБСО = СтарыйНомер;
		Движение.Статус = Перечисления.Renault_СтатусыБСО.Испорчен;
		
		Движение = Движения.Renault_СтатусыБСО.Добавить();
		Движение.Период = Дата;
		Движение.Организация = Организация;
		Движение.СтраховаяКомпания = НовыйСК;
		Движение.ТипБСО = НовыйТип;
		Движение.СерияБСО = НовыйСерия;
		Движение.НомерБСО = НовыйНомер;
		Движение.Статус = Перечисления.Renault_СтатусыБСО.Продан;
		
	КонецЕсли;	
	
	
КонецПроцедуры
