
Процедура ОбработкаПроведения(Отказ, Режим)
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!

	// регистр Renault_СтатусыБСО
	Движения.Renault_СтатусыБСО.Записывать = Истина;
	Движения.Renault_СтатусыБСО.Очистить();
	Для Каждого ТекСтрокаБСО Из БСО Цикл
		Если ТекСтрокаБСО.ИзменятьСтатус Тогда
			Движение = Движения.Renault_СтатусыБСО.Добавить();
			Движение.Период = Дата;
			Движение.Организация = Организация;
			Движение.СтраховаяКомпания = ТекСтрокаБСО.СтраховаяКомпания;
			Движение.ТипБСО = ТекСтрокаБСО.ТипБСО;
			Движение.СерияБСО = ТекСтрокаБСО.СерияБСО;
			Движение.НомерБСО = ТекСтрокаБСО.НомерБСО;
			Движение.Статус = ТекСтрокаБСО.Статус;
		КонецЕсли;	
	КонецЦикла;

	// регистр Renault_БСОНаТочкеПродаж Приход
	Движения.Renault_БСОНаТочкеПродаж.Записывать = Истина;
	Движения.Renault_БСОНаТочкеПродаж.Очистить();
	Для Каждого ТекСтрокаБСО Из БСО Цикл
		Движение = Движения.Renault_БСОНаТочкеПродаж.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
		Движение.Период = Дата;
		Движение.Организация = Организация;
		Движение.ТочкаПродаж = ТочкаПродаж;
		Движение.СтраховаяКомпания = ТекСтрокаБСО.СтраховаяКомпания;
		Движение.ТипБСО = ТекСтрокаБСО.ТипБСО;
		Движение.СерияБСО = ТекСтрокаБСО.СерияБСО;
		Движение.НомерБСО = ТекСтрокаБСО.НомерБСО;
		Движение.Количество = 1;
	КонецЦикла;

	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры

Процедура Печать() Экспорт
	
	Если НЕ ЭтотОбъект.Проведен Тогда
		Сообщить("Печать возможна только после проведения документа!");
		Возврат;
	КонецЕсли;	
	
	ТабДок = Новый ТабличныйДокумент;
	Макет = ПолучитьМакет("АктПриемаПередачи");	
	
    Область = Макет.ПолучитьОбласть("Шапка");
	Область.Параметры.Заголовок = "АКТ ПРИЕМА-ПЕРЕДАЧИ БЛАНКОВ СТРОГОЙ ОТЧЕТНОСТИ № " + Номер;
	Область.Параметры.Передал = Ответственный;
	Область.Параметры.Принял = ?(ПодписьАдеррайтера, Адеррайтер, "");
	Область.Параметры.ДатаСозданияАкта = Дата;
	ТабДок.Вывести(Область);
	
    Область = Макет.ПолучитьОбласть("ШапкаТаблицы");
	ТабДок.Вывести(Область);
	
	Выборка = ПолучитьВыборкуБСО();
	
	НомерСтроки = 1;
	Пока Выборка.Следующий() Цикл
		
		Область = Макет.ПолучитьОбласть("Строка");
		
		ЗаполнитьЗначенияСвойств(Область.Параметры, Выборка);
		Область.Параметры.НомерДоговора = "" + СокрЛП(Выборка.СерияБСО) + " " + СокрЛП(Выборка.НомерБСО);
		Область.Параметры.НомерКвитанции = "" + СокрЛП(Выборка.СерияБСОКвитанция) + " " + СокрЛП(Выборка.НомерБСОКвитанция);
		Область.Параметры.Номер = НомерСтроки;
		
		ТабДок.Вывести(Область);
		
		НомерСтроки = НомерСтроки + 1;
		
	КонецЦикла;
	
    Область = Макет.ПолучитьОбласть("Подвал");
	Область.Параметры.Передал = Ответственный;
	Область.Параметры.Принял = ?(ПодписьАдеррайтера, Адеррайтер, "");;
	ТабДок.Вывести(Область);
	
	ТабДок.Показать();
	
КонецПроцедуры

Процедура ПриУстановкеНовогоНомера(СтандартнаяОбработка, Префикс)	
	Префикс = DMS_ОбщегоНазначенияСервер.ПолучитьПрефикс();
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)  	
	Если ОбменДанными.Загрузка Тогда 		
		Возврат;  		
	КонецЕсли;
	
	Если РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда
		
		//ЕстьБСОВОрганизации = ложь;
		//ЕстьБСОНаТочке = ложь;
		
		ТаблицаБСО = Renault_УчетБСО.ПолучитьТаблицуБСОПоТабЧасти(БСО, Организация, неопределено, ТочкаПродаж, ложь);
		
		ЕстьБСОВОрганизации = Renault_УчетБСО.ПроверитьНаличиеБСО(Дата, ТаблицаБСО, Организация, неопределено, неопределено, истина);
		
		ЕстьБСОНаТочке = Renault_УчетБСО.ПроверитьНаличиеБСО(Дата, ТаблицаБСО, Организация, неопределено, ТочкаПродаж, истина);
		
		Отказ = (НЕ ЕстьБСОВОрганизации) ИЛИ (НЕ ЕстьБСОНаТочке);
		
	КонецЕсли;
	
КонецПроцедуры     

Процедура ПриЗаписи(Отказ)  	
	Если ОбменДанными.Загрузка Тогда 		
		Возврат;  		
	КонецЕсли;
КонецПроцедуры

Функция ПолучитьВыборкуБСО()
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	Запрос.Текст = "ВЫБРАТЬ
	               |	БСО.СтраховаяКомпания,
	               |	БСО.ТипБСО,
	               |	БСО.СерияБСО,
	               |	БСО.НомерБСО,
	               |	БСО.НомерСтроки
	               |ПОМЕСТИТЬ ВТ_БСО
	               |ИЗ
	               |	Документ.Renault_ВозвратБСОВОрганизацию.БСО КАК БСО
	               |ГДЕ
	               |	БСО.Ссылка = &Ссылка
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВТ_БСО.СтраховаяКомпания,
	               |	ВТ_БСО.ТипБСО,
	               |	ВТ_БСО.СерияБСО,
	               |	ВТ_БСО.НомерБСО,
	               |	ВТ_БСО.НомерСтроки
	               |ПОМЕСТИТЬ ВТ_Полисы
	               |ИЗ
	               |	ВТ_БСО КАК ВТ_БСО
	               |ГДЕ
	               |	НЕ ВТ_БСО.ТипБСО.ЭтоКвитанция
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВТ_БСО.СтраховаяКомпания,
	               |	ВТ_БСО.ТипБСО,
	               |	ВТ_БСО.СерияБСО,
	               |	ВТ_БСО.НомерБСО,
	               |	ВТ_БСО.НомерСтроки
	               |ПОМЕСТИТЬ ВТ_Квитанции
	               |ИЗ
	               |	ВТ_БСО КАК ВТ_БСО
	               |ГДЕ
	               |	ВТ_БСО.ТипБСО.ЭтоКвитанция
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВТ_Полисы.СтраховаяКомпания,
	               |	ВТ_Полисы.ТипБСО,
	               |	ВТ_Полисы.СерияБСО,
	               |	ВТ_Полисы.НомерБСО,
	               |	ВТ_Полисы.НомерСтроки,
	               |	ВТ_Квитанции.ТипБСО КАК ТипБСОКвитанция,
	               |	ВТ_Квитанции.СерияБСО КАК СерияБСОКвитанция,
	               |	ВТ_Квитанции.НомерБСО КАК НомерБСОКвитанция,
	               |	Renault_СтраховыеПолисы.Страхователь,
	               |	Renault_СтраховыеПолисы.ВидСтрахования
	               |ПОМЕСТИТЬ ВТ_ПолисыСКвитанциями
	               |ИЗ
	               |	ВТ_Полисы КАК ВТ_Полисы
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.Renault_СтраховыеПолисы КАК Renault_СтраховыеПолисы
	               |			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.Renault_КвитанцииКПолисам КАК Renault_КвитанцииКПолисам
	               |				ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Квитанции КАК ВТ_Квитанции
	               |				ПО Renault_КвитанцииКПолисам.СтраховаяКомпания = ВТ_Квитанции.СтраховаяКомпания
	               |					И Renault_КвитанцииКПолисам.ТипБСО = ВТ_Квитанции.ТипБСО
	               |					И Renault_КвитанцииКПолисам.СерияБСО = ВТ_Квитанции.СерияБСО
	               |					И Renault_КвитанцииКПолисам.НомерБСО = ВТ_Квитанции.НомерБСО
	               |			ПО Renault_СтраховыеПолисы.Регистратор = Renault_КвитанцииКПолисам.СтраховойПолис
	               |		ПО ВТ_Полисы.СтраховаяКомпания = Renault_СтраховыеПолисы.СтраховаяКомпания
	               |			И ВТ_Полисы.ТипБСО = Renault_СтраховыеПолисы.ТипБСО
	               |			И ВТ_Полисы.СерияБСО = Renault_СтраховыеПолисы.СерияБСО
	               |			И ВТ_Полисы.НомерБСО = Renault_СтраховыеПолисы.НомерБСО
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	Вт_ПолисыСКвитанциями.ТипБСОКвитанция,
	               |	Вт_ПолисыСКвитанциями.СерияБСОКвитанция,
	               |	Вт_ПолисыСКвитанциями.НомерБСОКвитанция,
	               |	Вт_ПолисыСКвитанциями.СтраховаяКомпания
	               |ПОМЕСТИТЬ ВТ_КвитанцииКПолисам
	               |ИЗ
	               |	ВТ_ПолисыСКвитанциями КАК Вт_ПолисыСКвитанциями
	               |ГДЕ
	               |	НЕ Вт_ПолисыСКвитанциями.ТипБСОКвитанция ЕСТЬ NULL 
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВТ_Квитанции.СтраховаяКомпания,
	               |	ВТ_Квитанции.ТипБСО,
	               |	ВТ_Квитанции.СерияБСО,
	               |	ВТ_Квитанции.НомерБСО,
	               |	ВТ_Квитанции.НомерСтроки
	               |ПОМЕСТИТЬ ВТ_КвитанцииБезПолисов
	               |ИЗ
	               |	ВТ_Квитанции КАК ВТ_Квитанции
	               |		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_КвитанцииКПолисам КАК ВТ_КвитанцииКПолисам
	               |		ПО ВТ_Квитанции.СтраховаяКомпания = ВТ_КвитанцииКПолисам.СтраховаяКомпания
	               |			И ВТ_Квитанции.ТипБСО = ВТ_КвитанцииКПолисам.ТипБСОКвитанция
	               |			И ВТ_Квитанции.СерияБСО = ВТ_КвитанцииКПолисам.СерияБСОКвитанция
	               |			И ВТ_Квитанции.НомерБСО = ВТ_КвитанцииКПолисам.НомерБСОКвитанция
	               |ГДЕ
	               |	ВТ_КвитанцииКПолисам.ТипБСОКвитанция ЕСТЬ NULL 
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВТ_ПолисыСКвитанциями.СтраховаяКомпания,
	               |	ВТ_ПолисыСКвитанциями.ТипБСО,
	               |	ВТ_ПолисыСКвитанциями.СерияБСО,
	               |	ВТ_ПолисыСКвитанциями.НомерБСО,
	               |	ВТ_ПолисыСКвитанциями.НомерСтроки КАК НомерСтроки,
	               |	ВТ_ПолисыСКвитанциями.ТипБСОКвитанция,
	               |	ВТ_ПолисыСКвитанциями.СерияБСОКвитанция,
	               |	ВТ_ПолисыСКвитанциями.НомерБСОКвитанция,
	               |	ВТ_ПолисыСКвитанциями.Страхователь,
	               |	ВТ_ПолисыСКвитанциями.ВидСтрахования
	               |ИЗ
	               |	ВТ_ПолисыСКвитанциями КАК ВТ_ПолисыСКвитанциями
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	ВТ_КвитанцииБезПолисов.СтраховаяКомпания,
	               |	NULL,
	               |	NULL,
	               |	NULL,
	               |	ВТ_КвитанцииБезПолисов.НомерСтроки,
	               |	ВТ_КвитанцииБезПолисов.ТипБСО,
	               |	ВТ_КвитанцииБезПолисов.СерияБСО,
	               |	ВТ_КвитанцииБезПолисов.НомерБСО,
	               |	NULL,
	               |	NULL
	               |ИЗ
	               |	ВТ_КвитанцииБезПолисов КАК ВТ_КвитанцииБезПолисов
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	НомерСтроки
	               |АВТОУПОРЯДОЧИВАНИЕ";
	
	Возврат Запрос.Выполнить().Выбрать();
	
КонецФункции	