Функция СформироватьТабличныйДокументЗКП(ДокументСсылка) Экспорт
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Renault_ЗапросНаКоммерческуюПомощь.CaseNumber,
		|	Renault_ЗапросНаКоммерческуюПомощь.CaseStatus,
		|	Renault_ЗапросНаКоммерческуюПомощь.DATE_MODIFIED,
		|	Renault_ЗапросНаКоммерческуюПомощь.СпециалистРено,
		|	Renault_ЗапросНаКоммерческуюПомощь.БизнесРегион,
		|	Renault_ЗапросНаКоммерческуюПомощь.ТипКлиента,
		|	Renault_ЗапросНаКоммерческуюПомощь.Контрагент,
		|	Renault_ЗапросНаКоммерческуюПомощь.Модель,
		|	Renault_ЗапросНаКоммерческуюПомощь.КомплектацияАвто,
		|	Renault_ЗапросНаКоммерческуюПомощь.Пробег,
		|	Renault_ЗапросНаКоммерческуюПомощь.VIN,
		|	Renault_ЗапросНаКоммерческуюПомощь.ДатаПродажиАвто,
		|	Renault_ЗапросНаКоммерческуюПомощь.ГосНомер,
		|	Renault_ЗапросНаКоммерческуюПомощь.СостояниеАвто,
		|	Renault_ЗапросНаКоммерческуюПомощь.ДатаОбращенияВДЦ,
		|	Renault_ЗапросНаКоммерческуюПомощь.ФункциональныйКод,
		|	Renault_ЗапросНаКоммерческуюПомощь.Гарантия,
		|	Renault_ЗапросНаКоммерческуюПомощь.ПричинаОбращения,
		|	Renault_ЗапросНаКоммерческуюПомощь.Комментарий,
		|	Renault_ЗапросНаКоммерческуюПомощь.ПожеланиеКлиента,
		|	Renault_ЗапросНаКоммерческуюПомощь.ПрохождениеТО,
		|	Renault_ЗапросНаКоммерческуюПомощь.НаличиеДопОборудования,
		|	Renault_ЗапросНаКоммерческуюПомощь.ПлатныеРемонты,
		|	Renault_ЗапросНаКоммерческуюПомощь.ПовтороноеПриобретенияАвто,
		|	Renault_ЗапросНаКоммерческуюПомощь.РепутационныеРиски,
		|	Renault_ЗапросНаКоммерческуюПомощь.ЮридическиеРиски,
		|	Renault_ЗапросНаКоммерческуюПомощь.СтоимостьРешенияПоГарантийнымРасценкам,
		|	Renault_ЗапросНаКоммерческуюПомощь.СтоимостьРешенияПоКоммерческимРасценкам,
		|	Renault_ЗапросНаКоммерческуюПомощь.РекомендованнаяКоммерческаяПомощь,
		|	Renault_ЗапросНаКоммерческуюПомощь.ЗапросДилераСумма,
		|	Renault_ЗапросНаКоммерческуюПомощь.Ответственный
		|ИЗ
		|	Документ.Renault_ЗапросНаКоммерческуюПомощь КАК Renault_ЗапросНаКоммерческуюПомощь
		|ГДЕ
		|	Renault_ЗапросНаКоммерческуюПомощь.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", ДокументСсылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	МакетЗКП = ПолучитьМакет("МакетЗКП");
	ОбластьДокумента = МакетЗКП.ПолучитьОбласть("ОбластьДокумента");

	ТабДокумент = Новый ТабличныйДокумент;
	ТабДокумент.ПолеСлева = 5;
	ТабДокумент.ПолеСправа = 5;
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		ЗаполнитьЗначенияСвойств(ОбластьДокумента.Параметры,ВыборкаДетальныеЗаписи);	
//		ОбластьДокумента.Параметры.СпециалистРеноТелефон = Renault_УправлениеКонтактнойИнформацией.ПолучитьОсновнойТелефонКлиента(ВыборкаДетальныеЗаписи.СпециалистРено);
//		ОбластьДокумента.Параметры.СпециалистРеноEmail = Renault_УправлениеКонтактнойИнформацией.ПолучитьОсновнойEmailКлиента(ВыборкаДетальныеЗаписи.СпециалистРено);
		
		ДЦ = Renault_CRM.ПолучитьДилерскийЦентрПользователя(ВыборкаДетальныеЗаписи.Ответственный);
		Если ЗначениеЗаполнено(ДЦ) Тогда
			ОбластьДокумента.Параметры.ДЦ = ДЦ; 
			ОбластьДокумента.Параметры.BIRКод = ДЦ.BIR;
			ОбластьДокумента.Параметры.АдресДЦ = ДЦ.ОсновнойАдрес;
		КонецЕсли;
		
		ОбластьДокумента.Параметры.ОтветственныйТелефон = Renault_УправлениеКонтактнойИнформацией.ПолучитьОсновнойТелефонКлиента(ВыборкаДетальныеЗаписи.Ответственный.Сотрудник);
		ОбластьДокумента.Параметры.ОтветственныйEmail =  Renault_УправлениеКонтактнойИнформацией.ПолучитьОсновнойEmailКлиента(ВыборкаДетальныеЗаписи.Ответственный.Сотрудник);
		
		ОбластьДокумента.Параметры.КлиентТелефон =  Renault_УправлениеКонтактнойИнформацией.ПолучитьОсновнойТелефонКлиента(ВыборкаДетальныеЗаписи.Контрагент);
		ОбластьДокумента.Параметры.КлиентАдрес =  Renault_УправлениеКонтактнойИнформацией.ПолучитьОсновнойEmailКлиента(ВыборкаДетальныеЗаписи.Контрагент);
		ОбластьДокумента.Параметры.КлиентEmail =  Renault_УправлениеКонтактнойИнформацией.АдресКлиента(ВыборкаДетальныеЗаписи.Контрагент);


	КонецЦикла;
	
	ТабДокумент.Вывести(ОбластьДокумента);
	ОбластьПодвал = МакетЗКП.ПолучитьОбласть("ОбластьПодвал");
	ТабДокумент.Вывести(ОбластьПодвал);
	
	Возврат ТабДокумент;

КонецФункции
