Перем КоличествоСтрокДоЗаписи;

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
КонецПроцедуры

Процедура ПриУстановкеНовогоНомера(СтандартнаяОбработка, Префикс)	
	Префикс = DMS_ОбщегоНазначенияСервер.ПолучитьПрефикс();
КонецПроцедуры

Процедура ПриЗаписи(Отказ)  	
	Если ОбменДанными.Загрузка Тогда 		
		Возврат;  		
	КонецЕсли;
	
	//запишем изменения пробега и ГосНомера
	Если ЗначениеЗаполнено(Автомобиль) тогда
		ТекПробег = Справочники.Автомобили.ЧтениеЗначенияРегистраСведения(Автомобиль, Перечисления.ДополнительнаяИнформацияАвтомобилей.Пробег);
		ТекПробег = ?(ТекПробег = Неопределено, 0, ТекПробег);
		Если Пробег < ТекПробег тогда
			Сообщить("Вы указали пробег автомобиля меньше существующего!");
			Отказ = Истина;
		КонецЕсли;
	КонецЕсли;
		
	//запишем изменения пробега и ГосНомера
	Если ЗначениеЗаполнено(Автомобиль) тогда
		
		ТекПробег = Справочники.Автомобили.ЧтениеЗначенияРегистраСведения(Автомобиль, Перечисления.ДополнительнаяИнформацияАвтомобилей.Пробег);
		ТекПробег = ?(ТекПробег = Неопределено, 0, ТекПробег);
		Если Пробег > ТекПробег тогда
			Справочники.Автомобили.ЗаписьЗначенияРегистраСведения(Автомобиль, Пробег,Перечисления.ДополнительнаяИнформацияАвтомобилей.Пробег,ТекущаяДата());
		КонецЕсли;
		
		Если ЗначениеЗаполнено(ГосНомер) тогда
			Если ГосНомер <> Справочники.Автомобили.ЧтениеЗначенияРегистраСведения(Автомобиль, Перечисления.ДополнительнаяИнформацияАвтомобилей.ГосНомер) тогда
				Справочники.Автомобили.ЗаписьЗначенияРегистраСведения(Автомобиль, ГосНомер,Перечисления.ДополнительнаяИнформацияАвтомобилей.ГосНомер,ТекущаяДата());
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)   	
	Если ОбменДанными.Загрузка Тогда 		
		Возврат;  		
	КонецЕсли;
		
	//Если ЗначениеЗаполнено(Автомобиль) Тогда
	//	Если ЗначениеЗаполнено(ГосНомер) тогда
	//		Если ПроверкаГосНомера(ГосНомер) тогда
	//			Сообщить("Ошибка гос. номер может содержать только цифры и буквы латинского алфавита.");
	//			Отказ = Истина;
	//		КонецЕсли;
	//	КонецЕсли;
	//	
	//КонецЕсли;
	
КонецПроцедуры

Функция ПроверкаГосНомера(ГосНомер)
	
	Для х=0 по СтрДлина(ГосНомер) цикл
		ТекСимвол = Сред(ГосНомер,х,1);
		Если НЕ КодСимвола(ТекСимвол)= 32  //пробел
			и НЕ (КодСимвола(ТекСимвол)>47 и КодСимвола(ТекСимвол)<58) //цифры
			и НЕ (КодСимвола(ТекСимвол)>64 и КодСимвола(ТекСимвол)<91) //большие латинские буквы
			и НЕ (КодСимвола(ТекСимвол)>96 и КодСимвола(ТекСимвол)<123) //маленькие латинские буквы
			Тогда
				Возврат Истина;
		КонецЕсли;
	КонецЦикла;
	
	Возврат Ложь;
		
КонецФункции

Функция СформироватьТабличныйДокументЗКП(ДокументСсылка) Экспорт
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Renault_ЗапросНаКоммерческуюПомощь.CaseNumber,
		|	Renault_ЗапросНаКоммерческуюПомощь.CaseStatus,
		|	Renault_ЗапросНаКоммерческуюПомощь.DATE_MODIFIED,
		|	Renault_ЗапросНаКоммерческуюПомощь.СпециалистРено,
		|	Renault_ЗапросНаКоммерческуюПомощь.БизнесРегион,
		|	Renault_ЗапросНаКоммерческуюПомощь.ТипКлиента,
		|	Renault_ЗапросНаКоммерческуюПомощь.Контрагент,
		|	Renault_ЗапросНаКоммерческуюПомощь.Модель,
		|	Renault_ЗапросНаКоммерческуюПомощь.КомплектацияАвто,
		|	Renault_ЗапросНаКоммерческуюПомощь.Пробег,
		|	Renault_ЗапросНаКоммерческуюПомощь.VIN,
		|	Renault_ЗапросНаКоммерческуюПомощь.ДатаПродажиАвто,
		|	Renault_ЗапросНаКоммерческуюПомощь.ГосНомер,
		|	Renault_ЗапросНаКоммерческуюПомощь.СостояниеАвто,
		|	Renault_ЗапросНаКоммерческуюПомощь.ДатаОбращенияВДЦ,
		|	Renault_ЗапросНаКоммерческуюПомощь.ФункциональныйКод,
		|	Renault_ЗапросНаКоммерческуюПомощь.Гарантия,
		|	Renault_ЗапросНаКоммерческуюПомощь.ПричинаОбращения,
		|	Renault_ЗапросНаКоммерческуюПомощь.Комментарий,
		|	Renault_ЗапросНаКоммерческуюПомощь.ПожеланиеКлиента,
		|	Renault_ЗапросНаКоммерческуюПомощь.ПрохождениеТО,
		|	Renault_ЗапросНаКоммерческуюПомощь.НаличиеДопОборудования,
		|	Renault_ЗапросНаКоммерческуюПомощь.ПлатныеРемонты,
		|	Renault_ЗапросНаКоммерческуюПомощь.ПовтороноеПриобретенияАвто,
		|	Renault_ЗапросНаКоммерческуюПомощь.РепутационныеРиски,
		|	Renault_ЗапросНаКоммерческуюПомощь.ЮридическиеРиски,
		|	Renault_ЗапросНаКоммерческуюПомощь.СтоимостьРешенияПоГарантийнымРасценкам,
		|	Renault_ЗапросНаКоммерческуюПомощь.СтоимостьРешенияПоКоммерческимРасценкам,
		|	Renault_ЗапросНаКоммерческуюПомощь.РекомендованнаяКоммерческаяПомощь,
		|	Renault_ЗапросНаКоммерческуюПомощь.ЗапросДилераСумма,
		|	Renault_ЗапросНаКоммерческуюПомощь.Ответственный
		|ИЗ
		|	Документ.Renault_ЗапросНаКоммерческуюПомощь КАК Renault_ЗапросНаКоммерческуюПомощь
		|ГДЕ
		|	Renault_ЗапросНаКоммерческуюПомощь.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", ДокументСсылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	МакетЗКП = ПолучитьМакет("МакетЗКП");
	ОбластьДокумента = МакетЗКП.ПолучитьОбласть("ОбластьДокумента");

	ТабДокумент = Новый ТабличныйДокумент;
	ТабДокумент.ПолеСлева = 5;
	ТабДокумент.ПолеСправа = 5;
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		ЗаполнитьЗначенияСвойств(ОбластьДокумента.Параметры,ВыборкаДетальныеЗаписи);	
		ОбластьДокумента.Параметры.СпециалистРеноТелефон = Renault_УправлениеКонтактнойИнформацией.ПолучитьОсновнойТелефонКлиента(ВыборкаДетальныеЗаписи.СпециалистРено);
		ОбластьДокумента.Параметры.СпециалистРеноEmail = Renault_УправлениеКонтактнойИнформацией.ПолучитьОсновнойEmailКлиента(ВыборкаДетальныеЗаписи.СпециалистРено);
		
		ДЦ = Renault_CRM.ПолучитьДилерскийЦентрПользователя(ВыборкаДетальныеЗаписи.Ответственный);
		ОбластьДокумента.Параметры.BIRКод = ДЦ.BIR;
		ОбластьДокумента.Параметры.АдресДЦ = ДЦ.ОсновнойАдрес;
		
		ОбластьДокумента.Параметры.ОтветственныйТелефон = Renault_УправлениеКонтактнойИнформацией.ПолучитьОсновнойТелефонКлиента(ВыборкаДетальныеЗаписи.Ответственный.Сотрудник);
		ОбластьДокумента.Параметры.ОтветственныйEmail =  Renault_УправлениеКонтактнойИнформацией.ПолучитьОсновнойEmailКлиента(ВыборкаДетальныеЗаписи.Ответственный.Сотрудник);
		
		ОбластьДокумента.Параметры.КлиентТелефон =  Renault_УправлениеКонтактнойИнформацией.ПолучитьОсновнойТелефонКлиента(ВыборкаДетальныеЗаписи.Контрагент);
		ОбластьДокумента.Параметры.КлиентАдрес =  Renault_УправлениеКонтактнойИнформацией.ПолучитьОсновнойEmailКлиента(ВыборкаДетальныеЗаписи.Контрагент);
		ОбластьДокумента.Параметры.КлиентEmail =  Renault_УправлениеКонтактнойИнформацией.АдресКлиента(ВыборкаДетальныеЗаписи.Контрагент);


	КонецЦикла;
	
	ТабДокумент.Вывести(ОбластьДокумента);
	ОбластьПодвал = МакетЗКП.ПолучитьОбласть("ОбластьПодвал");
	ТабДокумент.Вывести(ОбластьПодвал);
	
	Возврат ТабДокумент;

КонецФункции
//#КонецЕсли

Функция СохранитьИПрикрепитьКДокументу(ТабДокумент,ДокументСсылка) Экспорт
	
	//ВременноеИмяФайла = ПолучитьИмяВременногоФайла("XLS"); 
	ПрефиксБланка =  "Бланк_ЗКП_№";
	ИимяБланка = ПрефиксБланка + ДокументСсылка.Номер+".XLS";
	
	//Проверим создав
	ВременноеИмяФайла = КаталогВременныхФайлов()+ИимяБланка;
	
	ТабДокумент.Записать(ВременноеИмяФайла,ТипФайлаТабличногоДокумента.XLS);
	ФайлXLS = Новый Файл(ВременноеИмяФайла);
	
	Если ФайлXLS.Существует() Тогда
		
		Запрос = новый Запрос(
		"ВЫБРАТЬ
		|	КартинкиИФайлы.Идентификатор,
		|	КартинкиИФайлы.ИмяФайла,
		|	КартинкиИФайлы.ДатаСохранения,
		|	КартинкиИФайлы.Комментарий,
		|	КартинкиИФайлы.Данные КАК ХранилищеДанных,
		|	КартинкиИФайлы.Объект
		|ИЗ
		|	РегистрСведений.Renault_КартинкиИФайлы КАК КартинкиИФайлы
		|ГДЕ
		|	КартинкиИФайлы.Объект = &Объект
		|	И КартинкиИФайлы.Наименование ПОДОБНО &Наименование"
		);
		Запрос.УстановитьПараметр("Объект", ДокументСсылка);
		Запрос.УстановитьПараметр("Наименование", "%"+ПрефиксБланка+"%");
	
		Выборка = Запрос.Выполнить().Выбрать();
		Пока Выборка.Следующий() Цикл
			 Идентификатор = Выборка.Идентификатор;
		КонецЦикла;
		
		НаборЗаписей = РегистрыСведений.Renault_КартинкиИФайлы.СоздатьНаборЗаписей();
		
		Если НЕ ЗначениеЗаполнено(Идентификатор) Тогда
			ТекущийНаборЗаписей = НаборЗаписей.Добавить();		 
		Иначе
			НаборЗаписей.Отбор.Идентификатор.Установить(Идентификатор);
			НаборЗаписей.Прочитать();
			ТекущийНаборЗаписей = НаборЗаписей[0];
		КонецЕсли;
				
		ТекущийНаборЗаписей.Объект = ДокументСсылка;
		ТекущийНаборЗаписей.ИмяФайла = ФайлXLS.ПолноеИмя;
		ТекущийНаборЗаписей.ДанныеВоВнешнемФайле = Ложь;
		ТекущийНаборЗаписей.РазмерФайла = ФайлXLS.Размер();
		ТекущийНаборЗаписей.ДатаСохранения = ТекущаяДата();
		
		ТекущийНаборЗаписей.Данные = Новый ХранилищеЗначения(Новый ДвоичныеДанные(ФайлXLS.ПолноеИмя), Новый СжатиеДанных(9));
		ТекущийНаборЗаписей.Наименование = ФайлXLS.ИмяБезРасширения;

		ТекущийНаборЗаписей.Картинка = Ложь;

		Если НЕ ЗначениеЗаполнено(ТекущийНаборЗаписей.Идентификатор) Тогда
			ТекущийНаборЗаписей.Идентификатор = Новый УникальныйИдентификатор();
		Иначе
			ТекущийНаборЗаписей.Идентификатор = Идентификатор;
		КонецЕсли;
				
		НаборЗаписей.Записать(Истина);
		
	КонецЕсли;
	
	Возврат Истина;
	
КонецФункции