Процедура ПриУстановкеНовогоКода(СтандартнаяОбработка, Префикс)
	Префикс = DMS_ОбщегоНазначенияСервер.ПолучитьПрефикс();
	//Если НЕ спПриУстановкеНовогоКода(ЭтотОбъект, СтандартнаяОбработка, Префикс) Тогда Возврат; КонецЕсли;
КонецПроцедуры

Процедура ПередЗаписью(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	//По каждому элементу справочника ведутся отдельные алгоритмы расчетов в плане
	//продаж по автосервису, поэтому запрещаем запись новых.
	Если ЭтоНовый() Тогда  
		Сообщить("В данном справочнике могут содержаться только предопределенные элементы!"); 
		
		Отказ = Истина;
	КонецЕсли;	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
КонецПроцедуры
