Процедура ПередЗаписью(Отказ)

	Отказ = Ложь;
 	Отбор = Новый Структура();
	Отбор.Вставить("Наименование",ЭтотОбъект.Наименование);
	Выборка = Справочники.Домены.Выбрать(,,Отбор,);
	
	Пока Выборка.Следующий() Цикл
		СМГ_Сообщить("ОШИБКА! Уже существует элемент с наименованием "+Выборка.ПолучитьОбъект().Наименование,СтатусСообщения.ОченьВажное);
		Отказ = Истина;
		Возврат;
	КонецЦикла;
	
	// Заполним автора и дату регистрации, если объект новый
	Если ЭтоНовый() Тогда
		Автор = ПараметрыСеанса.Пользователь;
		ДатаРегистрации = ТекущаяДата();
	КонецЕсли;	
  	
КонецПроцедуры

 