
////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
		
	Объект.ДатаНач = ПолучитьДатуНачалаПериодаПоУмолчанию(ТекущаяДата());
	Объект.ДатаКон = КонецДня(ТекущаяДата());

	ОчиститьОтборы();
	
	Если ЗначениеЗаполнено(Параметры.ОбъектОтбора) Тогда
		ДатаНач = Дата(1, 1, 1);
		ДатаКон = Дата(1, 1, 1);
		МассивОбъектов.Добавить(Параметры.ОбъектОтбора);
	КонецЕсли;
		
	ОбновитьИсториюИзменений();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "внПерейтиНаТекущуюЗапись" Тогда
		Найдено = Ложь;
		Для Каждого Строки Из Объект.ИсторияИзменений Цикл
			Если Строки.Код = Параметр Тогда
				Элементы.ИсторияИзменений.ТекущаяСтрока = Строки.ПолучитьИдентификатор();
				Найдено = Истина;
				Прервать;
			КонецЕсли;
		КонецЦикла;
		
		Если НЕ Найдено И Объект.ИсторияИзменений.Количество() <> 0 тогда
			Элементы.ИсторияИзменений.ТекущаяСтрока = Объект.ИсторияИзменений[Объект.ИсторияИзменений.Количество() - 1].ПолучитьИдентификатор();
		КонецЕсли;
	ИначеЕсли ИмяСобытия = "внВсеСобытияПоОбъекту" Тогда
		// За все периоды
		Объект.ДатаНач				= Дата(1, 1, 1);
		Объект.ДатаКон				= Дата(1, 1, 1);		
		// Очищаем все отборы
		ОчиститьОтборы();
		// Делаем отбор по объекту
		МассивОбъектов.Добавить(Параметр);		
		// Обновляем историю
		ОбновитьИсториюИзмененийКлиент();
	ИначеЕсли ИмяСобытия = "внОбновитьИсторию" Тогда
		// Обновляем историю
		ОбновитьИсториюИзмененийКлиент();
	КонецЕсли;
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ЭЛЕМЕНТОВ ШАПКИ ФОРМЫ

&НаКлиенте
Процедура ДатаНачПриИзменении(Элемент)
	
	ОбновитьИсториюИзмененийКлиент();
	
КонецПроцедуры

&НаКлиенте
Процедура ДатаКонПриИзменении(Элемент)
	
	ОбновитьИсториюИзмененийКлиент();
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ЭЛЕМЕНТОВ СПИСКОВ И ТАБЛИЧНЫХ ЧАСТЕЙ

&НаКлиенте
Процедура ИсторияИзмененийПередНачаломИзменения(Элемент, Отказ)	
	
	Отказ = Истина;
	
	// Открываем данные по текущей записи
	ОткрытьСобытие(Элементы.ИсторияИзменений);
	
КонецПроцедуры

&НаКлиенте
Процедура ИсторияИзмененийПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа)
	
	Отказ = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура ИсторияИзмененийПередУдалением(Элемент, Отказ)
	
	Отказ = Истина;
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ КОМАНД ФОРМЫ

&НаКлиенте
Процедура ПоказатьИзмененияНаФорме(Команда)	
	
	Если Элементы.ИсторияИзменений.ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;

	ОбъектЖР = Элементы.ИсторияИзменений.ТекущиеДанные;

	ОбъектСсылка = НайтиСсылку(ОбъектЖР.Объект);
	Если ОбъектСсылка = Неопределено Тогда
		ОбъектСсылка = ОбъектЖР.Объект;
	КонецЕсли;
	
	ТипОбъекта = ОбъектЖР.Событие;
	
	СтрДатаИзмененияПлюсПользователь = Формат(ОбъектЖР.ДатаИзменения, "ДФ='dd.MM.yyyy HH:mm:ss'") + " " + ОбъектЖР.Пользователь;
	
	// Константа и входы, выходы
	Если ТипОбъекта = 4 ИЛИ ТипОбъекта = 9 ИЛИ ТипОбъекта = 10 ИЛИ ПустаяСтрока(ОбъектСсылка) Тогда
		#Если Клиент Тогда
		Предупреждение("Для данного типа объектов изменения не показываются на форме!", 10);
		#КонецЕсли
		Возврат;
	КонецЕсли;
	
	Попытка
		П = Новый Структура("Ключ", ОбъектСсылка);
		Форма = ПолучитьФорму(ОбъектЖР.МетаданныеОбъекта + ".ФормаОбъекта", П);
		ЭлементыФормыОбъекта = Форма.ПодчиненныеЭлементы;		
		Изменения = ПолучитьИзмененияПоОбъекту(ОбъектЖР.Код);
	Исключение
		#Если Клиент Тогда
		Предупреждение("Для данного типа объектов изменения не показываются на форме!", 10);
		#КонецЕсли
		Возврат;
	КонецПопытки;	
	
	Для Каждого Строки Из Изменения Цикл
		// Перебор всех реквизитов на форме
		Для Индекс = 0 По ЭлементыФормыОбъекта.Количество() - 1 Цикл
			Элемент = ЭлементыФормыОбъекта[Индекс];
			Если Строки.НомерСтрокиТЧ = 0 Тогда
				// ШАПКА
				Если ВРег(Элемент.Имя) = ВРег(Строки.ИмяРеквизита) Тогда
					Если Строки.ПредставлениеСтарое = Строки.ПредставлениеНовое И
						Строки.ПредставлениеНовое = "" Тогда
						СтрокаЗначений = "";
					Иначе
						СтрокаЗначений = 
						" '" + Строки.ПредставлениеСтарое + "' => " +
						" '" + Строки.ПредставлениеНовое + "'"
					КонецЕсли;
					
					Элемент.ЦветРамки = WebЦвета.Красный;
					Элемент.Подсказка = СтрДатаИзмененияПлюсПользователь + СтрокаЗначений;
				КонецЕсли;
			Иначе
				// ТЧ
				Если ВРег(Элемент.Имя) = ВРег(Строки.ИмяТЧ) Тогда
					Элемент.ЦветРамки = WebЦвета.Красный;
					Элемент.Подсказка =	СтрДатаИзмененияПлюсПользователь;
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
	
	Форма.Открыть();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьИсториюИзменения(Команда)
	
	ОбновитьИсториюИзмененийКлиент();
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьОтбор(Команда)
	
	// Устанавливаем параметры отборов
	ФормаОтбора = ПолучитьФорму("Обработка.Renault_внЖурналРегистрации.Форма.ФормаОтбораУправляемая");
	
	// 1 страница
	// Заполняем пользователей
	ФормаОтбора.Пользователи.Очистить();
	ФормаОтбора.Пользователи = Renault_внОбщийМодуль.ПолучитьПользователейИстории();
	Для Каждого Элемент Из ФормаОтбора.Пользователи Цикл
		Элемент.Пометка = МассивПользователи.НайтиПоЗначению(Элемент.Значение) <> Неопределено ИЛИ МассивПользователи.Количество() = 0;
		Элемент.Картинка = БиблиотекаКартинок.Пользователь;
	КонецЦикла;
	                                                
	// Заполняем компьютеры
	ФормаОтбора.Компьютеры.Очистить();
	ФормаОтбора.Компьютеры = Renault_внОбщийМодуль.ПолучитьКомпьютерыИстории();
	Для Каждого Элемент Из ФормаОтбора.Компьютеры Цикл
		Элемент.Пометка = МассивКомпьютеры.НайтиПоЗначению(Элемент.Значение) <> Неопределено ИЛИ МассивКомпьютеры.Количество() = 0;
		Элемент.Картинка = БиблиотекаКартинок.Картинка;
	КонецЦикла;
	
	// Заполняем события
	ФормаОтбора.События.Очистить();
	ФормаОтбора.События = Renault_внОбщийМодуль.ПолучитьСобытияИстории();
	Для Каждого Элемент Из ФормаОтбора.События Цикл
		Элемент.Пометка = МассивСобытий.НайтиПоЗначению(Элемент.Значение) <> Неопределено ИЛИ МассивСобытий.Количество() = 0;
	КонецЦикла;	
	
	// Период
	ФормаОтбора.ДатаНач = Объект.ДатаНач;
	ФормаОтбора.ДатаКон = Объект.ДатаКон;
		
	// Представление
	ФормаОтбора.ПредставлениеОбъекта = ПредставлениеОбъекта;
	
	// Данные отбора
	ФормаОтбора.ДанныеОтбора = Неопределено;
	Если МассивОбъектов.Количество() = 1 Тогда
		Попытка
			ФормаОтбора.ДанныеОтбора = ЗначениеИзСтрокиВнутрСервер(МассивОбъектов[0].Значение);
		Исключение
		КонецПопытки;
	КонецЕсли;
	
	// Данные отбора
	ФормаОтбора.ДанныеОтбораСсылка = Неопределено;
	Если МассивОбъектовСсылок.Количество() = 1 Тогда
		Попытка
			ФормаОтбора.ДанныеОтбораСсылка = ЗначениеИзСтрокиВнутрСервер(МассивОбъектовСсылок[0].Значение);
		Исключение
		КонецПопытки;
	КонецЕсли;
	
	// Метаданные
	ФормаОтбора.Мета.Очистить();
	Для Каждого Элемент Из МассивМетаданных Цикл
		ФормаОтбора.Мета.Добавить(Элемент.Значение);		
	КонецЦикла;
	
	// РИБ
	ФормаОтбора.УзлыРИБ.Очистить();
	ФормаОтбора.УзлыРИБ = Renault_внОбщийМодуль.ПолучитьУзлыРИБИстории();
	Для Каждого Элемент Из ФормаОтбора.УзлыРИБ Цикл
		Элемент.Пометка = МассивУзловРИБ.НайтиПоЗначению(Элемент.Значение) <> Неопределено ИЛИ МассивУзловРИБ.Количество() = 0;		
		Элемент.Картинка = БиблиотекаКартинок.ПланОбмена;
	КонецЦикла;		
	
	// Открываем форму
	Результат = ФормаОтбора.ОткрытьМодально();
	Если Результат = ИСТИНА Тогда // именно ИСТИНА, т.к. Результат м.б. равен Неопределено
		// Устанавливаем новые параметры
		// Пользователи
		ВсеПометки = Истина;
		МассивПользователи.Очистить();
		Для Каждого Элемент Из ФормаОтбора.Пользователи Цикл
			Если Элемент.Пометка Тогда
				МассивПользователи.Добавить(Элемент.Значение);
			Иначе
				ВсеПометки = Ложь;
			КонецЕсли;
		КонецЦикла;
		Если ВсеПометки Тогда
			МассивПользователи.Очистить();
		КонецЕсли;
		
		// Компьютеры
		ВсеПометки = Истина;
		МассивКомпьютеры.Очистить();
		Для Каждого Элемент Из ФормаОтбора.Компьютеры Цикл
			Если Элемент.Пометка Тогда
				МассивКомпьютеры.Добавить(Элемент.Значение);
			Иначе
				ВсеПометки = Ложь;
			КонецЕсли;
		КонецЦикла;
		Если ВсеПометки Тогда
			МассивКомпьютеры.Очистить();
		КонецЕсли;
		
		// РИБ
		ВсеПометки = Истина;
		МассивУзловРИБ.Очистить();
		Для Каждого Элемент Из ФормаОтбора.УзлыРИБ Цикл
			Если Элемент.Пометка Тогда
				МассивУзловРИБ.Добавить(Элемент.Значение);
			Иначе
				ВсеПометки = Ложь;
			КонецЕсли;
		КонецЦикла;
		Если ВсеПометки Тогда
			МассивУзловРИБ.Очистить();
		КонецЕсли;		
		
		// События
		ВсеПометки = Истина;
		МассивСобытий.Очистить();
		Для Каждого Элемент Из ФормаОтбора.События Цикл
			Если Элемент.Пометка Тогда
				МассивСобытий.Добавить(Элемент.Значение);
			Иначе
				ВсеПометки = Ложь;
			КонецЕсли;
		КонецЦикла;
		Если ВсеПометки Тогда
			МассивСобытий.Очистить();
		КонецЕсли;
		
		// Периоды
		Объект.ДатаНач = ФормаОтбора.ДатаНач;
		Объект.ДатаКон = ФормаОтбора.ДатаКон;
		
		// Представление
		ПредставлениеОбъекта = ФормаОтбора.ПредставлениеОбъекта;
		
		// Объекты
		МассивОбъектов.Очистить();
		Если ЗначениеЗаполнено(ФормаОтбора.ДанныеОтбора) Тогда
			МассивОбъектов.Добавить(Renault_внОбщийМодуль.СистемноеПредставлениеОбъекта(ФормаОтбора.ДанныеОтбора));
		КонецЕсли;
		
		// Объекты ссылка
		МассивОбъектовСсылок.Очистить();
		Если ЗначениеЗаполнено(ФормаОтбора.ДанныеОтбораСсылка) Тогда
			МассивОбъектовСсылок.Добавить(Renault_внОбщийМодуль.СистемноеПредставлениеОбъекта(ФормаОтбора.ДанныеОтбораСсылка));
		КонецЕсли;
		
		// Метаданные
		ВсеПометки = Истина;
		МассивМетаданных.Очистить();
		Для Каждого Элемент Из ФормаОтбора.Мета Цикл
			Если Элемент.Пометка Тогда
				МассивМетаданных.Добавить(Элемент.Значение);
			Иначе
				ВсеПометки = Ложь;
			КонецЕсли;
		КонецЦикла;
		Если ВсеПометки Тогда
			МассивМетаданных.Очистить();
		КонецЕсли;
				
		ОбновитьИсториюИзменений();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОтборПоТекущемуОбъекту(Команда)
	
	Если Элементы.ИсторияИзменений.ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	// За все периоды
	Объект.ДатаНач					= Дата(1, 1, 1);
	Объект.ДатаКон					= Дата(1, 1, 1);
	
	// Очищаем все отборы
	ОчиститьОтборы();
	
	// Делаем отбор по объекту
	ТекущиеДанные = Элементы.ИсторияИзменений.ТекущиеДанные;	
	Если ТекущиеДанные.Событие = 9 ИЛИ ТекущиеДанные.Событие = 10 Тогда
		МассивСобытий.Добавить(ТекущиеДанные.Событие);
	Иначе
		МассивОбъектов.Добавить(ТекущиеДанные.Объект);
	КонецЕсли; 
	// Обновляем историю
	ОбновитьИсториюИзмененийКлиент();
	
КонецПроцедуры

&НаКлиенте
Процедура ОтключитьОтбор(Команда)
	
	Элементы.ОтборПоИзменениямПодписок.Пометка = Ложь;
	ОчиститьОтборы();
	ОбновитьИсториюИзмененийКлиент();
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьАдминистрирование(Команда)
	
	Форма = ПолучитьФорму("Обработка.Renault_внНастройкаЖурналаРегистрации.Форма.ФормаУправляемая");
	Форма.Открыть();
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьСобытиеИстории(Команда)
	
	ОткрытьСобытие(Элементы.ИсторияИзменений);
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПодпискиНаСобытияНаСервере()
	
	ПодпискиНаСобытия = Renault_внОбщийМодуль.ПолучитьПодпискиНаСобытияТекущегоПользователя();
	Для Каждого Подписка Из ПодпискиНаСобытия Цикл
		Для Каждого Строки Из Подписка.Ссылка.Объекты Цикл
			
			Соответствие = Новый Соответствие();
			Соответствие.Вставить("МетаданныеОбъекта"	, Строки.МетаданныеОбъекта);
			Соответствие.Вставить("ИмяТЧ"				, Строки.ИмяТЧ);
			Соответствие.Вставить("ИмяРеквизита"		, Строки.ИмяРеквизита);
			
			МассивПодписок.Добавить(Соответствие);
			
		КонецЦикла;
	КонецЦикла;
	
КонецПроцедуры // ЗаполнитьПодпискиНаСобытияНаСервере()

&НаКлиенте
Процедура ОтборПоИзменениямПодписок(Команда)
	
	Элементы.ОтборПоИзменениямПодписок.Пометка = НЕ Элементы.ОтборПоИзменениямПодписок.Пометка;
	
	Если Элементы.ОтборПоИзменениямПодписок.Пометка Тогда
		
		ЗаполнитьПодпискиНаСобытияНаСервере();
		
	Иначе
		
		МассивПодписок.Очистить();
		
	КонецЕсли;
		
	// Обновляем историю
	ОбновитьИсториюИзменений();
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

&НаСервереБезКонтекста
Функция СписокЗначенийВМассив(СЗ)
	
	Массив = Новый Массив();
	Для Каждого Элемент Из СЗ Цикл
		Массив.Добавить(Элемент.Значение);
	КонецЦикла;
	
	Возврат Массив;
	
КонецФункции // СписокЗначенийВМассив

&НаСервере
Процедура УстановитьПериодПоУмолчанию()
	
	Объект.ДатаНач = ПолучитьДатуНачалаПериодаПоУмолчанию(ТекущаяДата());
	Объект.ДатаКон = КонецДня(ТекущаяДата());	
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПериодВыборкиСтрокойПоУмолчанию()
	
	Вариант = Renault_внОбщийМодульПовтИсп.глВНЗначениеПеременной("ДавностьПросмотраВЖурналеПоУмолчанию");	
	Если Вариант = 1 Тогда
		Возврат "квартал";
	ИначеЕсли Вариант = 2 Тогда
		Возврат "месяц";
	ИначеЕсли Вариант = 3 Тогда
		Возврат "неделю";
	ИначеЕсли Вариант = 4 Тогда
		Возврат "день";
	ИначеЕсли Вариант = 5 Тогда
		Возврат "час";
	Иначе
		Возврат "";
	КонецЕсли;
	
КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьДатуНачалаПериодаПоУмолчанию(ТекДата)
	
	ДатаНачала = НачалоДня(ТекДата);
	Вариант = Renault_внОбщийМодульПовтИсп.глВНЗначениеПеременной("ДавностьПросмотраВЖурналеПоУмолчанию");	
	// 0 без огранчений, 1 - за квартал, 2 - за месяц, 3 - за неделю, 4 за день, 5 за час
	Если Вариант = 1 Тогда
		Возврат ДобавитьМесяц(ТекДата, -3);
	ИначеЕсли Вариант = 2 Тогда
		Возврат ТекДата - 86400 * 30;
	ИначеЕсли Вариант = 3 Тогда
		Возврат ТекДата - 86400 * 7;
	ИначеЕсли Вариант = 4 Тогда
		Возврат ТекДата - 86400;
	ИначеЕсли Вариант = 5 Тогда
		Возврат ТекДата - 3600;
	Иначе
		Возврат Дата(1, 1, 1);
	КонецЕсли;
	
КонецФункции

&НаСервере
Процедура ОбновитьИсториюИзменений()
		
	// Запоминаем позицию
	Количество = Объект.ИсторияИзменений.Количество();
	Попытка
		Код = Объект.ИсторияИзменений.НайтиПоИдентификатору(Элементы.ИсторияИзменений.ТекущаяСтрока).Код;
	Исключение
		Код = -1;
	КонецПопытки;
	
	// Обновляем
	Выборка = Renault_внОбщийМодуль.ПолучитьИсториюИзменений(Объект.ДатаНач, Объект.ДатаКон,
			СписокЗначенийВМассив(МассивПользователи),
			СписокЗначенийВМассив(МассивКомпьютеры),
			СписокЗначенийВМассив(МассивМетаданных),
			СписокЗначенийВМассив(МассивОбъектов), 
			СписокЗначенийВМассив(МассивОбъектовСсылок), 
			СписокЗначенийВМассив(МассивСобытий),
			СписокЗначенийВМассив(МассивУзловРИБ),
			СписокЗначенийВМассив(МассивПодписок),
			ПредставлениеОбъекта);
			
	Объект.ИсторияИзменений.Очистить();
	Для Каждого Строки Из Выборка Цикл
		ЗаполнитьЗначенияСвойств(Объект.ИсторияИзменений.Добавить(), Строки);
	КонецЦикла;
	
	// Переходим на нужную позиция
	Если Код <> -1 Тогда
		Найдено = Ложь;
		Для Каждого Строки Из Объект.ИсторияИзменений Цикл
			Если Строки.Код = Код Тогда
				Элементы.ИсторияИзменений.ТекущаяСтрока = Строки.ПолучитьИдентификатор();
				Найдено = Истина;
				Прервать;
			КонецЕсли;
		КонецЦикла;
		
		Если НЕ Найдено И Объект.ИсторияИзменений.Количество() <> 0 тогда
			Элементы.ИсторияИзменений.ТекущаяСтрока = Объект.ИсторияИзменений[Объект.ИсторияИзменений.Количество() - 1].ПолучитьИдентификатор();
		КонецЕсли;
	ИначеЕсли Код = -1 И Объект.ИсторияИзменений.Количество() <> 0 Тогда
		Элементы.ИсторияИзменений.ТекущаяСтрока = Объект.ИсторияИзменений[Объект.ИсторияИзменений.Количество() - 1].ПолучитьИдентификатор();
	КонецЕсли;
	
	ОбновитьВидимостьИДоступность();
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьИсториюИзмененийКлиент()
	
	// Если все отборы отключены, и даты пустые
	// (то вопрос о выборке)
	Если МассивПользователи.Количество() = 0 И
		МассивКомпьютеры.Количество() = 0 И
		МассивМетаданных.Количество() = 0 И
		МассивОбъектов.Количество() = 0 И
		МассивОбъектовСсылок.Количество() = 0 И
		МассивСобытий.Количество() = 0 И
		МассивУзловРИБ.Количество() = 0 И
		МассивПодписок.Количество() = 0 И
		ПредставлениеОбъекта = "" И
		Объект.ДатаНач = Дата(1, 1, 1) И
		Объект.ДатаКон = Дата(1, 1, 1) Тогда
		
		
		Если Вопрос("Все отборы отключены, выборка всей истории изменений за все время работы будет выполняться очень долго.
			|Установить период выборки по умолчанию(за последний " + ПериодВыборкиСтрокойПоУмолчанию() + ")?", РежимДиалогаВопрос.ДаНет, 0) = КодВозвратаДиалога.Да Тогда
		    УстановитьПериодПоУмолчанию();
		КонецЕсли;
	КонецЕсли;
	
	ОбновитьИсториюИзменений();
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьВидимостьИДоступность()
	
	Элементы.ФормаОтключитьОтбор.Доступность = 
		МассивПользователи.Количество() <> 0 ИЛИ
		МассивКомпьютеры.Количество() <> 0 ИЛИ
		МассивМетаданных.Количество() <> 0 ИЛИ
		МассивОбъектов.Количество() <> 0 ИЛИ
		МассивОбъектовСсылок.Количество() <> 0 ИЛИ
		МассивСобытий.Количество() <> 0 ИЛИ
		МассивУзловРИБ.Количество() <> 0 ИЛИ
		МассивПодписок.Количество() <> 0 ИЛИ
		ПредставлениеОбъекта <> "";
		
КонецПроцедуры

&НаСервере
Функция ЗначениеИзСтрокиВнутрСервер(Стр)
	
	Возврат ЗначениеИзСтрокиВнутр(Стр);
	
КонецФункции

&НаСервере
Функция НайтиСсылку(Стр)
	
	Если Renault_внОбщийМодуль.ЭтаСсылкаСуществуетВИБ(Стр) Тогда
		Ссылка = ЗначениеИзСтрокиВнутр(Стр);
	Иначе
		Ссылка = Неопределено;
	КонецЕсли;
	
	Возврат Ссылка;
	
КонецФункции

&НаСервере
Функция ПолучитьИзмененияПоОбъекту(Код)
	
	Изменения = Renault_внОбщийМодуль.ПолучитьИзмененияПоОбъекту(Код);
	
	Массив = Новый Массив();
	Для Каждого Строки Из Изменения Цикл
		Соответствие = Новый Структура("НомерСтроки,ИмяТЧ,ИмяРеквизита,НомерСтрокиТЧ,ЗначениеСтарое,ЗначениеНовое,ПредставлениеСтарое,ПредставлениеНовое,ТипРеквизита");
		ЗаполнитьЗначенияСвойств(Соответствие, Строки);
		Массив.Добавить(Соответствие);
	КонецЦикла;
	
	Возврат Массив;
	
КонецФункции

&НаСервере
Процедура ОчиститьОтборы()
	
	// Очищаем все отборы
	МассивПользователи.Очистить();
	МассивКомпьютеры.Очистить();
	МассивМетаданных.Очистить();
	МассивОбъектов.Очистить();
	МассивОбъектовСсылок.Очистить();
	МассивСобытий.Очистить();
	МассивУзловРИБ.Очистить();
	МассивПодписок.Очистить();
	ПредставлениеОбъекта = "";
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьСобытие(Элемент)
	
	Если Элемент.ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	// Открываем форму
	ЗаголовокСобытия	= "Событие №" + Элемент.ТекущиеДанные.Код;
	Форма				= ПолучитьФорму("Обработка.Renault_внЖурналРегистрации.Форма.ФормаСобытияУправляемая",,ЭтаФорма, ЗаголовокСобытия);
	Форма.Заголовок		= ЗаголовокСобытия;
	// Переносим реквизиты за исключением реквизита "Объект" (иначе ошибка)
	ЗаполнитьЗначенияСвойств(Форма, Элемент.ТекущиеДанные, , "Объект");
	Форма.ЗначениеОбъекта = Элемент.ТекущиеДанные.Объект;
	Форма.УИД			= Элемент.ТекущиеДанные.ПолучитьИдентификатор();
	
	Форма.Открыть();
	
КонецПроцедуры

&НаСервере
Функция ВосстановитьОбъектСервер(ДатаИзменения, Объект)
	Структура = Renault_внОбщийМодуль.ОбразОбъектаНаДату(ДатаИзменения, Объект);	
	Если Структура = Неопределено Тогда
		Возврат Неопределено;
	Иначе
		Возврат ПоместитьВоВременноеХранилище(Структура, Новый УникальныйИдентификатор);
	КонецЕсли;	
КонецФункции

&НаСервере
Функция СоздатьНовыйОбъектПоМетаданнымСервер(МетаданныеОбъекта, АдресСтруктуры)
	Структура	= ПолучитьИзВременногоХранилища(АдресСтруктуры);
	НовыйОбъект	= Renault_внОбщийМодуль.СоздатьНовыйОбъектПоМетаданным(МетаданныеОбъекта, Структура.ОбразОбъекта);
	Возврат ПоместитьВоВременноеХранилище(НовыйОбъект, Новый УникальныйИдентификатор);
КонецФункции

&НаСервере
Процедура ВосстановитьОбъектПоАдресу(СтруктураОткрываемогоОбъекта, АдресОбъекта, АдресСтруктуры, ОткрыватьФорму) Экспорт
	// Достанем из временного хранилища
	Структура = ПолучитьИзВременногоХранилища(АдресСтруктуры);
	
	// Восстановим объект
	НовыйОбъект = ПолучитьИзВременногоХранилища(АдресОбъекта);
	Renault_внОбщийМодуль.ВосстановитьОбъект(НовыйОбъект, Структура.ОбразОбъекта, ОткрыватьФорму);	
	НовыйОбъект.Записать();
КонецПроцедуры

&НаСервере
Функция ПолучитьПоСсылкеАдресОбъекта(Ссылка)
	НовыйОбъект	= Ссылка.ПолучитьОбъект();
	Возврат ПоместитьВоВременноеХранилище(НовыйОбъект, Новый УникальныйИдентификатор);
КонецФункции

&НаКлиенте
Процедура ВернутьсяКПредыдущейВерсии(Команда)
	
	ТекущиеДанные = Элементы.ИсторияИзменений.ТекущиеДанные;
	
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
		
	Если НЕ ТекущиеДанные.Сжат Тогда		
		Предупреждение("Объект не сжат. Не удалось восстановить предыдущую версию объекта!");
		Возврат;
	КонецЕсли;
	
	ТипОбъекта = Renault_внОбщийМодуль.ПолучитьТипОбъектаПоИмени(ТекущиеДанные.МетаданныеОбъекта);
	
	Если ТипОбъекта = 4 Тогда		
		Предупреждение("Константа не может быть восстановлена и открыта!");
		Возврат;		
	КонецЕсли;
	
	// Восстановим образ объекта
	АдресСтруктуры = ВосстановитьОбъектСервер(ТекущиеДанные.ДатаИзменения, ТекущиеДанные.Объект);
	
	// Что-то пошло не так
	Если АдресСтруктуры = Неопределено Тогда
		Предупреждение("Не удалось восстановить предыдущую версию объекта!");
		Возврат;		
	КонецЕсли;
	
	СтруктураОткрываемогоОбъекта = Новый Структура;
		
	Если НЕ Renault_внОбщийМодуль.ЭтаСсылкаСуществуетВИБ(ТекущиеДанные.Объект) Тогда		
		Режим = РежимДиалогаВопрос.ДаНет;
		Ответ = Вопрос(
			"Видимо элемент удален из информационной базы 1С.
			|Создать новый объект на основании версии до удаления?", Режим, 0);
		Если Ответ = КодВозвратаДиалога.Нет Тогда
		    Возврат;
		КонецЕсли;
		
		АдресОбъектаВосстановления	= СоздатьНовыйОбъектПоМетаданнымСервер(ТекущиеДанные.МетаданныеОбъекта, АдресСтруктуры);
	Иначе		
		ОбъектВосстановленияСсылка	= Renault_внОбщийМодуль.ЗначениеИзСтрокиВнутрСервер(ТекущиеДанные.Объект);
		АдресОбъектаВосстановления	= ПолучитьПоСсылкеАдресОбъекта(ОбъектВосстановленияСсылка);
		СтруктураОткрываемогоОбъекта.Вставить("Ключ", ОбъектВосстановленияСсылка);
		
		Режим = РежимДиалогаВопрос.ДаНет;
		Ответ = Вопрос("Откратить изменение до старой версии?", Режим, 0);
		Если Ответ = КодВозвратаДиалога.Нет Тогда
		    Возврат;
		КонецЕсли;
		
	КонецЕсли;
	
	ОткрыватьФорму = Ложь;
	ВосстановитьОбъектПоАдресу(СтруктураОткрываемогоОбъекта, АдресОбъектаВосстановления, АдресСтруктуры, ОткрыватьФорму);	
	
	Если ОткрыватьФорму Тогда		
		Попытка
			Форма = ПолучитьФорму(ТекущиеДанные.МетаданныеОбъекта + ".ФормаОбъекта", СтруктураОткрываемогоОбъекта);
			Форма.Открыть();
		Исключение
			Сообщить("Не удалось открыть форму объекта после восстановления!");
		КонецПопытки;		
	КонецЕсли;

	
	Попытка
		// Удаляем старый экземпляр структуры
		УдалитьИзВременногоХранилища(АдресСтруктуры);
		УдалитьИзВременногоХранилища(АдресОбъектаВосстановления);				
	Исключение		
	КонецПопытки;
	
КонецПроцедуры
