
Процедура Renault_ПроверкаРаботыСистемы(Параметр = Неопределено) Экспорт
	ОбработкаНаСервере()
КонецПроцедуры

Процедура ОбработкаНаСервере() Экспорт
	
	BIR = Renault_ОбщийМодуль.ПолучитьBIRБазыДанных();
	Если Не ЗначениеЗаполнено(BIR) Тогда
		Возврат;
	КонецЕсли;
	
	АдресWS	 =Константы.Renault_АдресWebСервисов.Получить();
	Адрес = АдресWS +"ws/checkCRM.ws";
	Адрес = СтрЗаменить(Адрес, "?wsdl", "");
	ЛогинWS = Константы.Renault_ЛогинВебСервиса.Получить();
	ПарольWS = Константы.Renault_ПарольВебСервиса.Получить();
	ВСОпределение = Новый WSОпределения(СокрЛП(Адрес) + "?wsdl",
									СокрЛП(ЛогинWS), СокрЛП(ПарольWS));
	ВебСервис = Новый WSПрокси(ВСОпределение, "http://renault-nissan.com/schema/checkCRM", 
							   "ПроверкаРаботыСистемыCRM","ПроверкаРаботыСистемыCRMSoap12",600);
	ВебСервис.Пользователь	 = СокрЛП(ЛогинWS);
	ВебСервис.Пароль		 = СокрЛП(ПарольWS);
	СервисФабрика = ВебСервис.ФабрикаXDTO;

	//Отметка о работе системы
	Инфа  = СервисФабрика.Создать(СервисФабрика.Тип("http://renault-nissan.com/schema/checkCRM","ИнформацияОДЦ"));
	Инфа.BIR =BIR;
	Инфа.ВерсияАА = Метаданные.Версия;
	Инфа.ВерсияCRM = Константы.Renault_Версия.Получить();
	Инфа.ДатаАктуальности = ТекущаяДата();
	
	ИмяБд = "Неопределено";	
	Выборка = Справочники.CRM_ДилерскиеЦентры.Выбрать();
	Если Выборка.Следующий() Тогда
		ИмяБд = Выборка.Наименование;
	КонецЕсли;
	
	Итог = ВебСервис.CheckCRMv2(ИмяБд,Инфа);
	
	//Отправка статистики по данным
	СтатистикаКОтправке = ПолучитьСтатистикуПоДанным(BIR, ВебСервис.ФабрикаXDTO);
	ИтогОтправкиСтатистики = ВебСервис.RefreshStatisticsData(СтатистикаКОтправке);
	ЗадачиКВыполнению = ВебСервис.GetTask(BIR);
	Для Каждого ЗадачаКВыполнению Из ЗадачиКВыполнению.Строки Цикл
		Результат  = ВыполнитьЗадачу(ЗадачаКВыполнению);
		ВебСервис.RegTask(BIR,ЗадачаКВыполнению.Код,ТекущаяДата(),Результат);
	КонецЦикла;

	Если (Итог = Истина) И (ИтогОтправкиСтатистики = Истина)Тогда
		ВебСервис.RegOperation(BIR);
		
	КонецЕсли;
		
КонецПроцедуры

Функция ПолучитьПрокси()
	
	Адрес = Константы.Renault_АдресWebСервисов.Получить();	
	Адрес = Адрес +"ws/checkCRM.ws";
	//Адрес = СтрЗаменить(Адрес, "?wsdl", "");
	ЛогинWS = Константы.Renault_ЛогинВебСервиса.Получить();
	ПарольWS = Константы.Renault_ПарольВебСервиса.Получить();
	
	ОпределениеСервиса = Новый WSОпределения(Адрес, ЛогинWS, ПарольWS);
	ВебСервис = Новый WSПрокси(ОпределениеСервиса, 
		"http://renault-nissan.com/schema/checkCRM", 
		"ПроверкаРаботыСистемыCRM",
		"ПроверкаРаботыСистемыCRMSoap12",
		600);
	ВебСервис.Пользователь	 = ЛогинWS;
	ВебСервис.Пароль		 = ПарольWS;
	
	Возврат ВебСервис;	                        
	                         
КонецФункции
 
Функция ПолучитьСтатистикуПоДанным(Бир, ФабрикаСервис)
	
	МассивДЦ = ПолучитьМассивДЦ();
	
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ Renault_Трафик.Идентификатор) КАК КоличествоТрафика,
	                      |	Renault_Трафик.ДилерскийЦентр
	                      |ПОМЕСТИТЬ Трафик
	                      |ИЗ
	                      |	РегистрСведений.Renault_Трафик.СрезПоследних КАК Renault_Трафик
	                      |
	                      |СГРУППИРОВАТЬ ПО
	                      |	Renault_Трафик.ДилерскийЦентр
	                      |;
	                      |
	                      |////////////////////////////////////////////////////////////////////////////////
	                      |ВЫБРАТЬ
	                      |	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ CRM_УпущенныйТрафикСрезПоследних.ИдентификаторТрафика) КАК КоличествоУпущеногоТрафика,
	                      |	CRM_УпущенныйТрафикСрезПоследних.ДилерскийЦентр
	                      |ПОМЕСТИТЬ УпущенныйТрафик
	                      |ИЗ
	                      |	РегистрСведений.CRM_УпущенныйТрафик.СрезПоследних КАК CRM_УпущенныйТрафикСрезПоследних
	                      |
	                      |СГРУППИРОВАТЬ ПО
	                      |	CRM_УпущенныйТрафикСрезПоследних.ДилерскийЦентр
	                      |;
	                      |
	                      |////////////////////////////////////////////////////////////////////////////////
	                      |ВЫБРАТЬ
	                      |	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ Renault_РабочиеЛисты.ID) КАК КоличествоРабочихЛистов,
	                      |	Renault_РабочиеЛисты.ДилерскийЦентр
	                      |ПОМЕСТИТЬ РЛ
	                      |ИЗ
	                      |	РегистрСведений.Renault_РабочиеЛисты КАК Renault_РабочиеЛисты
	                      |
	                      |СГРУППИРОВАТЬ ПО
	                      |	Renault_РабочиеЛисты.ДилерскийЦентр
	                      |;
	                      |
	                      |////////////////////////////////////////////////////////////////////////////////
	                      |ВЫБРАТЬ
	                      |	КОЛИЧЕСТВО(CRM_ВоронкаПродаж.IDK) КАК КоличествоВоронокПродаж,
	                      |	CRM_ВоронкаПродаж.ДилерскийЦентр
	                      |ПОМЕСТИТЬ ВП
	                      |ИЗ
	                      |	РегистрСведений.CRM_ВоронкаПродаж КАК CRM_ВоронкаПродаж
	                      |
	                      |СГРУППИРОВАТЬ ПО
	                      |	CRM_ВоронкаПродаж.ДилерскийЦентр
	                      |;
	                      |
	                      |////////////////////////////////////////////////////////////////////////////////
	                      |ВЫБРАТЬ
	                      |	КОЛИЧЕСТВО(CRM_КоммерческоеПредложениеСостав.Конфигурация) КАК КоличествоКонфигурацийКП,
	                      |	CRM_КоммерческоеПредложениеСостав.Ссылка.ДилерскийЦентр
	                      |ПОМЕСТИТЬ ККП
	                      |ИЗ
	                      |	Документ.CRM_КоммерческоеПредложение.Состав КАК CRM_КоммерческоеПредложениеСостав
	                      |
	                      |СГРУППИРОВАТЬ ПО
	                      |	CRM_КоммерческоеПредложениеСостав.Ссылка.ДилерскийЦентр
	                      |;
	                      |
	                      |////////////////////////////////////////////////////////////////////////////////
	                      |ВЫБРАТЬ
	                      |	CRM_ДилерскиеЦентры.Ссылка,
	                      |	ВП.КоличествоВоронокПродаж,
	                      |	РЛ.КоличествоРабочихЛистов,
	                      |	Трафик.КоличествоТрафика,
	                      |	УпущенныйТрафик.КоличествоУпущеногоТрафика,
	                      |	&БазаДанных,
	                      |	ККП.КоличествоКонфигурацийКП
	                      |ИЗ
	                      |	Справочник.CRM_ДилерскиеЦентры КАК CRM_ДилерскиеЦентры
	                      |		ЛЕВОЕ СОЕДИНЕНИЕ Трафик КАК Трафик
	                      |		ПО (Трафик.ДилерскийЦентр = CRM_ДилерскиеЦентры.Ссылка)
	                      |		ЛЕВОЕ СОЕДИНЕНИЕ УпущенныйТрафик КАК УпущенныйТрафик
	                      |		ПО CRM_ДилерскиеЦентры.Ссылка = УпущенныйТрафик.ДилерскийЦентр
	                      |		ЛЕВОЕ СОЕДИНЕНИЕ РЛ КАК РЛ
	                      |		ПО CRM_ДилерскиеЦентры.Ссылка = РЛ.ДилерскийЦентр
	                      |		ЛЕВОЕ СОЕДИНЕНИЕ ВП КАК ВП
	                      |		ПО CRM_ДилерскиеЦентры.Ссылка = ВП.ДилерскийЦентр
	                      |		ЛЕВОЕ СОЕДИНЕНИЕ ККП КАК ККП
	                      |		ПО CRM_ДилерскиеЦентры.Ссылка = ККП.ДилерскийЦентр
	                      |ГДЕ
	                      |	CRM_ДилерскиеЦентры.Ссылка В(&Ссылки)");
						  Запрос.УстановитьПараметр("БазаДанных",Бир);
						  Запрос.УстановитьПараметр("Ссылки",МассивДЦ);
	Таблица = Запрос.Выполнить().Выгрузить();
	
	Таблица.Колонки.Добавить("ДилерскийЦентр");
	Для каждого Тек Из Таблица Цикл
		Тек.ДилерскийЦентр = Строка(Тек.Ссылка.УникальныйИдентификатор());
	КонецЦикла;
		Сериализатор = Новый СериализаторXDTO(ФабрикаСервис);
	ВозвратТаблицы = Сериализатор.ЗаписатьXDTO(Таблица);
	Возврат ВозвратТаблицы;
	
КонецФункции

Функция ПолучитьМассивДЦ()
	МассивДЦ = Новый Массив();
	Выборка = Справочники.CRM_ДилерскиеЦентры.Выбрать();
	Пока Выборка.Следующий() Цикл
		Если ЗначениеЗаполнено(Выборка.BIR) Тогда
			МассивДЦ.Добавить(Выборка.Ссылка);
		КонецЕсли;
		
	КонецЦикла;	
	Возврат МассивДЦ;
КонецФункции	

Функция ВыполнитьЗадачу(ЗадачаКВыполнению)
	Попытка	
		Обработка = ЗадачаКВыполнению.ОбработкаКВыполнению;
		КодКВыполнению = ЗадачаКВыполнению.КодКИсполнению;
		РезультатВыполнения ="";
		Если Не (Обработка = Неопределено) Тогда
			ПолныйПутьКобработке = ПолучитьИмяВременногоФайла("epf");
			Обработка.Записать(ПолныйПутьКОбработке);
			//ВнешниеОбработки.Подключить(ПолныйПутьКобработке,ЗадачаКВыполнению.Наименование,Ложь);
			ОбъектОбработка = ВнешниеОбработки.Создать(ПолныйПутьКобработке,Ложь);
			//Мета = ОбъектОбработка.Метаданные();
			Для Каждого ОписаниеПарам Из ЗадачаКВыполнению.Параметры Цикл
				ОбъектОбработка[ОписаниеПарам.ИмяПараметра]= ОписаниеПарам.ЗначениеПараметра;
			КонецЦикла;
			РезультатВыполнения =	ОбъектОбработка.ОбработкаНаСервере();
		КонецЕсли;
		Если (СтрДлина(КодКВыполнению)> 0 )  Тогда
			Выполнить(КодКВыполнению);
		КонецЕсли;
		
		Возврат РезультатВыполнения;
	Исключение
		Возврат ОписаниеОшибки();
	КонецПопытки;

КонецФункции



