&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Объект.Ссылка.Пустая() Тогда
		//ОбщийДляДокументов.ЗаполнитьНовыйДокумент(Объект, ПараметрыСеанса.ТекущийПользователь);
		Объект.Автор=ПараметрыСеанса.Пользователь;
		Объект.Организация=ПараметрыСеанса.Организация;
		Объект.Статус = Перечисления.Renault_СтатусыАктовКредитования.ВРаботе;
	КонецЕсли;
	
	Если Отказ Тогда
		СтандартнаяОбработка = Ложь;
		Возврат;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Файлы(Команда)
	Форма=ПолучитьФорму("РегистрСведений.Renault_КартинкиИФайлы.Форма.ФормаСписка");
	Форма.Отбор.Объект.Значение=Объект.Ссылка;
	Форма.Отбор.Объект.Использование=Истина;
	Форма.Отбор.Объект.ВидСравнения=ВидСравнения.Равно;
	Форма.Открыть();
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьКредитами(Команда)
	
	Если Объект.ВыданныеКредиты.Количество() Тогда
		Ответ = Вопрос("Табличная часть документа будет очищена. Продолжить?", РежимДиалогаВопрос.ДаНет,60);
		Если Ответ = КодВозвратаДиалога.Да Тогда 
			Объект.ВыданныеКредиты.Очистить();
		Иначе 
			Возврат;
		КонецЕсли;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Объект.Организация)Тогда
		Сообщить("Заполните реквизит ""Организация""!");
		Возврат;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Объект.Банк)Тогда
		Сообщить("Заполните реквизит ""Банк""!");
		Возврат;
	КонецЕсли;
		
	Если Не ЗначениеЗаполнено(Объект.ПериодС) Тогда 
		Сообщить("Заполните реквизит ""Период с""!");
		Возврат;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Объект.ПериодПо) Тогда 
		Сообщить("Заполните реквизит ""Период по""!");
		Возврат;
	КонецЕсли;
	
	ЗаполнитьТЧ();
	
	ОбновитьИтого();
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьТЧ()
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Renault_Договор.Клиент,
	|	Renault_Договор.КредитнаяПрограмма КАК Продукт,
	|	Renault_Договор.СуммаКредита,
	|	Renault_Договор.ДатаКредитногоДоговора КАК ДатаПодписанияДоговора,
	|	Renault_Договор.Ссылка КАК Договор
	|ИЗ
	|	Документ.Renault_Договор КАК Renault_Договор
	|ГДЕ
	|	Renault_Договор.ДатаКредитногоДоговора МЕЖДУ &НачалоПериода И &КонецПериода
	|	И Renault_Договор.КредитнаяПрограмма.Владелец = &Плательщик
	|	И ВЫБОР
	|			КОГДА &ОтборПоВсемОрганизациям
	|				ТОГДА ИСТИНА
	|			ИНАЧЕ Renault_Договор.Организация = &Организация
	|		КОНЕЦ
	|	И Renault_Договор.СтатусДоговора = ЗНАЧЕНИЕ(Перечисление.CRM_СтатусыДоговоровНаПродажуАвтомобиля.Подписан)
	|	И Renault_Договор.СпособОплаты В (ЗНАЧЕНИЕ(Перечисление.Renault_СпособыОплаты.Кредит), ЗНАЧЕНИЕ(Перечисление.Renault_СпособыОплаты.РеноКредит))
	|
	|УПОРЯДОЧИТЬ ПО
	|	Renault_Договор.ДатаКредитногоДоговора";
	
	Запрос.УстановитьПараметр("Организация", Объект.Организация);
	Запрос.УстановитьПараметр("Плательщик", Объект.Банк);
	Запрос.УстановитьПараметр("НачалоПериода", Объект.ПериодС);
	Запрос.УстановитьПараметр("КонецПериода", Объект.ПериодПо);
	Запрос.УстановитьПараметр("ОтборПоВсемОрганизациям", Объект.ПоВсемОрганизациям);
	
	Объект.ВыданныеКредиты.Загрузить(Запрос.Выполнить().Выгрузить());
	
КонецПроцедуры

&НаКлиенте
Процедура ПечатьСчета(Команда)
	
	Если Объект.Статус <> Перечисления.Renault_СтатусыАктовКредитования.Согласован Тогда 
		Предупреждение("Счет печатается только из документа в статусе ""Согласован""!", 15);
		Возврат;
	КонецЕсли;
	
	Если Объект.Проведен Тогда
		Если ЭтаФорма.Модифицированность = Ложь Тогда
			ТабДок = СформироватьМакетСчет();
			ТабДок.Показать();
		Иначе Сообщить("Документ был изменен! Сохраните его.", СтатусСообщения.Важное);
		КонецЕсли;	
	Иначе Сообщить("Документ должен быть проведен!", СтатусСообщения.ОченьВажное);	
	КонецЕсли;

КонецПроцедуры

&НаСервере
Функция СформироватьМакетСчет()
	
	Если ЗначениеЗаполнено(Объект.СчетНаОплату) Тогда
		ДокументСчет = Объект.СчетНаОплату.ПолучитьОбъект();
		ДокументСчет.Товары.Очистить();
	Иначе
		ДокументСчет = Документы.СчетНаОплату.СоздатьДокумент();
	КонецЕсли;
   	ДокументСчет.Дата					 = Объект.Дата;	
	ДокументСчет.Организация 		     = Объект.Организация;
	ДокументСчет.РасчетныйСчетОрганизации= ДокументСчет.Организация.ОсновнойБанковскийСчет;
	ДокументСчет.Контрагент 			 = Объект.Контрагент;
	ДокументСчет.ДоговорВзаиморасчетов	 = Объект.ДоговорВзаиморасчетов;
	ДокументСчет.ВалютаДокумента 	     = Константы.ВалютаУправленческогоУчетаКомпании.Получить();
	ДокументСчет.ПодразделениеКомпании   = Объект.ПодразделениеКомпании;
	ДокументСчет.Автор 					 = Объект.Автор;
	ДокументСчет.КурсДокумента  		 = 1;
	ДокументСчет.ТипЦен = Справочники.ТипыЦен.НормативнаяЦена; 
	ДокументСчет.ХозОперация = Справочники.ХозОперации.АктОбОказанииУслуг;

	ОплатаУслуга = Справочники.Номенклатура.НайтиПоНаименованию("Оплата комиссионного вознаграждения",Истина);
	Если ОплатаУслуга.Пустая() Тогда
		НовУслуга = Справочники.Номенклатура.СоздатьЭлемент();
		НовУслуга.УстановитьНовыйКод();
		НовУслуга.Наименование = "Оплата комиссионного вознаграждения";
		НовУслуга.Артикул = НовУслуга.Код;
		НовУслуга.ВидНоменклатуры = Перечисления.ВидыНоменклатуры.Услуга;
		НовУслуга.ТипНоменклатуры = Справочники.ТипыНоменклатуры.Услуга;
		НовУслуга.БазоваяЕдиницаИзмерения = НовУслуга.ТипНоменклатуры.ОсновнаяБазоваяЕдиницаИзмерения;
		
		НовУслуга.СтавкаНДС = Справочники.СтавкиНДС.БезНДС;
		НовУслуга.ВалютаУчета = ДокументСчет.ВалютаДокумента;
		НовУслуга.СпособРаспределенияДопРасходов = Перечисления.СпособыРаспределенияДопРасходов.НаДоходыИРасходы;
		НовУслуга.СтатьяДопРасходов=Справочники.СтатьиДоходовИРасходов.ПрочиеЗатраты;
		НовУслуга.Записать();
		ЕИ = Справочники.ЕдиницыИзмерения.СоздатьЭлемент();
		ЕИ.Владелец = НовУслуга.Ссылка; 
		ЕИ.ЕдиницаПоКлассификатору = НовУслуга.БазоваяЕдиницаИзмерения;
		ЕИ.Наименование = НовУслуга.БазоваяЕдиницаИзмерения.Наименование;
		ЕИ.Коэффициент = 1;
		ЕИ.Записать();
		НовУслуга.ОсновнаяЕдиницаИзмерения = ЕИ.Ссылка;
		НовУслуга.Записать();
		ОплатаУслуга = НовУслуга.Ссылка;
	КонецЕсли;
	
	СтрТовар = ДокументСчет.Товары.Добавить();
	
	СтрТовар.Номенклатура = ОплатаУслуга;
	СтрТовар.Количество = 1;
	СтрТовар.Коэффициент = 1;
	СтрТовар.ЕдиницаИзмерения = ОплатаУслуга.ОсновнаяЕдиницаИзмерения;
	СтрТовар.Сумма = Объект.ВыданныеКредиты.Итог("СуммаВознаграждения");
	СтрТовар.Цена =  СтрТовар.Сумма;
	СтрТовар.СуммаВсего = СтрТовар.Сумма;
	ДокументСчет.Записать();
	Объект.СчетНаОплату = ДокументСчет.Ссылка;
	Записать();
	ОрганизацияПродавец              = Объект.Организация;
	БанкПолучателяПредставление      = Объект.Организация.ОсновнойБанковскийСчет.Банк;
	СчетПолучателяПредставление      = Объект.Организация.ОсновнойБанковскийСчет.НомерСчета;
	БИКБанкаПолучателя 				 = БанкПолучателяПредставление.Код;
	СчетБанкаПолучателяПредставление = БанкПолучателяПредставление.КоррСчет;
	ИНН 							 = ОрганизацияПродавец.ИНН;
	КПП 							 = ОрганизацияПродавец.КПП;
	ПредставлениеПоставщика 		 = ОрганизацияПродавец.Наименование;
	
	Макет = Документы.Renault_АктПоКредитам.ПолучитьМакет("Счет");
	
	ОбластьЗаголовокСчета = Макет.ПолучитьОбласть("ЗаголовокСчета");
	ОбластьЗаголовок 	  = Макет.ПолучитьОбласть("Заголовок");
	ОбластьПоставщик 	  = Макет.ПолучитьОбласть("Поставщик");
	ОбластьПокупатель 	  = Макет.ПолучитьОбласть("Покупатель");
	ОбластьШапкаТаблицы   = Макет.ПолучитьОбласть("ШапкаТаблицы");
	ОбластьСтрока 		  = Макет.ПолучитьОбласть("Строка");
	ОбластьИтого 		  = Макет.ПолучитьОбласть("Итого");
	ОбластьИтогоНДС 	  = Макет.ПолучитьОбласть("ИтогоНДС");
	ОбластьСуммаПрописью  = Макет.ПолучитьОбласть("СуммаПрописью");
	ОбластьПодвалСчета 	  = Макет.ПолучитьОбласть("ПодвалСчета");
	
	ТаблДок = Новый ТабличныйДокумент;
	
	ТаблДок.АвтоМасштаб        = Истина;
	ТаблДок.ОриентацияСтраницы = ОриентацияСтраницы.Портрет;
	
	ОбластьЗаголовокСчета.Параметры.БанкПолучателяПредставление 	 = БанкПолучателяПредставление;
	ОбластьЗаголовокСчета.Параметры.БИКБанкаПолучателя 				 = БИКБанкаПолучателя;
	ОбластьЗаголовокСчета.Параметры.СчетБанкаПолучателяПредставление = СчетБанкаПолучателяПредставление;	
	ОбластьЗаголовокСчета.Параметры.СчетПолучателяПредставление 	 = СчетПолучателяПредставление;
	ОбластьЗаголовокСчета.Параметры.ИНН 							 = ИНН;
	ОбластьЗаголовокСчета.Параметры.КПП 							 = КПП;
	ОбластьЗаголовокСчета.Параметры.ПредставлениеПоставщика 		 = ПредставлениеПоставщика;
	
	Заголовок = "Счет № " + ДокументСчет.Номер + " от " + Формат(ТекущаяДата(), "ДЛФ=DD");
	ОбластьЗаголовок.Параметры.ТекстЗаголовка = Заголовок;
	
	Поставщик  = ПолучитьДанныеОрганизации(ОрганизацияПродавец);
	Покупатель = ПолучитьДанныеКонтрагентаЮрФактАдрес(Объект.Контрагент);
	
	ОбластьПоставщик.Параметры.ПредставлениеПоставщика 		= Поставщик;
	ОбластьПокупатель.Параметры.ПредставлениеПолучателя 	= Покупатель;
	
	ТаблДок.Вывести(ОбластьЗаголовокСчета);
	ТаблДок.Вывести(ОбластьЗаголовок);
	ТаблДок.Вывести(ОбластьПоставщик);
	ТаблДок.Вывести(ОбластьПокупатель);
	ТаблДок.Вывести(ОбластьШапкаТаблицы);
	
	ОбластьСтрока.Параметры.НомерСтроки = 1;
	ОбластьСтрока.Параметры.Товар = "Оплата комиссионного вознаграждения за " + Формат(Объект.ПериодС, "ДФ=ММММ") + " " + Формат(Объект.ПериодС, "ДФ=гггг") + " г.";
	
	СуммаВсего = Объект.ВыданныеКредиты.Итог("СуммаВознаграждения");
	ОбластьСтрока.Параметры.Цена = СуммаВсего;
	ОбластьСтрока.Параметры.Сумма = СуммаВсего;
	ТаблДок.Вывести(ОбластьСтрока);
	
	ОбластьИтого.Параметры.Всего = СуммаВсего;
	ТаблДок.Вывести(ОбластьИтого);
	
	// Трояновский К.Е. 15.02.2019 10:53:38 {
	// Закомментировано по DMSCOR-1087
	//Если ТекущаяДата() >= '20190101' Тогда
	//	СуммаНДС = СуммаВсего * 20 / 120;
	//Иначе
	//	СуммаНДС = СуммаВсего * 18 / 118;
	//КонецЕсли;
	СуммаНДС = СуммаВсего * ОплатаУслуга.СтавкаНДС.Ставка / (100 + ОплатаУслуга.СтавкаНДС.Ставка);
	// Трояновский К.Е. 15.02.2019 10:53:38 }
	ОбластьИтогоНДС.Параметры.НДС      = "В том числе НДС:";
	ОбластьИтогоНДС.Параметры.ВсегоНДС = Формат(СуммаНДС, "ЧДЦ=2");
	ТаблДок.Вывести(ОбластьИтогоНДС);
	
	ОбластьСуммаПрописью.Параметры.ИтоговаяСтрока = "Всего наименований " + 1 + ", на сумму " + Renault_Advanced_ОбщегоНазначения.ФорматСумм(СуммаВсего, ДокументСчет.ВалютаДокумента);
	ОбластьСуммаПрописью.Параметры.ИтогоПрописью  = Renault_Advanced_ОбщегоНазначения.СформироватьСуммуПрописью(СуммаВсего, ДокументСчет.ВалютаДокумента);
	ТаблДок.Вывести(ОбластьСуммаПрописью);
	
	//Чтение значения для руководителя
	СтруктураОтбора=Новый Структура("Организация,Объект",Объект.Организация,Перечисления.ВидыОбъектовСведений.Руководитель);
	СтруктураСведений=РегистрыСведений.СведенияКомпании.ПолучитьПоследнее(Объект.Дата,СтруктураОтбора);
	ФИОРуководителя=СтруктураСведений.Значение;
	//Чтение значения для главного бухгалтера
	СтруктураОтбора=Новый Структура("Организация,Объект",Объект.Организация,Перечисления.ВидыОбъектовСведений.ГлавныйБухгалтер);
	СтруктураСведений=РегистрыСведений.СведенияКомпании.ПолучитьПоследнее(Объект.Дата,СтруктураОтбора);
	ФИОБухгалтера=СтруктураСведений.Значение;
	
	
	ОбластьПодвалСчета.Параметры.ФИОРуководителя = "(" + Renault_Advanced_ОбщегоНазначения.ФамилияИнициалыФизЛица(ФИОРуководителя) + ")";
	ОбластьПодвалСчета.Параметры.ФИОБухгалтера   = "(" + Renault_Advanced_ОбщегоНазначения.ФамилияИнициалыФизЛица(ФИОБухгалтера)   + ")";
	ТаблДок.Вывести(ОбластьПодвалСчета);
	
	ТаблДок.ОтображатьСетку     = Ложь;
	ТаблДок.ОтображатьЗаголовки = Ложь;
	ТаблДок.АвтоМасштаб         = Истина;
	
	
	
	Возврат ТаблДок;
	
КонецФункции

&НаСервере
Функция ПолучитьДанныеОрганизации(ТекОрганизация)
	
			
	Запрос = Новый Запрос;
	Запрос.Текст = 
	  "ВЫБРАТЬ
	  |	КонтактнаяИнформация.Объект,
	  |	КонтактнаяИнформация.Представление КАК Адрес
	  |ИЗ
	  |	РегистрСведений.КонтактнаяИнформация КАК КонтактнаяИнформация
	  |ГДЕ
	  |	КонтактнаяИнформация.Объект = &Организация
	  |	И КонтактнаяИнформация.Вид = &ВидАдрес";
	  
	  	
	Запрос.УстановитьПараметр("Организация", ТекОрганизация);
	Запрос.УстановитьПараметр("ВидАдрес", Справочники.ВидыКонтактнойИнформации.АдресЮридический);
	Выборка = Запрос.Выполнить().Выбрать();
	Если  Выборка.Следующий() Тогда	
		Представление = ТекОрганизация.Наименование + ", " + Выборка.Адрес;
	Иначе 
		Представление = ТекОрганизация.Наименование;
	КонецЕсли;                                      		
	
	Возврат Представление;
	
КонецФункции

&НаСервере
Функция ПолучитьДанныеКонтрагентаЮрФактАдрес(Контрагент) 
	
	Результат = Новый Структура;
	
	Результат.Вставить("НаименованиеПолное"     , "");
	Результат.Вставить("НаименованиеКраткое"    , "");
	Результат.Вставить("ИНН"                    , "");
	Результат.Вставить("КПП"                    , "");
	Результат.Вставить("АдресОсновной"          , "");
	Результат.Вставить("ТелефонОсновной"        , "");
			
	Если НЕ ЗначениеЗаполнено(Контрагент) Тогда
		Возврат Результат;
	КонецЕсли;
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
	  "ВЫБРАТЬ
	  |	Контрагенты.НаименованиеПолное КАК НаименованиеПолное,
	  |	Контрагенты.ИНН КАК ИНН,
	  |	Контрагенты.КПП КАК КПП,
	  |	Контрагенты.Наименование КАК НаименованиеКраткое,
	  |	Контрагенты.Ссылка
	  |ПОМЕСТИТЬ ВТОсновныеДанные
	  |ИЗ
	  |	Справочник.Контрагенты КАК Контрагенты
	  |ГДЕ
	  |	Контрагенты.Ссылка = &Контрагент
	  |;
	  |
	  |////////////////////////////////////////////////////////////////////////////////
	  |ВЫБРАТЬ
	  |	КонтактнаяИнформация.Объект,
	  |	КонтактнаяИнформация.Представление КАК Адрес
	  |ПОМЕСТИТЬ ВТАдрес
	  |ИЗ
	  |	РегистрСведений.КонтактнаяИнформация КАК КонтактнаяИнформация
	  |ГДЕ
	  |	КонтактнаяИнформация.Объект = &Контрагент
	  |	И КонтактнаяИнформация.Вид = &ВидАдрес
	  |;
	  |
	  |////////////////////////////////////////////////////////////////////////////////
	  |ВЫБРАТЬ
	  |	КонтактнаяИнформация.Объект,
	  |	КонтактнаяИнформация.Представление КАК Телефон
	  |ПОМЕСТИТЬ ВТТелефон
	  |ИЗ
	  |	РегистрСведений.КонтактнаяИнформация КАК КонтактнаяИнформация
	  |ГДЕ
	  |	КонтактнаяИнформация.Объект = &Контрагент
	  |	И КонтактнаяИнформация.Вид = &ВидТелефон
	  |;
	  |
	  |////////////////////////////////////////////////////////////////////////////////
	  |ВЫБРАТЬ
	  |	ВТОсновныеДанные.НаименованиеПолное,
	  |	ВТОсновныеДанные.ИНН,
	  |	ВТОсновныеДанные.КПП,
	  |	ВТОсновныеДанные.НаименованиеКраткое,
	  |	ЕСТЬNULL(ВТТелефон.Телефон, """") КАК ТелефонОсновной,
	  |	ЕСТЬNULL(ВТАдрес.Адрес, 0) КАК АдресОсновной
	  |ИЗ
	  |	ВТОсновныеДанные КАК ВТОсновныеДанные
	  |		ЛЕВОЕ СОЕДИНЕНИЕ ВТАдрес КАК ВТАдрес
	  |		ПО ВТОсновныеДанные.Ссылка = ВТАдрес.Объект
	  |		ЛЕВОЕ СОЕДИНЕНИЕ ВТТелефон КАК ВТТелефон
	  |		ПО ВТОсновныеДанные.Ссылка = ВТТелефон.Объект";
	  
	  	
	Запрос.УстановитьПараметр("Контрагент", Контрагент);
	Запрос.УстановитьПараметр("ВидАдрес", Справочники.ВидыКонтактнойИнформации.АдресФактический);
	Запрос.УстановитьПараметр("ВидТелефон", Справочники.ВидыКонтактнойИнформации.ТелефонКонтактный);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		ЗаполнитьЗначенияСвойств(Результат, Выборка);
	Иначе
		Возврат Результат;
	КонецЕсли;
	
	Представление = "";
	
	Renault_Advanced_ОбщегоНазначения.ДобавитьТекстКПредставлению(Представление, Результат.НаименованиеПолное, ", ", "");
	Renault_Advanced_ОбщегоНазначения.ДобавитьТекстКПредставлению(Представление, Результат.ИНН,                ", ", "ИНН/КПП ");
	Renault_Advanced_ОбщегоНазначения.ДобавитьТекстКПредставлению(Представление, Результат.КПП,                "/",  "");
	Renault_Advanced_ОбщегоНазначения.ДобавитьТекстКПредставлению(Представление, Результат.АдресОсновной,      ", ", "");
	Renault_Advanced_ОбщегоНазначения.ДобавитьТекстКПредставлению(Представление, Результат.ТелефонОсновной,    ", ", "тел.: ");
	
	Возврат Представление;
	
КонецФункции


&НаКлиенте
Процедура ОбновитьИтого()
	
	ИтогоКредит = Объект.ВыданныеКредиты.Итог("СуммаКредита");
	ИтогоВознаграждение = Объект.ВыданныеКредиты.Итог("СуммаВознаграждения");
	
КонецПроцедуры

&НаКлиенте
Процедура ВыданныеКредитыСуммаКредитаПриИзменении(Элемент)
	
	ОбновитьИтого();
	
КонецПроцедуры

&НаКлиенте
Процедура ВыданныеКредитыСуммаВознагражденияПриИзменении(Элемент)
	
	ОбновитьИтого();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ОбновитьИтого();
	
КонецПроцедуры

