
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("ДилерскийЦентр") Тогда 
		ДилерскийЦентр = Параметры.ДилерскийЦентр;
	КонецЕсли;
	
	ПодставитьПараметрСписка(Справочники.CRM_Отделы.ПустаяСсылка());
	
	ПарамОформл = Renault_ОбщиеФункцииСервер.МультибрендПараметрыОформления();//Новый Цвет(254, 206, 0);
    ЦветРено = Вычислить(ПарамОформл.ОсновнойЦвет);
	ЦветРамкиНеВыбрано = Новый Цвет(153, 153, 153);
	ЦветНеВыбрано = Новый Цвет(49, 52, 49);
	ЦветФонаНеВыбрано = Новый Цвет(212, 212, 212);
	ЦветТекстаВыбрано = Новый Цвет(49, 52, 49);
	ЦветФонаВыбрано = ЦветРено;
	//ОбновитьЭлементы();
	ОтделПродаж = Renault_CRM.ПолучитьОтделАвтосалона(ДилерскийЦентр); 
	
	
КонецПроцедуры


&НаКлиенте
Процедура ОбновитьЭлементы()
	
	Если ВыбранОтделПродаж Тогда 
		Элементы.ВыбратьОтделПродаж.ЦветРамки = ЦветРено;
		Элементы.ВыбратьОтделПродаж.ЦветТекста = ЦветТекстаВыбрано;
		Элементы.ВыбратьОтделПродаж.ЦветФона = ЦветФонаВыбрано;
	Иначе 
		Элементы.ВыбратьОтделПродаж.ЦветРамки = ЦветРамкиНеВыбрано;
		Элементы.ВыбратьОтделПродаж.ЦветТекста = ЦветНеВыбрано;
		Элементы.ВыбратьОтделПродаж.ЦветФона = ЦветФонаНеВыбрано;
	КонецЕсли;
	
	Если ВыбранДругойОтдел Тогда
		Элементы.ВыбратьДругойОтдел.Заголовок = "Отдел: " + Строка(ВыбранныйОтдел);
		Элементы.ВыбратьДругойОтдел.ЦветРамки = ЦветРено;
		Элементы.ВыбратьДругойОтдел.ЦветТекста = ЦветТекстаВыбрано;
		Элементы.ВыбратьДругойОтдел.ЦветФона = ЦветФонаВыбрано;
	Иначе
		Элементы.ВыбратьДругойОтдел.Заголовок = "Другой отдел";
		Элементы.ВыбратьДругойОтдел.ЦветРамки = ЦветРамкиНеВыбрано;
		Элементы.ВыбратьДругойОтдел.ЦветТекста = ЦветНеВыбрано;
		Элементы.ВыбратьДругойОтдел.ЦветФона = ЦветФонаНеВыбрано;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ПодставитьПараметрСписка(Отдел)
	
	СписокСотрудников.Параметры.УстановитьЗначениеПараметра("Отдел",Отдел);
	
КонецПроцедуры

&НаКлиенте
Процедура ВыбратьОтделПродаж(Команда)
	ВыбранОтделПродаж = Истина;
	ВыбранДругойОтдел = Не ВыбранОтделПродаж;
	ПодставитьПараметрСписка(ОтделПродаж);
	ОбновитьЭлементы();
КонецПроцедуры

&НаКлиенте
Процедура ВыбратьДругойОтдел(Команда)
	
	ФормаСписка = ПолучитьФорму("Обработка.Renault_ARM_Администратор.Форма.ФормаВыбораИзСпискаПлиткой");
	Список = Renault_CRM.ПолучитьСписокПрочихОтделовЦентра(ДилерскийЦентр);
	ФормаСписка.Список = Список;
	ФормаСписка.Заголовок = "Выбор отдела";
	Ответ = ФормаСписка.ОткрытьМодально();
	
	Если ЗначениеЗаполнено(Ответ) Тогда
		ВыбранныйОтдел = Ответ;
		ВыбранДругойОтдел = Истина;
		ВыбранОтделПродаж  = Не ВыбранДругойОтдел;
		ПодставитьПараметрСписка(ВыбранныйОтдел);
	КонецЕсли;
	
	ОбновитьЭлементы();
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ОбновитьЭлементы();
КонецПроцедуры

&НаКлиенте
Процедура СписокСотрудниковВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)

	Закрыть(Элементы.СписокСотрудников.ТекущиеДанные.Ссылка);
	
КонецПроцедуры
