           Перем Док;

Процедура АвтоФормированиеРЛмодуль() Экспорт
	
 	СерверДляЗапросаCRWL = "crwl.ru";
 	//ТекстДляЗапросаCRWL = "/api/rest/latest/get_ads/?api_key=771d2ceed16425ee413c01aee622d444&region=2451&last=24&source=auto.ru,trucks.auto.ru,am.ru,irr.ru,mail.ru,avito.ru,drom.ru,chance.ru,autonavigator.ru,avtobizon.ru,bibika.ru";
	ТекстДляЗапросаCRWL = "/api/rest/latest/get_ads/?api_key=771d2ceed16425ee413c01aee622d444&region=729&last=24&source=auto.ru,trucks.auto.ru,am.ru,irr.ru,mail.ru,avito.ru,drom.ru,chance.ru,autonavigator.ru,avtobizon.ru,bibika.ru";
	
 	Для Сч=1 По 3 Цикл
		
		Если Сч = 1 Тогда
			ТекстДляЗапросаCRWL = "/api/rest/latest/get_ads/?api_key=771d2ceed16425ee413c01aee622d444&region=2451&last=24&source=auto.ru,trucks.auto.ru,am.ru,irr.ru,mail.ru,avito.ru,drom.ru,chance.ru,autonavigator.ru,avtobizon.ru,bibika.ru";
		ИначеЕсли Сч = 2 Тогда
			ТекстДляЗапросаCRWL = "/api/rest/latest/get_ads/?api_key=771d2ceed16425ee413c01aee622d444&region=729&last=24&source=auto.ru,trucks.auto.ru,am.ru,irr.ru,mail.ru,avito.ru,drom.ru,chance.ru,autonavigator.ru,avtobizon.ru,bibika.ru";
		Иначе
			ТекстДляЗапросаCRWL = "/api/rest/latest/get_ads/?api_key=771d2ceed16425ee413c01aee622d444&region=1181&last=24&source=auto.ru,trucks.auto.ru,am.ru,irr.ru,mail.ru,avito.ru,drom.ru,chance.ru,autonavigator.ru,avtobizon.ru,bibika.ru";
		КонецЕсли; 
 		
		Соединение = Новый HTTPСоединение(СерверДляЗапросаCRWL);     
		
		ФайлСтрокой = ПолучитьИмяВременногоФайла("json"); 
		
		Соединение.Получить(ТекстДляЗапросаCRWL, ФайлСтрокой);      
		#Если Клиент Тогда
			Сообщить("Удачно выполнен GET запрос!");
		#КонецЕсли
		ИмяФайла = ФайлСтрокой;
		ЧтениеИзJSON(ИмяФайла);
		
		Попытка
			УдалитьФайлы(ФайлСтрокой,"*.json");
		Исключение
			#Если Клиент Тогда
				Сообщить(ОписаниеОшибки());
			#КонецЕсли
		КонецПопытки;
	
	КонецЦикла;
 	
КонецПроцедуры


Процедура ЧтениеИзJSON(ИмяФайла)
	тЧтение = Новый ЧтениеJSON;
	//тЧтение.ОткрытьФайл("C:\test.json");
	тЧтение.ОткрытьФайл(ИмяФайла);
	Пока тЧтение.Прочитать() Цикл
		Если Отладка Тогда
			#Если Клиент Тогда
			Сообщить("Тип текущего элемента " + тЧтение.ТипТекущегоЗначения);
			#КонецЕсли
		КонецЕсли; 
		Если тЧтение.ТипТекущегоЗначения = ТипЗначенияJSON.ИмяСвойства Тогда
			Имя  = тЧтение.ТекущееЗначение;
			Если Отладка Тогда
				#Если Клиент Тогда 
				Сообщить("Имя = " + Имя );
				#КонецЕсли
			КонецЕсли; 
		КонецЕсли;
		Если тЧтение.ТипТекущегоЗначения = ТипЗначенияJSON.Булево ИЛИ
			тЧтение.ТипТекущегоЗначения = ТипЗначенияJSON.Строка ИЛИ 
			тЧтение.ТипТекущегоЗначения = ТипЗначенияJSON.Число ИЛИ 
			тЧтение.ТипТекущегоЗначения = ТипЗначенияJSON.Комментарий Тогда
			ТекущееЗначение = тЧтение.ТекущееЗначение;
			Если Отладка Тогда
				#Если Клиент Тогда 
				Сообщить("Значение = " + ТекущееЗначение);
				#КонецЕсли
			КонецЕсли; 
			Если Имя = "Id" Тогда
				Попытка
					Док.Записать();
					#Если Клиент Тогда 
					Сообщить("Записан документ "+Док+" ; с реквизитом "+Имя+" = "+ТекущееЗначение);
					#КонецЕсли
				Исключение
					//
				КонецПопытки; 
				Док = НайтиСоздатьРабочийЛист(ТекущееЗначение);
			КонецЕсли;
			Если НЕ обЗначениеНеЗаполнено(Док) Тогда
				
				Если Имя = "phone" Тогда
					Попытка
						Док.НомерТелефона         = СокрЛП(ТекущееЗначение);
						Док.ПредставлениеТелефона = СокрЛП(ТекущееЗначение);
					Исключение
						//					
					КонецПопытки; 
				КонецЕсли;
				
				//Бондаренко++ 20180312
  				Если Имя = "region" Тогда
					Попытка
						Док.ГдеПроживает         = СокрЛП(ТекущееЗначение);
 					Исключение
						//					
					КонецПопытки; 
				КонецЕсли;
				
				Если Имя = "company" Тогда
					Если СокрЛП(ТекущееЗначение)="1" Тогда
						Попытка
							Док.ЮридическоеЛицо = Истина;
 						Исключение
							//					
						КонецПопытки; 
					КонецЕсли;	
				КонецЕсли;
 				
				Если Имя = "price" Тогда
					Попытка
						Док.ЦенаПродавца = СокрЛП(ТекущееЗначение);
 					Исключение
						//					
					КонецПопытки; 
				КонецЕсли;
				
				Если Имя = "run" Тогда
					Попытка
						Док.ПробегТрейдИн = Дата(Число(СокрЛП(ТекущееЗначение)),1,1);
 					Исключение
						//					
					КонецПопытки; 
				КонецЕсли;
				
				Если Имя = "year" Тогда
					Попытка
						Док.ГодВыпускаТрейдИн = СокрЛП(ТекущееЗначение);
 					Исключение
						//					
					КонецПопытки; 
				КонецЕсли;
 				//Бондаренко-- 20180312
  				
				Если Имя = "marka" Тогда
					Марка = СокрЛП(ТекущееЗначение);
 				КонецЕсли; 
				
				Если Имя = "model" Тогда
					ТекНаименованиеМодели = Марка+" "+СокрЛП(ТекущееЗначение);
					Попытка
						Док.МодельТрейдИн = Справочники.Модели.НайтиПоНаименованию(ТекНаименованиеМодели);
						Док.КомментарийTradeIn = ТекНаименованиеМодели;
 					Исключение
						//					
					КонецПопытки; 
				КонецЕсли;
				
				Если Имя = "fio" Тогда
 					Попытка
						Док.Контрагент = СокрЛП(ТекущееЗначение);
  					Исключение
						//					
					КонецПопытки; 
				КонецЕсли;
 
				Если Имя = "url" Тогда
					Попытка
						Док.СсылкаНаОбъявление = СокрЛП(ТекущееЗначение);
 					Исключение
						//					
					КонецПопытки; 
				КонецЕсли;
				
				ИмяРус = Имя;
				ИмяРус = ЗаменитьИмяНаРус(Имя);
				
				Попытка
					Если НЕ обЗначениеНеЗаполнено(Док.Комментарий) Тогда
						Док.Комментарий = Док.Комментарий+" "+Символы.ВК+Символы.ПС+СокрЛП(ИмяРус)+": "+СокрЛП(ТекущееЗначение);
					Иначе	
						Док.Комментарий = СокрЛП(ИмяРус)+": "+СокрЛП(ТекущееЗначение);	
 					КонецЕсли;  
 				Исключение
					//					
				КонецПопытки; 
				
			КонецЕсли;
		КонецЕсли;	
	КонецЦикла;
	
	Попытка
		Док.Записать();
	    #Если Клиент Тогда 
		Сообщить("Записан документ "+Док+" ; с реквизитом "+Имя+" = "+ТекущееЗначение);
		#КонецЕсли
	Исключение
		//
	КонецПопытки; 
	
	тЧтение.Закрыть(); 	   
	
КонецПроцедуры

Функция ЗаменитьИмяНаРус(Имя)
	СтрВрем = Имя;
 	СтрВрем = СтрЗаменить(СтрВрем,"model_2","Модель 2");
	СтрВрем = СтрЗаменить(СтрВрем,"region_Id","Код региона"); 
	СтрВрем = СтрЗаменить(СтрВрем,"average_price","Средняя цена"); 
	СтрВрем = СтрЗаменить(СтрВрем,"difference_price","Разброс цен") ;
 	СтрВрем = СтрЗаменить(СтрВрем,"phone_find","Номер телефона найден"); 
	СтрВрем = СтрЗаменить(СтрВрем,"run_ed","Единица измерения пробега"); 
  	СтрВрем = СтрЗаменить(СтрВрем,"Id","Идентификатор объявления");
	СтрВрем = СтрЗаменить(СтрВрем,"dt","Дата");
	СтрВрем = СтрЗаменить(СтрВрем,"region","Регион");
 	СтрВрем = СтрЗаменить(СтрВрем,"color","Цвет кузова");
	СтрВрем = СтрЗаменить(СтрВрем,"body","Тип кузова");
	СтрВрем = СтрЗаменить(СтрВрем,"transmission","Тип КПП");
	СтрВрем = СтрЗаменить(СтрВрем,"enginevol","Объём двигателя"); 
 	СтрВрем = СтрЗаменить(СтрВрем,"engine","Двигатель"); 
 	СтрВрем = СтрЗаменить(СтрВрем,"condition","Состояние"); 
	СтрВрем = СтрЗаменить(СтрВрем,"drive","Привод"); 
	СтрВрем = СтрЗаменить(СтрВрем,"run" ,"Пробег"); 
 	СтрВрем = СтрЗаменить(СтрВрем,"year","Год выпуска"); 
	СтрВрем = СтрЗаменить(СтрВрем,"modification","Модификация"); 
	СтрВрем = СтрЗаменить(СтрВрем,"phone_find","Номер телефона"); 
	СтрВрем = СтрЗаменить(СтрВрем,"Фамилия, Имя, Отчество","Продавец"); 
	СтрВрем = СтрЗаменить(СтрВрем,"address","Адрес"); 
	СтрВрем = СтрЗаменить(СтрВрем,"price","Цена"); 
	СтрВрем = СтрЗаменить(СтрВрем,"info","Информация"); 
	СтрВрем = СтрЗаменить(СтрВрем,"horse","Мощность (л.с)"); 
	СтрВрем = СтрЗаменить(СтрВрем,"vin","VIN"); 
	СтрВрем = СтрЗаменить(СтрВрем,"company","Компания"); 
	СтрВрем = СтрЗаменить(СтрВрем,"fuel","Тип топлива"); 
	СтрВрем = СтрЗаменить(СтрВрем,"photo","Фотографии"); 
	СтрВрем = СтрЗаменить(СтрВрем,"latitude","Широта"); 
	СтрВрем = СтрЗаменить(СтрВрем,"longitude","Долгота"); 
	СтрВрем = СтрЗаменить(СтрВрем,"wheel","Расположение рулевого управления"); 
	СтрВрем = СтрЗаменить(СтрВрем,"complect","Комплектация"); 
 	СтрВрем = СтрЗаменить(СтрВрем,"metro","Метро"); 
 	СтрВрем = СтрЗаменить(СтрВрем,"source","Источник");
	СтрВрем = СтрЗаменить(СтрВрем,"fast","Быстрая продажа");
	СтрВрем = СтрЗаменить(СтрВрем,"gender","Пол");
 	СтрВрем = СтрЗаменить(СтрВрем,"phone","Номер телефона");
	СтрВрем = СтрЗаменить(СтрВрем,"marka","Марка");
	СтрВрем = СтрЗаменить(СтрВрем,"model","Модель");
	СтрВрем = СтрЗаменить(СтрВрем,"fio","ФИО");
	СтрВрем = СтрЗаменить(СтрВрем,"url","Ссылка на объявление");
	Возврат СтрВрем;
КонецФункции // ЗаменитьИмяРус()
 
Функция НайтиСоздатьРабочийЛист(Идент)
 	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	РабочийЛист.Комментарий,
		|	РабочийЛист.Ссылка,
		|	РабочийЛист.Дата,
		|	РабочийЛист.ПометкаУдаления
		|ИЗ
		|	Документ.РабочийЛист КАК РабочийЛист
		|ГДЕ
		|	(РабочийЛист.Комментарий ПОДОБНО &ВыбКоммент
		|			ИЛИ РабочийЛист.ИдентификаторОбъявления = &ВыбИдентификаторОбъявления)
		|	И РабочийЛист.Дата МЕЖДУ &ДатаНач И &ДатаКон
		|	И РабочийЛист.ПометкаУдаления = ЛОЖЬ";
	
	Запрос.УстановитьПараметр("ВыбКоммент","%%"+Идент+"%%");
	Запрос.УстановитьПараметр("ВыбИдентификаторОбъявления",Идент);
	Запрос.УстановитьПараметр("ДатаНач",НачалоДня(ТекущаяДата()));
	Запрос.УстановитьПараметр("ДатаКон",КонецДня(ТекущаяДата()));
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Возврат ВыборкаДетальныеЗаписи.Ссылка;
	КонецЦикла;
	
	НовДок = Документы.РабочийЛист.СоздатьДокумент();
	НовДок.Дата = ТекущаяДата();
	НовДок.Автор = ПараметрыСеанса.Пользователь;
	НовДок.ВалютаДокумента = Константы.ВалютаРегламентированногоУчетаОрганизаций;
	НовДок.КурсДокумента = 1.0;
	НовДок.КурсВалютыУпр = 1.0;
	НовДок.ДатаСоздания = ТекущаяДата();
	//НовДок.Комментарий = Идент;
	
	НовДок.ПредставлениеТелефона = "Новый";
	НовДок.НомерТелефона = "Новый";
	НовДок.ВидТелефона=Справочники.ВидыКонтактнойИнформации.ТелефонКонтактный;
	НовДок.Контрагент = "Клиент интернета";
	НовДок.ПодразделениеКомпании = ПараметрыСеанса.ПодразделениеКомпании;
	НовДок.Организация = ПараметрыСеанса.Организация;
	НовДок.Менеджер = ПараметрыСеанса.Пользователь.Сотрудник;
	НовДок.РуководительМенеджера = ПараметрыСеанса.Пользователь.Сотрудник;
	НовДок.Пол = Перечисления.ПолФизическихЛиц.НеУказан;
	НовДок.ВидКонтакта=Перечисления.ВидыСобытий.ТелефонныйЗвонок;
	НовДок.Реклама=Справочники.ИсточникиИнформации.ОбъявлениеОПродажеАвтомобиляВИнтернет;
	НовДок.ВидОплаты=Перечисления.ВидыОплаты.Обмен;
	НовДок.Статус=Справочники.СтатусыРабочегоЛиста.Создан;
	НовДок.ТрейдИн=Истина;
	
	Попытка
		НовДок.ИдентификаторОбъявления = Идент;
  	Исключение
		//	
	КонецПопытки;
	
	НовСтрокаПользователи = НовДок.Пользователи.Добавить();
	НовСтрокаПользователи.Пользователь = ПараметрыСеанса.Пользователь;
 
	Попытка
		НовДок.Записать();
		#Если Клиент Тогда 
		Сообщить("Записан новый документ "+НовДок);
		#КонецЕсли
	Исключение
		#Если Клиент Тогда 
		Сообщить("ОШИБКА! Не удалось записать новый документ Рабочий лист с идентификатором "+Идент,СтатусСообщения.ОченьВажное);	
		#КонецЕсли
		НовДок = Документы.РабочийЛист.ПустаяСсылка();
 	КонецПопытки; 
	
	Возврат НовДок;
 
КонецФункции // НайтиСоздатьРабочийЛист()


