&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	//отбор	по ДЦ
	Если ЗначениеЗаполнено(Список.Отбор.Элементы) Тогда  //Блинков добавлена проверка DMSREN-755
		ЭлементОтбора=Список.Отбор.Элементы.Получить(0);
		ЭлементОтбора.ВидСравнения=ВидСравненияКомпоновкиДанных.Равно;
		ЭлементОтбора.Использование=Истина;
		ЭлементОтбора.ЛевоеЗначение=Новый ПолеКомпоновкиДанных("ДилерскийЦентр");
		ЭлементОтбора.ПравоеЗначение=Renault_CRM.ПолучитьДилерскийЦентрПользователя(ПараметрыСеанса.Пользователь);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура кнОтбор(Команда)
	Если ТекущийРежимЗапуска() = РежимЗапускаКлиентскогоПриложения.УправляемоеПриложение Тогда
		Источник=Renault_ОбщиеФункции.ИсточникДанныхФормы(ЭтаФорма,"Список");
		Renault_ОбщиеФункции.ОткрытьФормуОтбора(ЭтаФорма,Источник,ЭтаФорма["Список"].КомпоновщикНастроек,"ОтборСписка","Список",,Истина)
	КонецЕсли;	
КонецПроцедуры




&НаКлиенте
Процедура ОтборСписка(КомпНастроек,ИмяСписка) Экспорт
	Если КомпНастроек=Неопределено Тогда Возврат КонецЕсли;		
	ЭтаФорма[ИмяСписка].КомпоновщикНастроек.ЗагрузитьФиксированныеНастройки(КомпНастроек.ФиксированныеНастройки);
	//ЭтаФорма[ИмяСписка].КомпоновщикНастроек.ЗагрузитьНастройки(КомпоновщикНастроек.Настройки);
	//ЭтаФорма[ИмяСписка].КомпоновщикНастроек.ЗагрузитьПользовательскиеНастройки(КомпоновщикНастроек.ПользовательскиеНастройки);
	//ЭтаФорма[ИмяСписка].КомпоновщикНастроек.ЗагрузитьФиксированныеНастройки(КомпоновщикНастроек.ФиксированныеНастройки);
	Элементы[ИмяСписка].Обновить();
КонецПроцедуры


&НаКлиенте
Процедура кнПериод(Команда)
	ИмяСписка="Список";	
	НастройкаПериода=Новый НастройкаПериода;
	НастройкаПериода.ДатаНачала=Элементы[ИмяСписка].Период.ДатаНачала;
	НастройкаПериода.ДатаОкончания=Элементы[ИмяСписка].Период.ДатаОкончания;
	НастройкаПериода.ВариантПериода=ВариантПериода.ПроизвольныйИнтервал;
	НастройкаПериода.Редактировать();
	Элементы[ИмяСписка].Период.ДатаНачала=НастройкаПериода.ДатаНачала;
	Элементы[ИмяСписка].Период.ДатаОкончания=НастройкаПериода.ДатаОкончания;
	Элементы[ИмяСписка].Обновить();
КонецПроцедуры


&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Если Не Renault_РаботаСПравамиПользователя.ЕстьПравоОткрытияПодсистемыАвтосервиса(ПараметрыСеанса.Пользователь) тогда
		Сообщить("Недостаточно прав доступа.");
		Отказ = Истина;
		Возврат;
	КонецЕсли;	
КонецПроцедуры

