
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Если Не Renault_РаботаСПравамиПользователя.ЕстьПравоОткрытияОтчетапродаж(ПараметрыСеанса.Пользователь,"CRM_ЗаменыМенеджеров") тогда
		Сообщить("Недостаточно прав доступа.");
		СтандартнаяОбработка = Ложь;
		Отказ = Истина;
		Возврат;
	КонецЕсли;	
	Если ЗначениеЗаполнено(ОтборМенеджер) Тогда
		//Установим отбор и сформируем отчет
		УстановитьПараметрОтбораКомпоновки("МенеджерЗаменен", ОтборМенеджер);		
	КонецЕсли;
	
КонецПроцедуры

Процедура УстановитьПараметрОтбораКомпоновки(Имя, Значение)
	
	Идентификатор = Неопределено;
	Для Каждого Элемент Из Отчет.КомпоновщикНастроек.Настройки.Отбор.Элементы Цикл
		Если ТипЗнч(Элемент) = Тип("ЭлементОтбораКомпоновкиДанных") Тогда
			Если Элемент.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("МенеджерЗаменен") Тогда
				Идентификатор = Элемент.ИдентификаторПользовательскойНастройки;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	Если ЗначениеЗаполнено(Идентификатор) Тогда
		Для Каждого Элемент Из Отчет.КомпоновщикНастроек.ПользовательскиеНастройки.Элементы Цикл
			Если ТипЗнч(Элемент) = Тип("ЭлементОтбораКомпоновкиДанных") Тогда
				Если Элемент.ИдентификаторПользовательскойНастройки = Идентификатор Тогда
					Элемент.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
					Элемент.Использование = Истина;
					Элемент.ПравоеЗначение = Значение;
				Иначе
					Элемент.Использование = Ложь;
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	 
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("ОтборМенеджер") Тогда
		ОтборМенеджер = Параметры.ОтборМенеджер;
	КонецЕсли;
	
КонецПроцедуры