
&НаКлиенте
Перем РезультатПолученияДопИнформации;

&НаКлиенте
Перем ФормаДлительнойОперации;

&НаКлиенте
Перем ПараметрыОбработчика;

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	ЗаполнитьЗначенияСвойств(Объект,Параметры);
	
	Если НЕ ЗначениеЗаполнено(Объект.Ссылка) Тогда
		Объект.ПродавецСтрока = ПараметрыСеанса.Пользователь.Наименование;
		Объект.Продавец = ПараметрыСеанса.Пользователь;
		Объект.ДилерскийЦентр = Renault_CRM.ПолучитьДилерскийЦентрПользователя(ПараметрыСеанса.Пользователь);
		Объект.BIR = Сред(Объект.ДилерскийЦентр.BIR, 1, 8);
		Объект.Счет = "00"+ Сред(Объект.ДилерскийЦентр.BIR, 5, 4); 
	КонецЕсли;
	Если Параметры.Свойство("Ответ") Тогда
		сОтвет = Параметры.Ответ;
		Если сОтвет.Свойство("Модель") Тогда 
			Объект.Модель = Справочники.Модели.НайтиПоРеквизиту("Артикул", сОтвет.Модель);
			Если сОтвет.Свойство("Версия") Тогда
				Объект.Версия = Справочники.ВариантыКомплектации.НайтиПоРеквизиту("Артикул",сОтвет.Версия,,Объект.Модель);   // DMSREN-785, передаем модель 4ым параметром
			КонецЕсли;
			Объект.Цвет = Справочники.Цвета.НайтиПоРеквизиту("Артикул",сОтвет.Цвет);
			ЦветСалона = Справочники.DMS_ЦветаСалона.НайтиПоРеквизиту("Артикул",сОтвет.ЦветСалона);
			Если ЦветСалона = Справочники.DMS_ЦветаСалона.ПустаяСсылка() и ЗначениеЗаполнено(сОтвет.ЦветСалона) тогда
				НовыйЦветСалона = Справочники.DMS_ЦветаСалона.СоздатьЭлемент();
				НовыйЦветСалона.Артикул = сОтвет.ЦветСалона;
				НовыйЦветСалона.Наименование = сОтвет.ЦветСалонаНаименование;
				НовыйЦветСалона.Записать();
				ЦветСалона = НовыйЦветСалона.Ссылка;
			КонецЕсли; 
			Объект.ЦветСалона = ЦветСалона;
			ВариантСалона = Справочники.DMS_ВариантыСалона.НайтиПоРеквизиту("Артикул",сОтвет.ВариантСалона);
			Если ВариантСалона = Справочники.DMS_ВариантыСалона.ПустаяСсылка() и ЗначениеЗаполнено(сОтвет.ВариантСалона) тогда
				НовыйВариант = Справочники.DMS_ВариантыСалона.СоздатьЭлемент();
				НовыйВариант.Артикул = сОтвет.ВариантСалона;
				НовыйВариант.Наименование = сОтвет.ВариантСалонаНаименование;
				НовыйВариант.Записать();
				ВариантыСалона = НовыйВариант.Ссылка;
			КонецЕсли; 
			Объект.ВариантСалона = ВариантСалона;
			Объект.ТипАвтомобиля = Перечисления.DMS_ТипыАвтомобилей.VP;
			МинимальнаяДатаПоставки = сОтвет.ДатаДоставки;
		КонецЕсли;
	КонецЕсли;
	Если Параметры.Свойство("Договор") 
		И ЗначениеЗаполнено(Параметры.Договор) Тогда 
		Объект.ДоговорКП = Параметры.Договор;
		Если НЕ ЗначениеЗаполнено(Объект.Клиент) Тогда
			Объект.Клиент = Параметры.Договор.КлиентДоговора;
		КонецЕсли;
	КонецЕсли;
	
	Если Параметры.Свойство("ИдентификаторСтрокиДоговора") 
		И ЗначениеЗаполнено(Параметры.ИдентификаторСтрокиДоговора) Тогда 
		Объект.ИдентификаторСтрокиДоговора = Параметры.ИдентификаторСтрокиДоговора;
	КонецЕсли;

	Если Параметры.Свойство("Продавец") Тогда
		ПользовательПродавец = Renault_CRM.ПолучитьПользователяПоСотруднику(Параметры.Продавец);
		Если ЗначениеЗаполнено(ПользовательПродавец) Тогда
			Объект.Продавец = ПользовательПродавец;
			Объект.ПродавецСтрока = Объект.Продавец.Наименование;
		КонецЕсли;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Объект.Клиент) Тогда
		ЗаполнитьЗначенияСвойств(ЭтаФорма,КлиентПриИзмененииНаСервере(Объект.Клиент));
	КонецЕсли;
	
	УстановитьВидимость();
	УправлениеДоступностьюЭлементов();
	
	//Элементы.ГруппаНетEmail.Видимость = Не ЗначениеЗаполнено(EMail);
	Если ЗначениеЗаполнено(Объект.Модель) Тогда
		Элементы.ЗаголовокКонфигурации.Заголовок =  УстановитьЗаголовокКонфигуратора (Объект.Модель, Объект.Версия, Объект.Цвет, Объект.ВариантСалона, Объект.ЦветСалона);
	Иначе
		Элементы.ЗаголовокКонфигурации.Заголовок = "Обновить конфигурацию";	
	КонецЕсли;
	
	Элементы.ЗаголовокКонфигурации.Гиперссылка = Истина;
	Элементы.ЗаголовокКонфигурации.УстановитьДействие("Нажатие", "ОбновитьКонфигурациюАвто");
	ЗаполнитьСписокКоммерческихАкцийНаСервере();
	
	Если Объект.ДатаЖелаемойПоставки = Дата(1,1,1) 
		И (ЗначениеЗаполнено(Объект.VIN) ИЛИ (ЗначениеЗаполнено(Объект.Модель) И ЗначениеЗаполнено(Объект.Версия))) Тогда
		ВыполнитьРасчетМинимальногоСрокаПоставки(Ложь); 
		
	ИначеЕсли ЗначениеЗаполнено(Объект.Ссылка) Тогда
		ПараметрыРасчета = РегистрыСведений.DMS_АрхивРасчетовМинДатыПоставки.ПолучитьПараметрыРасчетаМинДатыПоставки(Объект.Ссылка, Объект.VIN);	
		
		Если ПараметрыРасчета <> Неопределено Тогда
			НоваяСтрока = ПараметрыРасчетаМДП.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, ПараметрыРасчета);
			МинимальнаяДатаПоставки = ПараметрыРасчета.МинимальнаяДатаПоставки;
			
			УстановитьПояснениеКСрокуПоставки(); 
		КонецЕсли;
	КонецЕсли;	
	
	Если ЗначениеЗаполнено(Объект.Ссылка) Тогда
		ЦентрКонтракт = ?(Объект.ЦентрализованныйКонтракт, "Да", "Нет");
	КонецЕсли;	
	
	//+++
	ПодставитьДокументСогласия();
	//---
	
КонецПроцедуры

&НаСервере
Процедура ПодставитьДокументСогласия()
	ДокументСогласия = Документы.DMS_СогласиеНаОбработкуПерсональныхДанных.ВернутьСогласиеПоКлиенту(Объект.Клиент);
	
	//Если Не ЗначениеЗаполнено(ДокументСогласия) Тогда 
	//	Элементы.ДокументСогласия.Заголовок = "Создать документ обработки персональных данных";
	//Иначе 
	//	Элементы.ДокументСогласия.поЗаголовок = "";
	//КонецЕсли;	
	Если Не ЗначениеЗаполнено(ДокументСогласия) Тогда 
		Элементы.ДекорацияСогласия.Заголовок = "Создать документ обработки персональных данных";
	Иначе 
		Элементы.ДекорацияСогласия.Заголовок = ДокументСогласия;
	КонецЕсли;	
	
	УстановитьСогласияПоКонтрагенту();
КонецПроцедуры

&НаСервере
Процедура УстановитьСогласияПоКонтрагенту()
	
	СогласиеНаОПД = Ложь;
	СогласиеНаКоммуникацию = Ложь;
	СогласиеНаПодключаемыеСервисы = Ложь;
	
	Если Объект.Клиент.СогласиеНаОбработкуПерсональныхДанных = Перечисления.ВариантыОтветов.Да Тогда
		СогласиеНаОПД = Истина;
	КонецЕсли;
	
	СогласиеНаКоммуникацию = Объект.Клиент.СогласиеНаПолучениеSMS;
	СогласиеНаПодключаемыеСервисы = ДокументСогласия.СогласиеНаПодключаемыеСервисы;
	
	Элементы.ПечатьОПД.Доступность = СогласиеНаОПД;
	Элементы.ПечатьКоммуникация.Доступность = СогласиеНаКоммуникацию;
	Элементы.ПечатьСервисы.Доступность = СогласиеНаПодключаемыеСервисы;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ПодключитьОбработчикОжидания("ЗаполнитьСписокКоммерческихАкцийНаКлиенте",0.1,Истина);
	
	Объект.КоммерческаяАкция1 = Справочники.DMS_КоммерческиеАкции.НайтиПоКоду("0000");

КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	ПроверитьЗаполнениеПолей(Отказ);
	
	Если ПараметрыЗаписи.Свойство("ОбменДанными") Тогда
		ТекущийОбъект.ОбменДанными.Загрузка = ПараметрыЗаписи.ОбменДанными;
		ТекущийОбъект.ОбменДанными.Получатели.АвтоЗаполнение = не ПараметрыЗаписи.ОбменДанными;
	КонецЕсли;
		
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)

	Если ЗначениеЗаполнено(ТекущийОбъект.Ссылка) Тогда
		Для Каждого СтрокаТЗ Из ПараметрыРасчетаМДП Цикл 
			ПараметрыРасчета = Новый Структура;
			ПараметрыРасчета.Вставить("VIN",                     СтрокаТЗ.VIN);
			ПараметрыРасчета.Вставить("ДатаОтсчета",             СтрокаТЗ.ДатаОтсчета);
			ПараметрыРасчета.Вставить("НазваниеДаты",            СтрокаТЗ.НазваниеДаты);
			ПараметрыРасчета.Вставить("СрокДоставки",            СтрокаТЗ.СрокДоставки);
			ПараметрыРасчета.Вставить("СрокНаСкладе",            СтрокаТЗ.СрокНаСкладе);
			ПараметрыРасчета.Вставить("СрокПодготовки",          СтрокаТЗ.СрокПодготовки);
			ПараметрыРасчета.Вставить("ОписаниеРасчета",         СтрокаТЗ.ОписаниеРасчета);
			ПараметрыРасчета.Вставить("МинимальнаяДатаПоставки", СтрокаТЗ.МинимальнаяДатаПоставки);
			ПараметрыРасчета.Вставить("ЛокальноВДМС",            СтрокаТЗ.ЛокальноВДМС);	
			ПараметрыРасчета.Вставить("ЗаявкаНаАвтомобиль",      ТекущийОбъект.Ссылка);	
			
			РегистрыСведений.DMS_АрхивРасчетовМинДатыПоставки.СоздатьЗаписьРасчетаМинДатыПоставки(ПараметрыРасчета);		
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "ОбработатьЗакрытиеКонфигуратора" Тогда
		Если Параметр <> Неопределено Тогда
			Объект.VIN = "";
			ЗаполнитьЗначенияСвойств(Объект, Параметр);
			Объект.ВариантСалона = Параметр.Салон;
			Элементы.ЗаголовокКонфигурации.Заголовок =  УстановитьЗаголовокКонфигуратора(Объект.Модель, Объект.Версия, Объект.Цвет, Объект.ВариантСалона, Объект.ЦветСалона);	
		КонецЕсли;
	КонецЕсли;	
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементов

&НаКлиенте
Процедура VIN1Нажатие(Элемент, СтандартнаяОбработка)
	
	ОткрытьЗначение(ВернутьАвтомобильПоVIN(Объект.VIN));
	
КонецПроцедуры

&НаКлиенте
Процедура VINПриИзменении(Элемент)
	
	ПодключитьОбработчикОжидания("ЗаполнитьСписокКоммерческихАкцийНаКлиенте",0.1,Истина);
	
	Объект.ДатаЖелаемойПоставки = Дата(1,1,1);	
	ВыполнитьРасчетМинимальногоСрокаПоставки(Ложь); 
	
КонецПроцедуры

&НаКлиенте
Процедура КлиентПриИзменении(Элемент)
	Если ЗначениеЗаполнено(Объект.Клиент) Тогда
		ЗаполнитьЗначенияСвойств(ЭтаФорма,КлиентПриИзмененииНаСервере(Объект.Клиент));
	КонецЕсли;
	//+++
	ПодставитьДокументСогласия();
	//---
КонецПроцедуры

&НаКлиенте
Процедура ОбычнаяСделкаПриИзменении(Элемент)
	
	Объект.Конверсия = Ложь;
	Объект.Лизинг = Ложь;
	УстановитьВидимость();
	
КонецПроцедуры

&НаКлиенте
Процедура КонверсияПриИзменении(Элемент)
	
	Объект.ОбычнаяСделка = Ложь;
	//Объект.Лизинг = Ложь;
	УстановитьВидимость();
	
КонецПроцедуры

&НаКлиенте
Процедура ЛизингПриИзменении(Элемент)
	
	//Объект.Конверсия = Ложь;
	Объект.ОбычнаяСделка = Ложь;
	УстановитьВидимость();
	
КонецПроцедуры

&НаКлиенте
Процедура ПродавецПриИзменении(Элемент)
	
	Объект.ПродавецСтрока = Строка(Объект.Продавец);
	
КонецПроцедуры

&НаКлиенте            
Процедура ТипЗаявкиПриИзменении(Элемент)
	
	Если Объект.ТипЗаявки <> ПредопределенноеЗначение("Справочник.DMS_ТипыЗаявки.КрупныеКлиенты") Тогда
		Объект.ЦентрализованныйКонтракт = Ложь;	
		ЦентрКонтракт = "";
	КонецЕсли;	
	
	Объект.ДатаЖелаемойПоставки = Дата(1,1,1);	
	ВыполнитьРасчетМинимальногоСрокаПоставки(Ложь); 
	
	УстановитьВидимость();
	
КонецПроцедуры

&НаКлиенте
Процедура ПочтаКлиентаПриИзменении(Элемент)
	Элементы.ГруппаНетEmail.Видимость = Не ЗначениеЗаполнено(EMail);
	Renault_УправлениеКонтактнойИнформацией.ЗаписатьОсновнойEmailКлиента(EMail, Объект.Клиент);
КонецПроцедуры

&НаКлиенте
Процедура ДилерскийЦентрПриИзменении(Элемент)
	ДилерскийЦентрПриИзмененииНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ТелефонКлиентаПриИзменении(Элемент)
	Renault_УправлениеКонтактнойИнформацией.ЗаписатьОсновнойТелефонКлиента(ТелефонКлиента, Объект.Клиент);
КонецПроцедуры

&НаКлиенте
Процедура ДатаЖелаемойПоставкиПриИзменении(Элемент)
	
	Если МинимальнаяДатаПоставки <> Дата(1,1,1) И Объект.ДатаЖелаемойПоставки < МинимальнаяДатаПоставки Тогда
		ПоказатьПредупреждение(, "Желаемая дата поставки должна быть ≥ " + Формат(МинимальнаяДатаПоставки, "ДФ=dd.MM.yyyy"),, "Установка даты поставки");
		Объект.ДатаЖелаемойПоставки = Дата(1,1,1);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ОтправитьВDistriNet(Команда)
	         
	Отказ = Ложь;
	ПроверитьЗаполнениеПолей(Отказ);
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Объект.Ссылка) или Модифицированность Тогда
		Ответ = Вопрос("Заявка не записана, отправка не возможна, выполнить запись?",РежимДиалогаВопрос.ДаНет);
		Если Ответ=КодВозвратаДиалога.Да Тогда
			Если не Записать(Новый Структура("ОбменДанными", Истина)) Тогда
				Возврат;
			КонецЕсли;
		Иначе
			Возврат;
		КонецЕсли;
	КонецЕсли;
	ПараметрыВызоваСервера = Новый Структура;
	ПараметрыВызоваСервера.Вставить("Ссылка",Объект.Ссылка);
	РезультатПолученияДопИнформации = ВыполнитьЗапрос (ПараметрыВызоваСервера);
	Если РезультатПолученияДопИнформации.ФоновоеЗадание Тогда
		Renault_ДлительныеОперацииКлиент.ИнициализироватьПараметрыОбработчикаОжидания(ПараметрыОбработчика);
		ПодключитьОбработчикОжидания("ФоновоеЗаданиеЗагрузкаФайлаНаКлиенте", 1, Истина);
		ФормаДлительнойОперации = Renault_ДлительныеОперацииКлиент.ОткрытьФормуДлительнойОперации(ЭтаФорма, РезультатПолученияДопИнформации.ФоновоеЗаданиеИдентификатор);
	Иначе
		ОбработатьРезультатВыполненияЗадания();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьПоКлиенту(Команда)
	
	Если ЗначениеЗаполнено(Объект.Клиент) Тогда
		ЗаполнитьЗначенияСвойств(ЭтаФорма,КлиентПриИзмененииНаСервере(Объект.Клиент));
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПолучитьМинимальнуюДатуПоставки(Команда)
	
	ВыполнитьРасчетМинимальногоСрокаПоставки(Истина);
	
КонецПроцедуры


#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервереБезКонтекста
Функция КлиентПриИзмененииНаСервере(Клиент)
	
	ДанныеКлиента = Новый Структура;
	ДанныеКлиента.Вставить("Фамилия",Клиент.Фамилия);
	ДанныеКлиента.Вставить("Имя",Клиент.Имя);
	ДанныеКлиента.Вставить("Отчество",Клиент.Отчество);
	ДанныеКлиента.Вставить("Пол",Клиент.Пол);
	ДанныеКлиента.Вставить("ДатаРождения",Клиент.ДатаРождения);
	ДанныеКлиента.Вставить("ИНН",Клиент.ИНН);
	Если Клиент.ФормаСобственности = Перечисления.ФормыСобственности.ЧастноеЛицо Тогда
		АдресКлиента = Renault_УправлениеКонтактнойИнформацией.АдресКлиента(Клиент);
		ТелефонКлиента = Renault_УправлениеКонтактнойИнформацией.ПолучитьОсновнойТелефонКлиента(Клиент);
	Иначе
		Запись = РегистрыСведений.КонтактнаяИнформация.СоздатьМенеджерЗаписи();
		Запись.Вид = Справочники.ВидыКонтактнойИнформации.АдресЮридический;
		Запись.Тип = Перечисления.ТипыКонтактнойИнформации.Адрес;
		Запись.Объект = Клиент;
		Запись.Прочитать();
		АдресКлиента = Запись.Представление;
		ТелефонКлиента = Renault_УправлениеКонтактнойИнформацией.ПолучитьОсновнойТелефонКлиента(Клиент);
	КонецЕсли;

	Email = Renault_УправлениеКонтактнойИнформацией.ПолучитьОсновнойEmailКлиента(Клиент);
	
	ДанныеКлиента.Вставить("АдресКлиента",АдресКлиента);
	ДанныеКлиента.Вставить("ТелефонКлиента",ТелефонКлиента);
	ДанныеКлиента.Вставить("Email",Email);
		
	Возврат ДанныеКлиента;
	
КонецФункции

&НаСервере
Процедура ДилерскийЦентрПриИзмененииНаСервере()
	Объект.Счет = "00"+ Сред(Объект.ДилерскийЦентр.BIR, 5, 4); 
КонецПроцедуры

&НаСервереБезКонтекста
Функция ВернутьАвтомобильПоVIN(VIN)
	
	Возврат Справочники.Автомобили.НайтиПоРеквизиту("VIN",Vin);
	
КонецФункции

&НаСервере
Процедура УправлениеДоступностьюЭлементов () 
	
	Если ЗначениеЗаполнено(Объект.Ссылка) и не ЗначениеЗаполнено(Объект.ДатаПродажи) Тогда
		Элементы.Клиент.Доступность = Ложь;
		Элементы.ИНН.Доступность = Ложь;
		Элементы.ГруппаАкции.Доступность = Ложь;
		Элементы.ТипЗаявки.Доступность = Ложь;  
		Элементы.ГруппаШапка.Доступность = Ложь;
		Элементы.ПочтаКлиента.Доступность = истина;
		Элементы.ТелефонКлиента.Доступность = Истина;
		Элементы.ПолучитьМинимальнуюДатуПоставки.Доступность = Ложь;	
		Элементы.ЦентрКонтракт.Доступность = Ложь;
		Элементы.ЦентрКонтрактДекорация.Доступность = Ложь;
	иначеЕсли ЗначениеЗаполнено(Объект.Ссылка) и ЗначениеЗаполнено(Объект.ДатаПродажи) Тогда
		Элементы.ГруппаАкции.Доступность = Ложь;
		Элементы.ПолучитьМинимальнуюДатуПоставки.Доступность = Ложь;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьВидимость()
	
	Если Не Объект.ОбычнаяСделка И Не Объект.Конверсия И Не Объект.Лизинг Тогда
		Объект.ОбычнаяСделка = Истина;	
	КонецЕсли;
	
	Элементы.ГруппаКорп.Видимость = 
		Объект.ТипЗаявки = Справочники.DMS_ТипыЗаявки.КорпоративныеКлиенты 
		Или Объект.ТипЗаявки = Справочники.DMS_ТипыЗаявки.КрупныеКлиенты;
		
	Элементы.ФИО.Видимость = НЕ Элементы.ГруппаКорп.Видимость;
	Элементы.ДатаРождения.Видимость = НЕ Элементы.ГруппаКорп.Видимость;
	Элементы.ИНН.Видимость = НЕ Элементы.ДатаРождения.Видимость;
		
	Элементы.Кузовостроитель.Доступность = Объект.Конверсия;
	Элементы.ЛизинговаяКомпания.Доступность = Объект.Лизинг;
	
	Если Не Объект.Конверсия Тогда
		Объект.Кузовостроитель = "";
	КонецЕсли;
	
	Если Не Объект.Лизинг Тогда
		Объект.ЛизинговаяКомпания = "";
	КонецЕсли;
	
	Если ПараметрыСеанса.DMS_Бренд <> Справочники.CRM_МаркаАвтомобиля.RENAULT Тогда
		Элементы.РегистрируемВMyRenault.Видимость = Ложь;
	КонецЕсли;
	
	Элементы.ЦентрКонтракт.Видимость = Объект.ТипЗаявки = ПредопределенноеЗначение("Справочник.DMS_ТипыЗаявки.КрупныеКлиенты");
	Элементы.ЦентрКонтрактДекорация.Видимость = Элементы.ЦентрКонтракт.Видимость;

КонецПроцедуры

&НаСервереБезКонтекста
Функция УстановитьЗаголовокКонфигуратора (Модель, Версия, Цвет, ВариантСалона, ЦветСалона)
	
	Если ЗначениеЗаполнено(Модель) и ЗначениеЗаполнено(Версия) Тогда
		Возврат Модель.Артикул +" " + Версия.Артикул + " " + Цвет.Артикул + " " + ВариантСалона + " " + ЦветСалона;
	Иначе
		Возврат "Конфигурация не выбрана...";
	КонецЕсли;
	
КонецФункции

&НаСервере
Процедура УстановитьПояснениеКСрокуПоставки()
	
	Элементы.ДекорацияСрокПоставки.Заголовок = "Минимальная дата поставки автомобиля - " + ?(ЗначениеЗаполнено(МинимальнаяДатаПоставки), Формат(МинимальнаяДатаПоставки, "ДФ=dd.MM.yyyy"), "не получена!");
	
КонецПроцедуры

&НаСервере
Процедура ПроверитьЗаполнениеПолей (ЕстьОшибки)
	
	Если Не ЗначениеЗаполнено(Объект.Счет) Тогда
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Счет не указан";
		Сообщение.Сообщить();
		ЕстьОшибки = Истина;
	КонецЕсли;
	
	Если СтрДлина(Объект.Счет) <> 6 Тогда
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "В поле ""Счет"" должны быть указано 6 символов";
		Сообщение.Поле = "Счет";
		Сообщение.Сообщить();
		ЕстьОшибки = Истина;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Объект.Продавец) Тогда
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Продавец не указан"; 
		Сообщение.Поле = "Продавец";
		Сообщение.Сообщить();
		ЕстьОшибки = Истина;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Объект.ТипЗаявки) Тогда
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Тип клиента не указан";
		Сообщение.Поле = "ТипЗаявки";
		Сообщение.Сообщить();
		ЕстьОшибки = Истина;
	КонецЕсли;
	
	Если Объект.Клиент.ФормаСобственности = Перечисления.ФормыСобственности.ЧастноеЛицо 
		или не (Объект.ТипЗаявки = Справочники.DMS_ТипыЗаявки.КорпоративныеКлиенты 
		или Объект.ТипЗаявки = Справочники.DMS_ТипыЗаявки.КрупныеКлиенты 
		или Объект.ТипЗаявки = Справочники.DMS_ТипыЗаявки.Демо 
		или Объект.ТипЗаявки = Справочники.DMS_ТипыЗаявки.Подменный) тогда
		
		Если НЕ ЗначениеЗаполнено(Фамилия) Или не ЗначениеЗаполнено(Имя) тогда
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = "ФИО не указано";
			Сообщение.Сообщить();
			ЕстьОшибки = Истина;
		КонецЕсли;
		
	ИначеЕсли Объект.Клиент.ФормаСобственности = Перечисления.ФормыСобственности.ЮридическоеЛицо 
		или Объект.ТипЗаявки = Справочники.DMS_ТипыЗаявки.КорпоративныеКлиенты 
		или Объект.ТипЗаявки = Справочники.DMS_ТипыЗаявки.КрупныеКлиенты 
		или Объект.ТипЗаявки = Справочники.DMS_ТипыЗаявки.Демо 
		или Объект.ТипЗаявки = Справочники.DMS_ТипыЗаявки.Подменный Тогда
		
		Если Объект.Конверсия И Не ЗначениеЗаполнено(Объект.Кузовостроитель) Тогда
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = "Кузовостроитель не указан";
			Сообщение.Поле = "Кузовостроитель";
			Сообщение.Сообщить();
			ЕстьОшибки = Истина;
		КонецЕсли;
		Если Объект.Лизинг И Не ЗначениеЗаполнено(Объект.ЛизинговаяКомпания) Тогда
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = "Лизинговая компания не указана"; 
			Сообщение.Поле = "ЛизинговаяКомпания";
			Сообщение.Сообщить();
			ЕстьОшибки = Истина;
		КонецЕсли;		
		
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Объект.Модель) ТОгда
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Конфигурация не заполнена";
		Сообщение.Сообщить();
		ЕстьОшибки = Истина;
	КонецЕсли;
	Если Не ЗначениеЗаполнено(ТелефонКлиента) Тогда
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Не указан телефон";
		Сообщение.Сообщить();
		ЕстьОшибки = Истина;
	КонецЕсли;
	Если Не ЗначениеЗаполнено(Объект.ДатаЖелаемойПоставки) Тогда
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Не указана дата желаемой поставки";
		Сообщение.Сообщить();
		ЕстьОшибки = Истина;
	КонецЕсли;
	Если Не ЗначениеЗаполнено(Объект.КоммерческаяАкция1) Тогда
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Не указана коммерческая акция";
		Сообщение.Поле = "КоммерческаяАкция1";
		Сообщение.Сообщить();
		ЕстьОшибки = Истина;
	КонецЕсли;
	
	// Проверим на дубли заявок. Если есть, отказ.
	Если Не Объект.Аннулирована и ЗначениеЗаполнено(Объект.VIN) тогда // DMSREN-1121
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		|	DMS_ЗаявкаНаАвтомобиль.Номер,
		|	DMS_ЗаявкаНаАвтомобиль.НомерDMS,
		|	DMS_ЗаявкаНаАвтомобиль.Дата
		|ИЗ
		|	Документ.DMS_ЗаявкаНаАвтомобиль КАК DMS_ЗаявкаНаАвтомобиль
		|ГДЕ
		|	DMS_ЗаявкаНаАвтомобиль.Ссылка <> &Ссылка
		|	И DMS_ЗаявкаНаАвтомобиль.VIN = &VIN
		|	И НЕ DMS_ЗаявкаНаАвтомобиль.ПометкаУдаления
		|	И НЕ DMS_ЗаявкаНаАвтомобиль.Аннулирована";
		
		Запрос.УстановитьПараметр("Ссылка", Объект.Ссылка);
		Запрос.УстановитьПараметр("VIN", Объект.VIN);
		Выборка = Запрос.Выполнить().Выбрать();
		ЕстьДубли = Ложь;
		Пока Выборка.Следующий() цикл
			Сообщить("Существует заявка на автомобиль № "+Выборка.Номер+", DMS ("+Выборка.НомерDMS+") от "+Формат(Выборка.Дата,"ДФ=dd.MM.yyyy"));		
			ЕстьДубли 	= Истина;
			ЕстьОшибки	= Истина;
		КонецЦикла;
		Если ЕстьДубли тогда
			Сообщить("Необходимо аннулировать другие заявки.");
		КонецЕсли;
	КонецЕсли;
	
	Если Объект.ТипЗаявки = ПредопределенноеЗначение("Справочник.DMS_ТипыЗаявки.КрупныеКлиенты") Тогда
		Если ЦентрКонтракт = "" Тогда
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = "Не указан признак ""Централизованный контракт"".";
			Сообщение.Поле = "ЦентрКонтракт";
			Сообщение.Сообщить();
			ЕстьОшибки = Истина;
		КонецЕсли;
	КонецЕсли;	

КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьСписокКоммерческихАкцийНаКлиенте()
	
	ЗаполнитьСписокКоммерческихАкцийНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСписокКоммерческихАкцийНаСервере()

	СписокДоступныхКоммерческихАкций = DMS_ОбменДаннымиСДилерскимПорталом.ВернутьСписокДоступныхКоммерческихАкций(Объект.VIN);
	ЭтаФорма.Элементы.КоммерческаяАкция1.СписокВыбора.ЗагрузитьЗначения(СписокДоступныхКоммерческихАкций.ВыгрузитьЗначения());
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьКонфигурациюАвто(Элемент, НавигационнаяСсылкаФорматированнойСтроки, СтандартнаяОбработка)
			
	сПараметры = Новый Структура;
	Если ЗначениеЗаполнено(Объект.Модель) и ЗначениеЗаполнено(Объект.Версия) Тогда
		сПараметры.Вставить("Модель",Объект.Модель);
		сПараметры.Вставить("Версия", Объект.Версия);
		сПараметры.Вставить("Цвет", Объект.Цвет);
		сПараметры.Вставить("Опции", Объект.Опции);
		сПараметры.Вставить("Салон", Объект.ВариантСалона);
		сПараметры.Вставить("ЦветСалона", Объект.ЦветСалона);
		сПараметры.Вставить("ТипАвтомобиля", Объект.ТипАвтомобиля);
	КонецЕсли;

	//ОткрытьФорму("Документ.DMS_ЗаявкаНаАвтомобиль.Форма.ФормаКонфигуратора",сПараметры,,,,,ОписаниеОповещенияОЗакрытии);
	Результат = ОткрытьФормуМодально("Документ.DMS_ЗаявкаНаАвтомобиль.Форма.ФормаКонфигуратора",сПараметры);
	
	Если Результат <> Неопределено Тогда
		Объект.VIN = "";
		ЗаполнитьЗначенияСвойств(Объект, Результат);
		Объект.ВариантСалона = Результат.Салон;
		Элементы.ЗаголовокКонфигурации.Заголовок = УстановитьЗаголовокКонфигуратора(Объект.Модель, Объект.Версия, Объект.Цвет, Объект.ВариантСалона, Объект.ЦветСалона);	
		
		Объект.ДатаЖелаемойПоставки = Дата(1,1,1);	
		ВыполнитьРасчетМинимальногоСрокаПоставки(Ложь); 
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ВыполнитьЗапрос (ПараметрыВызоваСервера)
	РезультатФоновогоЗадания = Renault_ДлительныеОперации.ЗапуститьВыполнениеВФоне(УникальныйИдентификатор, 
	"DMS_ОбменДаннымиСДилерскимПорталом.ОтправитьЗаявкуВДилерскийПортал", ПараметрыВызоваСервера);
	Результат = Новый Структура;
	Если РезультатФоновогоЗадания.ЗаданиеВыполнено Тогда
		Результат.Вставить("ФоновоеЗадание", Ложь);
		Результат.Вставить("АдресХранилища", РезультатФоновогоЗадания.АдресХранилища);
	Иначе 
		Результат.Вставить("ФоновоеЗадание", Истина);
		Результат.Вставить("ФоновоеЗаданиеИдентификатор", РезультатФоновогоЗадания.ИдентификаторЗадания);
		Результат.Вставить("АдресХранилища", РезультатФоновогоЗадания.АдресХранилища);
	КонецЕсли;
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Процедура ФоновоеЗаданиеЗагрузкаФайлаНаКлиенте()
	Результат = Новый Структура;
	Результат.Вставить("ФоновоеЗаданиеВыполнено", Ложь);
	Результат.ФоновоеЗаданиеВыполнено = Renault_ДлительныеОперации.ЗаданиеВыполнено(РезультатПолученияДопИнформации.ФоновоеЗаданиеИдентификатор);

	Если Результат.ФоновоеЗаданиеВыполнено Тогда
		Если ФормаДлительнойОперации.Открыта() 
			И ФормаДлительнойОперации.ИдентификаторЗадания = РезультатПолученияДопИнформации.ФоновоеЗаданиеИдентификатор Тогда
				Renault_ДлительныеОперацииКлиент.ЗакрытьФормуДлительнойОперации(ФормаДлительнойОперации);
		КонецЕсли;
		ОбработатьРезультатВыполненияЗадания();
		Иначе
		Renault_ДлительныеОперацииКлиент.ОбновитьПараметрыОбработчикаОжидания(ПараметрыОбработчика);
		ПодключитьОбработчикОжидания("ФоновоеЗаданиеЗагрузкаФайлаНаКлиенте", ПараметрыОбработчика.ТекущийИнтервал, Истина);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьРезультатВыполненияЗадания()
	сОтвет = ПолучитьИзВременногоХранилища(РезультатПолученияДопИнформации.АдресХранилища);
	Если сОтвет.Свойство("Ошибка") и сОтвет.Ошибка Тогда
		Ответ = Вопрос ("Отправка заявки не завершена, поставить заявку в очередь на отправку?", РежимДиалогаВопрос.ДаНет);
		Если Ответ = КодВозвратаДиалога.Да Тогда
			ЭтаФорма.Записать();
			ЭтаФорма.Закрыть();
		иначе
			ЭтаФорма.Закрыть();
		КонецЕсли;
	Иначе
		Прочитать();
		Объект.НомерDevis = сОтвет.НомерDevis;
		Записать();
		Предупреждение("В Distri.net cоздан запрос на автомобиль № "+ НРег(сОтвет.НомерDevis));
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ВыполнитьРасчетМинимальногоСрокаПоставки(ЛокальныйРасчет)
	
	ПараметрыРасчетаМДП.Очистить(); 

	КорпКлиент = Объект.ТипЗаявки = ПредопределенноеЗначение("Справочник.DMS_ТипыЗаявки.КорпоративныеКлиенты") ИЛИ Объект.ТипЗаявки = ПредопределенноеЗначение("Справочник.DMS_ТипыЗаявки.КрупныеКлиенты"); 	
	МинимальнаяДатаПоставки = Дата(1,1,1);
	VINДляРасчета = СокрЛП(Объект.VIN);
	BIRДляРасчета = ?(ЗначениеЗаполнено(Объект.ДилерскийЦентр), СокрЛП(Сред(Объект.ДилерскийЦентр.BIR, 1, 8)), СокрЛП(Объект.BIR));
	
	
	Если ЛокальныйРасчет Тогда
		ПараметрыРасчета = DMS_ОбменДаннымиСДилерскимПорталом.РассчитатьМинимальныйСрокПоставки(VINДляРасчета, BIRДляРасчета, КорпКлиент,, Истина);	
		
		Если ПараметрыРасчета.МинимальнаяДатаПоставки = Дата(1,1,1) Тогда 
			ПараметрыРасчета = DMS_ОбменДаннымиСДилерскимПорталом.РассчитатьМинимальныйСрокПоставкиНаДилерскомПортале(VINДляРасчета, BIRДляРасчета, КорпКлиент,, Истина);	
		КонецЕсли;
		
		НоваяСтрока = ПараметрыРасчетаМДП.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, ПараметрыРасчета);
		
		МинимальнаяДатаПоставки = ПараметрыРасчета.МинимальнаяДатаПоставки;
		
	Иначе
		ПараметрыРасчета = DMS_ОбменДаннымиСДилерскимПорталом.РассчитатьМинимальныйСрокПоставкиНаДилерскомПортале(VINДляРасчета, BIRДляРасчета, КорпКлиент,, Истина);	
		
		Если ПараметрыРасчета.МинимальнаяДатаПоставки = Дата(1,1,1) Тогда 
			ПараметрыРасчета = DMS_ОбменДаннымиСДилерскимПорталом.РассчитатьМинимальныйСрокПоставки(VINДляРасчета, BIRДляРасчета, КорпКлиент,, Истина);	
		КонецЕсли;
		
		НоваяСтрока = ПараметрыРасчетаМДП.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, ПараметрыРасчета);
		
		МинимальнаяДатаПоставки = ПараметрыРасчета.МинимальнаяДатаПоставки;
	КонецЕсли;
	
	Если МинимальнаяДатаПоставки <> Дата(1,1,1) И Объект.ДатаЖелаемойПоставки < МинимальнаяДатаПоставки Тогда 
		Объект.ДатаЖелаемойПоставки = МинимальнаяДатаПоставки;
	КонецЕсли;	
	
	УстановитьПояснениеКСрокуПоставки();
	
КонецПроцедуры

&НаКлиенте
Процедура ЦентрКонтрактПриИзменении(Элемент)
	
	Объект.ЦентрализованныйКонтракт = ?(ЦентрКонтракт = "Да", Истина, Ложь);
	
КонецПроцедуры

//+++
&НаКлиенте
Процедура ПечатьОПД(Команда)

	Если ЭтаФорма.Модифицированность Тогда 
		ПоказатьПредупреждение(,"Необходимо записать документ");
		Возврат;
	КонецЕсли;
	
	Попытка
		СтруктураПараметровОПД = ЗаполнитьДанныеПоКонтрагенту("ПерсональныеДанные",Истина);
		
		МассивФайловОПД = DMS_ОбщегоНазначенияСервер.ПолучитьДанныеОПД(СтруктураПараметровОПД,Объект.Клиент);
		
		Если МассивФайловОПД = Неопределено Тогда 
			ПоказатьПредупреждение(,"Не удалось получить печатную форму обработки персональных данных");
		Иначе 
			Для каждого Файл Из МассивФайловОПД Цикл
				НачатьПолучениеФайлаССервера(ПоместитьВоВременноеХранилище(Base64Значение(Файл["ДанныеФайла"])), Файл["ИмяФайла"], Новый ПараметрыДиалогаПолученияФайлов());
			КонецЦикла;	
		КонецЕсли;
	Исключение
		Сообщить(ОписаниеОшибки());
		Возврат;
	КонецПопытки;
		
КонецПроцедуры

&НаКлиенте
Процедура ПечатьКоммуникация(Команда)
	
	Если ЭтаФорма.Модифицированность Тогда 
		ПоказатьПредупреждение(,"Необходимо записать документ");
		Возврат;
	КонецЕсли;
	
	Попытка
		СтруктураПараметровОПД = ЗаполнитьДанныеПоКонтрагенту("Коммуникация",Истина);
		
		МассивФайловОПД = DMS_ОбщегоНазначенияСервер.ПолучитьДанныеОПД(СтруктураПараметровОПД,Объект.Клиент);
		
		Если МассивФайловОПД = Неопределено Тогда 
			ПоказатьПредупреждение(,"Не удалось получить печатную форму.");
		Иначе 
			Для каждого Файл Из МассивФайловОПД Цикл
				НачатьПолучениеФайлаССервера(ПоместитьВоВременноеХранилище(Base64Значение(Файл["ДанныеФайла"])), Файл["ИмяФайла"], Новый ПараметрыДиалогаПолученияФайлов());
			КонецЦикла;	
		КонецЕсли;
	Исключение
		Сообщить(ОписаниеОшибки());
		Возврат;
	КонецПопытки;
	
КонецПроцедуры

&НаКлиенте
Процедура ПечатьСервисы(Команда)
	Если ЭтаФорма.Модифицированность Тогда 
		ПоказатьПредупреждение(,"Необходимо записать документ");
		Возврат;
	КонецЕсли;
	
	Попытка
		СтруктураПараметров = ЗаполнитьДанныеПоКонтрагенту("Сервисы",Истина);
		МассивФайлов = DMS_ОбщегоНазначенияСервер.ПолучитьДанныеОПД(СтруктураПараметров,Объект.Клиент);
		Если МассивФайлов = Неопределено Тогда 
			ПоказатьПредупреждение(,"Не удалось получить печатную форму");
			Возврат;
		КонецЕсли;
		
		Для каждого Файл Из МассивФайлов Цикл
			НачатьПолучениеФайлаССервера(ПоместитьВоВременноеХранилище(Base64Значение(Файл["ДанныеФайла"])), Файл["ИмяФайла"], Новый ПараметрыДиалогаПолученияФайлов());
		КонецЦикла;
	Исключение
		Сообщить(ОписаниеОшибки());
		Возврат;
	КонецПопытки;

КонецПроцедуры

&НаСервере
Функция ЗаполнитьДанныеПоКонтрагенту(ВидСогласия,Согласие)
	
	СтруктураОбъекта = Новый Структура;
	СтруктураКлиента = Новый Структура;
	СтруктураДокумента = Новый Структура;
	СтруктураАвтомобиля = Новый Структура;
	СтруктураСогласия = Новый Структура;
	СтруктураОтвветсвенный = Новый Структура;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПодтверждающиеДокументы.Серия КАК Серия,
		|	ПодтверждающиеДокументы.Номер КАК Номер,
		|	ПодтверждающиеДокументы.ДатаВыдачи КАК ДатаВыдачи,
		|	ПодтверждающиеДокументы.КемВыдан КАК КемВыдан,
		|	ПодтверждающиеДокументы.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.ПодтверждающиеДокументы КАК ПодтверждающиеДокументы
		|ГДЕ
		|	ПодтверждающиеДокументы.Владелец = &Контрагент
		|	И ПодтверждающиеДокументы.Текущий = ИСТИНА";
	
	Запрос.УстановитьПараметр("Контрагент", Объект.Клиент);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	Если Выборка.Количество() = 0 Тогда 
		ВызватьИсключение("Нет данных актуального паспорта");
	КонецЕсли;
	
	Пока Выборка.Следующий() Цикл
		СтруктураДокумента.Вставить("passportnumber",Выборка.Номер);
		СтруктураДокумента.Вставить("passportseries",Выборка.Серия);
		СтруктураДокумента.Вставить("passportissued",Выборка.КемВыдан); 
		СтруктураДокумента.Вставить("passportday",День(Выборка.ДатаВыдачи));
		СтруктураДокумента.Вставить("passportmonth",Месяц(Выборка.ДатаВыдачи));
		СтруктураДокумента.Вставить("passportyear",Год(Выборка.ДатаВыдачи));
	КонецЦикла;

	СтруктураКлиента.Вставить("lastname",Фамилия);
	СтруктураКлиента.Вставить("firstname",Имя);
	СтруктураКлиента.Вставить("middlename",Отчество);
	СтруктураКлиента.Вставить("birthday",ДатаРождения);
	СтруктураКлиента.Вставить("gender",?(Объект.Клиент.Пол=Перечисления.ПолФизическихЛиц.НеУказан,"",""+Объект.Клиент.Пол));
	СтруктураКлиента.Вставить("address",АдресКлиента);
	СтруктураКлиента.Вставить("tel",Renault_CRM.ПолучитьТелефонКлиент(Объект.Клиент));
	СтруктураКлиента.Вставить("email",Renault_CRM.ПолучитьЕмаилКлиент(Объект.Клиент));
	СтруктураКлиента.Вставить("company",?(Объект.Клиент.ФормаСобственности = Перечисления.ФормыСобственности.ЮридическоеЛицо,Истина,Ложь));
	СтруктураКлиента.Вставить("document",СтруктураДокумента);
	СтруктураОбъекта.Вставить("client",СтруктураКлиента);
	
	СтруктураАвтомобиля.Вставить("mark","");
	СтруктураАвтомобиля.Вставить("vin",Объект.VIN);
	СтруктураАвтомобиля.Вставить("daybuycar",Дата('00010101'));
	СтруктураОбъекта.Вставить("auto",СтруктураАвтомобиля);
	
	СтруктураСогласия.Вставить("form",ВидСогласия);
	СтруктураСогласия.Вставить("agree",Согласие);
	СтруктураОбъекта.Вставить("consent",СтруктураСогласия);
	
	СтруктураОтвветсвенный.Вставить("name",""+ПараметрыСеанса.Пользователь.Сотрудник);
	СтруктураОтвветсвенный.Вставить("from","Клиентская заявка");
	СтруктураОбъекта.Вставить("responsible",СтруктураОтвветсвенный);
	
	Возврат СтруктураОбъекта;
	
КонецФункции

&НаКлиенте
Процедура ДокументСогласияНажатие(Элемент, СтандартнаяОбработка)
	
	Если ЗначениеЗаполнено(ДокументСогласия) Тогда 
		ОткрытьЗначение(ДокументСогласия)
	Иначе 
		ПараметрыОткрытияФормы = Новый Структура;
		ПараметрыОткрытияФормы.Вставить("Клиент",Объект.Клиент);
		Оповещение = Новый ОписаниеОповещения("DMS_СогласиеНаОбработкуПерсональныхДанныхЗавершение",ЭтаФорма);
		ОткрытьФорму("Документ.DMS_СогласиеНаОбработкуПерсональныхДанных.Форма.ФормаДокумента",ПараметрыОткрытияФормы,ЭтаФорма,,,,Оповещение);		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура DMS_СогласиеНаОбработкуПерсональныхДанныхЗавершение(Результат,ДопПараметры) Экспорт 
	
	ПодставитьДокументСогласия();
	
КонецПроцедуры

&НаКлиенте
Процедура ДекорацияСогласияНажатие(Элемент)
	
	Если ЗначениеЗаполнено(ДокументСогласия) Тогда
		ПараметрыОткрытияФормы = Новый Структура("Ключ", ДокументСогласия);
	Иначе 
		ПараметрыОткрытияФормы = Новый Структура;
		ПараметрыОткрытияФормы.Вставить("Клиент",Объект.Клиент);
	КонецЕсли;
	
	Оповещение = Новый ОписаниеОповещения("DMS_СогласиеНаОбработкуПерсональныхДанныхЗавершение",ЭтаФорма);
	ОткрытьФорму("Документ.DMS_СогласиеНаОбработкуПерсональныхДанных.Форма.ФормаДокумента",ПараметрыОткрытияФормы,ЭтаФорма,,,,Оповещение);		
	
КонецПроцедуры


#КонецОбласти

