//******************************************************************************
// (c)Компания Simplit, http://simplit.info
// Киев, 2013-2014
//******************************************************************************
&НаКлиенте
Перем Телефония Экспорт;

////////////////////////////////////////////////////////////////////////////////
// ФУНКЦИИ РАБОТЫ С ВНЕШНЕЙ КОМПОНЕНТОЙ
////////////////////////////////////////////////////////////////////////////////

&НаКлиенте
Функция ИнициализироватьТелефонию() Экспорт;
	// кроме веб-клиента
	#Если ВебКлиент Тогда
		Возврат Ложь;
	#КонецЕсли
	
	ИДОбъекта="AddIn.ROM-Asterisk";
	Если Объект.NativeAPI Тогда
		ИДОбъекта="AddIn.Simplit.ROM-Asterisk-Native";
	КонецЕсли; 
	
	Попытка
		Телефония = Новый (ИДОбъекта);
	Исключение
		Сообщить("Не создать объект внешней компоненты для связи с Asterisk."+ОписаниеОшибки());
		Возврат Ложь;
	КонецПопытки; 
	
	Возврат Истина;
	
КонецФункции

&НаКлиенте
Функция ЗагрузитьКомпонентуТелефонии_NativeAPI()

	Попытка
		АдресВнешнейКомпоненты=ПолучитьАдресВнешнейКомпоненты();
		Результат=ПодключитьВнешнююКомпоненту(АдресВнешнейКомпоненты,"Simplit",ТипВнешнейКомпоненты.Native);
		Если Не Результат Тогда
			УстановитьВнешнююКомпоненту(АдресВнешнейКомпоненты);
			Результат=ПодключитьВнешнююКомпоненту(АдресВнешнейКомпоненты,"Simplit",ТипВнешнейКомпоненты.Native);
		КонецЕсли; 
	Исключение
		Результат=Ложь;
	КонецПопытки; 
	
	Если Результат=Ложь Тогда
		Сообщить("Не удалось подключить внешнюю компоненту для связи с Asterisk");
	КонецЕсли; 
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Функция ЗагрузитьКомпонентуТелефонии()Экспорт;

	// кроме веб-клиента
	#Если ВебКлиент Тогда
		Возврат Ложь;
	#КонецЕсли
	
	// константы определим отдельно, чтобы легко было менять на свои
	//Каталог="C:\Program Files\Simplit\";
	Каталог=Объект.ПутьКФайлуВК;
	ИмяВК="ROM-Asterisk";
	ФайлВК = Новый Файл(Каталог+"\"+ИмяВК+".dll");
	
	Если ФайлВК.Существует()=Ложь Тогда
		Сообщить("Не найден файл внешней компоненты для связи с Asterisk");
		Возврат Ложь;
	КонецЕсли; 
	
	Попытка
		
		#Если ТолстыйКлиентОбычноеПриложение или ТолстыйКлиентУправляемоеПриложение Тогда
			Попытка
				ЗагрузитьВнешнююКомпоненту(ФайлВК.ПолноеИмя);
			Исключение
				Сообщить("Не удалось подключить загрузить компоненту для связи с Asterisk");
				Возврат Ложь;
			КонецПопытки; 
		#Иначе
			Если ПодключитьВнешнююКомпоненту("AddIn."+ИмяВК)=Ложь Тогда
				Сообщить("Не удалось подключить внешнюю компоненту для связи с Asterisk в режиме тонкого клиента");
				Сообщить("Если это первый запуск, то нужно войти в режиме толстого клиента");
				Возврат Ложь;
			КонецЕсли; 
		#КонецЕсли
		
		Возврат Истина;
		
	Исключение
		Сообщить("Не удалось загрузить внешнюю компоненту для связи с Asterisk");
	КонецПопытки;
	
	Возврат Ложь;
	
КонецФункции

&НаКлиенте
Функция Подключиться(Адрес,Порт,Логин,Пароль) Экспорт;
	Телефония.Подключиться(Адрес,Порт);
	Login(Логин,Пароль);
КонецФункции

&НаКлиенте
Функция Отключиться() Экспорт;
	Телефония.Отключиться();
КонецФункции

// Выполнить команду AMI
//
// Параметры
//  СтрокаКоманды	- Строка - в формате AMI
//
// Возвращаемое значение:
//   Число   - 1-команда успешно отправлена, 0 -нет
//
&НаКлиенте
Функция ВыполнитьКоманду(СтрокаКоманды) Экспорт;
	// кроме веб-клиента
	#Если ВебКлиент Тогда
		Возврат 0;
	#КонецЕсли
	CRLF = Chars.CR + Chars.LF;
	// проверка завершения пакета
	Если Найти(СтрокаКоманды,CRLF+CRLF)=0 Тогда
		Сообщить("ВыполнитьКоманду: Неверный формат команды: "+CRLF+СтрокаКоманды);
		Возврат 0;
	КонецЕсли;
	Попытка
		Результат=Телефония.ВыполнитьКоманду(СтрокаКоманды);
	Исключение
	КонецПопытки;
	Если Результат=1 Тогда
		Возврат Истина;
	КонецЕсли; 
	Возврат Ложь;

КонецФункции

// Управление фильтром событий AMI Asterisk
//
// Параметры:
//	СтрФильтра:	Строка - фильтры, согласно спецификации AMI
//
// Возвращаемое значение:
//	Число	: 1-команда успешно отправлена, 0-нет
//
&НаКлиенте
Функция УстановитьФильтрСобытий(СтрокаФильтра="")Экспорт;
	Возврат Event(СтрокаФильтра);
КонецФункции

// Установить фильтр - регулярное выражение
//
// Параметры
//  СтрокаФильтра	- Строка - регулярное выражение
//
// Возвращаемое значение:
//   Число   - 1-фильтр установлен, 0 -нет
//
&НаКлиенте
Функция УстановитьФильтр(СтрокаФильтра) Экспорт;

	Телефония.УстановитьРегулярноеВыражение(СтрокаФильтра);

КонецФункции

// Включение/Отключение режима подписки на внешние события
//
// Параметры:
//	Режим	: - Число - 1-включить, 0-выключить
//
// Возвращаемое значение:
//	Число	: режим подписки после выполнения метода
//
&НаКлиенте
Функция ПодписатьсяНаВнешниеСобытия(Режим) Экспорт;
	ТекущийРежим=Телефония.РежимПрослушивания;
	// корректируем принимаемый параметр
	Режим = ?(Режим<0,0,Режим);
	Режим = ?(Режим>1,1,Режим);
	Если Режим - ТекущийРежим > 0 Тогда
		Телефония.РежимПрослушивания(Режим);
	КонецЕсли;
	Возврат Телефония.РежимПрослушивания;
КонецФункции


////////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ФУНКЦИИ
////////////////////////////////////////////////////////////////////////////////

// Возвращает коллекцию типа соответствие
// Вход	:
//			СтрДанные - строка с разделителями
// Выход:
//			ДанныеСобытия - Соответствие
&НаКлиенте
Функция ДанныеВСоответствие(Знач Данные) Экспорт;
	
	Массив=Новый Соответствие;
	СтрБуфер=Данные;
	// Пакет может быть завершен CR-ом, без LF-а. Дополним...
	Если Прав(СтрБуфер,1)=Chars.CR Тогда
		СтрБуфер=СтрБуфер+Chars.LF;
	КонецЕсли; 
	
	// переменные для разбора строк
	CRLF=Chars.CR+Chars.LF;
	КолвоСтрок=СтрЧислоВхождений(СтрБуфер,CRLF);
	ДлинаCRLF=СтрДлина(CRLF);
	
	// переменные для разбора ключ-значение, внутри строки
	Разделитель=": ";
	ДлинаРазделителя=СтрДлина(Разделитель);

	Для Индекс=1 По КолвоСтрок Цикл
		// выборка строк, разделенных CRLF
		ПозицияCRLF=Найти(СтрБуфер,CRLF);
		ТекСтрока=Лев(СтрБуфер,ПозицияCRLF-1);
		
		// в строке, ключ и значение разделены ": "
		ПозицияРазделителя=Найти(СтрБуфер,Разделитель);
		Ключ=Лев(ТекСтрока,ПозицияРазделителя-1);
		Значение=Сред(ТекСтрока,ПозицияРазделителя+ДлинаРазделителя);
		Если ЗначениеЗаполнено(Ключ) Тогда
			Массив.Вставить(Ключ,Значение);
		КонецЕсли; 
		
		// отрезаем прочитанную часть
		СтрБуфер=Сред(СтрБуфер,ПозицияCRLF+ДлинаCRLF);
		
	КонецЦикла; 
	
	Возврат Массив;

КонецФункции //ДанныеВСоответствие
 
&НаСервере
Функция ПолучитьАдресВнешнейКомпоненты()
	ТекОбъект=РеквизитФормыВЗначение("Объект");
	Возврат ТекОбъект.ПолучитьАдресВнешнейКомпоненты(Новый УникальныйИдентификатор);
КонецФункции
 

////////////////////////////////////////////////////////////////////////////////
// КОМАНДЫ ASTERISK
////////////////////////////////////////////////////////////////////////////////

// Авторизация в Asterisk Manager API
//
// Возвращаемое значение: 1-команда отправлена, 0-нет
//
&НаКлиенте
Функция Login(Логин,Пароль) Экспорт;

	Если ПустаяСтрока(Логин) Тогда
		Сообщить("Login(). Не указан параметр <Логин>");
		Возврат 0;
	КонецЕсли; 
	
	Если ПустаяСтрока(Пароль) Тогда
		Сообщить("Login(). Не указан параметр <Пароль>");
		Возврат 0;
	КонецЕсли; 
	
	Если Телефония.Подключено=1 Тогда
		CRLF = Chars.CR + Chars.LF;
		СтрокаКоманды= "Action: Login"+CRLF+
		"Username: "+Логин+CRLF+
		"Secret: "+Пароль+CRLF+CRLF;
		Возврат ВыполнитьКоманду(СтрокаКоманды);
	КонецЕсли; 

КонецФункции
 
// Завершения сеанса Asterisk Manager API и закрытие соединения
//
// Возвращаемое значение: 1-команда отправлена, 0-нет
//
&НаКлиенте
Функция Logoff() Экспорт;

	CRLF = Chars.CR+Chars.LF;
	ТекстКоманды = "Action: Logoff"+CRLF+CRLF;
	Возврат ВыполнитьКоманду(ТекстКоманды);

КонецФункции // Logoff
 
// Команда оригинации (по сути, совершение исходящего звонка)
//
// Параметры:
//		Приемник	-	Строка - Кому звоним. Экстен для используемый для соединения (используется только совместно с параметрами Context и Priority)
//		Источник	-	Строка - Название канала, с которого совершается исходящий вызов (В том же формате, как если бы Вы совершали вызов этому абоненту командой Dial)
//		Контекст	-	Строка - Название контекста для совершения исходящего вызова (используется только совместно с параметрами Exten и Priority)
//		Таймаут		-	Строка - Таймаут (в миллисекундах) для соединения с инициатором исходящего вызова (значение по умолчанию: 30000 миллисекунд)
//		Приоритет	-	Строка - Приоритет (используется только совместно с параметрами Context и Exten)
//		ИДНомера	-	Строка - Значение CallerID-источника, используемое для совершения исходящего вызова.
//		СтрокаПерем	-	Строка - Установка переменных канала (максимум 32). Переменные будут установлены для обоих каналов, участвующих в соединении (локального, для абонента от которого совершается вызов и для вызываемого канала)
//		Account		-	Строка - Значение для "Account code" исходящего вызова
//		Application	-	Строка - Команда плана набора, используемая для совершения исходящего вызова (используется параметр "Data", для указания ее параметров)
//		Данные		-	Строка - Параметры команды плана набора, используемой для совершения исходящего вызова
//		ФлагАсинхр	-	Если указано "true" исходящий вызов будет производиться асинхронно. Результат ее выполнения будет возвращен позже, в пакете типа "Event" (позволяет осуществлять несколько вызовов без ожидания результата предыдущей команды, совершающей исходящий вызов)
//		ИД			-	Строка - Необязательный ID команды, который будет возвращен в ответе. Позволяет сопоставить результат выполнения конкретному запросу. 
//								В качестве значения можно использовать или номер или строку. 
//								Очень полезно использовать, когда выполняется несколько асинхронных запросов одновременно
//
// Возвращаемое значение: 1-команда отправлена, 0-нет
//
&НаКлиенте
Функция Originate(Приемник, Источник, Контекст, Таймаут="30000", Приоритет="1", ИДНомера="", СтрокаПерем="", КодУчетной="", КомандаНабора="", ДанныеНабора="", ФлагАсинхр="false", ИД="") Экспорт;

	CRLF = Chars.CR + Chars.LF;
	
	Если ПустаяСтрока(Приемник) Тогда
		Сообщить("Originate(). Ошибка. Не указан номер, на который выполняется звонок");
		Возврат 0;
	КонецЕсли; 
	
	Если ПустаяСтрока(Источник) Тогда
		Сообщить("Originate(). Ошибка. Не указан номер-источник, с которого выполняется звонок");
		Возврат 0;
	КонецЕсли; 
	
	Если ПустаяСтрока(Контекст) Тогда
		Сообщить("Originate(). Ошибка. Не указан контекст");
		Возврат 0;
	КонецЕсли; 
	
	Если ПустаяСтрока(ИДНомера) Тогда
		ИДНомера = Источник;
	КонецЕсли; 
	
	Если ПустаяСтрока(СтрокаПерем) Тогда
		СтрокаПерем = "";
	КонецЕсли; 
	
	ТекстКоманды="Action: Originate"+CRLF+
	"Channel: "+Источник+CRLF+
	"Context: "+Контекст+CRLF+
	"Exten: "+Приемник+CRLF+
	"Priority: "+Приоритет+CRLF+
	"Callerid: "+ИДНомера+CRLF+
	"Timeout: "+Таймаут+CRLF;
	
	Если ПустаяСтрока(СтрокаПерем)=Ложь Тогда
		ТекстКоманды = ТекстКоманды + "Variable: "+СтрокаПерем+CRLF;
	КонецЕсли; 
	
	Если ПустаяСтрока(КодУчетной)=Ложь Тогда
		ТекстКоманды = ТекстКоманды + "Account: "+КодУчетной+CRLF;
	КонецЕсли; 
	
	Если ПустаяСтрока(КомандаНабора)=Ложь Тогда
		ТекстКоманды = ТекстКоманды + "Application: "+КомандаНабора+CRLF;
	КонецЕсли; 
	
	Если ПустаяСтрока(ДанныеНабора)=Ложь Тогда
		ТекстКоманды = ТекстКоманды + "Data: "+ДанныеНабора+CRLF;
	КонецЕсли; 
	
	ТекстКоманды = ТекстКоманды +
	"Async: "+ФлагАсинхр+CRLF;
	
	Если ПустаяСтрока(ИД)=Ложь Тогда
		ТекстКоманды = ТекстКоманды + "ActionID: "+ИД+CRLF;
	КонецЕсли; 
	ТекстКоманды = ТекстКоманды + CRLF;
	
	Возврат ВыполнитьКоманду(ТекстКоманды);


КонецФункции // Originate
 
// Авторизация в Asterisk Manager API
//
// Возвращаемое значение: 1-команда отправлена, 0-нет
//
&НаКлиенте
Функция Event(СтрокаФильтр="on", ИД="") Экспорт;

	CRLF = Chars.CR + Chars.LF;
	ТекстКоманды="Action: Events"+CRLF+
	"EventMask: "+СтрокаФильтр+CRLF;
	
	Если ПустаяСтрока(ИД)=Ложь Тогда
		ТекстКоманды = ТекстКоманды + "ActionID: "+ИД+CRLF;
	КонецЕсли; 
	ТекстКоманды = ТекстКоманды + CRLF;
	
	Возврат ВыполнитьКоманду(ТекстКоманды);
	
КонецФункции // Event
 
////////////////////////////////////////////////////////////////////////////////
// ПОЛЬЗОВАТЕЛЬСКИЕ КОМАНДЫ
////////////////////////////////////////////////////////////////////////////////

// Отправка команды на исходящий звонок
//
// Параметры:
//	Куда	-	Строка - Номер куда звонить
//
// Возвращаемое значение:
//	Число	: 1-команда успешно отправлена, 0-нет
//
// Описание:
// Сначала, звонок отправляется 1-му каналу, т.е. оператору на внутренний номер. 
// Только после того, как оператор поднял трубку, т.е. 1-й канал создан, 
// будет выполнен вызов 2-го канала, т.е. внешнего абонента 
//
&НаКлиенте
Функция Звонить(Куда) Экспорт;
	CRLF = Chars.CR + Chars.LF;
	Если ПустаяСтрока(Куда) Тогда
		Сообщить("Звонить(). Ошибка. Не указан номер куда выполняется звонок");
		Возврат 0;
	КонецЕсли;
	Протокол	= "SIP/"; // еще может быть IAX2
	Откуда 		= Протокол+Объект.ВнутреннийНомер;
	Таймаут		= "30000";

	Возврат Originate(Куда, Откуда, Объект.Контекст, Таймаут, 1, Объект.ВнутреннийНомер);

КонецФункции // Звонить

&НаКлиенте
Процедура ЗвонитьНажатие(Команда)
	Звонить(Объект.СтрокаНабора);
КонецПроцедуры

&НаКлиенте
Процедура ЦифраНажатие(Команда)
	СимволНабора=Сред(Команда.Имя,2);
	Если СимволНабора="10" Тогда
		СимволНабора="*";
	КонецЕсли; 
	Если СимволНабора="11" Тогда
		СимволНабора="#";
	КонецЕсли; 
	Объект.СтрокаНабора=Объект.СтрокаНабора+СимволНабора;
КонецПроцедуры

&НаКлиенте
Процедура ПодключитьсяНажатие(Элемент="")
	Если Телефония=Неопределено Тогда
		Возврат;
	КонецЕсли; 
	Если ЗначениеЗаполнено(Объект.Адрес)=Ложь Тогда
		Возврат;
	КонецЕсли; 
	Если ЗначениеЗаполнено(Объект.Порт)=Ложь Тогда
		Возврат;
	КонецЕсли; 
	Если ЗначениеЗаполнено(Объект.Логин)=Ложь Тогда
		Возврат;
	КонецЕсли; 
	Если ЗначениеЗаполнено(Объект.Пароль)=Ложь Тогда
		Возврат;
	КонецЕсли;
	
	// подключение и авторизация
	Подключиться(Объект.Адрес,Объект.Порт,Объект.Логин,Объект.Пароль);
	ИндикаторПодключения=?(Телефония.Подключено=1,Истина,Ложь);
	Элементы.Декорация1.Видимость=ИндикаторПодключения;
	
	// подписка на получение событий
	ПодписатьсяНаВнешниеСобытия(1);
	
	// указываем класс событий Asterisk, который необходимо получать
	УстановитьФильтрСобытий("call,agent,command");
	
	// устанавливаем фильтр по внутреннему номеру
	УстановитьФильтр(Объект.ВнутреннийНомер);
	
КонецПроцедуры

&НаКлиенте
Процедура Автоподключение()
	ПодключитьсяНажатие();
	Если Телефония.Подключено=1 Тогда
		Сообщить("Соединение с сервером телефонии восстановлено");
	КонецЕсли; 
КонецПроцедуры
 
&НаКлиенте
Процедура ПутьКФайлуВКНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка=Ложь;
	Диалог = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.ВыборКаталога);
	Диалог.Фильтр="Файл DLL-библиотеки(*.dll)|*.dll";
	Если Диалог.Выбрать() Тогда
	
		Объект.ПутьКФайлуВК=Диалог.Каталог;
		
		Если Телефония=Неопределено Тогда
			ЗагрузитьКомпонентуТелефонии();
			Результат=ИнициализироватьТелефонию();
		КонецЕсли; 
		
	КонецЕсли; 
КонецПроцедуры

&НаСервере
Процедура ЗаписатьМакетНаДиск(ПолноеИмяФайла)

	РеквизитФормыВЗначение("Объект").ЗаписатьМакет(ПолноеИмяФайла);

КонецПроцедуры
 
&НаКлиенте
Процедура СохранитьНаДиск(Команда)
	Диалог = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.ВыборКаталога);
	Диалог.Фильтр="Файл DLL-библиотеки(*.dll)|*.dll";
	Диалог.Каталог=Объект.ПутьКФайлуВК;
	Если Диалог.Выбрать() Тогда
	
		ПолноеИмяФайла=Диалог.Каталог+"\ROM-Asterisk.dll";
		ЗаписатьМакетНаДиск(ПолноеИмяФайла);
		ПутьКФайлуВК=Диалог.Каталог;
		
		Если Телефония=Неопределено Тогда
			ЗагрузитьКомпонентуТелефонии();
			Результат=ИнициализироватьТелефонию();
		КонецЕсли; 
		
	КонецЕсли; 
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ПРИМЕРЫ ОБРАБОТЧИКОВ СОБЫТИЙ ASTERISK
////////////////////////////////////////////////////////////////////////////////

// Обработчик события Dial. Событие возникает до момента поднятия трубки
&НаКлиенте
Функция EventDial(ДанныеСобытия)
	ТипСобытия=ДанныеСобытия.Получить("SubEvent");
	Если ВРег(ТипСобытия)=ВРег("Begin") Тогда
		Сообщить("Событие начала звонка. Стадия вызова, трубку еще не взяли");
	ИначеЕсли ВРег(ТипСобытия)=ВРег("End") Тогда
		Сообщить("Событие окончания звонка. Трубку положили, но полного завершения звонка еще нет");
	КонецЕсли; 

КонецФункции

// Обработчик события соединения каналов. Взяли трубку
&НаКлиенте
Функция EventBridge(ДанныеСобытия)

	Сообщить("Событие соединения 2-х каналов. Взяли трубку");

КонецФункции

// Обработчик завершения звонка. Положили трубку
&НаКлиенте
Функция EventHangup(ДанныеСобытия)

	Сообщить("Событие завершения звонка и закрытие канала");

КонецФункции

////////////////////////////////////////////////////////////////////////////////
// ПРЕДОПРЕДЕЛЕННЫЕ
////////////////////////////////////////////////////////////////////////////////

&НаКлиенте
Процедура ВнешнееСобытие(Источник, Событие, Данные)
	Если Источник="ROM-Asterisk" Тогда
	
		Если Событие="Disconnect" Тогда
			// возможно потеряли связь, перепоключение через 30 секунд
			Сообщить("Соединение с сервером телефонии разорвано");
			ИндикаторПодключения=?(Телефония.Подключено=1,Истина,Ложь);
			Элементы.Декорация1.Видимость=ИндикаторПодключения;
			ПодключитьОбработчикОжидания("Автоподключение",30,Ложь);
			Сообщить("Попытка переподключения будет выполняться каждые 30 секунд");
			Возврат;
		Иначе
			ОтключитьОбработчикОжидания("Автоподключение");
		КонецЕсли;
		
		// классификация входящих событий и перенаправление в обработчики
		ДанныеСобытия=ДанныеВСоответствие(Данные);
		ВидСобытия=ВРег(СокрЛП(ДанныеСобытия.Получить("Event")));
		
		Если ВидСобытия = ВРег("Dial") Тогда
			// событие начала звонка (до поднятия трубки)
			EventDial(ДанныеСобытия);
			
		ИначеЕсли ВидСобытия = ВРег("Bridge") Тогда
			// событие поднятия трубки
			EventBridge(ДанныеСобытия);
			
		ИначеЕсли ВидСобытия = ВРег("Hangup") Тогда
			// событие завершения звонка
			EventHangup(ДанныеСобытия);
			
		КонецЕсли; 
		
		// строка добавлена в отладочных и демонстрационных целях
		//Сообщить(Данные+Chars.CR+Chars.LF);
		
	КонецЕсли; 
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Элементы.Декорация1.Видимость=Ложь;
	
	Если Объект.NativeAPI Тогда
		ЗагрузитьКомпонентуТелефонии_NativeAPI();
	Иначе	
		ЗагрузитьКомпонентуТелефонии();
	КонецЕсли; 
	
	Результат=ИнициализироватьТелефонию();
	Если Объект.Автоподключение Тогда
		ПодключитьсяНажатие(Неопределено);
	КонецЕсли; 
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии()
	Если Телефония=Неопределено Тогда
		Возврат;
	КонецЕсли; 
	Если Телефония.Подключено=1 Тогда
		Logoff();
		Телефония.Отключиться();
	КонецЕсли; 
КонецПроцедуры

