
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	СписокКалькуляций.Параметры.УстановитьЗначениеПараметра("ВидОбращения", Справочники.Renault_ВидыОбращенийВАвтосервис.ДиагностикаТрейдИн);
	СписокКалькуляций.Параметры.УстановитьЗначениеПараметра("Ссылка", Параметры.ЗаявкаТрейдИн);
	
КонецПроцедуры

&НаКлиенте
Процедура ИспользоватьДляРасчета(Команда)
	
	ТекущиеДанные = Элементы.СписокКалькуляций.ТекущиеДанные;
	Если ТекущиеДанные <> Неопределено Тогда
		Закрыть(ТекущиеДанные.Ссылка);
	КонецЕсли;
	
КонецПроцедуры
