
////#Область ПрограммныйИнтерфейс

Процедура ОтразитьСтатусМакетаРекламнойКампании(Установил,Макет,ДатаСобытия,Статус,Отказ) Экспорт 

	DMS_РекламныеКампанииСервер.ОтразитьСтатусМакетаРекламнойКампании(Установил,Макет,ДатаСобытия,Статус,Отказ);	

КонецПроцедуры

Процедура ОтразитьСтатусОтчетаПоРекламнойКампании(Установил,Макет,ДатаСобытия,Статус,Отказ) Экспорт 

	DMS_РекламныеКампанииСервер.ОтразитьСтатусОтчетаПоРекламнойКампании(Установил,Макет,ДатаСобытия,Статус,Отказ);	

КонецПроцедуры

Процедура УстановитьПараметрыСеансаВидОперацииРекламнойКампании(ИмяПараметра, УстановленныеПараметры) Экспорт

	Если ИмяПараметра = "DMS_ВидОперацииРекламнойКампании" Тогда
		
		УстановитьПривилегированныйРежим(Истина);
		ПараметрыСеанса.DMS_ВидОперацииРекламнойКампании = Неопределено;//ЗначениеНастроекПовтИсп.ПолучитьВидОперацииРекламнойКампанииПользователяПоУмолчанию(ПараметрыСеанса.ТекущийПользователь);
		ОбновитьПовторноИспользуемыеЗначения();

		Если ТипЗнч(УстановленныеПараметры) = Тип("Структура") Тогда
			УстановленныеПараметры.Вставить("DMS_ВидОперацииРекламнойКампании");
		Иначе
			УстановленныеПараметры.Добавить("DMS_ВидОперацииРекламнойКампании");
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

Функция ОтправитьКампаниюНаСервер(Кампания) Экспорт
	
	
	
	
	Попытка

		
		СтруктураПараметров = Новый Структура;
		СтруктураПараметров.Вставить("РезультатыКампаний",DMS_ВзаимодействияСКлиентом.ПодготовитьРезультатыДляВыгрузки(Кампания.Сценарий));
		СтруктураПараметров.Вставить("СценарийКампании",DMS_ВзаимодействияСКлиентом.ПодготовитьСценарииДляВыгрузки(Кампания.Сценарий));
		СтруктураПараметров.Вставить("Кампания",DMS_ВзаимодействияСКлиентом.ПодготовитьКампаниюДляВыгрузки(Кампания));
		

		ИсходящийПараметр = СериализаторXDTO.ЗаписатьXDTO(СтруктураПараметров);
		СтрокаЗапроса = Renault_ОбщиеФункцииСервер.ПолучитьСтрокуJSONИзXDTO(ИсходящийПараметр);


		
		Настройки = Renault_ОбщиеФункцииСервер.ПолучитьНастройкиПодключенияПоБренду(ПараметрыСеанса.DMS_Бренд);
		HTTPЗапрос = Новый HTTPЗапрос();
		HTTPЗапрос.Заголовки.Вставить("Content-type", "application/json;  charset=utf-8");
		HTTPЗапрос.УстановитьТелоИзСтроки(СтрокаЗапроса);
		HTTPЗапрос.АдресРесурса = Настройки.Адрес2 + "/hs/Campaigns/Accept";
		Соединение = Новый HTTPСоединение(Настройки.Адрес1,,Настройки.ЛогинWS,Настройки.ПарольWS,,,Настройки.ЗащищенноеСоединениеOpenSSL);
                
		ОтветHTTP = Соединение.ОтправитьДляОбработки(HTTPЗапрос);

		Если ОтветHTTP.КодСостояния = 200 Тогда		
			Возврат Истина;
		Иначе
			Сообщить("Ошибка: " + ОтветHTTP.ПолучитьТелоКакСтроку());	
			Возврат Ложь;	 
		КонецЕсли;
		
	Исключение
		Сообщить("Ошибка " + ОписаниеОшибки());
		Возврат Ложь;
	КонецПопытки;
	
КонецФункции

Процедура ОбновитьКампании() Экспорт
	
	Попытка 
		//обновим статусы кампаний находящихся на рассмотрении
		ВебСервис = DMS_ВзаимодействияСКлиентом.ПолучитьВебСервисКампании();
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	Renault_Кампании.Ссылка
		|ИЗ
		|	Справочник.Renault_Кампании КАК Renault_Кампании
		|ГДЕ
		|	Renault_Кампании.Архивная = ЛОЖЬ
		|	И Renault_Кампании.ПометкаУдаления = ЛОЖЬ
		|	И Renault_Кампании.Загружаемая = ЛОЖЬ
		|	И Renault_Кампании.Родитель = ЗНАЧЕНИЕ(Справочник.Renault_Кампании.ПустаяСсылка)";
		
		Выборка = Запрос.Выполнить().Выбрать();
		Если выборка.Количество()>0 тогда
			
			BIR = Константы.Renault_BIR_db.Получить();
			
			Пока Выборка.Следующий() Цикл
				
				СтруктураПараметров	= новый Структура;
				СтруктураПараметров.Вставить("BIR",BIR);
				СтруктураПараметров.Вставить("УИД",Строка(Выборка.Ссылка.УникальныйИдентификатор()));
				
				ЗаписьJSON = Новый ЗаписьJSON();
				ЗаписьJSON.УстановитьСтроку();
				ЗаписатьJSON(ЗаписьJSON, СтруктураПараметров);
				ТелоЗапроса = ЗаписьJSON.Закрыть();
				
				Настройки = Renault_ОбщиеФункцииСервер.ПолучитьНастройкиПодключенияПоБренду(ПараметрыСеанса.DMS_Бренд);
	
				HTTPЗапрос = Новый HTTPЗапрос();
				HTTPЗапрос.Заголовки.Вставить("Content-type", "application/json;  charset=utf-8");
				HTTPЗапрос.УстановитьТелоИзСтроки(ТелоЗапроса);
				HTTPЗапрос.АдресРесурса = Настройки.Адрес2 + "/hs/Campaigns/Export";
				Соединение = Новый HTTPСоединение(Настройки.Адрес1,,Настройки.ЛогинWS,Настройки.ПарольWS,,,Настройки.ЗащищенноеСоединениеOpenSSL);
			                
				ОтветHTTP = Соединение.ОтправитьДляОбработки(HTTPЗапрос);
	
				ОтветСтруктура = Renault_ОбщиеФункцииСервер.ПолучитьЗначениеИзJSON(ОтветHTTP.ПолучитьТелоКакСтроку());

				Если ОтветСтруктура.Количество()>0 тогда
					Если DMS_ВзаимодействияСКлиентом.ВернутьЗначениеПеречисления("CRM_СтатусыКлиентскихЗаявок",ОтветСтруктура.Статус) <> Перечисления.CRM_СтатусыКлиентскихЗаявок.НаРассмотрение Тогда
						КампанияОбъект = Выборка.Ссылка.ПолучитьОбъект();
						Если КампанияОбъект.Активная = Ложь и ОтветСтруктура.Активная = Истина и ЗначениеЗаполнено(КампанияОбъект.РодительскаяКампания) Тогда
							РодКампания = КампанияОбъект.РодительскаяКампания.ПолучитьОбъект();
							РодКампания.Родитель = Справочники.Renault_Кампании.Архивные;
							РодКампания.Активная = Ложь;
							РодКампания.Записать();
						КонецЕсли;
						ЗаполнитьЗначенияСвойств(КампанияОбъект,ОтветСтруктура);
						ВыбранныеПоля = ОтветСтруктура.ВыбранныеПоля.Получить();
						Если ВыбранныеПоля <> Неопределено и ВыбранныеПоля.Количество()>1 Тогда
							Настройки = КампанияОбъект.НастройкиОтбора.Получить();
							Настройки.Выбор.Элементы.Очистить();
							Для каждого ВыбПоле из ВыбранныеПоля Цикл
								
								Если ВыбПоле.Заголовок = Неопределено Тогда

									Продолжить;

								КонецЕсли; 
								
								Поле = Настройки.Выбор.Элементы.Добавить(Тип("ВыбранноеПолеКомпоновкиДанных"));
								ЗаполнитьЗначенияСвойств(Поле,ВыбПоле);
							КонецЦикла;
							КампанияОбъект.НастройкиОтбора = Новый ХранилищеЗначения(Настройки);
						КонецЕсли;
						КампанияОбъект.Статус = DMS_ВзаимодействияСКлиентом.ВернутьЗначениеПеречисления("CRM_СтатусыКлиентскихЗаявок",ОтветСтруктура.Статус);
						КампанияОбъект.Записать();
					КонецЕсли;
				КонецЕсли;
				
			КонецЦикла;
		КонецЕсли;
		
		//Получим кампании с центрального сервера
		
		HTTPЗапрос = Новый HTTPЗапрос();
		HTTPЗапрос.Заголовки.Вставить("Content-type", "application/json;  charset=utf-8");
		HTTPЗапрос.АдресРесурса = Настройки.Адрес2 + "/hs/Campaigns/ExportAll";
		Соединение = Новый HTTPСоединение(Настройки.Адрес1,,Настройки.ЛогинWS,Настройки.ПарольWS,,,Настройки.ЗащищенноеСоединениеOpenSSL);
	                
		ОтветHTTP = Соединение.Получить(HTTPЗапрос);

		Ответ = Renault_ОбщиеФункцииСервер.ПолучитьЗначениеИзJSON(ОтветHTTP.ПолучитьТелоКакСтроку());	
	
		Если ТипЗнч(Ответ) = Тип("СписокЗначений") и Ответ.Количество()>0 Тогда
			
			
			//заполним центральные настройки
			Для каждого Эл из Ответ цикл
				Если Эл.Значение.ЦентральнаяНастройка = Ложь тогда 
					Продолжить;
				КонецЕсли;
				НастройкиДляВсех = Эл.Значение.НастройкиДополнительные.Получить();
				Если ТипЗнч(НастройкиДляВсех) = Тип("НастройкиКомпоновкиДанных") Тогда
					DMS_ВзаимодействияСКлиентом.ЗаполнитьЦентральныеНастройкиДляВсехКампаний(Эл.Значение);
				КонецЕсли;
			КонецЦикла;
			
			//отберем УИДы кампаний, которые нужно создавать
			ТЗ_Уиды = Новый ТаблицаЗначений;
			ТЗ_Уиды.Колонки.Добавить("ЦентральныйУИД",Новый ОписаниеТипов("Строка",,,,Новый КвалификаторыСтроки(36)));

			Для каждого Эл из Ответ цикл
				Если Эл.Значение.ЦентральнаяНастройка = Ложь тогда 
					ЗаполнитьЗначенияСвойств(ТЗ_Уиды.Добавить(),Эл.Значение);	
				КонецЕсли;
   			КонецЦикла;
			
			Запрос = Новый Запрос;
			Запрос.Текст = 
			"ВЫБРАТЬ
			|	ТЗ_УИДы.ЦентральныйУИД
			|ПОМЕСТИТЬ ВТ_УИДы
			|ИЗ
			|	&ТЗ_УИДы КАК ТЗ_УИДы
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	ВТ_УИДы.ЦентральныйУИД,
			|	Renault_Кампании.Ссылка
			|ИЗ
			|	ВТ_УИДы КАК ВТ_УИДы
			|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Renault_Кампании КАК Renault_Кампании
			|		ПО ВТ_УИДы.ЦентральныйУИД = Renault_Кампании.ЦентральныйУИД
			|ГДЕ
			|	Renault_Кампании.Загружаемая = ИСТИНА
			|	И НЕ Renault_Кампании.Ссылка ЕСТЬ NULL ";
			
			Запрос.УстановитьПараметр("ТЗ_УИДы",ТЗ_Уиды);
			НовыеУИДы = Запрос.Выполнить().Выгрузить();
			
			Для каждого Эл из Ответ цикл
				
				Если Эл.Значение.ЦентральнаяНастройка = Истина тогда 
					Продолжить;
				КонецЕсли;

				Если НЕ ЗначениеЗаполнено(Эл.Значение.ЦентральныйУИД) Тогда
					Продолжить;
				КонецЕсли;
				СтрокаУИД = НовыеУИДы.Найти(Эл.Значение.ЦентральныйУИД,"ЦентральныйУИД");
				Если СтрокаУИД = Неопределено тогда
					КампанияОбъект = Справочники.Renault_Кампании.СоздатьЭлемент();
					
				Иначе
					КампанияОбъект = СтрокаУИД.Ссылка.ПолучитьОбъект();
				КонецЕсли;
				ЗаполнитьЗначенияСвойств(КампанияОбъект,Эл.Значение);
				КампанияОбъект.НастройкиОтбора = Эл.Значение.НастройкиДополнительные;
				КампанияОбъект.НастройкиДополнительные = Неопределено;
				КампанияОбъект.Статус = DMS_ВзаимодействияСКлиентом.ВернутьЗначениеПеречисления("CRM_СтатусыКлиентскихЗаявок",Эл.Значение.Статус);
				КампанияОбъект.ВидКонтакта = DMS_ВзаимодействияСКлиентом.ВернутьЗначениеПеречисления("Renault_ВидыКонтактаКампаний",Эл.Значение.ВидКонтакта);
				Если ЗначениеЗаполнено(Эл.Значение.Приоритет) тогда
					КампанияОбъект.Приоритет = Справочники.DMS_Приоритет[Эл.Значение.Приоритет];
				КонецЕсли;
				Если ЗначениеЗаполнено(Эл.Значение.ТипСообщения) тогда
					КампанияОбъект.ТипСообщения = DMS_ВзаимодействияСКлиентом.ВернутьЗначениеПеречисления("DMS_ТипСообщенияКампании",Эл.Значение.ТипСообщения);
				КонецЕсли;
				КампанияОбъект.Родитель = Справочники.Renault_Кампании.Загруженные;
				КампанияОбъект.Загружаемая = Истина;
				КампанияОбъект.Записать();
				
			КонецЦикла;
			
		КонецЕсли;
		
	Исключение
		ЗаписьЖурналаРегистрации("Обновление списка кампаний",,,,ОписаниеОшибки());
	КонецПопытки;
		

	
КонецПроцедуры	

//получает статус схемы коммуникации
Функция ПолучитьВебСервисСхемКоммуникации()
	
	Настройки = Справочники.Renault_СлужебныеНастройкиБазыДанных[ПараметрыСеанса.DMS_Бренд.Наименование];
	АдресWS = СокрЛП(Настройки.АдресWsGate);
	
	ЛогинWS = СокрЛП(Настройки.ЛогинДоступаКВебСервисам);
	ПарольWS = Настройки.ПарольДоступаКВебСервисам;
	                                                
	Определение = Новый WSОпределения(АдресWS + "ws/CommunicationCenterGate.1cws?wsdl",ЛогинWS, ПарольWS);
	
	Если Renault_ОбщиеФункции.СтараяПлатформа() Тогда
		ВебСервис = Новый WSПрокси(Определение,Определение.Сервисы[0].URIПространстваИмен,Определение.Сервисы[0].Имя,Определение.Сервисы[0].ТочкиПодключения[0].Имя,60);
	Иначе
		Выполнить("ВебСервис=Новый WSПрокси(Определение,""http://renault.ru/WSGate/RenaultCommunicationCenterGate"",""Renault_CommunicationCenter"",""Renault_CommunicationCenterSoap"",,60)");	
	КонецЕсли;	

	ВебСервис.Пользователь	 = ЛогинWS;
	ВебСервис.Пароль		 = ПарольWS;
		
	Возврат ВебСервис;
		
КонецФункции

Процедура ОбновитьСхемыКоммуникации() Экспорт
	
	//Возврат;
	
	Попытка 
		//обновим статусы кампаний находящихся на рассмотрении
		ВебСервис = ПолучитьВебСервисСхемКоммуникации();
	Исключение
		ЗаписьЖурналаРегистрации("Обновление списка схем коммуникации",,,,ОписаниеОшибки());
		Возврат;
	КонецПопытки;
		
	//Запрос = Новый Запрос;
	//Запрос.Текст = 
	//"ВЫБРАТЬ
	//|	Renault_CommunicationCenter_СхемыОбзвона.Ссылка,
	//|	Renault_CommunicationCenter_СхемыОбзвона.BIR,
	//|	Renault_CommunicationCenter_СхемыОбзвона.УИД
	//|ИЗ
	//|	Справочник.Renault_CommunicationCenter_СхемыОбзвона КАК Renault_CommunicationCenter_СхемыОбзвона
	//|ГДЕ
	//|	Renault_CommunicationCenter_СхемыОбзвона.Родитель <> &Архивные
	//|	И Renault_CommunicationCenter_СхемыОбзвона.ПометкаУдаления = ЛОЖЬ
	//|	И Renault_CommunicationCenter_СхемыОбзвона.Завершена = ЛОЖЬ
	//|	И Renault_CommunicationCenter_СхемыОбзвона.ЭтоГруппа = ЛОЖЬ
	//|	И Renault_CommunicationCenter_СхемыОбзвона.Статус = ЗНАЧЕНИЕ(Перечисление.CRM_СтатусыКлиентскихЗаявок.НаРассмотрение)
	//|	И НЕ Renault_CommunicationCenter_СхемыОбзвона.Предопределенный";
	//
	//Запрос.УстановитьПараметр("Архивные", Справочники.Renault_CommunicationCenter_СхемыОбзвона.Архивные);
	//
	//Выборка = Запрос.Выполнить().Выбрать();
	//
	//Если Выборка.Количество()>0 тогда
	//			
	//	Пока Выборка.Следующий() Цикл
	//		
	//		Если ЗначениеЗаполнено(Выборка.BIR) и ЗначениеЗаполнено(Выборка.УИД) Тогда
	//			
	//			СтруктураПараметров	= новый Структура;
	//			СтруктураПараметров.Вставить("BIR", Выборка.BIR);
	//			СтруктураПараметров.Вставить("УИД", Выборка.УИД);
	//			
	//			Попытка
	//				Ответ = ВебСервис.CommunicationCenter_Export(СериализаторXDTO.ЗаписатьXDTO(СтруктураПараметров));
	//			Исключение
	//				ЗаписьЖурналаРегистрации("Обновление списка схем коммуникации",УровеньЖурналаРегистрации.Ошибка,,,ОписаниеОшибки());
	//				Возврат;
	//			КонецПопытки;
	//			
	//			Если Ответ<>"" тогда
	//				
	//				Если DMS_ВзаимодействияСКлиентом.ВернутьЗначениеПеречисления("CRM_СтатусыКлиентскихЗаявок",Ответ) <> Выборка.Ссылка.Статус Тогда
	//					
	//					СхемаОбъект = Выборка.Ссылка.ПолучитьОбъект();
	//										
	//					СхемаОбъект.Статус = DMS_ВзаимодействияСКлиентом.ВернутьЗначениеПеречисления("CRM_СтатусыКлиентскихЗаявок",Ответ);
	//					СхемаОбъект.ОбменДанными.Загрузка = Истина;
	//					СхемаОбъект.Записать();
	//					
	//				КонецЕсли;
	//				
	//			КонецЕсли;
	//			
	//		КонецЕсли;
	//		
	//	КонецЦикла;
	//	
	//КонецЕсли;
	
	ЗагрузитьПредопределенныеСхемыСDictionary(ВебСервис);
		
КонецПроцедуры	

Процедура ЗагрузитьПредопределенныеСхемыСDictionary(ВебСервис)
	
	//Получим изменения предопределенных схем с дикшионари
	BIR=Константы.Renault_BIR_db.Получить(); //БИРы дилера
	Данные=Новый Структура("BIR",BIR);
	
	Если ЗначениеЗаполнено(BIR) Тогда
		
		Если Справочники.Renault_СлужебныеНастройкиБазыДанных[ПараметрыСеанса.DMS_Бренд.Наименование].ИспользоватьHTTPСервисы Тогда
			ТаблицаСхем="";
			Если НЕ DMS_DataExchange.sendMessage(DMS_ОбщиеПовторныеФункции.ПараметрыHTTPСоединения(),"DictionaryHTTP","Renault_CommunicationCenter.GetSchema",DMS_DataExchange.newPackage(Данные),ТаблицаСхем) Тогда 
				ЗаписьЖурналаРегистрации("Renault_CommunicationCenter.GetSchema",УровеньЖурналаРегистрации.Ошибка,,,ТаблицаСхем);
				Возврат;
			КонецЕсли;
		Иначе		
			Попытка
				Ответ = ВебСервис.CommunicationCenter_DictionariesSchema(СериализаторXDTO.ЗаписатьXDTO(BIR));
			Исключение
				ЗаписьЖурналаРегистрации("Обновление списка схем коммуникации",УровеньЖурналаРегистрации.Ошибка,,,ОписаниеОшибки());
				Возврат;
			КонецПопытки;
			ТаблицаСхем = СериализаторXDTO.ПрочитатьXDTO(Ответ);
			Ответ = Неопределено;
		КонецЕсли;
						
		Для Каждого Стр Из ТаблицаСхем Цикл
					
			СхемаОбзвонаПредопределенная = Справочники.Renault_CommunicationCenter_СхемыОбзвона.ПолучитьСхемуПоУид(Стр.УИД);
			Если ЗначениеЗаполнено(СхемаОбзвонаПредопределенная) Тогда
				СхемаОбзвонаПр = СхемаОбзвонаПредопределенная.ПолучитьОбъект(); 
			Иначе
				СхемаОбзвонаПр = Справочники.Renault_CommunicationCenter_СхемыОбзвона.СоздатьЭлемент();
			КонецЕсли;
			
			ЗаполнитьЗначенияСвойств(СхемаОбзвонаПр,Стр);
			СхемаОбзвонаПр.Наименование = Стр.Наименование + " (шаблон)";
			СхемаОбзвонаПр.ДилерскийЦентр = Справочники.CRM_ДилерскиеЦентры.ПустаяСсылка();
			СхемаОбзвонаПр.СпособПолученияКлиентов = НайтиЗнчПеречисления(Стр.СпособПолученияКлиентов, "DMS_СпособыПолученияКлиентовДляСхемКоммуникации");
			Если не СхемаОбзвонаПр.ПолЖенский и не СхемаОбзвонаПр.ПолМужской Тогда
				СхемаОбзвонаПр.ПолЖенский = Истина;
			    СхемаОбзвонаПр.ПолМужской = Истина;
			КонецЕсли;
			СхемаОбзвонаПр.ВидКонтрагента = НайтиЗнчПеречисления(Стр.ВидКонтрагента, "ФормыСобственности");
			
			Если Стр.ТипКоммуникации = "ТелефонныйЗвонок" Тогда
				СхемаОбзвонаПр.ТипКоммуникации = Перечисления.ВидыСобытий.ТелефонныйЗвонок;
			ИначеЕсли Стр.ТипКоммуникации = "SMS" Тогда
				СхемаОбзвонаПр.ТипКоммуникации = Перечисления.ВидыСобытий.SMS;
				СхемаОбзвонаПр.ТекстСМС        = Стр.ТекстСмс;
			ИначеЕсли Стр.ТипКоммуникации = "ЭлектронноеПисьмо" Тогда
				СхемаОбзвонаПр.ТипКоммуникации = Перечисления.ВидыСобытий.ЭлектронноеПисьмо;
				СхемаОбзвонаПр.ТекстEmail_Заголовок = Стр.ТекстEmail_Заголовок;
				СхемаОбзвонаПр.ТекстEmail_ПодЗаголовок = Стр.ТекстEmail_ПодЗаголовок;
				СхемаОбзвонаПр.ТекстEmail_Приветствие = Стр.ТекстEmail_Приветствие;
				СхемаОбзвонаПр.ТекстEmail_ТекстПисьма = Стр.ТекстEmail_ТекстПисьма;
				СхемаОбзвонаПр.ТекстEmail_ТекстПодвала = Стр.ТекстEmail_ТекстПодвала;
				СхемаОбзвонаПр.ТекстEmail_Тема = Стр.ТекстEmail_Тема;
			КонецЕсли;
			
			СхемаОбзвонаПр.Статус = Перечисления.CRM_СтатусыКлиентскихЗаявок.Утверждена;
			Если СхемаОбзвонаПр.Ссылка.Пустая() Тогда
				СхемаОбзвонаПр.Одноразовая = Истина;
			КонецЕсли;
			СхемаОбзвонаПр.Родитель = Справочники.Renault_CommunicationCenter_СхемыОбзвона.Загружаемые;
			Отборы = Стр.Отборы.Получить();
			
			Для Каждого СтрОтбор Из Отборы Цикл
				
				Если СтрОтбор.ИмяОтбора = "Событие" Тогда
					СхемаОбзвонаПр.Событие = СтрОтбор.ИмяОтбора;
					Схемаобзвонапр.ВидСравненияПоСобытию = СтрОтбор.ВидСравнения;
					Схемаобзвонапр.ДнейДоСобытия = Число(СтрОтбор.ЗначениеОтбора);
				Иначе
					СхемаОбзвонаПр[СтрОтбор.ИмяОтбора] = СтрОтбор.ЗначениеОтбора;
				КонецЕсли;
				
			КонецЦикла;
			
			СхемаОбзвонаПр.ОбменДанными.Загрузка = Истина;
			СхемаОбзвонаПр.Загружаемая = Истина;
			СхемаОбзвонаПр.Записать();
			
			Если СхемаОбзвонаПр.ТипКоммуникации = Перечисления.ВидыСобытий.ТелефонныйЗвонок Тогда
				
				ГрафСхема = Стр.ГрафСхема;
				
				НаборКартинок = РегистрыСведений.КартинкиИФайлы.СоздатьНаборЗаписей();
				НаборКартинок.Отбор.Объект.Установить(СхемаОбзвонаПр.Ссылка);
				НаборКартинок.Прочитать();								
				
				Если НаборКартинок.Количество()=0 Тогда
					СтрКартинка = НаборКартинок.Добавить();
					СтрКартинка.Объект = СхемаОбзвонаПр.Ссылка;
				Иначе
					СтрКартинка = НаборКартинок[0];
				КонецЕсли;
				
				СтрКартинка.ДатаСохранения = ТекущаяДата();
				СтрКартинка.Идентификатор  = СхемаОбзвонаПр.Наименование;
				СтрКартинка.ИмяФайла       = КаталогВременныхФайлов()+СхемаОбзвонаПр.Наименование + ".grs";	;
				СтрКартинка.Объект         = СхемаОбзвонаПр.Ссылка;
				СтрКартинка.Наименование   = СхемаОбзвонаПр.Наименование;
				СтрКартинка.Данные         = Стр.ГрафСхема;
				
				НаборКартинок.Записать();
				
				ДействияШаговХрЗ = Стр.ШагиСхемы.Получить();
				Если ДействияШаговХрЗ<>Неопределено Тогда

					ТаблицаДействий = Новый ТаблицаЗначений;
					ТаблицаДействий.Колонки.Добавить("ЭлементСхемы",);
					ТаблицаДействий.Колонки.Добавить("Действие",);
					ТаблицаДействий.Колонки.Добавить("НазначениеОпросов",);
					ТаблицаДействий.Колонки.Добавить("СхемаОбзвонаВторичная",);	
					
					Для Каждого СтрДействие Из ДействияШаговХрЗ Цикл
						
						НовСтрДействия = ТаблицаДействий.Добавить();
						НовСтрДействия.ЭлементСхемы = СтрДействие.Наименование;
						
						Если ЗначениеЗаполнено(СтрДействие.Действие) Тогда
							
							Действие = НайтиЗнчПеречисления(СтрДействие.Действие, "Renault_ДействияРезультатов");
						
							РезультатКоммуникации = Справочники.Renault_CommunicationCenter_РезультатыКоммуникации.НайтиПоРеквизиту("ТипРезультата", Действие);
							Если Не ЗначениеЗаполнено(РезультатКоммуникации) Тогда
								РезультатКоммуникации = Справочники.Renault_CommunicationCenter_РезультатыКоммуникации.СоздатьЭлемент();
								РезультатКоммуникации.ТипРезультата = Действие;
								РезультатКоммуникации.Записать();
							КонецЕсли;
							
							НовСтрДействия.Действие = РезультатКоммуникации.Ссылка;
							
						КонецЕсли;
						
					КонецЦикла;
				КонецЕсли;
				Если ГрафСхема.Получить()<>Неопределено Тогда
					
					ИмяКаталога = КаталогВременныхФайлов();
					ИмяВременногоФайла = ИмяКаталога + Стр.Наименование;
					ГрафСхема.Получить().Записать(ИмяВременногоФайла);
					ПолноеИмяФайла = ИмяВременногоФайла;
					ГрафСхемаНовая = Новый ГрафическаяСхема;
					ГрафСхемаНовая.Прочитать(ПолноеИмяФайла);
					
					Справочники.Renault_CommunicationCenter_СхемыОбзвона.ЗаполнитьШагиПоГрафСхеме(СхемаОбзвонаПр.Ссылка, ГрафСхемаНовая, ТаблицаДействий);
					
					ГрафСхемаНовая = Неопределено;
					УдалитьФайлы(ПолноеИмяФайла);
				КонецЕсли;
				
			КонецЕсли;
			
			Если СхемаОбзвонаПр.Исполнители.Количество()>0 и Не СхемаОбзвонаПр.НеНапоминать Тогда
				Справочники.Renault_CommunicationCenter_СхемыОбзвона.СоздатьНапоминания(СхемаОбзвонаПр.Ссылка);
			КонецЕсли;	
		КонецЦикла;				
	КонецЕсли;

КонецПроцедуры

Функция ОтправитьСхемуКоммуникацииВDictionary(СхемаКоммуникации) Экспорт
	
	Попытка 
		//обновим статусы кампаний находящихся на рассмотрении
		ВебСервис = ПолучитьВебСервисСхемКоммуникации();
	Исключение
		ЗаписьЖурналаРегистрации("Обновление списка схем коммуникации",,,,ОписаниеОшибки());
		Возврат Ложь;
	КонецПопытки;

	СтруктураПараметров = Новый Структура;
	СтруктураПараметров.Вставить("Наименование", СхемаКоммуникации.Наименование);
	СтруктураПараметров.Вставить("BIR", СхемаКоммуникации.BIR);
	СтруктураПараметров.Вставить("УИД", СхемаКоммуникации.УИД);
	СтруктураПараметров.Вставить("НачалоПериода", СхемаКоммуникации.НачалоПериода);
	СтруктураПараметров.Вставить("ОкончаниеПериода", СхемаКоммуникации.ОкончаниеПериода);
	СтруктураПараметров.Вставить("ДнейНаОбзвон", СхемаКоммуникации.ДнейНаОбзвон);
	СтруктураПараметров.Вставить("Одноразовая", СхемаКоммуникации.Одноразовая);

	Если СхемаКоммуникации.Статус = Перечисления.CRM_СтатусыКлиентскихЗаявок.НаРассмотрение Тогда
		Статус = "НаРассмотрение";
	ИначеЕсли СхемаКоммуникации.Статус = Перечисления.CRM_СтатусыКлиентскихЗаявок.НаРедактирование Тогда
		Статус = "НаРедактирование";
	ИначеЕсли СхемаКоммуникации.Статус = Перечисления.CRM_СтатусыКлиентскихЗаявок.Отклонена Тогда
		Статус = "Отклонена";
	ИначеЕсли СхемаКоммуникации.Статус = Перечисления.CRM_СтатусыКлиентскихЗаявок.Утверждена Тогда
		Статус = "Утверждена";
	КонецЕсли;
	
	СтруктураПараметров.Вставить("Статус", Статус);
	
	Если СхемаКоммуникации.ТипКоммуникации = Перечисления.ВидыСобытий.ТелефонныйЗвонок Тогда		
		
		Если СхемаКоммуникации.ШагиСхемы.Количество() = 0 Тогда
			Возврат Ложь;
		КонецЕсли;
		
		СтруктураПараметров.Вставить("ТипКоммуникации", "ТелефонныйЗвонок");
		
		УпаковатьГрафСхему(СхемаКоммуникации, СтруктураПараметров);	//подготовим граф. схему в виде двоичных данных
		
		УпаковатьДействияШагов(СхемаКоммуникации, СтруктураПараметров);
		
	ИначеЕсли СхемаКоммуникации.ТипКоммуникации = Перечисления.ВидыСобытий.SMS Тогда		
		
		СтруктураПараметров.Вставить("ТипКоммуникации", "SMS");
		СтруктураПараметров.Вставить("ТекстСМС", СхемаКоммуникации.ТекстСМС);		
		
	Иначе
		
		СтруктураПараметров.Вставить("ТипКоммуникации", "ЭлектронноеПисьмо");
		
		СтруктураПараметров.Вставить("ТекстEmail_Заголовок", СхемаКоммуникации.ТекстEmail_Заголовок);
		СтруктураПараметров.Вставить("ТекстEmail_ПодЗаголовок", СхемаКоммуникации.ТекстEmail_ПодЗаголовок);
		СтруктураПараметров.Вставить("ТекстEmail_Приветствие", СхемаКоммуникации.ТекстEmail_Приветствие);
		СтруктураПараметров.Вставить("ТекстEmail_ТекстПисьма", СхемаКоммуникации.ТекстEmail_ТекстПисьма);
		СтруктураПараметров.Вставить("ТекстEmail_ТекстПодвала", СхемаКоммуникации.ТекстEmail_ТекстПодвала);
		СтруктураПараметров.Вставить("ТекстEmail_Тема", СхемаКоммуникации.ТекстEmail_Тема);
		
	КонецЕсли;
			
	ПолучитьОтборыСхемыКоммуникации(СхемаКоммуникации, СтруктураПараметров);//добавляет в структуру параметров отборы схемы
	ПолучитьДопОтборыСхемыКоммуникации(СхемаКоммуникации, СтруктураПараметров);//добавляет в структуру параметров доп. отборы схемы	
	
	ИсходящийПараметр = СериализаторXDTO.ЗаписатьXDTO(СтруктураПараметров);
			
	Попытка
		
		Ответ = ВебСервис.CommunicationCenter_Accept(ИсходящийПараметр);		
		Возврат Ответ;	 

	Исключение
		Возврат Ложь;
	КонецПопытки;
	
КонецФункции

Процедура ПолучитьОтборыСхемыКоммуникации(СхемаКоммуникации, СтруктураПараметров)
	
	ТабОтборовПоКлиенту = Новый ТаблицаЗначений;
    ТабОтборовПоКлиенту.Колонки.Добавить("ИмяОтбора");
    ТабОтборовПоКлиенту.Колонки.Добавить("ВидСравнения");
    ТабОтборовПоКлиенту.Колонки.Добавить("ЗначениеОтбора");
				
	СтруктураПараметров.Вставить("ВидКонтрагента", Строка(СхемаКоммуникации.ВидКонтрагента));		
	СтруктураПараметров.Вставить("ВозрастОт", СхемаКоммуникации.ВозрастОт);
	СтруктураПараметров.Вставить("ВозрастДо", СхемаКоммуникации.ВозрастДо);
	СтруктураПараметров.Вставить("ПолМужской", СхемаКоммуникации.ПолМужской);
	СтруктураПараметров.Вставить("ПолЖенский", СхемаКоммуникации.ПолЖенский);
	СтруктураПараметров.Вставить("ДатаРегистрацииОт", СхемаКоммуникации.ДатаРегистрацииОт);
	СтруктураПараметров.Вставить("ДатаРегистрацииДо", СхемаКоммуникации.ДатаРегистрацииДо);
	СтруктураПараметров.Вставить("ГодВыпускаОт", СхемаКоммуникации.ГодВыпускаОт);
	СтруктураПараметров.Вставить("ГодВыпускаДо", СхемаКоммуникации.ГодВыпускаДо);
	СтруктураПараметров.Вставить("ПробегОт", СхемаКоммуникации.ПробегОт);
	СтруктураПараметров.Вставить("ПробегДо", СхемаКоммуникации.ПробегДо);
	СтруктураПараметров.Вставить("ДатаНачалаГарантии", СхемаКоммуникации.ДатаНачалаГарантии);
	СтруктураПараметров.Вставить("ДатаОкончанияГарантии", СхемаКоммуникации.ДатаОкончанияГарантии);
	СтруктураПараметров.Вставить("ПоследнийЗаездОт", СхемаКоммуникации.ПоследнийЗаездОт);
	СтруктураПараметров.Вставить("ПоследнийЗаездДо", СхемаКоммуникации.ПоследнийЗаездДо);
	СтруктураПараметров.Вставить("Событие", ""+СхемаКоммуникации.Событие);
	СтруктураПараметров.Вставить("ВидСравненияПоСобытию", СхемаКоммуникации.ВидСравненияПоСобытию);
	СтруктураПараметров.Вставить("ДнейДоСобытия", СхемаКоммуникации.ДнейДоСобытия);	
	
	Если ЗначениеЗаполнено(СхемаКоммуникации.ПоследнийТО) Тогда
		НовСтр                = ТабОтборовПоКлиенту.Добавить();
	    НовСтр.ИмяОтбора      = "Последний ТО";
	    НовСтр.ВидСравнения   = "=";
	    НовСтр.ЗначениеОтбора = Строка(СхемаКоммуникации.ПоследнийТО);
	КонецЕсли;
			
    ХрТабОтборовПоКлиенту = Новый ХранилищеЗначения(ТабОтборовПоКлиенту);
  
    СтруктураПараметров.Вставить("Отборы", ХрТабОтборовПоКлиенту);
  
КонецПроцедуры

Процедура ПолучитьДопОтборыСхемыКоммуникации(СхемаКоммуникации, СтруктураПараметров)
	
   ТабДопОтборовПоКлиенту = Новый ТаблицаЗначений;
   ТабДопОтборовПоКлиенту.Колонки.Добавить("ИмяОтбора");
   ТабДопОтборовПоКлиенту.Колонки.Добавить("ВидСравнения");
   ТабДопОтборовПоКлиенту.Колонки.Добавить("ЗначениеОтбора");
   
   Для Каждого Стр Из СхемаКоммуникации.ДопСегментацияПоКлиенту Цикл
	   
	  НовСтр = ТабДопОтборовПоКлиенту.Добавить();
	  НовСтр.ИмяОтбора      = "Контрагент."+Стр.Реквизит;
	  НовСтр.ВидСравнения   = Стр.ВидСравнения;
	  НовСтр.ЗначениеОтбора = Строка(Стр.Значение);
	  
   КонецЦикла;
	
   Для Каждого Стр Из СхемаКоммуникации.ДопСегментацияПоПолису Цикл
	   
	  НовСтр = ТабДопОтборовПоКлиенту.Добавить();
	  НовСтр.ИмяОтбора      = "Страховой полис."+Стр.Реквизит;
	  НовСтр.ВидСравнения   = Стр.ВидСравнения;
	  НовСтр.ЗначениеОтбора = Строка(Стр.Значение);
	  
   КонецЦикла;
  
   Для Каждого Стр Из СхемаКоммуникации.ДопСегментацияПоАвтомобилю Цикл
	   
	  НовСтр = ТабДопОтборовПоКлиенту.Добавить();
	  НовСтр.ИмяОтбора      = "Автомобиль."+Стр.Реквизит;
	  НовСтр.ВидСравнения   = Стр.ВидСравнения;
	  НовСтр.ЗначениеОтбора = Строка(Стр.Значение);
	  
   КонецЦикла;
     
   Если СхемаКоммуникации.Модели.Количество()>0 Тогда	   
	   НовСтр              = ТабДопОтборовПоКлиенту.Добавить();	   
	   НовСтр.ИмяОтбора    = "Автомобиль.Модель";
	   НовСтр.ВидСравнения = "В списке";
	   Модели              = "";
	   Для Каждого Стр Из СхемаКоммуникации.Модели Цикл
		   Модели = Модели + Стр.Модель.Наименование+"; ";	   
	   КонецЦикла;			
	   НовСтр.ЗначениеОтбора = Модели;		
   КонецЕсли;

   Если СхемаКоммуникации.Версии.Количество()>0 Тогда
	   НовСтр              = ТабДопОтборовПоКлиенту.Добавить();
	   НовСтр.ИмяОтбора    = "Автомобиль.Версия";
	   НовСтр.ВидСравнения = "В списке";		
	   Версии              = "";
	   Для Каждого Стр Из СхемаКоммуникации.Версии Цикл
	   		Версии = Версии + Стр.Версия.Наименование+"; ";
	   КонецЦикла;		
	   НовСтр.ЗначениеОтбора = Версии;	
   КонецЕсли;

	Если СхемаКоммуникации.ТипыКузова.Количество()>0 Тогда
	   НовСтр               = ТабДопОтборовПоКлиенту.Добавить();
		НовСтр.ИмяОтбора    = "Автомобиль.ТипКузова";
		НовСтр.ВидСравнения = "В списке";
		ТипыКузова          = "";
		Для Каждого Стр Из СхемаКоммуникации.ТипыКузова Цикл
			ТипыКузова = ТипыКузова + Стр.ТипКузова.Наименование+"; ";
		КонецЦикла;		
		НовСтр.ЗначениеОтбора = ТипыКузова;	
	КонецЕсли;

	Если СхемаКоммуникации.ТипыКПП.Количество()>0 Тогда
	    НовСтр              = ТабДопОтборовПоКлиенту.Добавить();
		НовСтр.ИмяОтбора    = "Автомобиль.ТипКПП";
		НовСтр.ВидСравнения = "В списке";
		ТипыКПП             = "";
		Для Каждого Стр Из СхемаКоммуникации.ТипыКПП Цикл
			ТипыКПП = ТипыКПП + Стр.ТипКПП.Наименование+"; ";
		КонецЦикла;		
		НовСтр.ЗначениеОтбора = ТипыКПП;
	КонецЕсли;

	Если СхемаКоммуникации.ТипыДвигателей.Количество()>0 Тогда
	    НовСтр              = ТабДопОтборовПоКлиенту.Добавить();
		НовСтр.ИмяОтбора    = "Автомобиль.ТипДвигателя";
		НовСтр.ВидСравнения = "В списке";
		ТипыДвигателей      = "";
		Для Каждого Стр Из СхемаКоммуникации.ТипыДвигателей Цикл
			ТипыДвигателей = ТипыДвигателей + Стр.ТипДвигателя.Наименование+"; ";
		КонецЦикла;		
		НовСтр.ЗначениеОтбора = ТипыДвигателей;
	КонецЕсли;

	Если СхемаКоммуникации.Опции.Количество()>0 Тогда
	    НовСтр              = ТабДопОтборовПоКлиенту.Добавить();
		НовСтр.ИмяОтбора    = "Автомобиль.Опция";
		НовСтр.ВидСравнения = "В списке";
		Опции               = "";
		Для Каждого Стр Из СхемаКоммуникации.Опции Цикл
			Опции = Опции + Стр.Опция.Наименование+"; ";
		КонецЦикла;		
		НовСтр.ЗначениеОтбора = Опции;
	КонецЕсли;

	Если СхемаКоммуникации.Оборудование.Количество()>0 Тогда
	    НовСтр              = ТабДопОтборовПоКлиенту.Добавить();
		НовСтр.ИмяОтбора    = "Автомобиль.Оборудование";
		НовСтр.ВидСравнения = "В списке";
		Оборудование        = "";
		Для Каждого Стр Из СхемаКоммуникации.Оборудование Цикл
			Оборудование = Оборудование + Стр.Оборудование.Наименование+"; ";
		КонецЦикла;		
		НовСтр.ЗначениеОтбора = Оборудование;
	КонецЕсли;

	Если СхемаКоммуникации.СервисныеКампании.Количество()>0 Тогда
	    НовСтр              = ТабДопОтборовПоКлиенту.Добавить();
		НовСтр.ИмяОтбора    = "СервисныеКампании";
		НовСтр.ВидСравнения = "В списке";
		СервисныеКампании   = "";
		Для Каждого Стр Из СхемаКоммуникации.СервисныеКампании Цикл
			СервисныеКампании = СервисныеКампании + Стр.СервиснаяКампания.Наименование+"; ";
		КонецЦикла;		
		НовСтр.ЗначениеОтбора = СервисныеКампании;
	КонецЕсли;

    ХрТабДопОтборовПоКлиенту = Новый ХранилищеЗначения(ТабДопОтборовПоКлиенту);
  
    СтруктураПараметров.Вставить("ДопОтборы", ХрТабДопОтборовПоКлиенту);
   
КонецПроцедуры

Процедура УпаковатьГрафСхему(СхемаКоммуникации, СтруктураПараметров)
	
	НаборФайла = РегистрыСведений.КартинкиИФайлы.СоздатьНаборЗаписей();
	НаборФайла.Отбор.Объект.Установить(СхемаКоммуникации);
	НаборФайла.Прочитать();
		
	Для Каждого Стр Из НаборФайла Цикл
		
		Если Найти(Стр.ИмяФайла, ".grs")>0 Тогда
			
			Если Стр.ДанныеВоВнешнемФайле Тогда
				ПолноеИмяФайла = Стр.ИмяФайла;
			Иначе
				ПолноеИмяФайла = Стр.Данные.Получить();					
			КонецЕсли;
				
			Прервать;
			
		КонецЕсли;
		
	КонецЦикла;	
	
	Если ТипЗнч(ПолноеИмяФайла) = Тип("ДвоичныеДанные") Тогда
		ддФайлСхемы = ПолноеИмяФайла;
	Иначе
		ддФайлСхемы = Новый ДвоичныеДанные(ПолноеИмяФайла); 
	КонецЕсли;
	
	СтруктураПараметров.Вставить("ФайлСхемы", Новый ХранилищеЗначения(ддФайлСхемы));
		
КонецПроцедуры

Процедура УпаковатьДействияШагов(СхемаКоммуникации, СтруктураПараметров)

	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |	Renault_CommunicationCenter_СхемыОбзвонаШагиСхемы.ШагСхемы.Наименование КАК ЭлементСхемы,
	               |	ВЫБОР
	               |		КОГДА Renault_CommunicationCenter_СхемыОбзвонаШагиСхемы.ШагСхемы.Действие.ТипРезультата = ЗНАЧЕНИЕ(Перечисление.Renault_ДействияРезультатов.Анкета)
	               |			ТОГДА ""Анкета""
	               |		КОГДА Renault_CommunicationCenter_СхемыОбзвонаШагиСхемы.ШагСхемы.Действие.ТипРезультата = ЗНАЧЕНИЕ(Перечисление.Renault_ДействияРезультатов.ЗаписатьНаСервис)
	               |			ТОГДА ""Записать на сервис""
	               |		КОГДА Renault_CommunicationCenter_СхемыОбзвонаШагиСхемы.ШагСхемы.Действие.ТипРезультата = ЗНАЧЕНИЕ(Перечисление.Renault_ДействияРезультатов.ОтменитьЗаписьНаСервис)
	               |			ТОГДА ""Отменить запись на сервис""
	               |		КОГДА Renault_CommunicationCenter_СхемыОбзвонаШагиСхемы.ШагСхемы.Действие.ТипРезультата = ЗНАЧЕНИЕ(Перечисление.Renault_ДействияРезультатов.УдалениеАвтомобиля)
	               |			ТОГДА ""Удаление автомобиля""
	               |		КОГДА Renault_CommunicationCenter_СхемыОбзвонаШагиСхемы.ШагСхемы.Действие.ТипРезультата = ЗНАЧЕНИЕ(Перечисление.Renault_ДействияРезультатов.ПереносЗаписиНаСервис)
	               |			ТОГДА ""Перенос записи на сервис""
	               |		КОГДА Renault_CommunicationCenter_СхемыОбзвонаШагиСхемы.ШагСхемы.Действие.ТипРезультата = ЗНАЧЕНИЕ(Перечисление.Renault_ДействияРезультатов.ОтметитьТелефонНеверным)
	               |			ТОГДА ""Отметить телефон неверным""
	               |		КОГДА Renault_CommunicationCenter_СхемыОбзвонаШагиСхемы.ШагСхемы.Действие.ТипРезультата = ЗНАЧЕНИЕ(Перечисление.Renault_ДействияРезультатов.БольшеНеБеспокоитьКлиента)
	               |			ТОГДА ""Больше не беспокоить клиента""
	               |		КОГДА Renault_CommunicationCenter_СхемыОбзвонаШагиСхемы.ШагСхемы.Действие.ТипРезультата = ЗНАЧЕНИЕ(Перечисление.Renault_ДействияРезультатов.ОтметитьРекомендацииВыполненными)
	               |			ТОГДА ""Отметить рекомендации выполненными""
	               |		КОГДА Renault_CommunicationCenter_СхемыОбзвонаШагиСхемы.ШагСхемы.Действие.ТипРезультата = ЗНАЧЕНИЕ(Перечисление.Renault_ДействияРезультатов.ПерезвонитьПозже)
	               |			ТОГДА ""Перезвонить позже""
	               |		КОГДА Renault_CommunicationCenter_СхемыОбзвонаШагиСхемы.ШагСхемы.Действие.ТипРезультата = ЗНАЧЕНИЕ(Перечисление.Renault_ДействияРезультатов.ОкончаниеЗвонка)
	               |			ТОГДА ""Окончание звонка""
	               |		КОГДА Renault_CommunicationCenter_СхемыОбзвонаШагиСхемы.ШагСхемы.Действие.ТипРезультата = ЗНАЧЕНИЕ(Перечисление.Renault_ДействияРезультатов.ПодтверждениеЗаписи)
	               |			ТОГДА ""Подтверждение записи на сервис""
	               |		ИНАЧЕ """"
	               |	КОНЕЦ КАК Действие,
	               |	ВЫРАЗИТЬ(Renault_CommunicationCenter_СхемыОбзвонаШагиСхемы.ШагСхемы.Содержание КАК СТРОКА(400)) КАК Содержание
	               |ИЗ
	               |	Справочник.Renault_CommunicationCenter_СхемыОбзвона.ШагиСхемы КАК Renault_CommunicationCenter_СхемыОбзвонаШагиСхемы
	               |ГДЕ
	               |	Renault_CommunicationCenter_СхемыОбзвонаШагиСхемы.Ссылка = &СхемаКоммуникации
	               |	И Renault_CommunicationCenter_СхемыОбзвонаШагиСхемы.ШагСхемы.Действие <> ЗНАЧЕНИЕ(Перечисление.Renault_ДействияРезультатов.ПустаяСсылка)";
	
	Запрос.УстановитьПараметр("СхемаКоммуникации", СхемаКоммуникации);
	
	ДействияШагов = Запрос.Выполнить().Выгрузить();
	
	СтруктураПараметров.Вставить("ДействияШагов", Новый ХранилищеЗначения(ДействияШагов)); 
	
КонецПроцедуры

Функция НайтиЗнчПеречисления(прм_имя, ИмяПеречисления)
    имя=СокрЛП(прм_имя);
    Для Каждого эл из Метаданные.Перечисления[ИмяПеречисления].ЗначенияПеречисления Цикл
        Если СокрЛП(эл.Синоним)=имя Тогда
            Возврат Вычислить("Перечисления."+ИмяПеречисления+"."+эл.Имя);
        КонецЕсли;    
    КонецЦикла;
    Возврат Неопределено;
КонецФункции
////#КонецОбласти

