//Клиент
Процедура ОтправитьНаСогласование(ЭтотОбъект,Кнопка) Экспорт 
	ПроцедурыФункцииСогласованияСервер = SM_ПроцедурыФункцииСогласованияСервер;
	Сотрудник			= ПараметрыСеанса.Пользователь.Сотрудник;
	НаборСотрудников	= ПроцедурыФункцииСогласованияСервер.ПоискРуководителяСогласоватора(Сотрудник);
	Руководитель        = НаборСотрудников.Руководитель;
	ИтоговыйСогласовательСсылка = Справочники.Сотрудники.ПустаяСсылка();
	ИтоговыйСогласователь = НаборСотрудников.ИтоговыйСогласователь;
	Если ЗначениеЗаполнено(ИтоговыйСогласователь) Тогда            
		ИтоговыйСогласовательСсылка = ИтоговыйСогласователь;
		ИтоговыйСогласователь = ИтоговыйСогласователь.Наименование;
	Иначе
		ИтоговыйСогласователь = "";
	КонецЕсли;
	
	Если Руководитель <> Неопределено Тогда
		СформироватьДокументСогласованияВДокументообороте(ЭтотОбъект,Кнопка,,Сотрудник.Наименование,Руководитель.Наименование,ИтоговыйСогласователь);  
		ПоказатьОповещение("Докумет отправлен на согласование.");
	Иначе         
		ПоказатьОповещение("Вам отказано в отправке документа на согласование, Вас нет в списке.");
	КонецЕсли;
КонецПроцедуры
//Клиент
Процедура СформироватьДокументСогласованияВДокументообороте(ДокументОбъект,Кнопка,ПовторноеСогласование = Ложь,Сотрудник,Руководитель,ИтоговыйСогласователь)
	ПроцедурыФункцииСогласованияСервер = SM_ПроцедурыФункцииСогласованияСервер;
	СтруктураJSON = ПроцедурыФункцииСогласованияСервер.СформироватьJSONДокументаДляСогласованияВДокументооборот(ДокументОбъект.Ссылка,ПовторноеСогласование,Сотрудник,Руководитель,ИтоговыйСогласователь);
	Если СтруктураJSON = Неопределено Тогда
		ПоказатьОповещение("Не сформирован JSON, отправка документа на согласование прервано."); 
		Возврат;
	КонецЕсли;
	
	JSON = ПроцедурыФункцииСогласованияСервер.ЗаписатьСтруктуруВJSON(СтруктураJSON);
	
	ОтправитьДокументНаСогласование(JSON,ДокументОбъект,Кнопка,Сотрудник,Руководитель,ИтоговыйСогласователь);				                                      	
КонецПроцедуры
//Клиент
Процедура ОтправитьДокументНаСогласование(JSON,ДокументОбъект,Кнопка,Сотрудник,Руководитель,ИтоговыйСогласователь)
	ПроцедурыФункцииСогласованияСервер = SM_ПроцедурыФункцииСогласованияСервер;
	HTTPОтвет = ПроцедурыФункцииСогласованияСервер.ОтправитьЗапросВДокументооборот("UploadDocument",JSON);
		
	Если HTTPОтвет.КодСостояния = 200 Тогда
		ПоказатьОповещение("Данный документ успешно отправлен на согласование.");
		Если РегистрыСведений.SM_СтатусСогласованияДокумента.СогласованиеПревано(ДокументОбъект.Ссылка) Тогда
			РегистрыСведений.SM_СтатусСогласованияДокумента.ДобавитьЗапись(ДокументОбъект.Ссылка,"ОткрытПовторно","",ТекущаяДата());
		Иначе
			РегистрыСведений.SM_СтатусСогласованияДокумента.ДобавитьЗапись(ДокументОбъект.Ссылка,"Открыт","");
		КонецЕсли;
	ИначеЕсли HTTPОтвет.КодСостояния = 201 Тогда 
		ПоказатьОповещение("Данный документ уже загружен и ожидает согласование.");  
	ИначеЕсли HTTPОтвет.КодСостояния = 202 Тогда
		Если Вопрос("Отправить документ повторно на согласование?",РежимДиалогаВопрос.ДаНет) = КодВозвратаДиалога.Да Тогда
			СформироватьДокументСогласованияВДокументообороте(ДокументОбъект,Кнопка,Истина,Сотрудник,Руководитель,ИтоговыйСогласователь);
			ПоказатьОповещение("Документ отправлен повторно на согласование.");
		КонецЕсли;
	ИначеЕсли HTTPОтвет.КодСостояния = 500 Тогда
		ПоказатьОповещение("Ошибка записи документа.");
	Иначе
		ПоказатьОповещение(" ");
	КонецЕсли;		
КонецПроцедуры
//Клиент
Процедура ДобавитьКнопкуСогласования(ЭтаФорма) Экспорт
	ПоискЭлементаДействияФормы = ЭтаФорма.ЭлементыФормы.Найти("ДействияФормы");
	
	Если ПоискЭлементаДействияФормы = Неопределено Тогда
		ПоказатьОповещение("В данной форме отстутсвует элемент формы ""ДействияФормы"", согласование не доступно.");
		Возврат ;
	КонецЕсли;  
	Если Константы.SM_ПереключательСистемыСогласований.Получить() Тогда
		СписокКнопок				= ПоискЭлементаДействияФормы.Кнопки.Добавить("СписокКнопокСогласования"	,ТипКнопкиКоманднойПанели.Подменю	,"Согласование документа");
		КнопкаЗапуститьСогласование = СписокКнопок.Кнопки.Добавить("СогласоватьДокумент"					,ТипКнопкиКоманднойПанели.Действие	,"Согласовать"	,Новый Действие("ОтправитьНаСогласование"));
		КнопкаЗапуститьСогласование.Картинка = БиблиотекаКартинок.Утвержден;
		КнопкаОтменитьСогласование	= СписокКнопок.Кнопки.Добавить("ОтменитьСогласовваниеДокумента"			,ТипКнопкиКоманднойПанели.Действие	,"Отменить" 	,Новый Действие("ОтправитьНаСогласование"));
		КнопкаОтменитьСогласование.Картинка = БиблиотекаКартинок.Отклонен;	
		
		Документ									= ЭтаФорма.ДокументОбъект.Ссылка;
		СогласованиеНеЗакрыто						= Не РегистрыСведений.SM_СтатусСогласованияДокумента.СогласованиеЗакрыто(Документ);
		СогласованиеПоДанномуДокументуЗапущено		= РегистрыСведений.SM_СтатусСогласованияДокумента.СогласованиеПоДанномуДокументуЗапущено(Документ);
		СогласованиеПоДанномуДокументуНеЗапущено	= Не СогласованиеПоДанномуДокументуЗапущено;
		
		Если СогласованиеНеЗакрыто И СогласованиеПоДанномуДокументуЗапущено Тогда
			ОтобразитьСтатусНаКнопке(ЭтаФорма.ДокументОбъект.Ссылка,СписокКнопок);
		ИначеЕсли СогласованиеПоДанномуДокументуНеЗапущено Тогда
			СписокКнопок.Отображение = ОтображениеКнопкиКоманднойПанели.НадписьКартинка;
			СписокКнопок.Текст = "Отправить на согласование";
			СписокКнопок.Доступность = Истина;
			СписокКнопок.Картинка = БиблиотекаКартинок.Просмотр;
		Иначе
			СписокКнопок.Отображение = ОтображениеКнопкиКоманднойПанели.НадписьКартинка;
			СписокКнопок.Текст = "Статус: Документ согласован";
			//СписокКнопок.Доступность = Ложь;
			СписокКнопок.Картинка = БиблиотекаКартинок.Успешно;
			СписокКнопок.Кнопки.Очистить();
		КонецЕсли;
	Иначе  
		СписокКнопок = ПоискЭлементаДействияФормы.Кнопки.Добавить("СписокКнопокСогласования"	,ТипКнопкиКоманднойПанели.Действие	,"Согласование документов",Новый Действие("ОтправитьНаСогласование"));
		СписокКнопок = ПоискЭлементаДействияФормы.Кнопки.Добавить("ИсторияСогласования"	,ТипКнопкиКоманднойПанели.Действие	,"Открыть историю согласования",Новый Действие("ПоказатьИсториюСогласования"));
	КонецЕсли;
КонецПроцедуры  
//Клиент
Процедура ОтобразитьСтатусНаКнопке(ДокументОбъект,Кнопка) Экспорт
	ПроцедурыФункцииСогласованияСервер = SM_ПроцедурыФункцииСогласованияСервер;
	ТекстКнопки = "Отправить на согласование ";
	Кнопка.Отображение = ОтображениеКнопкиКоманднойПанели.НадписьКартинка;
	
	Таймер = ТекущаяДата() + 8;
	
	Пока ТекущаяДата() <> Таймер Цикл		
	КонецЦикла;
	
	Попытка 
		УникальныйИдентификатор = ДокументОбъект.Ссылка.УникальныйИдентификатор(); 
		JSON = ПроцедурыФункцииСогласованияСервер.СформироватьJSONУникальныйИдентификатор(УникальныйИдентификатор);
		СтатусСогласования = ПроцедурыФункцииСогласованияСервер.ОтправитьЗапросВДокументооборот("GetStatus",JSON,Истина); 
	Исключение  
		Кнопка.Текст = ТекстКнопки;  
		ПоказатьОповещение("Не удалось получить статус,попробуйте позже.");
		Возврат;
	КонецПопытки;
	
	Если СтатусСогласования = "Положительно" Тогда
		Кнопка.Текст = "Статус: Документ согласован";
		Кнопка.Доступность = Ложь;
		Кнопка.Картинка = БиблиотекаКартинок.Успешно; 
		Если Не РегистрыСведений.SM_СтатусСогласованияДокумента.СогласованиеЗакрыто(ДокументОбъект.Ссылка) Тогда 
			ПроцедурыФункцииСогласованияСервер.ЗаполнитьРезультатыСогласования(УникальныйИдентификатор,ДокументОбъект.Ссылка)
		КонецЕсли;
	ИначеЕсли СтатусСогласования = "ПоложительноСЗамечаниями" Тогда 
		Кнопка.Текст = "Статус: Документ согласован";
		Кнопка.Доступность = Ложь; 
		Кнопка.Картинка = БиблиотекаКартинок.Успешно;
		Если Не РегистрыСведений.SM_СтатусСогласованияДокумента.СогласованиеЗакрыто(ДокументОбъект.Ссылка) Тогда 
			ПроцедурыФункцииСогласованияСервер.ЗаполнитьРезультатыСогласования(УникальныйИдентификатор,ДокументОбъект.Ссылка)
		КонецЕсли;
	ИначеЕсли СтатусСогласования = "НеСогласовано" Тогда
		Кнопка.Текст = ТекстКнопки + "| Статус: Не согласован. Исправьте документ и отправьте на повторное согласование";
		Кнопка.Картинка = БиблиотекаКартинок.Перечитать;
	ИначеЕсли СтатусСогласования = "ОжиданиеСогласования" Тогда
		Кнопка.Текст = "Документ отправлен | Статус: Ожидает согласования";
	ИначеЕсли СтатусСогласования = "Прерван" Тогда 
		Кнопка.Текст = "Согласвание прервано | Статус: Перезапустите согласование";
	Иначе
		Кнопка.Картинка = БиблиотекаКартинок.Просмотр;
		Кнопка.Текст = ТекстКнопки ; 
	КонецЕсли;
КонецПроцедуры
//Клиент
Процедура ПоказатьОповещение(Текст) Экспорт
	ПоказатьПредупреждение(,Текст,5); 
КонецПроцедуры

Процедура ПолучитьПоследнийСтатусПоДокументу(Документ)
	
	//{{КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	SM_СтатусСогласованияДокументаСрезПоследних.Статус КАК Статус
		|ИЗ
		|	РегистрСведений.SM_СтатусСогласованияДокумента.СрезПоследних КАК SM_СтатусСогласованияДокументаСрезПоследних
		|ГДЕ
		|	SM_СтатусСогласованияДокументаСрезПоследних.Документ = &Документ";
	
	Запрос.УстановитьПараметр("Документ", Документ);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		// Вставить обработку выборки ВыборкаДетальныеЗаписи
	КонецЦикла;
	
	//}}КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
	
	
КонецПроцедуры


//АА5
Процедура ЗапуститьСогласование(Ссылка) Экспорт
	Согласующие = ПолучитьСогласующих();
	
	Если Согласующие.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	НачатьТранзакцию();
	Попытка	
		Параметры = РегистрыСведений.SM_СогласованиеДокументов.ПолучитьПараметры(Ссылка);
		РегистрыСведений.SM_СогласованиеДокументов.ЗаполнитьПараметрыПоУмолчанию(Параметры);
		
		ТекущееСогласование = РегистрыСведений.SM_СогласованиеДокументов.ПолучитьТекущееСогласование(Параметры);
		
		Если Не ЗначениеЗаполнено(ТекущееСогласование.УникальныйИдентификатор) Тогда
			ЗапуститьНовоеСогласование(Параметры, Согласующие);
		Иначе
			ОбработатьСуществующееСогласование(ТекущееСогласование, Параметры, Согласующие);
		КонецЕсли;
		ЗафиксироватьТранзакцию();
	Исключение 
		ОтменитьТранзакцию();
	КонецПопытки;
КонецПроцедуры

Процедура ЗапуститьНовоеСогласование(Параметры, Согласующие)
	ЗапуститьСогласованиеПоТекущемуДокументу(Параметры, Согласующие);
	ПоказатьОповещение("Согласование запущено.");
КонецПроцедуры

Процедура ОбработатьСуществующееСогласование(ТекущееСогласование, Параметры, Согласующие)
	Статус = ТекущееСогласование.ТекущийСтатус;
	
	Если Не ЗначениеЗаполнено(Статус) Тогда
		Возврат;
	КонецЕсли;
	
	Если Статус = Перечисления.SM_СтатусыСогласования.ВПроцессе Тогда
		ОбработатьАктивноеСогласование(ТекущееСогласование, Параметры, Согласующие);
	ИначеЕсли Статус = Перечисления.SM_СтатусыСогласования.Отменен Тогда
		ПредложитьПерезапуск("Согласование по данному документу было прервано. Перезапустить?", 
		                     ТекущееСогласование, Параметры, Согласующие);
	ИначеЕсли Статус = Перечисления.SM_СтатусыСогласования.Согласован Тогда
		ПоказатьОповещение("Документ согласован");
	ИначеЕсли Статус = Перечисления.SM_СтатусыСогласования.НеСогласован Тогда
		ПоказатьОповещение("Документ не согласован. Обратитесь к администратору.");
	КонецЕсли;
КонецПроцедуры

Процедура ОбработатьАктивноеСогласование(ТекущееСогласование, Параметры, Согласующие)
	ТекущийЭтап = РегистрыСведений.SM_ЭтапСогласования.ПолучитьТекущийЭтап(ТекущееСогласование.УникальныйИдентификатор);
	
	Если Не ТекущийЭтап.ЭтапЗавершен Тогда                                                                      
		ТекстСообщения = "По данному документу согласование уже запущено и есть активный этап";
		ПолучитьТекущиеАктивныеЗаписи = РегистрыСведений.SM_СогласующиеЭтап.ПолучитьАктивныеЗаписи(ТекущийЭтап);
		Для Каждого Строка Из ПолучитьТекущиеАктивныеЗаписи Цикл
			ТекстСообщения = ТекстСообщения + Символы.ПС + СтрШаблон("%1) %2. Ожидаем ответа от данного пользователя.",ПолучитьТекущиеАктивныеЗаписи.Индекс(Строка) + 1,Строка.Согласующий);
		КонецЦикла;
		ПоказатьОповещение(ТекстСообщения);
		Возврат;
	КонецЕсли;
	
	Если ТекущийЭтап.ТекущийСтатус = Перечисления.SM_СтатусыСогласования.НеСогласован Тогда
		ПоказатьПричиныНесогласованияИПредложитьПерезапуск(ТекущийЭтап, ТекущееСогласование, Параметры, Согласующие);
	КонецЕсли;
КонецПроцедуры

Функция СформироватьТекстПричинНесогласования(ОтветыСогласующих)
	Текст = "Текущий этап был не согласован, так как:";
	
	Для Каждого Строка Из ОтветыСогласующих Цикл
		Если Строка.Ответ = Перечисления.SM_СтатусыСогласования.НеСогласован Тогда
			Причина = ?(ЗначениеЗаполнено(Строка.Причина), Строка.Причина, "Причина не указана");
			Текст = Текст + Символы.ПС + 
			        СтрШаблон("Согласующий <%1> дал ответ <%2> по причине: %3", 
			                 Строка.Согласующий, Строка.Ответ, Причина);
		КонецЕсли;
	КонецЦикла;
	
	Текст = Текст + Символы.ПС + "Запустить новый этап согласования?";
	
	Возврат Текст;
КонецФункции

Процедура ПоказатьПричиныНесогласованияИПредложитьПерезапуск(ТекущийЭтап, ТекущееСогласование, Параметры, Согласующие)
	ОтветыСогласующих = РегистрыСведений.SM_СогласующиеЭтап.ПолучитьОтветыСогласующих(ТекущийЭтап);
	ТекстВопроса = СформироватьТекстПричинНесогласования(ОтветыСогласующих);
	
	ПредложитьПерезапуск(ТекстВопроса, ТекущееСогласование, Параметры, Согласующие);
КонецПроцедуры

Процедура ПредложитьПерезапуск(ТекстВопроса, ТекущееСогласование, Параметры, Согласующие)
	Ответ = Вопрос(ТекстВопроса, РежимДиалогаВопрос.ДаНет);
	
	Если Ответ = КодВозвратаДиалога.Да Тогда
		ПерезапуститьСогласование(ТекущееСогласование, Параметры, Согласующие);
		ПоказатьОповещение("Согласование перезапущено");
	Иначе
		ПоказатьОповещение("Согласование не перезапущено");
	КонецЕсли;
КонецПроцедуры

Процедура ЗапуститьСогласованиеПоТекущемуДокументу(ПараметрыДляЗапускаСогласования, Согласующие)
	SM_СогласованиеДокументов	= РегистрыСведений.SM_СогласованиеДокументов;
	SM_ЭтапСогласования			= РегистрыСведений.SM_ЭтапСогласования;
	SM_СогласующиеЭтап			= РегистрыСведений.SM_СогласующиеЭтап;
	
	SM_СогласованиеДокументов.ДобавитьЗапись(ПараметрыДляЗапускаСогласования); 
	
	// Запуск первого этапа
	ПараметрыДляЗапускаЭтапа = SM_ЭтапСогласования.ПолучитьПараметры();
	SM_ЭтапСогласования.ЗаполнитьПараметрыПоУмолчанию(ПараметрыДляЗапускаСогласования, ПараметрыДляЗапускаЭтапа);
	SM_ЭтапСогласования.ДобавитьЗапись(ПараметрыДляЗапускаЭтапа);
	
	// Запуск согласующих 
	ПараметрыЗапускаСогласующих = SM_СогласующиеЭтап.ПолучитьПараметры();
	SM_СогласующиеЭтап.ЗаполнитьПараметрыПоУмолчанию(ПараметрыЗапускаСогласующих);
	ЗаполнитьЗначенияСвойств(ПараметрыЗапускаСогласующих, ПараметрыДляЗапускаЭтапа, "УникальныйИдентификатор,НомерЭтапа");
	
	Если Не ЕстьАктивныеСогласующиеПоТекущемуЭтапу(ПараметрыЗапускаСогласующих) Тогда
		Для Каждого Строка Из Согласующие Цикл                             
			ПараметрыЗапускаСогласующих.Согласующий = Строка.Значение;
			SM_СогласующиеЭтап.ДобавитьЗапись(ПараметрыЗапускаСогласующих);
		КонецЦикла
	КонецЕсли;
КонецПроцедуры

Процедура ПерезапуститьСогласование(ТекущееСогласование, ПараметрыДляЗапускаСогласования, Согласующие)
	SM_СогласованиеДокументов	= РегистрыСведений.SM_СогласованиеДокументов;
	SM_ЭтапСогласования			= РегистрыСведений.SM_ЭтапСогласования;
	SM_СогласующиеЭтап			= РегистрыСведений.SM_СогласующиеЭтап;
	
	УникальныйИдентификатор = ТекущееСогласование.УникальныйИдентификатор;
	НомерЭтапа = SM_ЭтапСогласования.ПолучитьНомерТекущегоЭтапа(УникальныйИдентификатор);
	ПараметрыДляЗапускаЭтапа = SM_ЭтапСогласования.ПолучитьПараметры();
	SM_ЭтапСогласования.ЗаполнитьПараметрыПоУмолчанию(ПараметрыДляЗапускаСогласования, ПараметрыДляЗапускаЭтапа);
	ПараметрыДляЗапускаЭтапа.НомерЭтапа = НомерЭтапа + 1;
	SM_ЭтапСогласования.ДобавитьЗапись(ПараметрыДляЗапускаЭтапа);
	
	ПараметрыЗапускаСогласующих = SM_СогласующиеЭтап.ПолучитьПараметры();
	SM_СогласующиеЭтап.ЗаполнитьПараметрыПоУмолчанию(ПараметрыЗапускаСогласующих);
	ЗаполнитьЗначенияСвойств(ПараметрыЗапускаСогласующих, ПараметрыДляЗапускаЭтапа, "УникальныйИдентификатор,НомерЭтапа");
	
	Если Не ЕстьАктивныеСогласующиеПоТекущемуЭтапу(ПараметрыЗапускаСогласующих) Тогда
		Для Каждого Строка Из Согласующие Цикл                             
			ПараметрыЗапускаСогласующих.Согласующий = Строка.Значение;
			SM_СогласующиеЭтап.ДобавитьЗапись(ПараметрыЗапускаСогласующих);
		КонецЦикла
	КонецЕсли;
КонецПроцедуры

Функция ПолучитьСогласующих()
	ПроцедурыФункцииСогласованияСервер = SM_ПроцедурыФункцииСогласованияСервер;
	
	Параметры			= Новый Структура;
	Сотрудник			= ПараметрыСеанса.Пользователь.Сотрудник;
	НаборСотрудников	= ПроцедурыФункцииСогласованияСервер.ПоискРуководителяСогласоватора(Сотрудник);
	Руководитель        = НаборСотрудников.Руководитель;
	
	ИтоговыйСогласовательСсылка = Справочники.Сотрудники.ПустаяСсылка();
	ИтоговыйСогласователь		= НаборСотрудников.ИтоговыйСогласователь;
	Если ЗначениеЗаполнено(ИтоговыйСогласователь) Тогда            
		ИтоговыйСогласовательСсылка = ИтоговыйСогласователь;
	КонецЕсли;
	
	Если Руководитель <> Неопределено Тогда
		Параметры.Вставить("Руководитель",Руководитель);
		Если ЗначениеЗаполнено(ИтоговыйСогласовательСсылка) Тогда
			Параметры.Вставить("ИтоговыйСогласующий",ИтоговыйСогласовательСсылка);
		КонецЕсли; 
		Возврат Параметры;
	Иначе 
		Сообщить("Отказано в доступе");
		Возврат Параметры;
	КонецЕсли;
КонецФункции

Функция ЕстьАктивныеСогласующиеПоТекущемуЭтапу(Параметры)
	ЕстьАктивныйЭтап					= РегистрыСведений.SM_ЭтапСогласования.ЕстьАктивныйЭтап(Параметры.УникальныйИдентификатор);
	ЕстьАктивныеЗаписиПоТекущемуЭтапу	= РегистрыСведений.SM_СогласующиеЭтап.ЕстьАктивныеЗаписиПоТекущемуЭтапу(Параметры); 
	Возврат ЕстьАктивныйЭтап И ЕстьАктивныеЗаписиПоТекущемуЭтапу;
КонецФункции

Процедура ОтменитьСогласованиеПоТекущемуДокументу(ДокументСсылка,Причина = "") Экспорт	
	МенеджерSM_СогласованиеДокументов	= РегистрыСведений.SM_СогласованиеДокументов;
	МенеджерSM_ЭтапСогласования			= РегистрыСведений.SM_ЭтапСогласования;
	МенеджерSM_СогласующиеЭтап			= РегистрыСведений.SM_СогласующиеЭтап;
	
	СтатустОтменен 						= Перечисления.SM_СтатусыСогласования.Отменен;
	
	ПараметрыСогласования = МенеджерSM_СогласованиеДокументов.ПолучитьПараметры(ДокументСсылка);
	МенеджерSM_СогласованиеДокументов.ЗаполнитьПараметрыПоУмолчанию(ПараметрыСогласования);
	
	Если Не МенеджерSM_СогласованиеДокументов.СогласованиеЗапущенно(ПараметрыСогласования) Тогда
		Возврат;
	КонецЕсли;    
	
	ПараметрыСогласования.ТекущийСтатус = СтатустОтменен;
	МенеджерSM_СогласованиеДокументов.ИзменитьЗапись(ПараметрыСогласования);
	
	УникальныйИдентификатор = ПараметрыСогласования.УникальныйИдентификатор; 
	
	ТекущийЭтап					= РегистрыСведений.SM_ЭтапСогласования.ПолучитьТекущийЭтап(УникальныйИдентификатор);
	ТекущийЭтап.ТекущийСтатус	= СтатустОтменен;
	ТекущийЭтап.ЭтапЗавершен	= Истина;
	ТекущийЭтап.ДатаЗавершения  = ТекущаяДата();
	
	МенеджерSM_ЭтапСогласования.ИзменитьЗапись(ТекущийЭтап);
	
	ВсеСогласующие = МенеджерSM_СогласующиеЭтап.ПолучитьВсехСогласующихПоТекущемуЭтапу(ТекущийЭтап); 
	
	Для Каждого Строка Из ВсеСогласующие Цикл
		Строка.Ответ		= СтатустОтменен;
		Строка.ДатаОтвета	= ТекущаяДата();
		Строка.Причина		= Причина;
		МенеджерSM_СогласующиеЭтап.ИзменитьЗапись(Строка);	
	КонецЦикла;	
КонецПроцедуры

