
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если НЕ ЗначениеЗаполнено(Объект.Ссылка) Тогда
		
		ЗаполнитьЗначенияСвойств(Объект, Параметры);
		Если Параметры.Свойство("ВыбранныеНебазовыеОпции") Тогда
			Для Каждого Опция Из Параметры.ВыбранныеНебазовыеОпции Цикл
				Если Опция.Выбран Тогда
					СтрОпция = Объект.Опции.Добавить();
					ЗаполнитьЗначенияСвойств(СтрОпция, Опция);
				КонецЕсли;
			КонецЦикла
		КонецЕсли;
		
		Если Параметры.Свойство("ВыбранноеОборудование") Тогда
			Для Каждого Оборудование Из Параметры.ВыбранноеОборудование Цикл
				СтрОборудование = Объект.Оборудование.Добавить();
				ЗаполнитьЗначенияСвойств(СтрОборудование, Оборудование);
			КонецЦикла
		КонецЕсли;
		
		Если Параметры.Свойство("ВыбранныеАксессуары") Тогда
			Для Каждого Аксессуар Из Параметры.ВыбранныеАксессуары Цикл
				СтрАксессуар = Объект.Аксессуары.Добавить();
				ЗаполнитьЗначенияСвойств(СтрАксессуар, Аксессуар);
			КонецЦикла
		КонецЕсли;
		
		Если Параметры.Свойство("ВыбранныеАвтоработы") Тогда
			Для Каждого Авторабота Из Параметры.ВыбранныеАвтоработы Цикл
				СтрАвторабота = Объект.Автоработы.Добавить();
				ЗаполнитьЗначенияСвойств(СтрАвторабота, Авторабота);
			КонецЦикла
		КонецЕсли;
		
		Объект.Менеджер = ПараметрыСеанса.Пользователь;
		
		Объект.Наименование = Строка(Объект.Модель);
		Если ЗначениеЗаполнено(Объект.Версия) Тогда
			Объект.Наименование = Объект.Наименование + " " + Строка(Объект.Версия);
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры
