//Бондаренко++ 20200603
Процедура АвтоРуЗагрузкаСправочников(Параметры = Неопределено)  Экспорт
 	
 Обработки.СкопироватьФайл_CARS_XML_сСайта_AUTO_RU_ИЗагрузитьСправочники.Создать().АвтоРуЗагрузкаСправочниковМодуль();
	
КонецПроцедуры
//Бондаренко-- 20200603

//Бондаренко++ 20200605
Процедура АвитоЗагрузкаСправочников(Параметры = Неопределено)  Экспорт
 	
 Обработки.СкопироватьФайл_AUTOCATALOG_XML_сСайта_AVITO_RU_ИЗагрузитьСправочники.Создать().АвитоЗагрузкаСправочниковМодуль();
 Обработки.СкопироватьФайл_PartsBrands_xml_сСайта_AVITO_RU_ИЗагрузитьСправочники.Создать().АвитоЗагрузкаСправочниковМодуль();
	
КонецПроцедуры
//Бондаренко-- 20200605

//Бондаренко++ 20200622
Процедура АвтоРуКоммерцияЗагрузкаСправочников(Параметры = Неопределено)  Экспорт
 	
 Обработки.СкопироватьФайл_TRUCKS_XML_сСайта_AUTO_RU_ИЗагрузитьСправочники.Создать().АвтоРуЗагрузкаСправочниковКоммерцияМодуль();
	
КонецПроцедуры
//Бондаренко-- 20200622

 //Бондаренко++ 20180109
Процедура ЗагрузитьРЛизОбъявлений(Параметры = Неопределено)  Экспорт
 
	 Обработки.СформироватьРабочиеЛистыHTTP.Создать().АвтоФормированиеРЛмодуль();	
 	
КонецПроцедуры
//Бондаренко-- 20180109

 Процедура ОбменСсайтомУдалитьАвто (Пармаетры = Неопределено) Экспорт 
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПродажиАвтомобилей.Автомобиль
		|ИЗ
		|	РегистрНакопления.ПродажиАвтомобилей КАК ПродажиАвтомобилей
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.Автомобили.СрезПоследних(&ДатаОкончания, ) КАК АвтомобилиСрезПоследних
		|		ПО ПродажиАвтомобилей.Автомобиль = АвтомобилиСрезПоследних.Автомобиль
		|ГДЕ
		|	АвтомобилиСрезПоследних.Значение = &Значение
		|	И ПродажиАвтомобилей.Период МЕЖДУ &ДатаНачала И &ДатаОкончания";
	
	Запрос.УстановитьПараметр("ДатаНачала", НачалоДня(ТекущаяДата())-60*60*24*14);
	Запрос.УстановитьПараметр("ДатаОкончания", КонецДня(НачалоДня(ТекущаяДата())-60*60*24*14));
	Запрос.УстановитьПараметр("Значение", Перечисления.ВидАвтомобиля.АвтомобильСПробегом);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Ошибка = "";
		ОбщиеСервер.УдалитьАвтоСайта(ВыборкаДетальныеЗаписи.Автомобиль,Ошибка)
	КонецЦикла;
	
	
КонецПроцедуры	

//Дынников 09.03.2020 ++
Процедура ВыгрузкаВАвтотеку(Параметры = Неопределено) Экспорт

	ОбработкаВыгрузки = Обработки.ВыгрузкаВАвтотеку.Создать();
	ОбработкаВыгрузки.ВыполнитьОбработку();
	ОбработкаВыгрузки.ВыполнитьОбработку(Истина);
	
КонецПроцедуры //Дынников 09.03.2020 --

//Бондаренко++ 20220616
Процедура ДромЗагрузкаСправочников(Параметры = Неопределено)  Экспорт
 	
 Обработки.СМ_СкопироватьФайл_REF_XML_сСайта_DROM_RU_ИЗагрузитьСправочники.Создать().ДромЗагрузкаСправочниковМодуль();
	
КонецПроцедуры
//Бондаренко-- 20220616 

//Бондаренко++ 20200605
Процедура АвитоКоммерческийЗагрузкаСправочников(Параметры = Неопределено)  Экспорт
 	
 Обработки.СМ_СкопироватьФайл_LCV_XML_сСайта_AVITO_RU_ИЗагрузитьСправочники.Создать().АвитоКоммерческийЗагрузкаСправочниковМодуль();
	
КонецПроцедуры
//Бондаренко-- 20200605

//Бондаренко++ 20230711
Процедура ЛегоКарВыгрузитьАвтомобилиНаСайт(Параметры = Неопределено)  Экспорт
 	
 Обработки.СМ_ВыгрузитьАвтомобилиНаСайт_LEGOCAR_RU.Создать().ЛегоКарВыгрузкаАвтомобилейМодуль(); 
	
КонецПроцедуры
//Бондаренко-- 20230711

//Бондаренко++ 20221123
Процедура СоколМоторсВыгрузитьНовыеАвтомобилиНаСайт(Параметры = Неопределено)  Экспорт
 	
 Обработки.СМ_ВыгрузитьДляХарабыФайлыЭксЭмЭль.Создать().ВыгрузитьДляХарабоВЭксЭмЭльМодуль(); 
	
КонецПроцедуры //СоколМоторсВыгрузитьНовыеАвтомобилиНаСайт()
//Бондаренко-- 20231123


