
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("ДоговорПродажиАвтомобиля")
		И ЗначениеЗаполнено(Параметры.ДоговорПродажиАвтомобиля)Тогда
		ДоговорПродажиАвтомобиля = Параметры.ДоговорПродажиАвтомобиля;
	Иначе 
		Отказ = Истина;
		Возврат;
	КонецЕсли; 
	
	ЗаполнитьТаблицуПлатежей();
	
	УстановитьУсловноеОформление();
	
	Элементы.ТаблицаПлатежей.ОтборСтрок = Новый ФиксированнаяСтруктура(Новый Структура("ЕстьВнесенныйПлатеж",Ложь));
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьТаблицуПлатежей()

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ДоговорПродаж", ДоговорПродажиАвтомобиля);
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ДоговораПродажАвтомобиля.ДоговорВзаиморасчетов КАК ДоговорВзаиморасчетов,
		|	ВзаиморасчетыКомпании.Регистратор КАК ДокументПлатежа,
		|	ВзаиморасчетыКомпании.СуммаРасход КАК Сумма,
		|	ВзаиморасчетыКомпании.Регистратор.Дата КАК ДатаОплаты,
		|	ВЫБОР
		|		КОГДА ВзаиморасчетыКомпании.Регистратор ССЫЛКА Документ.Выписка
		|			ТОГДА ЗНАЧЕНИЕ(Перечисление.CRM_СпособыОплаты.БезналичнаяОплата)
		|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.CRM_СпособыОплаты.НаличнаяОплата)
		|	КОНЕЦ КАК СпособОплаты
		|ПОМЕСТИТЬ Платежи
		|ИЗ
		|	РегистрСведений.DMS_ДоговораПродажАвтомобиля.СрезПоследних КАК ДоговораПродажАвтомобиля
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.ВзаиморасчетыКомпании.Обороты(, , Регистратор, ) КАК ВзаиморасчетыКомпании
		|		ПО ДоговораПродажАвтомобиля.ДоговорВзаиморасчетов = ВзаиморасчетыКомпании.ДоговорВзаиморасчетов
		|			И (ВзаиморасчетыКомпании.СуммаРасход > 0)
		|			И (ВзаиморасчетыКомпании.Регистратор ССЫЛКА Документ.ПриходныйКассовыйОрдер
		|				ИЛИ ВзаиморасчетыКомпании.Регистратор ССЫЛКА Документ.Выписка
		|				ИЛИ ВзаиморасчетыКомпании.Регистратор ССЫЛКА Документ.КорректировкаДолга
		|				ИЛИ ВзаиморасчетыКомпании.Регистратор ССЫЛКА Документ.Взаимозачет)
		|ГДЕ
		|	ДоговораПродажАвтомобиля.Регистратор = &ДоговорПродаж
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	Платежи.ДоговорВзаиморасчетов КАК ДоговорВзаиморасчетов,
		|	Платежи.ДокументПлатежа КАК ДокументПлатежа,
		|	Платежи.Сумма КАК Сумма,
		|	Платежи.ДатаОплаты КАК Дата,
		|	ЕСТЬNULL(ОплатыАвтомобиляКлиентом.Регистратор, ЗНАЧЕНИЕ(Документ.Renault_ВнесениеОплатыПоДоговору.ПустаяСсылка)) КАК ВнесениеПлатежа,
		|	ЕСТЬNULL(ОплатыАвтомобиляКлиентом.СпособОплаты, Платежи.СпособОплаты) КАК СпособОплаты,
		|	ЗНАЧЕНИЕ(Перечисление.Renault_ВидыОплат.Договор) КАК ВидОплаты
		|ПОМЕСТИТЬ ТаблицаДанных
		|ИЗ
		|	Платежи КАК Платежи
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.Renault_ОплатыАвтомобиляКлиентом КАК ОплатыАвтомобиляКлиентом
		|		ПО (ОплатыАвтомобиляКлиентом.Договор = &ДоговорПродаж)
		|			И Платежи.ДокументПлатежа = ОплатыАвтомобиляКлиентом.Регистратор.DMS_ДокументОснование
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ЕСТЬNULL(ДоговораПродаж.ДоговорВзаиморасчетов, ЗНАЧЕНИЕ(Справочник.ДоговорыВзаиморасчетов.ПустаяСсылка)),
		|	НЕОПРЕДЕЛЕНО,
		|	ОплатыАвтомобиляКлиентом.Сумма,
		|	ОплатыАвтомобиляКлиентом.Дата,
		|	ЕСТЬNULL(ОплатыАвтомобиляКлиентом.Регистратор, ЗНАЧЕНИЕ(Документ.Renault_ВнесениеОплатыПоДоговору.ПустаяСсылка)),
		|	ОплатыАвтомобиляКлиентом.СпособОплаты,
		|	ЗНАЧЕНИЕ(Перечисление.Renault_ВидыОплат.Договор)
		|ИЗ
		|	РегистрСведений.Renault_ОплатыАвтомобиляКлиентом КАК ОплатыАвтомобиляКлиентом
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.DMS_ДоговораПродажАвтомобиля.СрезПоследних КАК ДоговораПродаж
		|		ПО ОплатыАвтомобиляКлиентом.Договор = ДоговораПродаж.Регистратор
		|ГДЕ
		|	ОплатыАвтомобиляКлиентом.Регистратор.DMS_ДокументОснование = НЕОПРЕДЕЛЕНО
		|	И ОплатыАвтомобиляКлиентом.Договор = &ДоговорПродаж
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ТаблицаДанных.ДоговорВзаиморасчетов КАК ДоговорВзаиморасчетов,
		|	ТаблицаДанных.ДокументПлатежа КАК ДокументПлатежа,
		|	ТаблицаДанных.Сумма,
		|	ТаблицаДанных.Дата КАК Дата,
		|	ТаблицаДанных.ВнесениеПлатежа,
		|	ТаблицаДанных.СпособОплаты,
		|	ТаблицаДанных.ВидОплаты,
		|	ВЫБОР
		|		КОГДА ТаблицаДанных.ВнесениеПлатежа = ЗНАЧЕНИЕ(Документ.Renault_ВнесениеОплатыПоДоговору.ПустаяСсылка)
		|			ТОГДА ЛОЖЬ
		|		ИНАЧЕ ИСТИНА
		|	КОНЕЦ КАК ЕстьВнесенныйПлатеж
		|ИЗ
		|	ТаблицаДанных КАК ТаблицаДанных
		|
		|УПОРЯДОЧИТЬ ПО
		|	Дата,
		|	ДоговорВзаиморасчетов,
		|	ДокументПлатежа
		|АВТОУПОРЯДОЧИВАНИЕ";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ТаблицаПлатежей.Загрузить(РезультатЗапроса.Выгрузить());
	
КонецПроцедуры // ЗаполнитьТаблицуПлатежей()

&НаКлиенте
Процедура ТаблицаПлатежейПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	Отказ = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаПлатежейПередУдалением(Элемент, Отказ)
	Отказ = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ВыбратьВсе(Команда)
	
	Для каждого ТекущаяСтрока Из ТаблицаПлатежей Цикл
		ТекущаяСтрока.Выбрать = Истина;
	КонецЦикла; 
	
КонецПроцедуры

&НаКлиенте
Процедура ОтменитьВсе(Команда)
	
	Для каждого ТекущаяСтрока Из ТаблицаПлатежей Цикл
		ТекущаяСтрока.Выбрать = Ложь;
	КонецЦикла; 
	
КонецПроцедуры

&НаКлиенте
Процедура Выбрать(Команда)
	
	Отказ = Ложь;
	
	Для каждого ТекущаяСтрока Из ТаблицаПлатежей Цикл
	
		Если ТекущаяСтрока.Выбрать Тогда
		
			Если Не ЗначениеЗаполнено(ТекущаяСтрока.ВидОплаты) Тогда
			
				Сообщить("Выберите вид оплаты",СтатусСообщения.ОченьВажное);
				
				Отказ = Истина;
				
			КонецЕсли; 
		
			Если Не ЗначениеЗаполнено(ТекущаяСтрока.СпособОплаты) Тогда
			
				Сообщить("Выберите способ оплаты",СтатусСообщения.ОченьВажное);
				
				Отказ = Истина;
				
			КонецЕсли; 
		
		КонецЕсли; 
	
	КонецЦикла; 
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли; 
	
	Адрес = ПоместитьВоВременноеХранилищеНаСервере();
	
	ОповеститьОВыборе(Адрес);
	
КонецПроцедуры

&НаСервере
Функция ПоместитьВоВременноеХранилищеНаСервере()
	
	ТаблицаВыбора = ТаблицаПлатежей.Выгрузить(Новый Структура("Выбрать",Истина));
	
	Возврат ПоместитьВоВременноеХранилище(ТаблицаВыбора,Новый УникальныйИдентификатор);
	
КонецФункции
    
&НаСервере
Процедура УстановитьУсловноеОформление()
	
	ЭтаФорма.УсловноеОформление.Элементы.Очистить();
	
	//
	
	Элемент = УсловноеОформление.Элементы.Добавить();
	
	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ТаблицаПлатежейВнесениеПлатежа.Имя);

	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ТаблицаПлатежей.ВнесениеПлатежа");
	ОтборЭлемента.ВидСравнения   = ВидСравненияКомпоновкиДанных.НеЗаполнено;
	
	Элемент.Оформление.УстановитьЗначениеПараметра("ЦветФона",   WebЦвета.Оранжевый);
	Элемент.Оформление.УстановитьЗначениеПараметра("ЦветТекста", ЦветаСтиля.DMS_ТекстЗапрещеннойЯчейкиЦвет);
	Элемент.Оформление.УстановитьЗначениеПараметра("Текст", 	 "Не сопоставлен");
	
	//
	
	Элемент = УсловноеОформление.Элементы.Добавить();
	
	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ТаблицаПлатежейВнесениеПлатежа.Имя);

	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ТаблицаПлатежей.ВнесениеПлатежа");
	ОтборЭлемента.ВидСравнения   = ВидСравненияКомпоновкиДанных.Заполнено;
	
	Элемент.Оформление.УстановитьЗначениеПараметра("ТолькоПросмотр", Истина);
	
	//
	
	Элемент = УсловноеОформление.Элементы.Добавить();
	
	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ТаблицаПлатежейСпособОплаты.Имя);

	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ТаблицаПлатежей.СпособОплаты");
	ОтборЭлемента.ВидСравнения   = ВидСравненияКомпоновкиДанных.НеЗаполнено;
	
	Элемент.Оформление.УстановитьЗначениеПараметра("ЦветТекста", 			WebЦвета.Красный);
	Элемент.Оформление.УстановитьЗначениеПараметра("Текст", 	 			"Укажите способ оплаты");
	Элемент.Оформление.УстановитьЗначениеПараметра("ОтметкаНезаполненного", Истина);
	
	//
	
	Элемент = УсловноеОформление.Элементы.Добавить();
	
	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ТаблицаПлатежейВидОплаты.Имя);

	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ТаблицаПлатежей.ВидОплаты");
	ОтборЭлемента.ВидСравнения   = ВидСравненияКомпоновкиДанных.НеЗаполнено;
	
	Элемент.Оформление.УстановитьЗначениеПараметра("ЦветТекста", 			WebЦвета.Красный);
	Элемент.Оформление.УстановитьЗначениеПараметра("Текст", 	 			"Укажите вид оплаты");
	Элемент.Оформление.УстановитьЗначениеПараметра("ОтметкаНезаполненного", Истина);
	
	//
	
	Элемент = УсловноеОформление.Элементы.Добавить();
	
	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ТаблицаПлатежейДокументПлатежа.Имя);

	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ТаблицаПлатежей.ДокументПлатежа");
	ОтборЭлемента.ВидСравнения   = ВидСравненияКомпоновкиДанных.НеЗаполнено;
	
	Элемент.Оформление.УстановитьЗначениеПараметра("ЦветФона",   WebЦвета.ЖелтоЗеленый);
	Элемент.Оформление.УстановитьЗначениеПараметра("ЦветТекста", ЦветаСтиля.DMS_ТекстЗапрещеннойЯчейкиЦвет);
	Элемент.Оформление.УстановитьЗначениеПараметра("Текст", 	 "Внесен вручную");

КонецПроцедуры // УстановитьУсловноеОформление() 

&НаКлиенте
Процедура ПоказатьВсе(Команда)
	
	Элементы.ТаблицаПлатежейПоказатьВсе.Пометка = Не Элементы.ТаблицаПлатежейПоказатьВсе.Пометка;
	
	Если Элементы.ТаблицаПлатежейПоказатьВсе.Пометка Тогда
		Элементы.ТаблицаПлатежей.ОтборСтрок = Неопределено;
		Элементы.ТаблицаПлатежейПоказатьВсе.Заголовок = "Показать не внесенные платежи";
		УстановитьКартинкуПоказатьВсе(Истина);
	Иначе 
		Элементы.ТаблицаПлатежей.ОтборСтрок = Новый ФиксированнаяСтруктура(Новый Структура("ЕстьВнесенныйПлатеж",Ложь));
		Элементы.ТаблицаПлатежейПоказатьВсе.Заголовок = "Показать все платежи";
		УстановитьКартинкуПоказатьВсе(Ложь);
	КонецЕсли; 
	
КонецПроцедуры

&НаСервере
Процедура УстановитьКартинкуПоказатьВсе(ВсеПлатежи = Ложь)
	
	Если ВсеПлатежи Тогда
		Элементы.ТаблицаПлатежейПоказатьВсе.Картинка = БиблиотекаКартинок.ОтборИСортировка;
	Иначе 
		Элементы.ТаблицаПлатежейПоказатьВсе.Картинка = БиблиотекаКартинок.ОтключитьОтбор;
	КонецЕсли; 
	
КонецПроцедуры // УстановитьКартинкуПоказатьВсе()


 