Процедура УстановитьПараметры()
	
	ПериодОтчета = КомпоновщикНастроек.Настройки.ПараметрыДанных.Элементы.Найти("ПериодОтчета");
	ДатаН = КомпоновщикНастроек.Настройки.ПараметрыДанных.Элементы.Найти("ДатаН");
	ДатаК = КомпоновщикНастроек.Настройки.ПараметрыДанных.Элементы.Найти("ДатаК");
	
	ПериодОтчета.Значение.ДатаНачала    = НачалоДня(Дата(2001,1,1,0,0,0));
	//ПериодОтчета.Значение.ДатаНачала    = НачалоДня(ДобавитьМесяц(ТекущаяДата(),-240));
	ПериодОтчета.Значение.ДатаОкончания = НачалоДня(ДобавитьМесяц(ТекущаяДата(),-12));
	ДатаН.Значение = ПериодОтчета.Значение.ДатаНачала;
	ДатаК.Значение = ПериодОтчета.Значение.ДатаОкончания;
	
	Если Не ПериодОтчета = Неопределено Тогда
		Если обЗначениеНеЗаполнено(ПериодОтчета.Значение) Тогда
			//ПериодОтчета.Значение.ДатаНачала    = НачалоДня(ДобавитьМесяц(ТекущаяДата(),-120));
			//ПериодОтчета.Значение.ДатаОкончания = НачалоДня(ДобавитьМесяц(ТекущаяДата(),-12));
			//ДатаН.Значение = ПериодОтчета.Значение.ДатаНачала;
			//ДатаК.Значение = ПериодОтчета.Значение.ДатаОкончания;			
  		КонецЕсли;
 	КонецЕсли;
   	
КонецПроцедуры

 
Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка) Экспорт
	
	УстановитьПараметры();
	
 	ОтчетыСервер.ВывестиОтчет(ЭтотОбъект, СхемаКомпоновкиДанных, КомпоновщикНастроек.Настройки, ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка);
	
КонецПроцедуры

 