
Функция ШаблонСотрудникиПолучитьСписок(Запрос)
	ЗаголовкиHTTP = Новый Соответствие;
	//ЗаголовкиHTTP.Вставить("Content-Type", "application/json; charset=utf-8");
	ЗаголовкиHTTP.Вставить("Content-Type", "text/html; charset=utf-8");
	//ЗаголовкиHTTP.Вставить("Accept", "application/json");
	ЗаголовкиHTTP.Вставить("Connection", "Keep-Alive");
	Ответ = Новый HTTPСервисОтвет(200,, ЗаголовкиHTTP);
	стТелоОтвета = Новый Структура;
	
	ЗапросСотрудники = Новый Запрос();
	//ЗапросСотрудники.Параметры.Вставить("ТекущаяДата", Дата(2018, 5, 31)); // для отладки
	ЗапросСотрудники.Параметры.Вставить("ТекущаяДата", НачалоДня(ТекущаяДата()));
	ЗапросСотрудники.Текст = "ВЫБРАТЬ
	                         |	Сотрудники.Ссылка КАК Сотрудник,
	                         |	Сотрудники.РабочийТелефон,
	                         |	РегистрацияВремениСотрудникаСрезПоследних.Продолжительность КАК Продолжительность
	                         |ПОМЕСТИТЬ СотрудникиСТелефонами
	                         |ИЗ
	                         |	Справочник.Сотрудники КАК Сотрудники
	                         |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РегистрацияВремениСотрудника.СрезПоследних(, Период > &ТекущаяДата) КАК РегистрацияВремениСотрудникаСрезПоследних
	                         |		ПО Сотрудники.Ссылка = РегистрацияВремениСотрудникаСрезПоследних.Сотрудник
	                         |ГДЕ
	                         |	Сотрудники.РабочийТелефон > 0
	                         |	И НЕ Сотрудники.ФлагУволен
	                         |;
	                         |
	                         |////////////////////////////////////////////////////////////////////////////////
	                         |ВЫБРАТЬ
	                         |	СотрудникиСТелефонами.Сотрудник,
	                         |	СотрудникиСТелефонами.РабочийТелефон,
	                         |	ВЫБОР
	                         |		КОГДА СотрудникиСТелефонами.Продолжительность ЕСТЬ NULL
	                         |			ТОГДА ЛОЖЬ
	                         |		ИНАЧЕ ВЫБОР
	                         |				КОГДА СотрудникиСТелефонами.Продолжительность > 0
	                         |					ТОГДА ЛОЖЬ
	                         |				ИНАЧЕ ИСТИНА
	                         |			КОНЕЦ
	                         |	КОНЕЦ КАК НаРабочемМесте
	                         |ИЗ
	                         |	СотрудникиСТелефонами КАК СотрудникиСТелефонами";
	
	РезультатСотрудники = ЗапросСотрудники.Выполнить().Выбрать();
	МассивСотрудников = Новый Массив();
	Пока РезультатСотрудники.Следующий() Цикл
		стСотрудник = Новый Структура();
		стСотрудник.Вставить("Сотрудник", Строка(РезультатСотрудники.Сотрудник));
		стСотрудник.Вставить("РабочийТелефон", Формат(РезультатСотрудники.РабочийТелефон, "ЧГ=0"));
		стСотрудник.Вставить("НаРабочемМесте", РезультатСотрудники.НаРабочемМесте);
		МассивСотрудников.Добавить(стСотрудник);
	КонецЦикла;
	стТелоОтвета.Вставить("СписокСотрудников", МассивСотрудников);
	
	//////////////////////////////////////////
	ЗаписьJSON = Новый ЗаписьJSON();
	ЗаписьJSON.УстановитьСтроку();
	ЗаписатьJSON(ЗаписьJSON, стТелоОтвета);		
	Ответ.УстановитьТелоИзСтроки(ЗаписьJSON.Закрыть(), "UTF-8", ИспользованиеByteOrderMark.НеИспользовать);
	Возврат Ответ;
КонецФункции
