//Бондаренко++ 20231014
Функция ПолучитьСписокВидовРемонта(ТекОбъект) Экспорт
	
	ИтСпВидовРемонта = Новый СписокЗначений;
	
	ИтСпВидовРемонта.ЗагрузитьЗначения(ТекОбъект.ВидыРемонта.Выгрузить().ВыгрузитьКолонку("ВидРемонта"));
	
	Возврат ИтСпВидовРемонта;
 	
КонецФункции // ПолучитьСписокВидовРемонта(ТекОбъект)

//Бондаренко++ 20241005
Функция НайтиЭлементСправочникаСМ_ЧериЭксид_Настройки(Марка,ПодразделениеКомпании) Экспорт
	
	Ссылка_ = "";
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СМ_ЧериЭксид_НастройкиПодразделения.Ссылка.Ссылка КАК Ссылка,
		|	СМ_ЧериЭксид_НастройкиПодразделения.Ссылка.Марка КАК Марка,
		|	СМ_ЧериЭксид_НастройкиПодразделения.ПодразделениеКомпании КАК ПодразделениеКомпании
		|ИЗ
		|	Справочник.СМ_ЧериЭксид_Настройки.Подразделения КАК СМ_ЧериЭксид_НастройкиПодразделения
		|ГДЕ
		|	СМ_ЧериЭксид_НастройкиПодразделения.Ссылка.Марка = &Марка
		|	И СМ_ЧериЭксид_НастройкиПодразделения.ПодразделениеКомпании = &ПодразделениеКомпании";
	
	Запрос.УстановитьПараметр("Марка", Марка);
	Запрос.УстановитьПараметр("ПодразделениеКомпании", ПодразделениеКомпании);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Ссылка_ = ВыборкаДетальныеЗаписи.Ссылка;
	КонецЦикла;
	
	Возврат Ссылка_;
	
КонецФункции // НайтиЭлементСправочникаСМ_ЧериЭксид_Настройки()
//Бондаренко-- 20241005

Процедура ИнтерактивнаяПроверкаСВыгрузкойУниверсальная(Ссылка) Экспорт
	Если Ссылка <> Неопределено Тогда
		Если ТипЗНЧ(Ссылка) = Тип("ДокументСсылка.ЗаказНаряд") Тогда
			ЭлСпрНастроек = Неопределено;
			//Бондаренко++ 20241005
			//Попытка
			//	ЭлСпрНастроек = Справочники.СМ_ЧериЭксид_Настройки.НайтиПоРеквизиту("Марка",Ссылка.Автомобиль.Модель.Марка);
			//Исключение
			//КонецПопытки;
			Попытка
				ЭлСпрНастроек = НайтиЭлементСправочникаСМ_ЧериЭксид_Настройки(Ссылка.Автомобиль.Модель.Марка,Ссылка.ПодразделениеКомпании);
			Исключение
			КонецПопытки;
			//Бондаренко-- 20241005
			
			//Бондаренко-- 20250521
			//Если ЭлСпрНастроек <> Неопределено Тогда
			Если ЭлСпрНастроек <> "" Тогда	
			//Бондаренко-- 20250521	
				
				Если Ссылка.Организация = ЭлСпрНастроек.Дилер Тогда
					Если Ссылка.Состояние = Справочники.ВидыСостоянийЗаказНарядов.Выполнен ИЛИ Ссылка.Состояние = Справочники.ВидыСостоянийЗаказНарядов.Закрыт Тогда
 						СписокВидовРемонта = Новый СписокЗначений;
  						Если ЭлСпрНастроек.ВидыРемонта.Количество() > 0 Тогда
							СписокВидовРемонта = ПолучитьСписокВидовРемонта(ЭлСпрНастроек);
						КонецЕсли;
						Если СписокВидовРемонта.НайтиПоЗначению(Ссылка.ВидРемонта) <> Неопределено Тогда
 							Если Ссылка.Пробег > 0 Тогда
								СМ_ЧЕРИ_Сервер.ВыгрузитьЗНпоМарке(Ссылка);					                                            
								СМГ_Сообщить("Завершена отправка на портал. Проверьте результат.",СтатусСообщения.Информация);
							Иначе
								СМГ_Сообщить("Пробег в документе '"+СокрЛП(Ссылка.Пробег)+"' не соответствует критериям выгрузки на портал. Должен быть больше нуля.",СтатусСообщения.ОченьВажное);							 		
							КонецЕсли;
 						Иначе	
							СМГ_Сообщить("Вид ремонта документа '"+СокрЛП(Ссылка.ВидРемонта)+"' не соответствует критериям выгрузки на портал.",СтатусСообщения.ОченьВажное);							 	 
							СМГ_Сообщить("Должен быть из списка: "+СписокВидовРемонта,СтатусСообщения.ОченьВажное);							 	
						КонецЕсли;
					Иначе
						СМГ_Сообщить("Состояние документа '"+СокрЛП(Ссылка.Состояние)+"' не соответствует критериям выгрузки на портал. Должно быть 'Выполнен' или 'Закрыт'",СтатусСообщения.ОченьВажное);							 
					КонецЕсли;	
 				Иначе
					СМГ_Сообщить("Организация документа '"+СокрЛП(Ссылка.Организация)+"' не соответствует критериям выгрузки на портал. Должна быть '"+СокрЛП(ЭлСпрНастроек.Дилер)+"'.",СтатусСообщения.ОченьВажное);						
				КонецЕсли;	
			КонецЕсли;				
 		КонецЕсли;	
	КонецЕсли;	
КонецПроцедуры             
//Бондаренко++ 20231014

Процедура ИнтерактивнаяПроверкаСВыгрузкой(Ссылка) Экспорт
	
	//Бондаренко++ 20231011
	Если Ссылка.Дата >= Дата(2023,10,17) Тогда
 		ИнтерактивнаяПроверкаСВыгрузкойУниверсальная(Ссылка);
		Возврат;		
	КонецЕсли;             
	//Бондаренко-- 20231011
 	
	//Бондаренко++ 20230617 
	//Если Ссылка.Организация = Справочники.Организации.НайтиПоРеквизиту("ИНН","6168069282") ИЛИ Ссылка.Организация = Справочники.Организации.НайтиПоРеквизиту("ИНН","6167106118") Тогда
	Если Ссылка.Организация = Справочники.Организации.НайтиПоРеквизиту("ИНН","6168069282") ИЛИ Ссылка.Организация = Справочники.Организации.НайтиПоРеквизиту("ИНН","6167106118") ИЛИ Ссылка.Организация = Справочники.Организации.НайтиПоРеквизиту("ИНН","6167104657") Тогда		
	//Бондаренко-- 20230617 	
		Если Ссылка.Состояние = Справочники.ВидыСостоянийЗаказНарядов.Выполнен ИЛИ Ссылка.Состояние = Справочники.ВидыСостоянийЗаказНарядов.Закрыт Тогда
			Если Ссылка.ВидРемонта = Справочники.ВидыРемонта.ТехническоеОбслуживание ИЛИ         
				//Бондаренко++ 20220606
				Ссылка.ВидРемонта = Справочники.ВидыРемонта.ТехническоеОбслуживаниеБесплатное ИЛИ
				//Бондаренко-- 20220606 
				//Бондаренко++ 20230607
				Ссылка.ВидРемонта = Справочники.ВидыРемонта.ТО_нольПлатный ИЛИ
				//Бондаренко-- 20230607				
				//Бондаренко++ 20230706
				Ссылка.ВидРемонта = Справочники.ВидыРемонта.ТО_ноль ИЛИ
				//Бондаренко-- 20230706				
 				//Бондаренко++ 20230503
				Ссылка.ВидРемонта = Справочники.ВидыРемонта.ДобраяВоляКомпании ИЛИ
				//Бондаренко-- 20230503 
 				//Бондаренко++ 20230714
				( Ссылка.ВидРемонта = Справочники.ВидыРемонта.ПредпродажнаяПодготовка И Ссылка.Автомобиль.Модель.Марка = Справочники.Марка.EXEED ) ИЛИ
				//Бондаренко-- 20230714 
				Ссылка.ВидРемонта = Справочники.ВидыРемонта.КоммерческийРемонт      ИЛИ 
				Ссылка.ВидРемонта = Справочники.ВидыРемонта.ГарантияПроизводителя   Тогда
				Если Ссылка.Пробег > 0 Тогда
					//Бондаренко++ 2023
 					Если Ссылка.Автомобиль.Модель.Марка = Справочники.Марка.CHERY Тогда
						СМ_ЧЕРИ_Сервер.ВыгрузитьЗНпоЧери(Ссылка);					                                            
					//Бондаренко++ 20230601	
					ИначеЕсли Ссылка.Автомобиль.Модель.Марка = Справочники.Марка.EXEED Тогда
						СМ_ЧЕРИ_Сервер.ВыгрузитьЗНпоЭксид(Ссылка);					                                            						
					ИначеЕсли Ссылка.Автомобиль.Модель.Марка = Справочники.Марка.OMODA Тогда
						СМ_ЧЕРИ_Сервер.ВыгрузитьЗНпоОмода(Ссылка);					   
					//Бондаренко++ 20231006						
					ИначеЕсли Ссылка.Автомобиль.Модель.Марка = Справочники.Марка.JAECOO Тогда
						СМ_ЧЕРИ_Сервер.ВыгрузитьЗНпоДжаеку(Ссылка);	 				
					//Бондаренко-- 20231006							
					КонецЕсли;					
					//Бондаренко-- 20230601					
 					Сообщить("Завершена попытка выгрузки на портал...",СтатусСообщения.Информация);
				Иначе
					Сообщить("Пробег в документе '"+СокрЛП(Ссылка.Пробег)+"' не соответствует критериям выгрузки на портал. Должен быть больше нуля.",СтатусСообщения.ОченьВажное);							 		
				КонецЕсли;
			Иначе
				Сообщить("Вид ремонта документа '"+СокрЛП(Ссылка.ВидРемонта)+"' не соответствует критериям выгрузки на портал.",СтатусСообщения.ОченьВажное);							 	 
				Сообщить("Должен быть: 'Техническое обслуживание','Техническое обслуживание (бесплатное)','ТO-0(платный)','ТО-0(Бесплатный)','Добрая воля компании','Коммерческий ремонт' или 'Гарантия производителя'",СтатусСообщения.ОченьВажное);							 	
			КонецЕсли;	                                                   
		Иначе
			Сообщить("Состояние документа '"+СокрЛП(Ссылка.Состояние)+"' не соответствует критериям выгрузки на портал. Должно быть 'Выполнен' или 'Закрыт'",СтатусСообщения.ОченьВажное);							 
		КонецЕсли;		
	Иначе
		Сообщить("Организация документа '"+СокрЛП(Ссылка.Организация)+"' не соответствует критериям выгрузки на портал. Должна быть 'Престиж Моторс ООО' или 'Автопарк ООО' или 'Атлант Моторс ООО'",СтатусСообщения.ОченьВажное);						
	КонецЕсли;	
	
	
КонецПроцедуры // ИнтерактивнаяПроверкаСВыгрузкой(Ссылка)
 