
&НаКлиенте
Процедура Выбрать(Команда)
	
	СтруктураВозврата = Новый Структура("Инцидент,ИдентификаторИнцидента",СписокИнцидентов,ИдентификаторИнцидента);
	
	ОповеститьОВыборе(СтруктураВозврата);
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("СписокИнцидентов") Тогда
				                      
		Для каждого ЭлементСписка Из Параметры.СписокИнцидентов Цикл
			
			Если Элементы.СписокИнцидентов.СписокВыбора.НайтиПоЗначению(ЭлементСписка.Значение) <> Неопределено Тогда
				Продолжить;
			КонецЕсли; 
			
			Элементы.СписокИнцидентов.СписокВыбора.Добавить(ЭлементСписка.Значение,ЭлементСписка.Представление);
			
		КонецЦикла; 
		
		ИдентификаторИнцидента = Параметры.ИдентификаторИнцидента;
		
	КонецЕсли; 
	
КонецПроцедуры
