//+ контроль прав
//где ВидРазрешения: "Создание","Просмотр","Редактирование"	
Функция РазрешенныеСобытия(ВидРазрешения) Экспорт
//где ВидРазрешения: "Создание","Просмотр","Редактирование"
	МассивРазрешенных=Новый Массив;
	Если ЗначениеЗаполнено(ПараметрыСеанса.Renault_ПраваПользователя.Ссылка) Тогда
		Права=ПараметрыСеанса.Renault_ПраваПользователя.Ссылка.События;	
		Для Каждого Стр Из Права.НайтиСтроки(Новый Структура(ВидРазрешения,Истина)) Цикл МассивРазрешенных.Добавить(Стр.Событие) КонецЦикла;
	КонецЕсли;
	Возврат МассивРазрешенных
КонецФункции

Функция ЕстьРазрешение(ВидСобытия,ВидРазрешения) Экспорт //где ВидСобытия один или массив
	Если ТипЗнч(ВидСобытия)=Тип("СправочникСсылка.CRM_ВидыСобытий") Тогда
		Массив=Новый Массив;
		Массив.Добавить(ВидСобытия);
	Иначе
		Массив=ВидСобытия;
	КонецЕсли;	
	ЕстьРезрешение=Истина;
	РазрешенныеСобытия=РазрешенныеСобытия(ВидРазрешения);
	Для Каждого Событие ИЗ Массив Цикл
		Если РазрешенныеСобытия.Найти(Событие)=Неопределено Тогда
			ЕстьРезрешение=Ложь;
			Прервать
		КонецЕсли;	
	КонецЦикла;
	Возврат ЕстьРезрешение
КонецФункции	

Функция РазрешенныеВидыСобытийПоОбластиПрименения(Область,ВидРазрешения) Экспорт
//где ВидРазрешения: "Создание","Просмотр","Редактирование"	
	МассивРазрешенных=Новый Массив;
	
	Если ЗначениеЗаполнено(ПараметрыСеанса.Renault_ПраваПользователя.Ссылка) Тогда

		Права=ПараметрыСеанса.Renault_ПраваПользователя.Ссылка.События;

		Запрос=Новый Запрос("Выбрать Различные Ссылка Из Справочник.CRM_ВидыСобытий.ОбластиПрименения ГДЕ Область=&Область И НЕ Ссылка.ПометкаУдаления");
		Запрос.УстановитьПараметр("Область",Область);
		Для Каждого ВидСобытия Из Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка") Цикл
			Если Права.НайтиСтроки(Новый Структура("Событие,"+ВидРазрешения,ВидСобытия,Истина))<>Неопределено Тогда
				МассивРазрешенных.Добавить(ВидСобытия)
			КонецЕсли;	
		КонецЦикла;	
		
	КонецЕсли;
	Возврат МассивРазрешенных
КонецФункции

Функция РазрешенныеВидыСобытийПоОбластямПрименения(Области,ВидРазрешения) Экспорт
	МассивРазрешенных=Новый Массив;
	Для Каждого Область Из Области Цикл 
		Для Каждого ВидСобытия Из РазрешенныеВидыСобытийПоОбластиПрименения(Область,ВидРазрешения) Цикл
			Если МассивРазрешенных.Найти(ВидСобытия)=Неопределено Тогда
				МассивРазрешенных.Добавить(ВидСобытия)
			КонецЕсли;	
		КонецЦикла;
	КонецЦикла;
	Возврат МассивРазрешенных
КонецФункции	

Функция СписокВидовСобытий(МассивВидовСобытий,ПомеченныйЭлементИлиМассивЭлементов=Неопределено) Экспорт //представление списка для выбора в диалоге ОбщиеФормы.Renault_ДиалогВыбораСпискаЗначений
	ВидыСобытий=Новый СписокЗначений;
	ВидыСобытий.ЗагрузитьЗначения(МассивВидовСобытий);
	Для Каждого Эл Из ВидыСобытий Цикл 
		Эл.Представление=Эл.Значение.Наименование;
		
		Если ПомеченныйЭлементИлиМассивЭлементов<>Неопределено Тогда
			Если ТипЗнч(ПомеченныйЭлементИлиМассивЭлементов)=Тип("Массив") Тогда
				Эл.Пометка=?(ПомеченныйЭлементИлиМассивЭлементов.Найти(Эл.Значение)=Неопределено,Ложь,Истина);
			Иначе
				Эл.Пометка=?(Эл.Значение=ПомеченныйЭлементИлиМассивЭлементов,Истина,Ложь);	
			КонецЕсли;	
		КонецЕсли;	
			
		Если Найти(Эл.Представление,"Звонок") Тогда Эл.Картинка=БиблиотекаКартинок.Renault_Phone_New КонецЕсли;
	КонецЦикла; 
	ВидыСобытий.СортироватьПоПредставлению();
	Возврат ВидыСобытий 
КонецФункции	
//- контроль прав

Функция ПроверитьИЗаполнитьОбласти() Экспорт // вызов при обновлении/первичном заполнении
	
	ЕстьОшибкиЗаписи=Ложь;
	Запрос=Новый Запрос("Выбрать Ссылка Из Справочник.CRM_ВидыСобытий ГДЕ Ссылка Не В(Выбрать Различные Ссылка Из Справочник.CRM_ВидыСобытий.ОбластиПрименения)");
	Выборка=Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Объект=Выборка.Ссылка.ПолучитьОбъект();
		Если Объект.Ссылка=Справочники.CRM_ВидыСобытий.ОтправкаДокументовВБанк ИЛИ Объект.Ссылка=Справочники.CRM_ВидыСобытий.Кредит ИЛИ Объект.Ссылка=Справочники.CRM_ВидыСобытий.Страховка 
			ИЛИ Объект.Ссылка=Справочники.CRM_ВидыСобытий.КонсультацияОФУ 
			ИЛИ Объект.Ссылка=Справочники.CRM_ВидыСобытий.ПлановаяПролонгация 
			ИЛИ Объект.Ссылка=Справочники.CRM_ВидыСобытий.КлиентыСервиса 
			ИЛИ Объект.Ссылка=Справочники.CRM_ВидыСобытий.НапоминаниеОВзносе 
			ИЛИ Объект.Ссылка=Справочники.CRM_ВидыСобытий.УтеряннаяБаза Тогда
			Объект.ОбластиПрименения.Добавить().Область=Перечисления.Renault_ОбластиПрименения.ОФУ;
		ИначеЕсли Объект.Ссылка=Справочники.CRM_ВидыСобытий.ОценкаТрейдИн ИЛИ Объект.Ссылка=Справочники.CRM_ВидыСобытий.ТестДрайв Тогда
			Объект.ОбластиПрименения.Добавить().Область=Перечисления.Renault_ОбластиПрименения.Продажи;
		ИначеЕсли Объект.Ссылка=Справочники.CRM_ВидыСобытий.Выдача Тогда
			Объект.ОбластиПрименения.Добавить().Область=Перечисления.Renault_ОбластиПрименения.Сервис;
			Объект.ОбластиПрименения.Добавить().Область=Перечисления.Renault_ОбластиПрименения.Продажи;
		Иначе	
			Объект.ОбластиПрименения.Добавить().Область=Перечисления.Renault_ОбластиПрименения.Общие;
		КонецЕсли;	
		
		Попытка Объект.Записать() Исключение ЕстьОшибкиЗаписи=Истина; Сообщить(ОписаниеОшибки(),СтатусСообщения.Внимание) КонецПопытки;
	КонецЦикла;	
	
	Возврат НЕ ЕстьОшибкиЗаписи
КонецФункции

Функция ПолучитьОбласть(ВидСобытия) Экспорт
	Запрос=Новый Запрос("Выбрать Область Из Справочник.CRM_ВидыСобытий.ОбластиПрименения ГДЕ Ссылка=&Ссылка И Область<>Значение(Перечисление.Renault_ОбластиПрименения.Общие)");	
	Запрос.УстановитьПараметр("Ссылка",ВидСобытия);
	Выборка=Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда Возврат Выборка.Область Иначе Возврат Перечисления.Renault_ОбластиПрименения.Общие КонецЕсли;
КонецФункции	