Функция ЗаписатьСтатусПеремещения(ДокПеремещение, Статус) Экспорт

	Запись = РегистрыСведений.Renault_СтатусыПеремещений.СоздатьМенеджерЗаписи();
	Запись.Перемещение = ДокПеремещение;
	Запись.Статус = Статус;
	Запись.Ответственный = ПараметрыСеанса.Пользователь;
	Запись.Период = ТекущаяДата();
	Запись.ВремяИзменения = ТекущаяДата();
	
	Попытка
		Запись.Записать();
	Исключение
		Сообщить(КраткоеПредставлениеОшибки(ИнформацияОбОшибке()));
	КонецПопытки;

КонецФункции

Функция ПолучитьСтатусПеремещения(ДокПеремещение, НаДату = Неопределено) Экспорт

	Запрос = Новый Запрос;
			
	Запрос.УстановитьПараметр("Перемещение", ДокПеремещение);
	Запрос.УстановитьПараметр("Дата", ?(НаДату = Неопределено, ТекущаяДата(), НаДату));
			
	Запрос.Текст = "ВЫБРАТЬ
	               |	Renault_СтатусыПеремещенийСрезПоследних.Статус
	               |ИЗ
	               |	РегистрСведений.Renault_СтатусыПеремещений.СрезПоследних(&Дата, ) КАК Renault_СтатусыПеремещенийСрезПоследних
	               |ГДЕ
	               |	Renault_СтатусыПеремещенийСрезПоследних.Перемещение = &Перемещение";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Статус = Справочники.Renault_СтатусыПеремещения.ПустаяСсылка();
	Если Выборка.Следующий() Тогда
		Статус = Выборка.Статус; 
	КонецЕсли;

	Возврат Статус;
	
КонецФункции

Функция ПриходоватьОстатки(ДокПеремещение) Экспорт

	Статус = ПолучитьСтатусПеремещения(ДокПеремещение);
	
	Возврат ?(Статус = Справочники.Renault_СтатусыПеремещения.Доставлен, Истина, Ложь);

КонецФункции
