
&НаКлиенте
Процедура ОК(Команда)
	Для Каждого СтрокаТЧ из Таблица Цикл
		Если не ЗначениеЗаполнено(СтрокаТЧ.ВИН) 
		//или не ЗначениеЗаполнено(СтрокаТЧ.Комментарий) 
			Тогда
			Предупреждение("Поля VIN и комментарий обязательны для заполнения",,"Ошибка"); 
			Возврат
		КонецЕсли;
	КонецЦикла;
	Закрыть(Таблица);
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаАвтомобильПриИзменении(Элемент)
	ТекущаяСтрока = Элементы.Таблица.ТекущиеДанные;
	ТекущаяСтрока.ВИН = ПолучитьВИННаСервере(ТекущаяСтрока.Автомобиль);
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьВИННаСервере (Автомобиль)
	Возврат Автомобиль.VIN;
КонецФункции

&НаКлиенте
Процедура ТаблицаVINПриИзменении(Элемент)
	ТекущаяСтрока = Элементы.Таблица.ТекущиеДанные;
	ТекущаяСтрока.Автомобиль = ПредопределенноеЗначение("Справочник.Автомобили.ПустаяСсылка");
КонецПроцедуры


