// +++++ Соколмоторс +++++
Функция УстановитьНовыйНомер(Дата) Экспорт
	//НаборЗаписей = СоздатьНаборЗаписей();
	//НаборЗаписей.Прочитать();
	//Если НаборЗаписей.Количество() = 0 Тогда
	//	ТекущаяЗапись = НаборЗаписей.Добавить();
	//	ТекущаяЗапись.Название = "Новая";
	//Иначе
	//	ТекущаяЗапись = НаборЗаписей[0];
	//КонецЕсли;
	//
	//Если ТекущаяЗапись.Дата = НачалоДня(Дата) Тогда
	//	ТекущаяЗапись.Номер = ТекущаяЗапись.Номер + 1;	
	//Иначе
	//	ТекущаяЗапись.Дата = НачалоДня(Дата);
	//	ТекущаяЗапись.Номер = 1;
	//КонецЕсли;
	//НаборЗаписей.Записать();
	//Возврат ТекущаяЗапись.Номер;
	
	
	//Запрос = Новый Запрос;
	//Запрос.Текст = 
	//		"ВЫБРАТЬ
	//		|	НумерацияСкладскихДокументов.Название,
	//		|	НумерацияСкладскихДокументов.Дата,
	//		|	НумерацияСкладскихДокументов.Номер
	//		|ИЗ
	//		|	РегистрСведений.НумерацияСкладскихДокументов КАК НумерацияСкладскихДокументов
	//		|
	//		|ДЛЯ ИЗМЕНЕНИЯ";
	//Выборка = Запрос.Выполнить().Выбрать();
	//Если Выборка.Следующий() Тогда
	//	Если Выборка.Дата = НачалоДня(Дата) Тогда
	//		Номер = Выборка.Номер + 1;
	//		ДатаЗаписи = ТекущаяДата();
	//	Иначе
	//		ДатаЗаписи = НачалоДня(Дата);
	//		Номер = 1;
	//	КонецЕсли;	
	//Иначе
	//	Номер = 1;
	//	ДатаЗаписи = ТекущаяДата();
	//КонецЕсли;
	//НаборЗаписей = СоздатьНаборЗаписей();
	//ТекущаяЗапись = НаборЗаписей.Добавить(); 
	//ТекущаяЗапись.Название = "Новая";
	//ТекущаяЗапись.Дата = ДатаЗаписи; 
	//ТекущаяЗапись.Номер = Номер;
	//НаборЗаписей.Записать();
	
	Номер = 0;
	
	Возврат Номер;
	
КонецФункции
// ----- Соколмоторс -----
