
&НаКлиенте
Процедура Ок(Команда)
	Закрыть(Объект);
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	//Вставить содержимое обработчика
КонецПроцедуры

&НаКлиенте
Процедура ОбъектРаботыPVRНормаЧасПриИзменении(Элемент)
	ОбъектРаботыPVRНормаЧасПриИзмененииНаСервере();
КонецПроцедуры

&НаСервере
Процедура ОбъектРаботыPVRНормаЧасПриИзмененииНаСервере()
	ТекСтрока = Объект.РаботыPVR.НайтиПоИдентификатору(Элементы.ОбъектРаботыPVR.ТекущаяСтрока);
	ТекСтрока.Стоимость = Объект.СтоимостьНормаЧаса * ТекСтрока.НормаЧас;
КонецПроцедуры

&НаКлиенте
Процедура ОбъектТоварыPVRЦенаПриИзменении(Элемент)
	ОбъектТоварыPVRЦенаПриИзмененииНаСервере ();
КонецПроцедуры

Процедура ОбъектТоварыPVRЦенаПриИзмененииНаСервере ()
	ТекСтрока = Объект.ТоварыPVR.НайтиПоИдентификатору(Элементы.ОбъектТоварыPVR.ТекущаяСтрока);
	ТекСтрока.Стоимость = ТекСтрока.Цена * ТекСтрока.Количество;
КонецПроцедуры

&НаКлиенте
Процедура ОбъектТоварыPVRКоличествоПриИзменении(Элемент)
	ОбъектТоварыPVRЦенаПриИзмененииНаСервере();
КонецПроцедуры
