
&НаСервере
Функция ПолучитьТелефон(ВыбраннаяСтрока)
    
    Структура = Новый Структура;
    Структура.Вставить("Наименование", ВыбраннаяСтрока.Ссылка);
    Структура.Вставить("НомерТелефона", ВыбраннаяСтрока.НомерТелефона);
    
    Возврат Структура;
    
КонецФункции
 
&НаКлиенте
Процедура ПолучателиВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
    
    СтандартнаяОбработка = Ложь;
    Телефон = ПолучитьТелефон(ВыбраннаяСтрока);
    Структура = Новый Структура("Объект, Поле1, Поле2, Поле3", Телефон.Наименование, Телефон.НомерТелефона, "", "");
	// "эмулируем" выбор из "Контактной информации"
	ОповеститьОВыборе(Структура);

КонецПроцедуры
