
// Создает набор записей регистра сведений по переданным значениям структуры. Добавляет одну запись в набор.
//
// Параметры:
//  СтруктураЗаписи - Структура - структура по значениям которой необходимо создать набор записей и заполнить этот
//                                набор.
//  ИмяРегистра     - Строка - имя регистра сведений.
// 
Функция СоздатьНаборЗаписейРегистраСведений(СтруктураЗаписи, ИмяРегистра) Экспорт
	
	МетаданныеРегистра = Метаданные.РегистрыСведений[ИмяРегистра];
	
	// Создаем набор записей регистра.
	НаборЗаписей = РегистрыСведений[ИмяРегистра].СоздатьНаборЗаписей();
	
	// Устанавливаем отбор по измерениям регистра.
	Для Каждого Измерение Из МетаданныеРегистра.Измерения Цикл
		
		// Если задано значение в структуре, то отбор устанавливаем.
		Если СтруктураЗаписи.Свойство(Измерение.Имя) Тогда
			
			НаборЗаписей.Отбор[Измерение.Имя].Установить(СтруктураЗаписи[Измерение.Имя]);
			
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат НаборЗаписей;
КонецФункции

// Добавляет одну запись в регистр сведений по переданным значениям структуры.
//
// Параметры:
//  СтруктураЗаписи - Структура - структура, по значениям которой необходимо создать набор записей и заполнить этот
//                                набор.
//  ИмяРегистра     - Строка - имя регистра сведений, в который необходимо добавить запись.
// 
Процедура ДобавитьЗаписьВРегистрСведений(СтруктураЗаписи, Знач ИмяРегистра, Загрузка = Ложь) Экспорт
	
	НаборЗаписей = СоздатьНаборЗаписейРегистраСведений(СтруктураЗаписи, ИмяРегистра);
	
	// Добавляем только одну запись в новый набор записей.
	НоваяЗапись = НаборЗаписей.Добавить();
	
	// Заполняем значения свойств записи из переданной структуры.
	ЗаполнитьЗначенияСвойств(НоваяЗапись, СтруктураЗаписи);
	
	НаборЗаписей.ОбменДанными.Загрузка = Загрузка;
	
	// записываем набор записей
	НаборЗаписей.Записать();
	
КонецПроцедуры

// Обновляет запись в регистр сведений по переданным значениям структуры.
//
// Параметры:
//  СтруктураЗаписи - Структура - структура, по значениям которой необходимо создать менеджер записи и обновить запись.
//  ИмяРегистра     - Строка - имя регистра сведений, в котором необходимо обновить запись.
// 
Процедура ОбновитьЗаписьВРегистрСведений(СтруктураЗаписи, Знач ИмяРегистра) Экспорт
	
	МетаданныеРегистра = Метаданные.РегистрыСведений[ИмяРегистра];
	
	// Создаем менеджер записи регистра.
	МенеджерЗаписи = РегистрыСведений[ИмяРегистра].СоздатьМенеджерЗаписи();
	
	// Устанавливаем отбор по измерениям регистра.
	Для Каждого Измерение Из МетаданныеРегистра.Измерения Цикл
		
		// Если задано значение в структуре, то отбор устанавливаем.
		Если СтруктураЗаписи.Свойство(Измерение.Имя) Тогда
			
			МенеджерЗаписи[Измерение.Имя] = СтруктураЗаписи[Измерение.Имя];
			
		КонецЕсли;
		
	КонецЦикла;
	
	// Считываем запись из базы данных.
	МенеджерЗаписи.Прочитать();
	
	// Заполняем значения свойств записи из переданной структуры.
	ЗаполнитьЗначенияСвойств(МенеджерЗаписи, СтруктураЗаписи);
	
	// записываем менеджер записи
	МенеджерЗаписи.Записать();
	
КонецПроцедуры

// Удаляет набор записей в регистре по переданным значениям структуры.
//
// Параметры:
//  СтруктураЗаписи - Структура - структура, по значениям которой необходимо удалить набор записей.
//  ИмяРегистра     - Строка - имя регистра сведений, в котором необходимо удалить набор записей.
// 
Процедура УдалитьНаборЗаписейВРегистреСведений(СтруктураЗаписи, ИмяРегистра, Загрузка = Ложь) Экспорт
	
	НаборЗаписей = СоздатьНаборЗаписейРегистраСведений(СтруктураЗаписи, ИмяРегистра);
	
	НаборЗаписей.ОбменДанными.Загрузка = Загрузка;
	
	// записываем набор записей
	НаборЗаписей.Записать();
	
КонецПроцедуры

//// ВЕБ-СЕРВИС ДЛЯ СДМ, редакция 1.0

Функция ОтправкаДанных(УзелОбмена,КодУзла,ПравилаОбмена) Экспорт 
	
	УстановитьПривилегированныйРежим(Истина);
	
	ЗаписьЖурналаРегистрации("Отправка файлов для дилеров",УровеньЖурналаРегистрации.Информация,,,"Начало отправки файлов...");
	
	ПустоеЗначение = Новый ХранилищеЗначения(Неопределено);
	
	Попытка
		
		УзелИнформационнойБазы = ПланыОбмена[УзелОбмена].НайтиПоКоду(КодУзла);
		
		Если Не ЗначениеЗаполнено(УзелИнформационнойБазы) Тогда
			ЗаписьЖурналаРегистрации("Отправка файлов для дилеров",УровеньЖурналаРегистрации.Ошибка,,,"Не найден узел с кодом"+КодУзла);
			Возврат ПустоеЗначение;
		КонецЕсли; 
		
		ОбработкаОбменаДанными = Обработки.DMS_УниверсальныйОбменДаннымиXML.Создать();
		
		ОбработкаОбменаДанными.РежимОбмена = "Выгрузка";
		
		ОбработкаОбменаДанными.ИмяФайлаОбмена = ПолучитьИмяВременногоФайла("xml");
		
		ИмяФайлаПравилОбмена = ПолучитьИмяВременногоФайла("xml");
		
		ДвоичныеДанныеПравил = ПравилаОбмена.Получить();
		
		ДвоичныеДанныеПравил.Записать(ИмяФайлаПравилОбмена);
		
		ОбработкаОбменаДанными.ИмяФайлаПравилОбмена = ИмяФайлаПравилОбмена;
		
		ОбработкаОбменаДанными.ЗагрузитьПравилаОбмена();	
		ОбработкаОбменаДанными.ИнициализироватьПервоначальныеЗначенияПараметров();
		
		УстановитьУзелОбменаУСтрокДерева(ОбработкаОбменаДанными.ТаблицаПравилВыгрузки.Строки,УзелИнформационнойБазы);
		
		ОбработкаОбменаДанными.ДописыватьДанныеВПротоколОбмена = Ложь;
		ОбработкаОбменаДанными.ВыгружатьТолькоРазрешенные      = Ложь;
		
		ОбработкаОбменаДанными.ИспользоватьТранзакции         = Истина;
		ОбработкаОбменаДанными.КоличествоОбъектовНаТранзакцию = 100;
		
		Попытка
			ОбработкаОбменаДанными.ВыполнитьВыгрузку();
		Исключение
			ЗаписьЖурналаРегистрации("Отправка файлов для дилеров",УровеньЖурналаРегистрации.Ошибка,,,КраткоеПредставлениеОшибки(ИнформацияОбОшибке()));
			Возврат ПустоеЗначение;
		КонецПопытки;
		
		ДвоичныеДанные = Новый ДвоичныеДанные(ОбработкаОбменаДанными.ИмяФайлаОбмена);
		
		ХранилищеВозврата = Новый ХранилищеЗначения(ДвоичныеДанные,Новый СжатиеДанных(9));
		
		УдалитьФайлы(ОбработкаОбменаДанными.ИмяФайлаОбмена);
		УдалитьФайлы(ИмяФайлаПравилОбмена);
		
		ЗаписьЖурналаРегистрации("Отправка файлов для дилеров",УровеньЖурналаРегистрации.Информация,,,"Закончена отправки файлов...");
				
		Возврат ХранилищеВозврата;
		
	Исключение
		
		СообщениеООшибке = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		ЗаписьЖурналаРегистрации("Отправка файлов для дилеров",УровеньЖурналаРегистрации.Ошибка,,,СообщениеООшибке);
		Возврат ПустоеЗначение;
		
	КонецПопытки;
	
	ЗаписьЖурналаРегистрации("Отправка файлов для дилеров",УровеньЖурналаРегистрации.Информация,,,"Закончена отправки файлов...");
	
	Возврат ПустоеЗначение;
	
КонецФункции

Функция ПолучениеДанных(УзелОбмена,КодУзла,ДанныеЗагрузки,НомерОтправленного) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	ЗаписьЖурналаРегистрации("Получение файлов",УровеньЖурналаРегистрации.Информация,,,"Начало загрузки файлов...");
	
	Попытка
		
		УзелИнформационнойБазы = ПланыОбмена[УзелОбмена].НайтиПоКоду(КодУзла);
		
		Если Не ЗначениеЗаполнено(УзелИнформационнойБазы) Тогда
			ЗаписьЖурналаРегистрации("Отправка файлов для дилеров",УровеньЖурналаРегистрации.Ошибка,,,"Не найден узел с кодом"+КодУзла);
			Возврат 0;
		КонецЕсли;                      
		
		НомерПринятогоРанее = УзелИнформационнойБазы.НомерПринятого;
		
		Если НомерПринятогоРанее <> 0 
			И НомерПринятогоРанее >= НомерОтправленного Тогда
			ВызватьИсключение "Номер файла меньше и равен номер принятого ранее";
			Возврат 0;
		КонецЕсли; 
		
		ОбработкаОбменаДанными = Обработки.DMS_УниверсальныйОбменДаннымиXML.Создать();
		
		ОбработкаОбменаДанными.РежимОбмена = "Загрузка";
				
		ИмяФайлаЗагрузки = ПолучитьИмяВременногоФайла("xml");
		
		ДвоичныеДанныеПравил = ДанныеЗагрузки.Получить();
		
		ДвоичныеДанныеПравил.Записать(ИмяФайлаЗагрузки);
		
		ОбработкаОбменаДанными.УзелИсточник = УзелИнформационнойБазы; 
		
		ОбработкаОбменаДанными.ИмяФайлаОбмена = ИмяФайлаЗагрузки;
		
		ОбработкаОбменаДанными.ДописыватьДанныеВПротоколОбмена = Ложь;
		ОбработкаОбменаДанными.ВыгружатьТолькоРазрешенные      = Ложь;
		
		ОбработкаОбменаДанными.ИспользоватьТранзакции         = Истина;
		ОбработкаОбменаДанными.КоличествоОбъектовНаТранзакцию = 100;
		
		Попытка
			ОбработкаОбменаДанными.ВыполнитьЗагрузку();
		Исключение
			ЗаписьЖурналаРегистрации("Загрузка файлов",УровеньЖурналаРегистрации.Ошибка,,,КраткоеПредставлениеОшибки(ИнформацияОбОшибке()));
			Возврат 0;
		КонецПопытки;
		
		// Удаляем регистрацию изменений для узла отправителя сообщения.
		ПланыОбмена.УдалитьРегистрациюИзменений(УзелИнформационнойБазы, УзелИнформационнойБазы.НомерПринятого);
		
		ОтправительОбъект = УзелИнформационнойБазы.ПолучитьОбъект();
		ОтправительОбъект.НомерПринятого = ОтправительОбъект.НомерПринятого+1;
		ОтправительОбъект.Записать();
		
		УдалитьФайлы(ИмяФайлаЗагрузки);
		
		Возврат ОтправительОбъект.НомерПринятого;
		
	Исключение
		
		СообщениеООшибке = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		ЗаписьЖурналаРегистрации("Отправка файлов для дилеров",УровеньЖурналаРегистрации.Ошибка,,,СообщениеООшибке);
		Возврат 0;
		
	КонецПопытки;
	
КонецФункции // ПолучениеДанных()

Функция НомерОтправленного(УзелОбмена,КодУзла) Экспорт 
	
	УстановитьПривилегированныйРежим(Истина);
	
	ЗаписьЖурналаРегистрации("Отправка файлов для дилеров",УровеньЖурналаРегистрации.Информация,,,"Начало отправки файлов...");
	
	Попытка
		
		УзелИнформационнойБазы = ПланыОбмена[УзелОбмена].НайтиПоКоду(КодУзла);
		
		Если Не ЗначениеЗаполнено(УзелИнформационнойБазы) Тогда
			ЗаписьЖурналаРегистрации("Отправка файлов для дилеров",УровеньЖурналаРегистрации.Ошибка,,,"Не найден узел с кодом "+КодУзла);
			Возврат 0;
		КонецЕсли; 
		
		НомерОтправленного = УзелИнформационнойБазы.НомерОтправленного;
		
		Возврат НомерОтправленного;
		
	Исключение
		
		СообщениеООшибке = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		ЗаписьЖурналаРегистрации("Отправка файлов для дилеров",УровеньЖурналаРегистрации.Ошибка,,,СообщениеООшибке);
		Возврат 0;
		
	КонецПопытки;
	
КонецФункции // НомерОтправленного()
 
Процедура УстановитьУзелОбменаУСтрокДерева(Дерево, УзелОбмена)
	
	Для Каждого Строка Из Дерево Цикл
		
		Если Строка.ЭтоГруппа Тогда
			
			УстановитьУзелОбменаУСтрокДерева(Строка.Строки, УзелОбмена);
			
		Иначе
			
			Строка.СсылкаНаУзелОбмена = УзелОбмена;
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

///// РЕГЛАМЕНТНОЕ ЗАДАНИЕ

Процедура DMS_СинхронизацияДанных(КодСценарияОбмена) Экспорт
		
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Код", КодСценарияОбмена);
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ ПЕРВЫЕ 1
		|	DMS_СценарииОбменовДанными.Ссылка
		|ИЗ
		|	Справочник.DMS_СценарииОбменовДанными КАК DMS_СценарииОбменовДанными
		|ГДЕ
		|	DMS_СценарииОбменовДанными.Код = &Код";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
	
		Сценарий = ВыборкаДетальныеЗаписи.Ссылка;	
		
		Для каждого ТекущаяСтрока Из Сценарий.НастройкиОбмена Цикл
			
			
			Попытка
				
				УзелОбмена = ТекущаяСтрока.УзелИнформационнойБазы;
				
				ДлительнаяОперация = Ложь;
				ДлительнаяОперацияЗавершена = Ложь;
				ИдентификаторФайлаСообщенияВСервисе = "";
				ИдентификаторДлительнойОперации = "";
				
				ПараметрыАутентификации = Неопределено;
				
				ВидТранспорта = ТекущаяСтрока.ВидТранспортаОбмена;
				
				Если ТекущаяСтрока.ВыполняемоеДействие = Перечисления.DMS_ДействияПриОбмене.ЗагрузкаДанных Тогда
					DMS_ОбменДаннымиСДМСервер.ВыполнитьОбменДаннымиДляУзлаИнформационнойБазы(Ложь,УзелОбмена,Истина,Ложь,ВидТранспорта,ДлительнаяОперация,ИдентификаторДлительнойОперации,ИдентификаторФайлаСообщенияВСервисе,ДлительнаяОперацияЗавершена,ПараметрыАутентификации);	
				Иначе 
					DMS_ОбменДаннымиСДМСервер.ВыполнитьОбменДаннымиДляУзлаИнформационнойБазы(Ложь,УзелОбмена,Ложь,Истина,ВидТранспорта,ДлительнаяОперация,ИдентификаторДлительнойОперации,ИдентификаторФайлаСообщенияВСервисе,ДлительнаяОперацияЗавершена,ПараметрыАутентификации);	
				КонецЕсли; 
				
			Исключение
	         	ЗаписьЖурналаРегистрации("обмен с СДМ",УровеньЖурналаРегистрации.Ошибка,,,КраткоеПредставлениеОшибки(ИнформацияОбОшибке()));
			КонецПопытки;			
			
		КонецЦикла; 
		
	КонецЕсли; 

КонецПроцедуры

/// ДЛЯ ОБМЕНА ДАННЫМИ

////#Область ВыполнениеОбменаДанными

Процедура ВыполнитьОбменДаннымиДляУзлаИнформационнойБазы(Отказ,
														Знач УзелИнформационнойБазы,
														Знач ВыполнятьЗагрузку = Истина,
														Знач ВыполнятьВыгрузку = Истина,
														Знач ВидТранспортаСообщенийОбмена = Неопределено,
														ДлительнаяОперация = Ложь,
														ИдентификаторОперации = "",
														ИдентификаторФайла = "",
														Знач ДлительнаяОперацияРазрешена = Ложь,
														Знач ПараметрыАутентификации = Неопределено,
														Знач ТолькоПараметры = Ложь
	) Экспорт
	
	ДействиеПриОбмене = ?(ВыполнятьЗагрузку,Перечисления.DMS_ДействияПриОбмене.ЗагрузкаДанных,Перечисления.DMS_ДействияПриОбмене.ВыгрузкаДанных);
	
	// Обмен через внешнее соединение.
	Если ВидТранспортаСообщенийОбмена = Перечисления.DMS_ВидыТранспортаСообщенийОбмена.WS Тогда // Обмен через Web-сервис
			
		НастройкиТранспортаWS = РегистрыСведений.DMS_НастройкиТранспортаОбмена.НастройкиТранспортаWS(УзелИнформационнойБазы);
		
		Если ВыполнятьЗагрузку Тогда
			
			// Возвращаемое значение функции.
			СтруктураНастроекОбмена = СтруктураНастроекОбменаБазовая();
			
			СтруктураНастроекОбмена.УзелИнформационнойБазы = УзелИнформационнойБазы;
			СтруктураНастроекОбмена.ДействиеПриОбмене      = ДействиеПриОбмене;
			СтруктураНастроекОбмена.ВидТранспортаОбмена    = ВидТранспортаСообщенийОбмена;
			СтруктураНастроекОбмена.ЭтоОбменВРИБ           = ЭтоУзелРаспределеннойИнформационнойБазы(УзелИнформационнойБазы);
			
			СтруктураНастроекОбмена.РезультатВыполненияОбмена = Неопределено;
			СтруктураНастроекОбмена.ДатаНачала = ТекущаяДатаСеанса();
			
			СтруктураНастроекОбмена.ИмяОбработкиТранспортаСообщенийОбмена = ИмяОбработкиТранспортаСообщенийОбмена(СтруктураНастроекОбмена.ВидТранспортаОбмена);
			СтруктураНастроекОбмена.Вставить("WSИмяПользователя", НастройкиТранспортаWS.WSИмяПользователя);
			СтруктураНастроекОбмена.Вставить("WSПароль",		  НастройкиТранспортаWS.WSПароль);
			СтруктураНастроекОбмена.Вставить("WSURLВебСервиса",   НастройкиТранспортаWS.WSURLВебСервиса);
			
			ВыполнитьИнициализациюСтруктурыНастроекОбменаДляУзлаИнформационнойБазы(СтруктураНастроекОбмена, Ложь);
			
			СтрокаСообщения = НСтр("ru = 'Начало процесса обмена данными для узла %1'", КодОсновногоЯзыка());
			СтрокаСообщения = Renault_СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(СтрокаСообщения, СтруктураНастроекОбмена.УзелИнформационнойБазыНаименование);
			ЗаписьЖурналаРегистрацииОбменаДанными(СтрокаСообщения, СтруктураНастроекОбмена);
			
			ВыполитьЗагрузкуЧерезWSРесурс(СтруктураНастроекОбмена,Отказ);
			
			ЗафиксироватьЗавершениеОбмена(СтруктураНастроекОбмена);
			                            
			Если Не РезультатВыполненияОбменаВыполнено(СтруктураНастроекОбмена.РезультатВыполненияОбмена) Тогда
				
				Отказ = Истина;
				
			Иначе 
				
				Отправитель = СтруктураНастроекОбмена.УзелИнформационнойБазы;
			
				// Удаляем регистрацию изменений для узла отправителя сообщения.
				ПланыОбмена.УдалитьРегистрациюИзменений(Отправитель, Отправитель.НомерПринятого);
				
				//РегистрыСведений.ОбщиеНастройкиУзловИнформационныхБаз.СнятьПризнакНачальнойВыгрузкиДанных(Отправитель, Отправитель.НомерПринятого);
				
				ОтправительОбъект = Отправитель.ПолучитьОбъект();
				
				ОтправительОбъект.НомерПринятого = ОтправительОбъект.НомерПринятого+1;
				//ОтправительОбъект.ОбменДанными.Загрузка = Истина;
				ОтправительОбъект.Записать();
				
			КонецЕсли;
			
		КонецЕсли;
		
		Если ВыполнятьВыгрузку Тогда
			
			// Возвращаемое значение функции.
			СтруктураНастроекОбмена = СтруктураНастроекОбменаБазовая();
			
			СтруктураНастроекОбмена.УзелИнформационнойБазы = УзелИнформационнойБазы;
			СтруктураНастроекОбмена.ДействиеПриОбмене      = ДействиеПриОбмене;
			СтруктураНастроекОбмена.ВидТранспортаОбмена    = ВидТранспортаСообщенийОбмена;
			СтруктураНастроекОбмена.ЭтоОбменВРИБ           = ЭтоУзелРаспределеннойИнформационнойБазы(УзелИнформационнойБазы);
			
			СтруктураНастроекОбмена.РезультатВыполненияОбмена = Неопределено;
			СтруктураНастроекОбмена.ДатаНачала = ТекущаяДатаСеанса();
						
			СтруктураНастроекОбмена.ИмяОбработкиТранспортаСообщенийОбмена = ИмяОбработкиТранспортаСообщенийОбмена(СтруктураНастроекОбмена.ВидТранспортаОбмена);
			СтруктураНастроекОбмена.Вставить("WSИмяПользователя", НастройкиТранспортаWS.WSИмяПользователя);
			СтруктураНастроекОбмена.Вставить("WSПароль",		  НастройкиТранспортаWS.WSПароль);
			СтруктураНастроекОбмена.Вставить("WSURLВебСервиса",   НастройкиТранспортаWS.WSURLВебСервиса);
			
			ВыполнитьИнициализациюСтруктурыНастроекОбменаДляУзлаИнформационнойБазы(СтруктураНастроекОбмена, Ложь);
			
			СтрокаСообщения = НСтр("ru = 'Начало процесса обмена данными для узла %1'", КодОсновногоЯзыка());
			СтрокаСообщения = Renault_СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(СтрокаСообщения, СтруктураНастроекОбмена.УзелИнформационнойБазыНаименование);
			ЗаписьЖурналаРегистрацииОбменаДанными(СтрокаСообщения, СтруктураНастроекОбмена);
			
			ВыполитьВыгрузкуЧерезWSРесурс(СтруктураНастроекОбмена,Отказ);
			
			ЗафиксироватьЗавершениеОбмена(СтруктураНастроекОбмена);
			
			Если Не РезультатВыполненияОбменаВыполнено(СтруктураНастроекОбмена.РезультатВыполненияОбмена) Тогда
				
				Отказ = Истина;
				
			КонецЕсли;
			
		КонецЕсли;
		
	Иначе // Обмен через обычные каналы связи.
		
		Если ВыполнятьЗагрузку Тогда
			
			// Возвращаемое значение функции.
			СтруктураНастроекОбмена = СтруктураНастроекОбменаБазовая();
			
			СтруктураНастроекОбмена.УзелИнформационнойБазы = УзелИнформационнойБазы;
			СтруктураНастроекОбмена.ДействиеПриОбмене      = ДействиеПриОбмене;
			СтруктураНастроекОбмена.ВидТранспортаОбмена    = ВидТранспортаСообщенийОбмена;
			СтруктураНастроекОбмена.ЭтоОбменВРИБ           = ЭтоУзелРаспределеннойИнформационнойБазы(УзелИнформационнойБазы);
			
			СтруктураНастроекОбмена.РезультатВыполненияОбмена = Неопределено;
			СтруктураНастроекОбмена.ДатаНачала = ТекущаяДатаСеанса();
			
			СтруктураНастроекОбмена.ИмяОбработкиТранспортаСообщенийОбмена = ИмяОбработкиТранспортаСообщенийОбмена(СтруктураНастроекОбмена.ВидТранспортаОбмена);
			
			ВыполнитьИнициализациюСтруктурыНастроекОбменаДляУзлаИнформационнойБазы(СтруктураНастроекОбмена, Ложь);
			
			СтрокаСообщения = НСтр("ru = 'Начало процесса обмена данными для узла %1'", КодОсновногоЯзыка());
			СтрокаСообщения = Renault_СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(СтрокаСообщения, СтруктураНастроекОбмена.УзелИнформационнойБазыНаименование);
			ЗаписьЖурналаРегистрацииОбменаДанными(СтрокаСообщения, СтруктураНастроекОбмена);
			
			ВыполнитьЗагрузкуЧерезФайловыйРесурс(СтруктураНастроекОбмена,Отказ);
			
			СтруктураНастроекОбмена.КоличествоОбъектовОбработано = СтруктураНастроекОбмена.ОбработкаОбменаДанными.мСчетчикЗагруженныхОбъектов;
			
			ЗафиксироватьЗавершениеОбмена(СтруктураНастроекОбмена);
			                            
			Если Не РезультатВыполненияОбменаВыполнено(СтруктураНастроекОбмена.РезультатВыполненияОбмена) Тогда
				
				Отказ = Истина;
			Иначе 
				
				Отправитель = СтруктураНастроекОбмена.УзелИнформационнойБазы;
				
				// Удаляем регистрацию изменений для узла отправителя сообщения.
				ПланыОбмена.УдалитьРегистрациюИзменений(Отправитель, Отправитель.НомерПринятого);
				
				//РегистрыСведений.ОбщиеНастройкиУзловИнформационныхБаз.СнятьПризнакНачальнойВыгрузкиДанных(Отправитель, Отправитель.НомерПринятого);
				
				
				ОтправительОбъект = Отправитель.ПолучитьОбъект();
				ОтправительОбъект.НомерПринятого = ОтправительОбъект.НомерПринятого+1;
				//ОтправительОбъект.ОбменДанными.Загрузка = Истина;
				ОтправительОбъект.Записать();
				
			КонецЕсли;
			
		КонецЕсли;
		
		Если ВыполнятьВыгрузку Тогда
			
			// Возвращаемое значение функции.
			СтруктураНастроекОбмена = СтруктураНастроекОбменаБазовая();
			
			СтруктураНастроекОбмена.УзелИнформационнойБазы = УзелИнформационнойБазы;
			СтруктураНастроекОбмена.ДействиеПриОбмене      = ДействиеПриОбмене;
			СтруктураНастроекОбмена.ВидТранспортаОбмена    = ВидТранспортаСообщенийОбмена;
			СтруктураНастроекОбмена.ЭтоОбменВРИБ           = ЭтоУзелРаспределеннойИнформационнойБазы(УзелИнформационнойБазы);
			
			СтруктураНастроекОбмена.РезультатВыполненияОбмена = Неопределено;
			СтруктураНастроекОбмена.ДатаНачала = ТекущаяДатаСеанса();
			
			СтруктураНастроекОбмена.ИмяОбработкиТранспортаСообщенийОбмена = ИмяОбработкиТранспортаСообщенийОбмена(СтруктураНастроекОбмена.ВидТранспортаОбмена);
			
			ВыполнитьИнициализациюСтруктурыНастроекОбменаДляУзлаИнформационнойБазы(СтруктураНастроекОбмена, Ложь);
			
			СтрокаСообщения = НСтр("ru = 'Начало процесса обмена данными для узла %1'", DMS_ОбщегоНазначенияСервер.КодОсновногоЯзыка());
			СтрокаСообщения = Renault_СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(СтрокаСообщения, СтруктураНастроекОбмена.УзелИнформационнойБазыНаименование);
			ЗаписьЖурналаРегистрацииОбменаДанными(СтрокаСообщения, СтруктураНастроекОбмена);
			
 			ВыполнитьВыгрузкуЧерезФайловыйРесурс(СтруктураНастроекОбмена,Отказ);
			
			СтруктураНастроекОбмена.КоличествоОбъектовОбработано = СтруктураНастроекОбмена.ОбработкаОбменаДанными.мСчетчикВыгруженныхОбъектов;
			
			ЗафиксироватьЗавершениеОбмена(СтруктураНастроекОбмена);
			
			Если Не РезультатВыполненияОбменаВыполнено(СтруктураНастроекОбмена.РезультатВыполненияОбмена) Тогда
				
				Отказ = Истина;
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ВыполнитьВыгрузкуЧерезФайловыйРесурс(СтруктураНастроекОбмена,Отказ)
	
	ВыполнитьИнициализациюОбработкиТранспортаСообщенийОбмена(СтруктураНастроекОбмена);
	
	ВыполнитьТранспортСообщенияОбменаПередОбработкой(СтруктураНастроекОбмена);
	
	Если СтруктураНастроекОбмена.РезультатВыполненияОбмена <> Неопределено Тогда
	    Отказ = Истина;
		Возврат;
	КонецЕсли; 
	
	Попытка
		СтруктураНастроекОбмена.ОбработкаОбменаДанными = ПолучитьОбработкуОбменаДаннымиДляВыгрузки(СтруктураНастроекОбмена);
	Исключение
		ЗаписьЖурналаРегистрацииОбменаДанными(КраткоеПредставлениеОшибки(ИнформацияОбОшибке()),СтруктураНастроекОбмена,Истина);
		Отказ = Истина;
		СтруктураНастроекОбмена.РезультатВыполненияОбмена = Перечисления.DMS_РезультатыВыполненияОбмена.Ошибка;
		Возврат;
	КонецПопытки;
	
	СтруктураНастроекОбмена.ОбработкаОбменаДанными.УзелИсточник = СтруктураНастроекОбмена.УзелИнформационнойБазы; 
	
	Попытка
		СтруктураНастроекОбмена.ОбработкаОбменаДанными.ВыполнитьВыгрузку();
	Исключение
		ЗаписьЖурналаРегистрацииОбменаДанными(КраткоеПредставлениеОшибки(ИнформацияОбОшибке()),СтруктураНастроекОбмена,Истина);
		Отказ = Истина;
		СтруктураНастроекОбмена.РезультатВыполненияОбмена = Перечисления.DMS_РезультатыВыполненияОбмена.Ошибка;
	КонецПопытки;
	
	СтруктураНастроекОбмена.РезультатВыполненияОбмена = Перечисления.DMS_РезультатыВыполненияОбмена.Выполнено;
	
	Попытка
		ИмяКаталогаСообщенияОбмена = DMS_ОбменДаннымиСДМСервер.СоздатьВременныйКаталогСообщенийОбмена();
	Исключение
		Отказ = Истина;
		Сообщение = НСтр("ru = 'При получении сообщения обмена возникли ошибки: %1'", КодОсновногоЯзыка());
		Сообщение = Renault_СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(Сообщение, ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		СтруктураНастроекОбмена = Новый Структура("КлючСообщенияЖурналаРегистрации");
		СтруктураНастроекОбмена.КлючСообщенияЖурналаРегистрации = ПолучитьКлючСообщенияЖурналаРегистрации(СтруктураНастроекОбмена.УзелИнформационнойБазы, Перечисления.DMS_ДействияПриОбмене.ЗагрузкаДанных);
		ЗаписьЖурналаРегистрацииОбменаДанными(Сообщение, СтруктураНастроекОбмена, Истина);
		СтруктураНастроекОбмена.РезультатВыполненияОбмена = Перечисления.DMS_РезультатыВыполненияОбмена.Ошибка;
		Отказ = Истина;
		
	КонецПопытки;
	
	ВыполнитьТранспортСообщенияОбменаОтправка(СтруктураНастроекОбмена);
	
	ВыполнитьТранспортСообщенияОбменаПослеОбработки(СтруктураНастроекОбмена);
	
	ФайлПравилаВыгрузки = Новый Файл(СтруктураНастроекОбмена.ОбработкаОбменаДанными.ИмяФайлаПравилОбмена);
	
	Если ФайлПравилаВыгрузки.Существует() Тогда
		УдалитьФайлы(СтруктураНастроекОбмена.ОбработкаОбменаДанными.ИмяФайлаПравилОбмена);
	КонецЕсли; 
	
КонецПроцедуры

Процедура ВыполнитьЗагрузкуЧерезФайловыйРесурс(СтруктураНастроекОбмена,Отказ,ТолькоПараметры = Ложь)
	
	ВыполнитьИнициализациюОбработкиТранспортаСообщенийОбмена(СтруктураНастроекОбмена);
	
	ВыполнитьТранспортСообщенияОбменаПередОбработкой(СтруктураНастроекОбмена);
	
	Если СтруктураНастроекОбмена.РезультатВыполненияОбмена <> Неопределено Тогда
	    Отказ = Истина;
		Возврат;
	КонецЕсли; 
	
	Попытка
		СтруктураНастроекОбмена.ОбработкаОбменаДанными = ПолучитьОбработкуОбменаДаннымиДляЗагруки(СтруктураНастроекОбмена);
	Исключение
		ЗаписьЖурналаРегистрацииОбменаДанными(КраткоеПредставлениеОшибки(ИнформацияОбОшибке()),СтруктураНастроекОбмена,Истина);
		Отказ = Истина;
		СтруктураНастроекОбмена.РезультатВыполненияОбмена = Перечисления.DMS_РезультатыВыполненияОбмена.Ошибка;
		Возврат;
	КонецПопытки;
	
	Если СтруктураНастроекОбмена.РезультатВыполненияОбмена = Неопределено Тогда
		
		ВыполнитьТранспортСообщенияОбменаПолучение(СтруктураНастроекОбмена);
				
	КонецЕсли;
	
	СтруктураНастроекОбмена.ОбработкаОбменаДанными.УзелИсточник = СтруктураНастроекОбмена.УзелИнформационнойБазы; 
	
	// Загрузка данных только при успешном получении сообщения обмена.
	Попытка
		СтруктураНастроекОбмена.ОбработкаОбменаДанными.ВыполнитьЗагрузку();
	Исключение
		ЗаписьЖурналаРегистрацииОбменаДанными(КраткоеПредставлениеОшибки(ИнформацияОбОшибке()),СтруктураНастроекОбмена,Истина);
		СтруктураНастроекОбмена.РезультатВыполненияОбмена = Перечисления.DMS_РезультатыВыполненияОбмена.Ошибка;
		Отказ = Истина;
	КонецПопытки;
	
	// {Обработчик: ПослеЧтенияСообщенияОбмена} Начало
	СтандартнаяОбработка = Истина;
		
	Если СтандартнаяОбработка Тогда
		
		ВыполнитьТранспортСообщенияОбменаПослеОбработки(СтруктураНастроекОбмена);
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ВыполитьЗагрузкуЧерезWSРесурс(СтруктураНастроекОбмена,Отказ)
	
	WSПрокси = ПолучитьWSПрокси(СтруктураНастроекОбмена);
	
	Если WSПрокси = Неопределено Тогда
	
		ВызватьИсключение "Не удалось определить ws-прокси";
	
	КонецЕсли; 
	
	УзелИнформационнойБазы = СтруктураНастроекОбмена.УзелИнформационнойБазы;
	
	ПравилаКонвертацииОбъектов = ПолучитьЗачитанныеПравилаКонвертацииОбъектов(УзелИнформационнойБазы,СтруктураНастроекОбмена.ИмяПланаОбмена,Истина);
	
	Если ПравилаКонвертацииОбъектов = Неопределено Тогда
		
		// Правила обмена должны быть указаны.
		НСтрока = НСтр("ru = 'Не заданы правила конвертации для плана обмена %1. Загрузка данных отменена.'",
		КодОсновногоЯзыка());
		СтрокаСообщенияОбОшибке = Renault_СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтрока, СтруктураНастроекОбмена.ИмяПланаОбмена);
		ЗаписьЖурналаРегистрацииОбменаДанными(СтрокаСообщенияОбОшибке, СтруктураНастроекОбмена, Истина);
		ЗафиксироватьЗавершениеИнициализацииОбмена(СтруктураНастроекОбмена);
		
		Возврат;
	КонецЕсли;
	
	ИмяФайлаДанных = ПолучитьИмяВременногоФайла("xml");
	
	ДвоичныеДанныеПравила = ПравилаКонвертацииОбъектов.Получить();
	ДвоичныеДанныеПравила.Записать(ИмяФайлаДанных);
	
	ПравилаОбмена = Новый ХранилищеЗначения(ДвоичныеДанныеПравила,Новый СжатиеДанных(9));
	
	ХранилищеСообщенияОбмена 			= Неопределено;
	СообщениеОбОшибке		 			= "";
	СообщениеОбОшибкеПриПолученииНомера = "";
	НомерОтправленного 		 			= 0;         
	
	WSПрокси.ОтправкаДанных(СтруктураНастроекОбмена.ИмяПланаОбмена,СтруктураНастроекОбмена.ТекущийУзелПланаОбменаКод,ПравилаОбмена,ХранилищеСообщенияОбмена,СообщениеОбОшибке);
	WSПрокси.НомерОтправленного(СтруктураНастроекОбмена.ИмяПланаОбмена,СтруктураНастроекОбмена.ТекущийУзелПланаОбменаКод,НомерОтправленного,СообщениеОбОшибкеПриПолученииНомера);
	
	Если Не ПустаяСтрока(СообщениеОбОшибке) Тогда
	
		Отказ = Истина;
		ЗаписьЖурналаРегистрацииОбменаДанными(СообщениеОбОшибке,СтруктураНастроекОбмена,Истина);
		Возврат;
	
	КонецЕсли; 
	
	Если Не ПустаяСтрока(СообщениеОбОшибкеПриПолученииНомера) Тогда
	
		Отказ = Истина;
		ЗаписьЖурналаРегистрацииОбменаДанными(СообщениеОбОшибкеПриПолученииНомера,СтруктураНастроекОбмена,Истина);
		Возврат;
	
	КонецЕсли; 
	
	Если НомерОтправленного <> 0
		И НомерОтправленного <= УзелИнформационнойБазы.НомерПринятого Тогда
	
		Отказ = Истина;
		СтруктураНастроекОбмена.РезультатВыполненияОбмена = Перечисления.DMS_РезультатыВыполненияОбмена.Предупреждение_СообщениеОбменаБылоРанееПринято;
		ЗаписьЖурналаРегистрацииОбменаДанными("Номер принятого меньше или равен ранее принятому",СтруктураНастроекОбмена,Истина);
		Возврат;
	
	КонецЕсли; 
	
	Результат = ХранилищеСообщенияОбмена.Получить();
	
	Результат.Записать(ИмяФайлаДанных);
	
	ОбработкаОбменаДанными = Обработки.DMS_УниверсальныйОбменДаннымиXML.Создать();
	
	ОбработкаОбменаДанными.РежимОбмена = "Загрузка";
	
	ОбработкаОбменаДанными.ИмяФайлаОбмена = ИмяФайлаДанных;
	
	ОбработкаОбменаДанными.ДописыватьДанныеВПротоколОбмена = Ложь;
	ОбработкаОбменаДанными.ВыгружатьТолькоРазрешенные      = Ложь;
	
	ОбработкаОбменаДанными.ИспользоватьТранзакции         = Истина;
	ОбработкаОбменаДанными.КоличествоОбъектовНаТранзакцию = 100;
	
	ОбработкаОбменаДанными.УзелИсточник = СтруктураНастроекОбмена.УзелИнформационнойБазы; 
	
	Попытка
		ОбработкаОбменаДанными.ВыполнитьЗагрузку();
	Исключение
		ЗаписьЖурналаРегистрации("Загрузка файлов",УровеньЖурналаРегистрации.Ошибка,,,КраткоеПредставлениеОшибки(ИнформацияОбОшибке()));
		Отказ = Истина;
		СтруктураНастроекОбмена.РезультатВыполненияОбмена = Перечисления.DMS_РезультатыВыполненияОбмена.Ошибка;
		Возврат;
	КонецПопытки;
	
	УдалитьФайлы(ИмяФайлаДанных);
	
	СтруктураНастроекОбмена.КоличествоОбъектовОбработано = ОбработкаОбменаДанными.мСчетчикЗагруженныхОбъектов;
	
КонецПроцедуры

Процедура ВыполитьВыгрузкуЧерезWSРесурс(СтруктураНастроекОбмена,Отказ)
	
	WSПрокси = ПолучитьWSПрокси(СтруктураНастроекОбмена);
	
	УзелИнформационнойБазы = СтруктураНастроекОбмена.УзелИнформационнойБазы;
	
	ПравилаКонвертацииОбъектов = ПолучитьЗачитанныеПравилаКонвертацииОбъектов(УзелИнформационнойБазы,СтруктураНастроекОбмена.ИмяПланаОбмена);
	
	Если ПравилаКонвертацииОбъектов = Неопределено Тогда
		
		// Правила обмена должны быть указаны.
		НСтрока = НСтр("ru = 'Не заданы правила конвертации для плана обмена %1. Выгрузка данных отменена.'",
		КодОсновногоЯзыка());
		СтрокаСообщенияОбОшибке = Renault_СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтрока, СтруктураНастроекОбмена.ИмяПланаОбмена);
		ЗаписьЖурналаРегистрацииОбменаДанными(СтрокаСообщенияОбОшибке, СтруктураНастроекОбмена, Истина);
		ЗафиксироватьЗавершениеИнициализацииОбмена(СтруктураНастроекОбмена);
		СтруктураНастроекОбмена.РезультатВыполненияОбмена = Перечисления.DMS_РезультатыВыполненияОбмена.Ошибка;
		Отказ = Истина;
		Возврат;
		
	КонецЕсли;
	
	ИмяФайлаДанных 		 = ПолучитьИмяВременногоФайла("xml");
	ИмяФайлаПравилОбмена = ПолучитьИмяВременногоФайла("xml");
	
	ОбработкаОбменаДанными = Обработки.DMS_УниверсальныйОбменДаннымиXML.Создать();
	
	ОбработкаОбменаДанными.РежимОбмена = "Выгрузка";
	
	ОбработкаОбменаДанными.ИмяФайлаОбмена = ИмяФайлаДанных;
		
	ДвоичныеДанныеПравил = ПравилаКонвертацииОбъектов.Получить();
	
	ДвоичныеДанныеПравил.Записать(ИмяФайлаПравилОбмена);
	
	ОбработкаОбменаДанными.ИмяФайлаПравилОбмена = ИмяФайлаПравилОбмена;
	
	ОбработкаОбменаДанными.ЗагрузитьПравилаОбмена();	
	ОбработкаОбменаДанными.ИнициализироватьПервоначальныеЗначенияПараметров();
	
	УстановитьУзелОбменаУСтрокДерева(ОбработкаОбменаДанными.ТаблицаПравилВыгрузки.Строки,УзелИнформационнойБазы);
	
	ОбработкаОбменаДанными.ДописыватьДанныеВПротоколОбмена = Ложь;
	ОбработкаОбменаДанными.ВыгружатьТолькоРазрешенные      = Ложь;
	
	ОбработкаОбменаДанными.ИспользоватьТранзакции         = Истина;
	ОбработкаОбменаДанными.КоличествоОбъектовНаТранзакцию = 100;
	
	ОбработкаОбменаДанными.УзелИсточник = СтруктураНастроекОбмена.УзелИнформационнойБазы; 
	
	Попытка
		ОбработкаОбменаДанными.ВыполнитьВыгрузку();
	Исключение
		ЗаписьЖурналаРегистрации("Отправка файлов для дилеров",УровеньЖурналаРегистрации.Ошибка,,,КраткоеПредставлениеОшибки(ИнформацияОбОшибке()));
		Отказ = Истина;
		СтруктураНастроекОбмена.РезультатВыполненияОбмена = Перечисления.DMS_РезультатыВыполненияОбмена.Ошибка;
		Возврат;
	КонецПопытки;
	
	ДвоичныеДанные = Новый ДвоичныеДанные(ОбработкаОбменаДанными.ИмяФайлаОбмена);
	
	ХранилищеОтправки = Новый ХранилищеЗначения(ДвоичныеДанные,Новый СжатиеДанных(9));
	
	УдалитьФайлы(ИмяФайлаДанных);
	УдалитьФайлы(ИмяФайлаПравилОбмена);
	
	ХранилищеСообщенияОбмена 			= Неопределено;
	СообщениеОбОшибке		 			= "";
	НомерПринятого = УзелИнформационнойБазы.НомерОтправленного;
	
	WSПрокси.ПолучениеДанных(СтруктураНастроекОбмена.ИмяПланаОбмена,СтруктураНастроекОбмена.ТекущийУзелПланаОбменаКод,ХранилищеОтправки,НомерПринятого,СообщениеОбОшибке);
	
	Если Не ПустаяСтрока(СообщениеОбОшибке) Тогда
	
		Отказ = Истина;
		СтруктураНастроекОбмена.РезультатВыполненияОбмена = Перечисления.DMS_РезультатыВыполненияОбмена.Ошибка;
		ЗаписьЖурналаРегистрацииОбменаДанными(СообщениеОбОшибке,СтруктураНастроекОбмена,Истина);
		Возврат;
	
	КонецЕсли; 
		
КонецПроцедуры
 
////#Область ТранспортСообщенийОбмена

// Для внутреннего использования.
// 
Процедура ВыполнитьТранспортСообщенияОбменаПередОбработкой(СтруктураНастроекОбмена)
	
	// Получаем инициализированную обработку транспорта сообщений.
	ОбработкаТранспортаСообщенийОбмена = СтруктураНастроекОбмена.ОбработкаТранспортаСообщенийОбмена;
	
	// Получаем новое имя временного файла.
	Если Не ОбработкаТранспортаСообщенийОбмена.ВыполнитьДействияПередОбработкойСообщения() Тогда
		
		ЗаписьЖурналаРегистрацииОбменаДанными(ОбработкаТранспортаСообщенийОбмена.СтрокаСообщенияОбОшибкеЖР, СтруктураНастроекОбмена, Истина);
		
		СтруктураНастроекОбмена.РезультатВыполненияОбмена = Перечисления.DMS_РезультатыВыполненияОбмена.Ошибка_ТранспортСообщения;
		
	КонецЕсли;
	
КонецПроцедуры

// Для внутреннего использования.
// 
Процедура ВыполнитьИнициализациюОбработкиТранспортаСообщенийОбмена(СтруктураНастроекОбмена)
	
	// Создаем обработку транспорта.
	ОбработкаТранспортаСообщенийОбмена = Обработки[СтруктураНастроекОбмена.ИмяОбработкиТранспортаСообщенийОбмена].Создать();
	
	ЭтоИсходящееСообщение = СтруктураНастроекОбмена.ПроизводитьВыгрузкуДанных;
	
	// Заполняем общие реквизиты, одинаковые для всех обработок транспорта.
	ОбработкаТранспортаСообщенийОбмена.ШаблонИмениФайлаСообщения = ПолучитьШаблонИмениФайлаСообщения(СтруктураНастроекОбмена.ТекущийУзелПланаОбмена, СтруктураНастроекОбмена.УзелИнформационнойБазы, ЭтоИсходящееСообщение);
	
	// Заполняем настойки транспорта, различные для каждой обработки транспорта.
	ЗаполнитьЗначенияСвойств(ОбработкаТранспортаСообщенийОбмена, СтруктураНастроекОбмена.НастройкиТранспорта);
	
	// Инициализируем транспорт
	ОбработкаТранспортаСообщенийОбмена.Инициализация();
	
	СтруктураНастроекОбмена.Вставить("ОбработкаТранспортаСообщенийОбмена", ОбработкаТранспортаСообщенийОбмена);
	
КонецПроцедуры

// Для внутреннего использования.
// 
Процедура ВыполнитьТранспортСообщенияОбменаОтправка(СтруктураНастроекОбмена)
	
	// Получаем инициализированную обработку транспорта сообщений.
	ОбработкаТранспортаСообщенийОбмена = СтруктураНастроекОбмена.ОбработкаТранспортаСообщенийОбмена;
	
	// Отправляем сообщение обмена из временного каталога.
	Если Не ОбработкаТранспортаСообщенийОбмена.ОтправитьСообщение() Тогда
		
		ЗаписьЖурналаРегистрацииОбменаДанными(ОбработкаТранспортаСообщенийОбмена.СтрокаСообщенияОбОшибкеЖР, СтруктураНастроекОбмена, Истина);
		
		СтруктураНастроекОбмена.РезультатВыполненияОбмена = Перечисления.DMS_РезультатыВыполненияОбмена.Ошибка_ТранспортСообщения;
		
	КонецЕсли;
	
КонецПроцедуры

// Для внутреннего использования.
// 
Процедура ВыполнитьТранспортСообщенияОбменаПолучение(СтруктураНастроекОбмена)
	
	// Получаем инициализированную обработку транспорта сообщений.
	ОбработкаТранспортаСообщенийОбмена = СтруктураНастроекОбмена.ОбработкаТранспортаСообщенийОбмена;
	
	// Получаем сообщение обмена во временный каталог.
	Если Не ОбработкаТранспортаСообщенийОбмена.ПолучитьСообщение() Тогда
		
		ЗаписьЖурналаРегистрацииОбменаДанными(ОбработкаТранспортаСообщенийОбмена.СтрокаСообщенияОбОшибкеЖР, СтруктураНастроекОбмена, Истина);
		
		СтруктураНастроекОбмена.РезультатВыполненияОбмена = Перечисления.DMS_РезультатыВыполненияОбмена.Ошибка_ТранспортСообщения;
		
	КонецЕсли;
	
КонецПроцедуры

// Для внутреннего использования.
// 
Процедура ВыполнитьТранспортСообщенияОбменаПослеОбработки(СтруктураНастроекОбмена)
	
	// Получаем инициализированную обработку транспорта сообщений.
	ОбработкаТранспортаСообщенийОбмена = СтруктураНастроекОбмена.ОбработкаТранспортаСообщенийОбмена;
	
	// Выполняем действия после отправки сообщения.
	ОбработкаТранспортаСообщенийОбмена.ВыполнитьДействияПослеОбработкиСообщения();
	
КонецПроцедуры

////#КонецОбласти

////#КонецОбласти

////#Область WS

// Для внутреннего использования.
// 
Функция ПолучитьWSПрокси(СтруктураНастроек, СтрокаСообщенияОбОшибке = "", СообщениеПользователю = "",ДопДанныеПоВебСервису = Неопределено) Экспорт
	
	Если ДопДанныеПоВебСервису <> Неопределено Тогда
		WSURLПространстваИменСервиса = ДопДанныеПоВебСервису.WSURLПространстваИменСервиса;	
		WSИмяСервиса 				 = ДопДанныеПоВебСервису.WSИмяСервиса;	
	Иначе 
		WSURLПространстваИменСервиса = Метаданные.WebСервисы.DMS_MessageExchange.ПространствоИмен;	
		WSИмяСервиса 				 = Метаданные.WebСервисы.DMS_MessageExchange.Имя;	
	КонецЕсли; 
	
	УстановитьПривилегированныйРежим(Истина);
	
	УдалитьНезначащиеСимволыВНастройкахПодключения(СтруктураНастроек);
	                                                           
	СтруктураНастроек.Вставить("WSURLПространстваИменСервиса", WSURLПространстваИменСервиса);
	СтруктураНастроек.Вставить("WSИмяСервиса",				   WSИмяСервиса);
	СтруктураНастроек.Вставить("WSТаймаут", 600);
	
	Возврат ПолучитьWSПроксиПоПараметрамПодключения(СтруктураНастроек, СтрокаСообщенияОбОшибке, СообщениеПользователю);
	
КонецФункции

// Для внутреннего использования.
// 
Функция ПолучитьWSПроксиПоПараметрамПодключения(
					СтруктураНастроек,
					СтрокаСообщенияОбОшибке = "",
					СообщениеПользователю = "",
					ДелатьКонтрольныйВызов = Ложь
	) Экспорт
	
	Попытка
		DMS_ОбменДаннымиКлиентСервер.ПроверитьНедопустимыеСимволыВИмениПользователяWSПрокси(СтруктураНастроек.WSИмяПользователя);
	Исключение
		СообщениеПользователю = КраткоеПредставлениеОшибки(ИнформацияОбОшибке());
		СтрокаСообщенияОбОшибке = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		ЗаписьЖурналаРегистрации(СобытиеЖурналаРегистрацииУстановкаПодключенияКWebСервису(), УровеньЖурналаРегистрации.Ошибка,,, СтрокаСообщенияОбОшибке);
		Возврат Неопределено;
	КонецПопытки;
	
	МестоположениеWSDL = "[URLВебСервиса]?wsdl";
	МестоположениеWSDL = СтрЗаменить(МестоположениеWSDL, "[URLВебСервиса]", СтруктураНастроек.WSURLВебСервиса);
	
	Попытка
		WSПрокси = WSПрокси(
			МестоположениеWSDL,
			СтруктураНастроек.WSURLПространстваИменСервиса,
			СтруктураНастроек.WSИмяСервиса,
			,
			СтруктураНастроек.WSИмяПользователя,
			СтруктураНастроек.WSПароль,
			СтруктураНастроек.WSТаймаут)
	Исключение
		СообщениеПользователю = КраткоеПредставлениеОшибки(ИнформацияОбОшибке());
		СтрокаСообщенияОбОшибке = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		ЗаписьЖурналаРегистрации(СобытиеЖурналаРегистрацииУстановкаПодключенияКWebСервису(), УровеньЖурналаРегистрации.Ошибка,,, СтрокаСообщенияОбОшибке);
		Возврат Неопределено;
	КонецПопытки;
	
	Возврат WSПрокси;
КонецФункции

// Возвращает объект WSПрокси созданный с переданными параметрами.
//
// Параметры соответствуют конструктору объекта WSПрокси.
//
Функция WSПрокси(Знач АдресWSDL, Знач URIПространстваИмен, Знач ИмяСервиса,
	Знач ИмяТочкиПодключения, Знач ИмяПользователя, Знач Пароль, Знач Таймаут) Экспорт
	
	Возврат ВнутренняяWSПрокси(АдресWSDL, URIПространстваИмен, ИмяСервиса, 
		ИмяТочкиПодключения, ИмяПользователя, Пароль, Таймаут);
	
КонецФункции

// Функция возвращает объект WSПрокси созданный с переданными параметрами.
//
// Параметры:
//  АдресWSDL           - Строка - месторасположение wsdl.
//  URIПространстваИмен - Строка - URI пространства имен web-сервиса.
//  ИмяСервиса          - Строка - имя сервиса.
//  ИмяТочкиПодключения - Строка - если не задано, образуется как <ИмяСервиса>Soap.
//  ИмяПользователя     - Строка - имя пользователя для входа на сервер.
//  Пароль              - Строка - пароль пользователя.
//  Таймаут             - Число  - таймаут на операции выполняемые через полученное прокси.
//
// Возвращаемое значение:
//  WSПрокси
//
Функция ВнутренняяWSПрокси(Знач АдресWSDL, Знач URIПространстваИмен, Знач ИмяСервиса,
	Знач ИмяТочкиПодключения, Знач ИмяПользователя, Знач Пароль, Знач Таймаут) Экспорт
	#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
		
		WSОпределения = WSОпределения(АдресWSDL, ИмяПользователя, Пароль);
		
		Если ПустаяСтрока(ИмяТочкиПодключения) Тогда
			ИмяТочкиПодключения = ИмяСервиса + "Soap";
		КонецЕсли;
		
		СистемнаяИнформация = Новый СистемнаяИнформация;
		ВерсияПлатформы = СистемнаяИнформация.ВерсияПриложения;
		
		Прокси		   = Неопределено;
		ИнтернетПрокси = Неопределено;
		
		Если Лев(ВерсияПлатформы,3) = "8.2" Тогда
			Выполнить("ИнтернетПрокси = Неопределено");
			Выполнить("Прокси = Новый WSПрокси(WSОпределения, URIПространстваИмен, ИмяСервиса, ИмяТочкиПодключения, Таймаут)");
		ИначеЕсли Лев(ВерсияПлатформы,3) = "8.3" Тогда 
			Выполнить("ИнтернетПрокси = ПолучитьПрокси(АдресWSDL)");
			Выполнить("Прокси = Новый WSПрокси(WSОпределения, URIПространстваИмен, ИмяСервиса, ИмяТочкиПодключения, ИнтернетПрокси, Таймаут)");
		КонецЕсли; 
		
		Если Прокси <> Неопределено Тогда
			
			Прокси.Пользователь = ИмяПользователя;
			Прокси.Пароль       = Пароль;
			
		КонецЕсли; 
		
		Возврат Прокси;
	#Иначе
		Возврат Неопределено;
	#КонецЕсли
	
КонецФункции

// Функция возвращает объект WSОпределения созданный с переданными параметрами.
//
// Примечание: при получении определения используется кэш, обновление которого осуществляется
//  при смене версии конфигурации. Если для целей отладки требуется обновить
//  значения в кэше, раньше этого времени, следует удалить из регистра сведений.
//  КэшПрограммныхИнтерфейсов соответствующие записи.
//
// Параметры:
//  АдресWSDL       - Строка - месторасположение wsdl.
//  ИмяПользователя - Строка - имя пользователя для входа на сервер.
//  Пароль          - Строка - пароль пользователя.
//  Таймаут         - Число  - таймаут на получение wsdl.
//
// Возвращаемое значение:
//  WSОпределения 
//
Функция WSОпределения(Знач АдресWSDL, Знач ИмяПользователя, Знач Пароль, Знач Таймаут = 10) Экспорт
	
	#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
		
		СистемнаяИнформация = Новый СистемнаяИнформация;
		ВерсияПлатформы = СистемнаяИнформация.ВерсияПриложения;
		
		Прокси = Неопределено;
		
		мWSОпределения = Неопределено;
		
		Если Лев(ВерсияПлатформы,3) = "8.2" Тогда
			Выполнить("мWSОпределения = Новый WSОпределения(АдресWSDL, ИмяПользователя, Пароль,Таймаут)");
		ИначеЕсли Лев(ВерсияПлатформы,3) = "8.3" Тогда 
			Выполнить("мWSОпределения = Новый WSОпределения(АдресWSDL, ИмяПользователя, Пароль, ,Таймаут)");
		КонецЕсли; 
		
		Возврат мWSОпределения;
		
	#Иначе
		Возврат Неопределено;
	#КонецЕсли
	
КонецФункции

// Возвращает объект ИнтернетПрокси для доступа в Интернет.
//
// Параметры:
//   URLИлиПротокол - Строка - url в формате [Протокол://]<Сервер>/<Путь к файлу на сервере>,
//                             либо идентификатор протокола (http, ftp, ...).
//
// Возвращаемое значение:
//   ИнтернетПрокси
//
Функция ПолучитьПрокси(Знач URLИлиПротокол) Экспорт
	
	НастройкаПроксиСервера = НастройкиПроксиНаСервере();
	
	Если Найти(URLИлиПротокол, "://") > 0 Тогда
		Протокол = РазделитьURL(URLИлиПротокол).Протокол;
	Иначе
		Протокол = НРег(URLИлиПротокол);
	КонецЕсли;
	
	Возврат СформироватьИнтернетПрокси(НастройкаПроксиСервера, Протокол);
	
КонецФункции

// Разделяет URL по составным частям: протокол, сервер, путь к ресурсу.
//
// Параметры:
//  URL - Строка - ссылка на ресурс в сети Интернет.
//
// Возвращаемое значение:
//  Структура:
//             Протокол            - Строка - протокол доступа к ресурсу.
//             ИмяСервера          - Строка - сервер, на котором располагается ресурс.
//             ПутьКФайлуНаСервере - Строка - путь к ресурсу на сервере.
//
Функция РазделитьURL(Знач URL) Экспорт
	
	СтруктураURL = СтруктураURI(URL);
	
	Результат = Новый Структура;
	Результат.Вставить("Протокол", ?(ПустаяСтрока(СтруктураURL.Схема), "http", СтруктураURL.Схема));
	Результат.Вставить("ИмяСервера", СтруктураURL.ИмяСервера);
	Результат.Вставить("ПутьКФайлуНаСервере", СтруктураURL.ПутьНаСервере);
	
	Возврат Результат;
	
КонецФункции

// Разбирает строку URI на составные части и возвращает в виде структуры.
// На основе RFC 3986.
//
// Параметры:
//     СтрокаURI - Строка - ссылка на ресурс в формате:
//                          <схема>://<логин>:<пароль>@<хост>:<порт>/<путь>?<параметры>#<якорь>.
//
// Возвращаемое значение:
//     Структура - составные части URI согласно формату:
//         * Схема         - Строка.
//         * Логин         - Строка.
//         * Пароль        - Строка.
//         * ИмяСервера    - Строка - часть <хост>:<порт> входного параметра.
//         * Хост          - Строка.
//         * Порт          - Строка.
//         * ПутьНаСервере - Строка - часть <путь>?<параметры>#<якорь> входного параметра.
//
Функция СтруктураURI(Знач СтрокаURI) Экспорт
	
	СтрокаURI = СокрЛП(СтрокаURI);
	
	// схема
	Схема = "";
	Позиция = Найти(СтрокаURI, "://");
	Если Позиция > 0 Тогда
		Схема = НРег(Лев(СтрокаURI, Позиция - 1));
		СтрокаURI = Сред(СтрокаURI, Позиция + 3);
	КонецЕсли;

	// Строка соединения и путь на сервере.
	СтрокаСоединения = СтрокаURI;
	ПутьНаСервере = "";
	Позиция = Найти(СтрокаСоединения, "/");
	Если Позиция > 0 Тогда
		ПутьНаСервере = Сред(СтрокаСоединения, Позиция + 1);
		СтрокаСоединения = Лев(СтрокаСоединения, Позиция - 1);
	КонецЕсли;
		
	// Информация пользователя и имя сервера.
	СтрокаАвторизации = "";
	ИмяСервера = СтрокаСоединения;
	Позиция = Найти(СтрокаСоединения, "@");
	Если Позиция > 0 Тогда
		СтрокаАвторизации = Лев(СтрокаСоединения, Позиция - 1);
		ИмяСервера = Сред(СтрокаСоединения, Позиция + 1);
	КонецЕсли;
	
	// логин и пароль
	Логин = СтрокаАвторизации;
	Пароль = "";
	Позиция = Найти(СтрокаАвторизации, ":");
	Если Позиция > 0 Тогда
		Логин = Лев(СтрокаАвторизации, Позиция - 1);
		Пароль = Сред(СтрокаАвторизации, Позиция + 1);
	КонецЕсли;
	
	// хост и порт
	Хост = ИмяСервера;
	Порт = "";
	Позиция = Найти(ИмяСервера, ":");
	Если Позиция > 0 Тогда
		Хост = Лев(ИмяСервера, Позиция - 1);
		Порт = Сред(ИмяСервера, Позиция + 1);
	КонецЕсли;
	
	Результат = Новый Структура;
	Результат.Вставить("Схема", Схема);
	Результат.Вставить("Логин", Логин);
	Результат.Вставить("Пароль", Пароль);
	Результат.Вставить("ИмяСервера", ИмяСервера);
	Результат.Вставить("Хост", Хост);
	Результат.Вставить("Порт", ?(ПустаяСтрока(Порт), Неопределено, Число(Порт)));
	Результат.Вставить("ПутьНаСервере", ПутьНаСервере);
	
	Возврат Результат;
	
КонецФункции

// Возвращает прокси по настройкам НастройкаПроксиСервера для заданного протокола Протокол.
//
// Параметры:
//   НастройкаПроксиСервера - Соответствие:
//		ИспользоватьПрокси - использовать ли прокси-сервер.
//		НеИспользоватьПроксиДляЛокальныхАдресов - использовать ли прокси-сервер для локальных адресов.
//		ИспользоватьСистемныеНастройки - использовать ли системные настройки прокси-сервера.
//		Сервер       - адрес прокси-сервера.
//		Порт         - порт прокси-сервера.
//		Пользователь - имя пользователя для авторизации на прокси-сервере.
//		Пароль       - пароль пользователя.
//   Протокол - строка - протокол для которого устанавливаются параметры прокси сервера, например "http", "https",
//                       "ftp".
// 
// Возвращаемое значение:
//   ИнтернетПрокси
// 
Функция СформироватьИнтернетПрокси(НастройкаПроксиСервера, Протокол)
	
	Если НастройкаПроксиСервера = Неопределено Тогда
		// Системные установки прокси-сервера.
		Возврат Неопределено;
	КонецЕсли;	
	
	ИспользоватьПрокси = НастройкаПроксиСервера.Получить("ИспользоватьПрокси");
	Если Не ИспользоватьПрокси Тогда
		// Не использовать прокси-сервер.
		Возврат Новый ИнтернетПрокси(Ложь);
	КонецЕсли;
	
	ИспользоватьСистемныеНастройки = НастройкаПроксиСервера.Получить("ИспользоватьСистемныеНастройки");
	Если ИспользоватьСистемныеНастройки Тогда
		// Системные настройки прокси-сервера.
		Возврат Новый ИнтернетПрокси(Истина);
	КонецЕсли;
			
	// Настройки прокси-сервера, заданные вручную.
	Прокси = Новый ИнтернетПрокси;
	
	// Определение адреса и порта прокси-сервера.
	ДополнительныеНастройки = НастройкаПроксиСервера.Получить("ДополнительныеНастройкиПрокси");
	ПроксиПоПротоколу = Неопределено;
	Если ТипЗнч(ДополнительныеНастройки) = Тип("Соответствие") Тогда
		ПроксиПоПротоколу = ДополнительныеНастройки.Получить(Протокол);
	КонецЕсли;
	
	Если ТипЗнч(ПроксиПоПротоколу) = Тип("Структура") Тогда
		Прокси.Установить(Протокол, ПроксиПоПротоколу.Адрес, ПроксиПоПротоколу.Порт);
	Иначе
		Прокси.Установить(Протокол, НастройкаПроксиСервера["Сервер"], НастройкаПроксиСервера["Порт"]);
	КонецЕсли;
	
	Прокси.НеИспользоватьПроксиДляЛокальныхАдресов = НастройкаПроксиСервера["НеИспользоватьПроксиДляЛокальныхАдресов"];
	Прокси.Пользователь = НастройкаПроксиСервера["Пользователь"];
	Прокси.Пароль       = НастройкаПроксиСервера["Пароль"];
	
	АдресаИсключений = НастройкаПроксиСервера.Получить("НеИспользоватьПроксиДляАдресов");
	Если ТипЗнч(АдресаИсключений) = Тип("Массив") Тогда
		Для каждого АдресИсключения Из АдресаИсключений Цикл
			Прокси.НеИспользоватьПроксиДляАдресов.Добавить(АдресИсключения);
		КонецЦикла;
	КонецЕсли;
			
	Возврат Прокси;
	
КонецФункции


////#КонецОбласти

////#Область СлужебныеПроцедурыИФункции

// Для внутреннего использования.
// 
Функция ПолучитьШаблонИмениФайлаСообщения(ТекущийУзелПланаОбмена, УзелИнформационнойБазы, ЭтоИсходящееСообщение)
	
	УзелОтправитель = ?(ЭтоИсходящееСообщение, ТекущийУзелПланаОбмена, УзелИнформационнойБазы);
	УзелПолучатель  = ?(ЭтоИсходящееСообщение, УзелИнформационнойБазы, ТекущийУзелПланаОбмена);
	
	Возврат ИмяФайлаСообщенияОбмена(СокрЛП(DMS_ОбщегоНазначенияСервер.ЗначениеРеквизитаОбъекта(УзелОтправитель, "Код")),
									СокрЛП(DMS_ОбщегоНазначенияСервер.ЗначениеРеквизитаОбъекта(УзелПолучатель, "Код")));
	//
КонецФункции

// Возвращает имя файла сообщения обмена данными по данным узла-отправителя и узла-получателя.
//
Функция ИмяФайлаСообщенияОбмена(КодУзлаОтправителя, КодУзлаПолучателя) Экспорт
	
	ШаблонИмени = "[Префикс]_[УзелОтправитель]_[УзелПолучатель]";
	
	ШаблонИмени = СтрЗаменить(ШаблонИмени, "[Префикс]",         "Message");
	ШаблонИмени = СтрЗаменить(ШаблонИмени, "[УзелОтправитель]", КодУзлаОтправителя);
	ШаблонИмени = СтрЗаменить(ШаблонИмени, "[УзелПолучатель]",  КодУзлаПолучателя);
	
	Возврат ШаблонИмени;
КонецФункции

// Для внутреннего использования.
// 
Функция СтруктураНастроекОбменаБазовая()
	
	СтруктураНастроекОбмена = Новый Структура;
	
	// Структура настроек по полям запроса.
	
	СтруктураНастроекОбмена.Вставить("ДатаНачала");
	СтруктураНастроекОбмена.Вставить("ДатаОкончания");
	
	СтруктураНастроекОбмена.Вставить("НомерСтроки");
	СтруктураНастроекОбмена.Вставить("НастройкаВыполненияОбмена");
	СтруктураНастроекОбмена.Вставить("НастройкаВыполненияОбменаНаименование");
	СтруктураНастроекОбмена.Вставить("УзелИнформационнойБазы");
	СтруктураНастроекОбмена.Вставить("УзелИнформационнойБазыКод", "");
	СтруктураНастроекОбмена.Вставить("УзелИнформационнойБазыНаименование", "");
	СтруктураНастроекОбмена.Вставить("ВидТранспортаОбмена");
	СтруктураНастроекОбмена.Вставить("ДействиеПриОбмене");
	СтруктураНастроекОбмена.Вставить("КоличествоЭлементовВТранзакции", 1); // На каждый элемент отдельная транзакция.
	СтруктураНастроекОбмена.Вставить("ПроизводитьЗагрузкуДанных", Ложь);
	СтруктураНастроекОбмена.Вставить("ПроизводитьВыгрузкуДанных", Ложь);
	СтруктураНастроекОбмена.Вставить("ИспользоватьПередачуБольшогоОбъемаДанных", Ложь);
	
	// Структура настроек дополнительная.
	СтруктураНастроекОбмена.Вставить("Отказ", Ложь);
	СтруктураНастроекОбмена.Вставить("ЭтоОбменВРИБ", Ложь);
	
	СтруктураНастроекОбмена.Вставить("ОбработкаОбменаДанными");
	СтруктураНастроекОбмена.Вставить("ОбработкаТранспортаСообщенийОбмена");
	
	СтруктураНастроекОбмена.Вставить("ИмяПланаОбмена");
	СтруктураНастроекОбмена.Вставить("ТекущийУзелПланаОбмена");
	СтруктураНастроекОбмена.Вставить("ТекущийУзелПланаОбменаКод");
	
	СтруктураНастроекОбмена.Вставить("ОбменПоПравиламКонвертацииОбъектов", Ложь);
	
	СтруктураНастроекОбмена.Вставить("ИмяОбработкиТранспортаСообщенийОбмена");
	
	СтруктураНастроекОбмена.Вставить("КлючСообщенияЖурналаРегистрации");
	
	СтруктураНастроекОбмена.Вставить("НастройкиТранспорта");
	
	СтруктураНастроекОбмена.Вставить("ПравилаКонвертацииОбъектов");
	СтруктураНастроекОбмена.Вставить("ПравилаЗагружены", Ложь);
	
	СтруктураНастроекОбмена.Вставить("ОтладкаОбработчиковВыгрузки ", Ложь);
	СтруктураНастроекОбмена.Вставить("ОтладкаОбработчиковЗагрузки", Ложь);
	СтруктураНастроекОбмена.Вставить("ИмяФайлаВнешнейОбработкиОтладкиВыгрузки", "");
	СтруктураНастроекОбмена.Вставить("ИмяФайлаВнешнейОбработкиОтладкиЗагрузки", "");
	СтруктураНастроекОбмена.Вставить("РежимПротоколированияОбменаДанными", Ложь);
	СтруктураНастроекОбмена.Вставить("ИмяФайлаПротоколаОбмена", "");
	СтруктураНастроекОбмена.Вставить("ПродолжитьПриОшибке", Ложь);
	
	// Структура для регистрации событий в ЖР.
	СтруктураНастроекОбмена.Вставить("РезультатВыполненияОбмена");
	СтруктураНастроекОбмена.Вставить("ДействиеПриОбмене");
	СтруктураНастроекОбмена.Вставить("КоличествоОбъектовОбработано", 0);
	СтруктураНастроекОбмена.Вставить("СообщениеПриОбмене",           "");
	СтруктураНастроекОбмена.Вставить("СтрокаСообщенияОбОшибке",      "");
	
	Возврат СтруктураНастроекОбмена;
КонецФункции

// Для внутреннего использования.
// 
Процедура ВыполнитьИнициализациюСтруктурыНастроекОбменаДляУзлаИнформационнойБазы(
		СтруктураНастроекОбмена,
		ИспользоватьНастройкиТранспорта)
	                   
	СтруктураСвойств = DMS_ОбщегоНазначенияСервер.ЗначенияРеквизитовОбъекта(СтруктураНастроекОбмена.УзелИнформационнойБазы, "Код, Наименование");
	
	СтруктураНастроекОбмена.УзелИнформационнойБазыКод          = СтруктураСвойств.Код;
	СтруктураНастроекОбмена.УзелИнформационнойБазыНаименование = СтруктураСвойств.Наименование;
	
	// Получаем настройки транспорта обмена.
	СтруктураНастроекОбмена.НастройкиТранспорта = РегистрыСведений.DMS_НастройкиТранспортаОбмена.НастройкиТранспорта(СтруктураНастроекОбмена.УзелИнформационнойБазы);
	
	Если СтруктураНастроекОбмена.НастройкиТранспорта <> Неопределено Тогда
		
		Если ИспользоватьНастройкиТранспорта Тогда
			
			// Если не указан вид транспорта, то используем значение по умолчанию.
			Если СтруктураНастроекОбмена.ВидТранспортаОбмена = Неопределено Тогда
				СтруктураНастроекОбмена.ВидТранспортаОбмена = СтруктураНастроекОбмена.НастройкиТранспорта.ВидТранспортаСообщенийОбменаПоУмолчанию;
			КонецЕсли;
			
			// Если вид транспорта не задан, то используем транспорт FILE.
			Если Не ЗначениеЗаполнено(СтруктураНастроекОбмена.ВидТранспортаОбмена) Тогда
				
				СтруктураНастроекОбмена.ВидТранспортаОбмена = Перечисления.DMS_ВидыТранспортаСообщенийОбмена.FILE;
				
			КонецЕсли;
			
			СтруктураНастроекОбмена.ИмяОбработкиТранспортаСообщенийОбмена = ИмяОбработкиТранспортаСообщенийОбмена(СтруктураНастроекОбмена.ВидТранспортаОбмена);
			
		КонецЕсли;
		
		СтруктураНастроекОбмена.КоличествоЭлементовВТранзакции = КоличествоЭлементовВТранзакцииВыполняемогоДействия(СтруктураНастроекОбмена.ДействиеПриОбмене);
		
		Если СтруктураНастроекОбмена.НастройкиТранспорта.Свойство("WSИспользоватьПередачуБольшогоОбъемаДанных") Тогда
			СтруктураНастроекОбмена.ИспользоватьПередачуБольшогоОбъемаДанных = СтруктураНастроекОбмена.НастройкиТранспорта.WSИспользоватьПередачуБольшогоОбъемаДанных;
		КонецЕсли;
		
	КонецЕсли;
	
	// ЗНАЧЕНИЯ ПО УМОЛЧАНИЮ
	СтруктураНастроекОбмена.НастройкаВыполненияОбмена             = Неопределено;
	СтруктураНастроекОбмена.НастройкаВыполненияОбменаНаименование = "";
	
	// ВЫЧИСЛЯЕМЫЕ ЗНАЧЕНИЯ
	СтруктураНастроекОбмена.ПроизводитьЗагрузкуДанных = (СтруктураНастроекОбмена.ДействиеПриОбмене = Перечисления.DMS_ДействияПриОбмене.ЗагрузкаДанных);
	СтруктураНастроекОбмена.ПроизводитьВыгрузкуДанных = (СтруктураНастроекОбмена.ДействиеПриОбмене = Перечисления.DMS_ДействияПриОбмене.ВыгрузкаДанных);
	
	СтруктураНастроекОбмена.ИмяПланаОбмена = СтруктураНастроекОбмена.УзелИнформационнойБазы.Метаданные().Имя;
	СтруктураНастроекОбмена.ОбменПоПравиламКонвертацииОбъектов = Истина;
	
	СтруктураНастроекОбмена.ТекущийУзелПланаОбмена    = ПланыОбмена[СтруктураНастроекОбмена.ИмяПланаОбмена].ЭтотУзел();
	СтруктураНастроекОбмена.ТекущийУзелПланаОбменаКод = СтруктураНастроекОбмена.ТекущийУзелПланаОбмена.Код;
	
	// Получаем ключ сообщения для ЖР.
	СтруктураНастроекОбмена.КлючСообщенияЖурналаРегистрации = ПолучитьКлючСообщенияЖурналаРегистрации(СтруктураНастроекОбмена.УзелИнформационнойБазы, СтруктураНастроекОбмена.ДействиеПриОбмене);
	
КонецПроцедуры

// Возвращает признак успешного выполнения обмена данными.
//
Функция РезультатВыполненияОбменаВыполнено(РезультатВыполненияОбмена)
	
	Возврат РезультатВыполненияОбмена = Неопределено
		ИЛИ РезультатВыполненияОбмена = Перечисления.DMS_РезультатыВыполненияОбмена.Выполнено
		ИЛИ РезультатВыполненияОбмена = Перечисления.DMS_РезультатыВыполненияОбмена.ВыполненоСПредупреждениями;
	
КонецФункции

// Возвращает имя обработки транспорта сообщений обмена.
//
// Параметры:
//  ВидТранспорта - ПеречислениеСсылка.ВидыТранспортаСообщенийОбмена - вид транспорта, для которого необходимо получить
//                                                                     имя обработки.
// 
//  Возвращаемое значение:
//  Строка - имя обработки транспорта сообщений обмена.
//
Функция ИмяОбработкиТранспортаСообщенийОбмена(ВидТранспорта) Экспорт
	                                                                                  
	Возврат СтрЗаменить("ТранспортСообщенийОбмена[ВидТранспорта]", "[ВидТранспорта]", DMS_ОбщегоНазначенияСервер.ИмяЗначенияПеречисления(ВидТранспорта));
	
КонецФункции

// Для внутреннего использования.
// 
Функция ПолучитьОбработкуОбменаДаннымиДляВыгрузки(СтруктураНастроекОбмена)
	
	МенеджерОбработки = Обработки.DMS_УниверсальныйОбменДаннымиXML;
	
	ОбработкаОбменаДанными = МенеджерОбработки.Создать();
	
	ОбработкаОбменаДанными.РежимОбмена = "Выгрузка";
	
	// Если обработка поддерживает механизм правил конвертации.
	Если ОбработкаОбменаДанными.Метаданные().Реквизиты.Найти("ИмяФайлаПравилОбмена") <> Неопределено Тогда
		УстановитьПравилаОбменаВыгрузкиДанных(ОбработкаОбменаДанными, СтруктураНастроекОбмена);
	КонецЕсли;
		
	ОбработкаОбменаДанными.ИмяФайлаОбмена = СтруктураНастроекОбмена.ОбработкаТранспортаСообщенийОбмена.ИмяФайлаСообщенияОбмена();
	
	ОбработкаОбменаДанными.ЗагрузитьПравилаОбмена();	
	ОбработкаОбменаДанными.ИнициализироватьПервоначальныеЗначенияПараметров();
	
	УстановитьУзелОбменаУСтрокДерева(ОбработкаОбменаДанными.ТаблицаПравилВыгрузки.Строки,СтруктураНастроекОбмена.УзелИнформационнойБазы);
			
	УстановитьОбщиеПараметрыДляОбработкиОбменаДанными(ОбработкаОбменаДанными, СтруктураНастроекОбмена);
	
	Возврат ОбработкаОбменаДанными;
	
КонецФункции

// Для внутреннего использования.
// 
Функция ПолучитьОбработкуОбменаДаннымиДляЗагруки(СтруктураНастроекОбмена)
	
	МенеджерОбработки = Обработки.DMS_УниверсальныйОбменДаннымиXML;
	
	ОбработкаОбменаДанными = МенеджерОбработки.Создать();
	
	ОбработкаОбменаДанными.РежимОбмена = "Загрузка";
			
	ОбработкаОбменаДанными.ИмяФайлаОбмена = СтруктураНастроекОбмена.ОбработкаТранспортаСообщенийОбмена.ИмяФайлаСообщенияОбмена();
	
	УстановитьУзелОбменаУСтрокДерева(ОбработкаОбменаДанными.ТаблицаПравилВыгрузки.Строки,СтруктураНастроекОбмена.УзелИнформационнойБазы);
			
	УстановитьОбщиеПараметрыДляОбработкиОбменаДанными(ОбработкаОбменаДанными, СтруктураНастроекОбмена);
	
	Возврат ОбработкаОбменаДанными;
	
КонецФункции

// Для внутреннего использования.
// 
Процедура УстановитьОбщиеПараметрыДляОбработкиОбменаДанными(ОбработкаОбменаДанными, СтруктураНастроекОбмена, ОбменСБСП20 = Ложь)
		
 	ОбработкаОбменаДанными.ДописыватьДанныеВПротоколОбмена = Ложь;
	ОбработкаОбменаДанными.ВыгружатьТолькоРазрешенные      = Ложь;
	
	ОбработкаОбменаДанными.ИспользоватьТранзакции         = СтруктураНастроекОбмена.КоличествоЭлементовВТранзакции <> 1;
	ОбработкаОбменаДанными.КоличествоОбъектовНаТранзакцию = СтруктураНастроекОбмена.КоличествоЭлементовВТранзакции;
		
КонецПроцедуры

Процедура УстановитьПравилаОбменаВыгрузкиДанных(ОбработкаОбменаДаннымиXML, СтруктураНастроекОбмена)
	
	ПравилаКонвертацииОбъектов = ПолучитьЗачитанныеПравилаКонвертацииОбъектов(СтруктураНастроекОбмена.УзелИнформационнойБазы,СтруктураНастроекОбмена.ИмяПланаОбмена);
	
	Если ПравилаКонвертацииОбъектов = Неопределено Тогда
		
		// Правила обмена должны быть указаны.
		НСтрока = НСтр("ru = 'Не заданы правила конвертации для плана обмена %1. Выгрузка данных отменена.'",
			КодОсновногоЯзыка());
		СтрокаСообщенияОбОшибке = Renault_СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтрока, СтруктураНастроекОбмена.ИмяПланаОбмена);
		ЗаписьЖурналаРегистрацииОбменаДанными(СтрокаСообщенияОбОшибке, СтруктураНастроекОбмена, Истина);
		ЗафиксироватьЗавершениеИнициализацииОбмена(СтруктураНастроекОбмена);
		
		Возврат;
	КонецЕсли;
	
	//ОбработкаОбменаДаннымиXML.СохраненныеНастройки = ПравилаКонвертацииОбъектов;
	
	ИмяФайлаПравилОбмена = ПолучитьИмяВременногоФайла("xml");
	
	ДвоичныеДанныеПравила = ПравилаКонвертацииОбъектов.Получить();
	ДвоичныеДанныеПравила.Записать(ИмяФайлаПравилОбмена);
		
	ОбработкаОбменаДаннымиXML.ИмяФайлаПравилОбмена = ИмяФайлаПравилОбмена;
	
	//Попытка
	//	ОбработкаОбменаДаннымиXML.ВосстановитьПравилаИзВнутреннегоФормата();
	//Исключение
	//	ЗаписьЖурналаРегистрацииОбменаДанными(КраткоеПредставлениеОшибки(ИнформацияОбОшибке()), СтруктураНастроекОбмена, Истина);
	//	ЗафиксироватьЗавершениеИнициализацииОбмена(СтруктураНастроекОбмена);
	//	Возврат;
	//КонецПопытки;
	
КонецПроцедуры

Процедура УстановитьПравилаОбменаЗагрузкиДанных(ОбработкаОбменаДаннымиXML, СтруктураНастроекОбмена)
	
	ПравилаКонвертацииОбъектов = ПолучитьЗачитанныеПравилаКонвертацииОбъектов(СтруктураНастроекОбмена.УзелИнформационнойБазы,СтруктураНастроекОбмена.ИмяПланаОбмена, Истина);
	
	Если ПравилаКонвертацииОбъектов = Неопределено Тогда
		
		// Правила обмена должны быть указаны.
		НСтрока = НСтр("ru = 'Не заданы правила конвертации для плана обмена %1. Загрузка данных отменена.'",
			КодОсновногоЯзыка());
		СтрокаСообщенияОбОшибке = Renault_СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтрока, СтруктураНастроекОбмена.ИмяПланаОбмена);
		ЗаписьЖурналаРегистрацииОбменаДанными(СтрокаСообщенияОбОшибке, СтруктураНастроекОбмена, Истина);
		ЗафиксироватьЗавершениеИнициализацииОбмена(СтруктураНастроекОбмена);
		
		Возврат;
	КонецЕсли;
	
	ОбработкаОбменаДаннымиXML.СохраненныеНастройки = ПравилаКонвертацииОбъектов;
	
	Попытка
		ОбработкаОбменаДаннымиXML.ВосстановитьПравилаИзВнутреннегоФормата();
	Исключение
		ЗаписьЖурналаРегистрацииОбменаДанными(КраткоеПредставлениеОшибки(ИнформацияОбОшибке()), СтруктураНастроекОбмена, Истина);
		ЗафиксироватьЗавершениеИнициализацииОбмена(СтруктураНастроекОбмена);
		Возврат;
	КонецПопытки;
	
КонецПроцедуры

// Для внутреннего использования.
// 
Процедура ЗафиксироватьЗавершениеИнициализацииОбмена(СтруктураНастроекОбмена)
	
	СтруктураНастроекОбмена.Отказ = Истина;
	СтруктураНастроекОбмена.РезультатВыполненияОбмена = Перечисления.DMS_РезультатыВыполненияОбмена.Отменено;
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// Количество элементов в транзакции.

Функция КоличествоЭлементовВТранзакцииЗагрузкиДанных() Экспорт
	
	Возврат 10
	
КонецФункции

Функция КоличествоЭлементовВТранзакцииВыгрузкиДанных() Экспорт
	
	Возврат 1;
	
КонецФункции

Функция КоличествоЭлементовВТранзакцииВыполняемогоДействия(Действие)
	
	Если Действие = Перечисления.DMS_ДействияПриОбмене.ВыгрузкаДанных Тогда
		КоличествоЭлементов = КоличествоЭлементовВТранзакцииВыгрузкиДанных();
	Иначе
		КоличествоЭлементов = КоличествоЭлементовВТранзакцииЗагрузкиДанных();
	КонецЕсли;
	
	Возврат КоличествоЭлементов;
	
КонецФункции

Процедура УстановитьКоличествоЭлементовВТранзакцииЗагрузкиДанных(Количество) Экспорт
	
	
КонецПроцедуры

Процедура ДополнитьНастройкиТранспортаКоличествомЭлементовВТранзакции(Результат) Экспорт
	
	Результат.Вставить("КоличествоЭлементовВТранзакцииВыгрузкиДанных", КоличествоЭлементовВТранзакцииВыгрузкиДанных());
	Результат.Вставить("КоличествоЭлементовВТранзакцииЗагрузкиДанных", КоличествоЭлементовВТранзакцииЗагрузкиДанных());
	
КонецПроцедуры

// Получает зачитанные правила конвертации объектов из ИБ для плана обмена.
//
// Параметры:
//  ИмяПланаОбмена - Строка - имя плана обмена как объекта метаданных.
// 
// Возвращаемое значение:
//  ПравилаЗачитанные - ХранилищеЗначения - зачитанные правила конвертации объектов.
//  Неопределено - Если правила конвертации не были загружены в базу для плана обмена.
//
Функция ПолучитьЗачитанныеПравилаКонвертацииОбъектов(Знач УзелОбмена,Знач ИмяПланаОбмена, ПолучатьПравилаКорреспондента = Ложь) Экспорт
	
	// Возвращаемое значение функции.
	ПравилаЗачитанные = Неопределено;
	
	ИмяМакетаПравил = ?(ПолучатьПравилаКорреспондента,"ПравилаОбменаКорреспондента","ПравилаОбмена");
	
	МакетПравил = УзелОбмена[ИмяМакетаПравил].Получить();
	
	Если МакетПравил = Неопределено Тогда
	
		ОбъектПланОбмена = УзелОбмена.ПолучитьОбъект();
		МакетПравил = ОбъектПланОбмена.ПолучитьМакет(ИмяМакетаПравил);
	
	КонецЕсли;  
				
	ИмяФайлаПравилОбмена = ПолучитьИмяВременногоФайла("xml");
	
	МакетПравил.Записать(ИмяФайлаПравилОбмена,КодировкаТекста.UTF8);
	
	ДвоичныйДокумент = Новый ДвоичныеДанные(ИмяФайлаПравилОбмена);
	
	ПравилаЗачитанные = Новый ХранилищеЗначения(ДвоичныйДокумент,Новый СжатиеДанных(9));
	
	УдалитьФайлы(ИмяФайлаПравилОбмена);
	
	Возврат ПравилаЗачитанные;
	
КонецФункции

////#Область ЗаписьВЖурналРегистрации

// Создает запись в журнале регистрации о событии обмена данными/транспорте сообщений обмена.
//
Процедура ЗаписьЖурналаРегистрацииОбменаДанными(Комментарий, СтруктураНастроекОбмена, ЭтоОшибка = Ложь) Экспорт
	
	Уровень = ?(ЭтоОшибка, УровеньЖурналаРегистрации.Ошибка, УровеньЖурналаРегистрации.Информация);
	
	ЗаписьЖурналаРегистрации(СтруктураНастроекОбмена.КлючСообщенияЖурналаРегистрации, Уровень,,, Комментарий);
	
КонецПроцедуры

// Регистрирует что обмен был произведен и фиксирует информацию в протоколе.
//
// Параметры:
//  СтруктураНастроекОбмена - Структура - структура со всеми необходимыми данными и объектами для выполнения обмена.
// 
Процедура ЗафиксироватьЗавершениеОбмена(СтруктураНастроекОбмена) Экспорт
	
	// Статус "Неопределено" в конце обмена свидетельствует об успешном выполнении обмена.
	Если СтруктураНастроекОбмена.РезультатВыполненияОбмена = Неопределено Тогда
		СтруктураНастроекОбмена.РезультатВыполненияОбмена = Перечисления.DMS_РезультатыВыполненияОбмена.Выполнено;
	КонецЕсли;
	
	// Формируем итоговое сообщение для протокола.
	Если СтруктураНастроекОбмена.ЭтоОбменВРИБ Тогда
		СтрокаСообщения = НСтр("ru = '%1, %2'", КодОсновногоЯзыка());
		СтрокаСообщения = Renault_СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(СтрокаСообщения,
							СтруктураНастроекОбмена.РезультатВыполненияОбмена,
							СтруктураНастроекОбмена.ДействиеПриОбмене);
	Иначе
		СтрокаСообщения = НСтр("ru = '%1, %2; Объектов обработано: %3'", КодОсновногоЯзыка());
		СтрокаСообщения = Renault_СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(СтрокаСообщения,
							СтруктураНастроекОбмена.РезультатВыполненияОбмена,
							СтруктураНастроекОбмена.ДействиеПриОбмене,
							СтруктураНастроекОбмена.КоличествоОбъектовОбработано);
	КонецЕсли;
	
	СтруктураНастроекОбмена.ДатаОкончания = ТекущаяДатаСеанса();
	
	// Фиксируем состояние обмена в РС.
	ЗафиксироватьЗавершениеОбменаВРегистреСведений(СтруктураНастроекОбмена);
	
	// Если обмен данными был успешно выполнен.
	Если РезультатВыполненияОбменаВыполнено(СтруктураНастроекОбмена.РезультатВыполненияОбмена) Тогда
		
		ЗафиксироватьУспешныйОбменДаннымиВРегистреСведений(СтруктураНастроекОбмена);
		
		//РегистрыСведений.ОбщиеНастройкиУзловИнформационныхБаз.СнятьПризнакОтправкиДанных(СтруктураНастроекОбмена.УзелИнформационнойБазы);
		
	КонецЕсли;
	
	ЗаписьЖурналаРегистрацииОбменаДанными(СтрокаСообщения, СтруктураНастроекОбмена);
	
КонецПроцедуры

// Фиксирует состояние обмена данными в регистре сведений DMS_СостоянияОбменовДанными.
//
// Параметры:
//  СтруктураНастроекОбмена - Структура - структура со всеми необходимыми данными и объектами для выполнения обмена.
// 
Процедура ЗафиксироватьЗавершениеОбменаВРегистреСведений(СтруктураНастроекОбмена)
	
	// Создаем структуру для новой записи в РС.
	СтруктураЗаписи = Новый Структура;
	СтруктураЗаписи.Вставить("УзелИнформационнойБазы",    СтруктураНастроекОбмена.УзелИнформационнойБазы);
	СтруктураЗаписи.Вставить("ДействиеПриОбмене",         СтруктураНастроекОбмена.ДействиеПриОбмене);
	
	СтруктураЗаписи.Вставить("РезультатВыполненияОбмена", СтруктураНастроекОбмена.РезультатВыполненияОбмена);
	СтруктураЗаписи.Вставить("ДатаНачала",                СтруктураНастроекОбмена.ДатаНачала);
	СтруктураЗаписи.Вставить("ДатаОкончания",             СтруктураНастроекОбмена.ДатаОкончания);
	
	РегистрыСведений.DMS_СостоянияОбменовДанными.ДобавитьЗапись(СтруктураЗаписи);
	
КонецПроцедуры

// Для внутреннего использования.
// 
Процедура ЗафиксироватьУспешныйОбменДаннымиВРегистреСведений(СтруктураНастроекОбмена)
	
	// Создаем структуру для новой записи в РС.
	СтруктураЗаписи = Новый Структура;
	СтруктураЗаписи.Вставить("УзелИнформационнойБазы", СтруктураНастроекОбмена.УзелИнформационнойБазы);
	СтруктураЗаписи.Вставить("ДействиеПриОбмене",      СтруктураНастроекОбмена.ДействиеПриОбмене);
	СтруктураЗаписи.Вставить("ДатаОкончания",          СтруктураНастроекОбмена.ДатаОкончания);
	
	СтруктураЗаписи.Вставить("РезультатВыполненияОбмена", Перечисления.DMS_РезультатыВыполненияОбмена.Выполнено);

	
	РегистрыСведений.DMS_СостоянияОбменовДанными.ДобавитьЗапись(СтруктураЗаписи);
	
КонецПроцедуры

// Для внутреннего использования.
// 
Процедура ЗаписьЖурналаРегистрацииНачалаОбменаДанными(СтруктураНастроекОбмена) Экспорт
	
	СтрокаСообщения = НСтр("ru = 'Начало процесса обмена данными для узла %1'", КодОсновногоЯзыка());
	СтрокаСообщения = Renault_СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(СтрокаСообщения, СтруктураНастроекОбмена.УзелИнформационнойБазыНаименование);
	ЗаписьЖурналаРегистрацииОбменаДанными(СтрокаСообщения, СтруктураНастроекОбмена);
	
КонецПроцедуры

// Для внутреннего использования.
// 
Функция СобытиеЖурналаРегистрацииОбменДанными() Экспорт
	
	Возврат НСтр("ru = 'Обмен данными'", КодОсновногоЯзыка());
	
КонецФункции

// Возвращает ключ сообщения журнала регистрации.
//
Функция ПолучитьКлючСообщенияЖурналаРегистрации(УзелИнформационнойБазы, ДействиеПриОбмене) Экспорт
	
	ИмяПланаОбмена     = ПолучитьИмяПланаОбмена(УзелИнформационнойБазы);
	
	КлючСообщения = НСтр("ru = 'Обмен данными.[ИмяПланаОбмена].[ДействиеПриОбмене]'",
		КодОсновногоЯзыка());
	
	КлючСообщения = СтрЗаменить(КлючСообщения, "[ИмяПланаОбмена]",    ИмяПланаОбмена);
	КлючСообщения = СтрЗаменить(КлючСообщения, "[ДействиеПриОбмене]", ДействиеПриОбмене);
	
	Возврат КлючСообщения;
	
	
КонецФункции

// Для внутреннего использования.
// 
Функция СобытиеЖурналаРегистрацииУстановкаПодключенияКWebСервису() Экспорт
	
	Возврат НСтр("ru = 'Обмен данными.Установка подключения к web-сервису'", КодОсновногоЯзыка());
	
КонецФункции

////#КонецОбласти

// Для внутреннего использования.
// 
Процедура УдалитьНезначащиеСимволыВНастройкахПодключения(Настройки)
	
	Для Каждого Настройка Из Настройки Цикл
		
		Если ТипЗнч(Настройка.Значение) = Тип("Строка") Тогда
			
			Настройки.Вставить(Настройка.Ключ, СокрЛП(Настройка.Значение));
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

////#КонецОбласти

// Возвращает признак принадлежности узла к плану обмена РИБ.
//
// Параметры:
//  УзелИнформационнойБазы - ПланОбменаСсылка - узел плана обмена, для которого требуется получить значение функции.
// 
//  Возвращаемое значение:
//   Истина - узел принадлежит плану обмена РИБ, иначе Ложь.
//
Функция ЭтоУзелРаспределеннойИнформационнойБазы(Знач УзелИнформационнойБазы) Экспорт

	Возврат УзелИнформационнойБазы.Метаданные().РаспределеннаяИнформационнаяБаза;
	
КонецФункции

// Возвращает код основного языка конфигурации, например "ru".
Функция КодОсновногоЯзыка() Экспорт
	#Если НЕ ТонкийКлиент И НЕ ВебКлиент Тогда
		Возврат Метаданные.ОсновнойЯзык.КодЯзыка;
	#Иначе
		Возврат "ru";
	#КонецЕсли
КонецФункции

// Получает имя плана обмена как объекта метаданного для заданного узла.
//
// Параметры:
//  УзелПланаОбмена - ПланОбменаСсылка, ПланОбменаОбъект - узел плана обмена.
// 
// Возвращаемое значение:
//  Имя - Строка - имя плана обмена как объекта метаданного.
//
Функция ПолучитьИмяПланаОбмена(УзелПланаОбмена) Экспорт
	
	Возврат УзелПланаОбмена.Метаданные().Имя;
	
КонецФункции

// Создает временный каталог сообщений обмена.
// Фиксирует имя каталога в регистре для последующего его удаления.
//
Функция СоздатьВременныйКаталогСообщенийОбмена() Экспорт
	
	Результат = ПолучитьПолноеИмяФайла(КаталогВременныхФайлов(), ИмяВременногоКаталогаСообщенийОбмена());
	
	СоздатьКаталог(Результат);
		
	Возврат Результат;
	
КонецФункции

// Составляет полное имя файла из имени каталога и имени файла.
//
// Параметры:
//  ИмяКаталога  - Строка - путь к каталогу файла на диске.
//  ИмяФайла     - Строка - имя файла, без имени каталога.
//
// Возвращаемое значение:
//   Строка - полное имя файла с учетом каталога.
//
Функция ПолучитьПолноеИмяФайла(Знач ИмяКаталога, Знач ИмяФайла) Экспорт

	Если НЕ ПустаяСтрока(ИмяФайла) Тогда
		
		Слэш = "";
		Если (Прав(ИмяКаталога, 1) <> "\") И (Прав(ИмяКаталога, 1) <> "/") Тогда
			Слэш = ?(Найти(ИмяКаталога, "\") = 0, "/", "\");
		КонецЕсли;
		
		Возврат ИмяКаталога + Слэш + ИмяФайла;
		
	Иначе
		
		Возврат ИмяКаталога;
		
	КонецЕсли;

КонецФункции

// Возвращает имя временного каталога для сообщений обмена данными.
// Имя каталога соответствует шаблону:
// "Exchange82 {GUID}", 
// где GUID - строка уникального идентификатора.
//
// Параметры:
//  Нет.
// 
// Возвращаемое значение:
//  Строка - имя временного каталога для сообщений обмена данными.
//
Функция ИмяВременногоКаталогаСообщенийОбмена() Экспорт
	
	Возврат СтрЗаменить("Exchange82 {GUID}", "GUID", ВРег(Строка(Новый УникальныйИдентификатор)));
	
КонецФункции

// Возвращает параметры настройки прокси-сервера на стороне сервера 1С:Предприятие.
//
// Возвращаемое значение:
//   Соответствие - свойства:
//		ИспользоватьПрокси - использовать ли прокси-сервер.
//		НеИспользоватьПроксиДляЛокальныхАдресов - использовать ли прокси-сервер для локальных адресов.
//		ИспользоватьСистемныеНастройки - использовать ли системные настройки прокси-сервера.
//		Сервер       - адрес прокси-сервера.
//		Порт         - порт прокси-сервера.
//		Пользователь - имя пользователя для авторизации на прокси-сервере.
//		Пароль       - пароль пользователя.
//
Функция НастройкиПроксиНаСервере() Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	НастройкиПроксиНаСервере = Константы.DMS_НастройкаПроксиСервера.Получить().Получить();
		
	Возврат ?(ТипЗнч(НастройкиПроксиНаСервере) = Тип("Соответствие"),
				  НастройкиПроксиНаСервере,
				  Неопределено);
	
КонецФункции

// Сохраняет параметры настройки прокси сервера на стороне сервера 1С:Предприятие.
//
Процедура СохранитьНастройкиПроксиНаСервере1СПредприятие(Знач Настройки) Экспорт
	
	Если НЕ DMS_РекламныеКампанииСервер.ЭтоПолноправныйПользователь() Тогда
		ВызватьИсключение(НСтр("ru = 'Недостаточно прав для выполнения операции'"));
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Истина);
	Константы.DMS_НастройкаПроксиСервера.Установить(Новый ХранилищеЗначения(Настройки));
	
КонецПроцедуры


