Функция ПолучитьОбъектДляЗаписиXML(Адрес)
	
	ЗаписьXML = Новый ЗаписьXML();
	
	ЗаписьXML.ОткрытьФайл(Адрес);
	
	Возврат ЗаписьXML;
	
КонецФункции // ПолучитьОбъектДляЗаписиXML()

Функция ПолучитьСтрокуЗаписиДляXML(Значение) 
	
	СтрокаЗаписи = Строка(Значение);
		
	Если ( ТипЗнч(Значение) = Тип("Число") ) Тогда
		
		СтрокаЗаписи = СтрЗаменить(СтрокаЗаписи, Символы.НПП, "");
		СтрокаЗаписи = СтрЗаменить(СтрокаЗаписи, ",", ".");
		
	ИначеЕсли ( ТипЗнч(Значение) = Тип("Булево") ) Тогда
		
		Если (Значение) Тогда
			СтрокаЗаписи = "true";
		Иначе
			СтрокаЗаписи = "false";
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат СтрокаЗаписи;
	
КонецФункции // ПолучитьСтрокуЗаписиДляXML(Значение)

Процедура ЗаписатьXMLПоСпискуЗначений(ОбъектXML, СписокЗначений) Экспорт
	
	ПрефиксУзлаXML	   = "XMLУзел.";
	ПрефиксАтрибутаXML = "XMLАтрибут.";
	НачалоЭлементаXML  = "XMLНачалоЭлемента";
	КонецЭлементаXML   = "XMLКонецЭлемента";
	ПефиксСекцииXML	   = "XMLСекция";
	
	Для Каждого Элемент Из СписокЗначений Цикл
		Если ( Элемент.Представление = КонецЭлементаXML ) Тогда
			
			ОбъектXML.ЗаписатьКонецЭлемента();
			
		ИначеЕсли ( Элемент.Представление = НачалоЭлементаXML ) Тогда	
			
			ОбъектXML.ЗаписатьНачалоЭлемента(Элемент.Значение);
			
		ИначеЕсли ( Элемент.Представление = "" ) Тогда
			
			ОбъектXML.ЗаписатьТекст(Элемент.Значение);
			
		ИначеЕсли ( Булево(Найти(Элемент.Представление, ПефиксСекцииXML)) ) Тогда
			
			ИмяСекции = СтрЗаменить(Элемент.Представление, ПефиксСекцииXML, "");
			ОбъектXML.ЗаписатьСекциюCDATA(Элемент.Значение);
			
		ИначеЕсли ( Булево(Найти(Элемент.Представление, ПрефиксУзлаXML)) ) Тогда
			
			ИмяУзла = СтрЗаменить(Элемент.Представление, ПрефиксУзлаXML, "");
			ЗаписатьТекстовойУзел(ОбъектXML, ИмяУзла, Элемент.Значение);
			
		ИначеЕсли ( Булево(Найти(Элемент.Представление, ПрефиксАтрибутаXML)) ) Тогда
			
			ИмяАтрибута = СтрЗаменить(Элемент.Представление, ПрефиксАтрибутаXML, "");
			ОбъектXML.ЗаписатьАтрибут(ИмяАтрибута, Элемент.Значение);
			
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры // ЗаписатьXMLПоСпискуЗначений(ОбъектXML, СписокЗначений)

Процедура ЗаписатьТекстовойУзел(ОбъектXML, Имя, Значение) 
	
	СтрокаЗаписи = ПолучитьСтрокуЗаписиДляXML(Значение);
	ОбъектXML.ЗаписатьБезОбработки("<"+Имя+">"+СтрокаЗаписи+"</"+Имя+">");

КонецПроцедуры // ЗаписатьТекстовойУзел(ОбъектXML, Имя, Значение)

///////////////////////////////////////////////
// Процедуры работы со списком структуры XML

Процедура ДобавитьУзелXML(СписокЗначений, НаименованиеУзла, Значение) Экспорт
	
	СписокЗначений.Добавить(Значение, "XMLУзел." + НаименованиеУзла);
	
КонецПроцедуры // ДобавитьУзелXML(СписокЗначений, НаименованиеУзла, Значение)

Процедура ДобавитьНачалоЭлементаXML(СписокЗначений, НаименованиеЭлемента) Экспорт
	
	СписокЗначений.Добавить(НаименованиеЭлемента, "XMLНачалоЭлемента");
	
КонецПроцедуры // ДобавитьНачалоЭлементаXML(СписокЗначений, НаименованиеЭлемента)

Процедура ДобавитьАтрибутXML(СписокЗначений, НаименованиеАтрибута, Значение) Экспорт
	
	СписокЗначений.Добавить(Значение, "XMLАтрибут." + НаименованиеАтрибута);
	
КонецПроцедуры // ДобавитьАтрибутXML(СписокЗначений, НаименованиеАтрибута, Значение)

Процедура ДобавитьТекстXML(СписокЗначений, Значение) Экспорт
	
	СписокЗначений.Добавить(Значение, "");
	
КонецПроцедуры // ДобавитьТекстXML(СписокЗначений, Значение)

Процедура ДобавитьКонецЭлементаXML(СписокЗначений) Экспорт
	
	СписокЗначений.Добавить("", "XMLКонецЭлемента");
	
КонецПроцедуры // ДобавитьКонецЭлементаXML(СписокЗначений)

Процедура ДобавитьСекциюXML(СписокЗначений, Значение)
	
	СписокЗначений.Добавить(Значение, "XMLСекция");
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// Формирование запроса

Функция ПолучитьXMLЗапроса(Выборка) 
	
	//Первоначальная инициализация
	Адрес = ПолучитьИмяВременногоФайла("xml");
	XMLЗапроса = ПолучитьОбъектДляЗаписиXML(Адрес);
	
	СписокСтруктуры = Новый СписокЗначений;
	
	ДобавитьНачалоЭлементаXML(СписокСтруктуры, "Ads");
	ДобавитьАтрибутXML(СписокСтруктуры, "formatVersion", "3");
	//ДобавитьАтрибутXML(СписокСтруктуры, "target", "Avito.ru");
	
	ДобавитьНачалоЭлементаXML(СписокСтруктуры, "Ad");
	
	ДобавитьУзелXML(СписокСтруктуры, "BIR","6101");// Выборка.BIR);
	ДобавитьУзелXML(СписокСтруктуры,"Id",Строка(Выборка.Ссылка.УникальныйИдентификатор())); 
	ДобавитьУзелXML(СписокСтруктуры,"AdStatus", "Free");
	
	ДобавитьУзелXML(СписокСтруктуры,"EMail",Выборка.Емаил);
	ДобавитьУзелXML(СписокСтруктуры,"AllowEmail", "Нет");
	//ДобавитьУзелXML(СписокСтруктуры,"CompanyName", "");
	ДобавитьУзелXML(СписокСтруктуры,"ContactPhone", Выборка.Телефон);
	ДобавитьУзелXML(СписокСтруктуры,"Region", Выборка.Регион);
	Если ЗначениеЗаполнено(Выборка.Город) Тогда
		ДобавитьУзелXML(СписокСтруктуры,"City", Выборка.Город);
	КонецЕсли;
	Если ЗначениеЗаполнено(Выборка.Метро) Тогда
		ДобавитьУзелXML(СписокСтруктуры,"Subway", Выборка.Метро);
	КонецЕсли;
	ДобавитьУзелXML(СписокСтруктуры,"Category", "Автомобили");
	ДобавитьУзелXML(СписокСтруктуры,"CarType", "С пробегом");
	ДобавитьУзелXML(СписокСтруктуры,"Price", Формат(Выборка.ЦенаПродажи,"ЧЦ=10; ЧДЦ=; ЧГ=0"));
	ДобавитьУзелXML(СписокСтруктуры,"Kilometrage", Формат(Выборка.Пробег,"ЧЦ=10; ЧДЦ=; ЧГ=0"));
	ДобавитьУзелXML(СписокСтруктуры,"Accident", "Не битый");
	ДобавитьУзелXML(СписокСтруктуры,"Make", Выборка.Производитель);
	ДобавитьУзелXML(СписокСтруктуры,"Model", Выборка.Модель);
	ДобавитьУзелXML(СписокСтруктуры,"Year", Выборка.ГодВыпуска);
	ДобавитьУзелXML(СписокСтруктуры,"VIN", Выборка.VIN);
	ДобавитьУзелXML(СписокСтруктуры,"BodyType", Выборка.ТипКузова);
	ДобавитьУзелXML(СписокСтруктуры,"Doors", Выборка.КоличествоДверей);
	ДобавитьУзелXML(СписокСтруктуры,"Color", Выборка.Цвет);
	ДобавитьУзелXML(СписокСтруктуры,"EngineSize", Формат(Число(?(СокрЛП(Строка(Выборка.Объем))="",0,Выборка.Объем)),"ЧЦ=10; ЧДЦ=; ЧГ=0"));
	ДобавитьУзелXML(СписокСтруктуры,"Power", Формат(Число(?(СокрЛП(Строка(Выборка.ЛошадиныеСилы))="",0,Выборка.ЛошадиныеСилы)),"ЧЦ=10; ЧДЦ=; ЧГ=0"));
	ДобавитьУзелXML(СписокСтруктуры,"Transmission", Выборка.КПП);
	ДобавитьУзелXML(СписокСтруктуры,"DriveType", "Передний");
	ДобавитьУзелXML(СписокСтруктуры,"WheelType", "Левый");
	ДобавитьУзелXML(СписокСтруктуры,"FuelType", Выборка.ТипТоплива);
	ТекстОпции = "Дополнительное оборудование: ";
	ЕстьОпции = Ложь;
	СтрокаОпций = Выборка.Опции.Выбрать();
	Пока СтрокаОпций.Следующий () Цикл
		Если СтрокаОпций.Выбрана Тогда
			ТекстОпции = ТекстОпции +", " + СтрокаОпций.Опция.Наименование;
			ЕстьОпции = Истина;
		КонецЕсли;
	КонецЦикла;
	ДобавитьУзелXML(СписокСтруктуры,"Description", Прав(""+ Выборка.Объявление + Символы.ПС + ТекстОпции,3000));
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Renault_ФотографииАвтомобилей.Фотография
	|ИЗ
	|	РегистрСведений.Renault_ФотографииАвтомобилей КАК Renault_ФотографииАвтомобилей
	|ГДЕ
	|	Renault_ФотографииАвтомобилей.Автомобиль = &Автомобиль
	|
	|УПОРЯДОЧИТЬ ПО
	|	Renault_ФотографииАвтомобилей.Ракурс.Код";
	Запрос.УстановитьПараметр("Автомобиль", Выборка.Автомобиль);
	
	Результат = Запрос.Выполнить();
	Если Не Результат.Пустой() Тогда
		ВыборкаФото = Результат.Выбрать();
		Для х=1 по 5 Цикл
			Если ВыборкаФото.Следующий()Тогда
				ДобавитьНачалоЭлементаXML(СписокСтруктуры, "Image"+х);
				ДобавитьСекциюXML(СписокСтруктуры, "data:image/jpg;base64,"+ Base64Строка(ВыборкаФото.Фотография.Фотография.Получить()));
				ДобавитьКонецЭлементаXML(СписокСтруктуры);
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	//Закрываем <Ad> 
	ДобавитьКонецЭлементаXML(СписокСтруктуры);
	//Закрываем <Ads>
	ДобавитьКонецЭлементаXML(СписокСтруктуры);
	
	ЗаписатьXMLПоСпискуЗначений(XMLЗапроса, СписокСтруктуры);
	
	XMLЗапроса.Закрыть();
	Возврат Адрес;

КонецФункции

Функция СформироватьФайл (Размещение) Экспорт 
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	Renault_РазмещениеАвтоНаКаналеЦенаПродажи.Цена КАК Цена,
	|	Renault_РазмещениеАвтоНаКаналеЦенаПродажи.Ссылка.Владелец КАК Авто,
	|	Renault_РазмещениеАвтоНаКаналеЦенаПродажи.Ссылка.Объявление КАК Объявление,
	|	Renault_РазмещениеАвтоНаКаналеЦенаПродажи.Ссылка КАК Ссылка,
	|	Renault_РазмещениеАвтоНаКаналеЦенаПродажи.Ссылка.АктивностьОт КАК АктивностьОт,
	|	Renault_РазмещениеАвтоНаКаналеЦенаПродажи.Ссылка.АктивностьДо КАК АктивностьДо,
	|	Renault_РазмещениеАвтоНаКаналеЦенаПродажи.Ссылка.RenaultSelection КАК RenaultSelection,
	|	Renault_РазмещениеАвтоНаКаналеЦенаПродажи.Ссылка.СтатусОбъявления КАК СтатусОбъявления,
	|	Renault_РазмещениеАвтоНаКаналеЦенаПродажи.Ссылка.СостояниеАвтомобиля КАК СостояниеАвтомобиля,
	|	Renault_РазмещениеАвтоНаКаналеЦенаПродажи.Ссылка.ЗаявкаТрейдИн КАК ЗаявкаТрейдИн,
	|	Renault_РазмещениеАвтоНаКаналеЦенаПродажи.Ссылка.КолМесяцевГарантии КАК КолМесяцевГарантии,
	|	Renault_РазмещениеАвтоНаКаналеЦенаПродажи.Ссылка.КодЦвета,
	|	Renault_РазмещениеАвтоНаКаналеЦенаПродажи.Ссылка.Владелец КАК Автомобиль
	|ПОМЕСТИТЬ ВТ_ТЗ
	|ИЗ
	|	Справочник.Renault_РазмещениеАвтоНаКанале.ЦенаПродажи КАК Renault_РазмещениеАвтоНаКаналеЦенаПродажи
	|ГДЕ
	|	Renault_РазмещениеАвтоНаКаналеЦенаПродажи.Ссылка = &Ссылка
	|	И Renault_РазмещениеАвтоНаКаналеЦенаПродажи.ДатаСогласования <> ДАТАВРЕМЯ(1, 1, 1)
	|
	|УПОРЯДОЧИТЬ ПО
	|	Renault_РазмещениеАвтоНаКаналеЦенаПродажи.ДатаУстановки УБЫВ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Renault_CRM_ЗаявкаНаТрейдИн.Пробег КАК Пробег,
	|	Renault_CRM_ЗаявкаНаТрейдИн.VIN КАК VIN,
	|	Renault_CRM_ЗаявкаНаТрейдИн.МодификацияКод.КодМодификации КАК Модификация,
	|	Renault_CRM_ЗаявкаНаТрейдИн.Опции.(
	|		Ссылка КАК Ссылка,
	|		НомерСтроки КАК НомерСтроки,
	|		Опция КАК Опция,
	|		Выбрана КАК Выбрана
	|	) КАК Опции,
	|	CRM_ДилерскиеЦентры.UsedCars_Телефон КАК Телефон,
	|	CRM_ДилерскиеЦентры.UsedCars_Емаил КАК Емаил,
	|	ВТ_ТЗ.Цена,
	|	ВТ_ТЗ.Объявление,
	|	ВТ_ТЗ.АктивностьОт,
	|	ВТ_ТЗ.АктивностьДо,
	|	ВТ_ТЗ.RenaultSelection,
	|	ВТ_ТЗ.СтатусОбъявления,
	|	ВТ_ТЗ.СостояниеАвтомобиля,
	|	ВТ_ТЗ.КолМесяцевГарантии,
	|	ВТ_ТЗ.КодЦвета,
	|	CRM_ДилерскиеЦентры.Бир_ЛМТ,
	|	Renault_CRM_ЗаявкаНаТрейдИн.ОригиналПТС,
	|	ВТ_ТЗ.Ссылка,
	|	Renault_CRM_ЗаявкаНаТрейдИн.КоличествоВладельцевПоПТС КАК КоличествоВладельцев,
	|	ВТ_ТЗ.Автомобиль
	|ИЗ
	|	ВТ_ТЗ КАК ВТ_ТЗ
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.Renault_ЗаявкаНаТрейдИн КАК Renault_CRM_ЗаявкаНаТрейдИн
	|			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.CRM_ДилерскиеЦентры КАК CRM_ДилерскиеЦентры
	|			ПО Renault_CRM_ЗаявкаНаТрейдИн.ДилерскийЦентр = CRM_ДилерскиеЦентры.Ссылка
	|		ПО ВТ_ТЗ.ЗаявкаТрейдИн = Renault_CRM_ЗаявкаНаТрейдИн.Ссылка";
	Запрос.УстановитьПараметр("Ссылка", Размещение);
	Результат = Запрос.Выполнить();
	сОтвет = Новый Структура;
	Если Результат.Пустой() Тогда 
		сОтвет.Вставить("Ошибка", Истина);
	Иначе
		сОтвет.Вставить("Ошибка", Ложь);
	КонецЕсли;
	
	ПолучитьСтруктуруОбъявления(Результат.Выгрузить(), сОтвет);
	
	Возврат сОтвет;
	
КонецФункции

Процедура ПолучитьСтруктуруОбъявления (ТаблицаДанных, сОтвет)
	
	Для Каждого СтрТЗ из ТаблицаДанных Цикл
		сОтвет.Вставить("GUID", Строка(СтрТЗ.Ссылка.УникальныйИдентификатор()));
		сОтвет.Вставить("bir", СтрТЗ.Бир_ЛМТ);
		сОтвет.Вставить("action_from", СтрТЗ.АктивностьОт);
		сОтвет.Вставить("action_before",СтрТЗ.АктивностьДо);
		сОтвет.Вставить("description", СтрТЗ.Объявление);
		сОтвет.Вставить("mileage", СтрТЗ.Пробег);
		сОтвет.Вставить("renault_selection", СтрТЗ.RenaultSelection);
		сОтвет.Вставить("release_date",);
		сОтвет.Вставить("price", СтрТЗ.Цена);
		сОтвет.Вставить("guarantee",СтрТЗ.КолМесяцевГарантии);
		сОтвет.Вставить("owners", СтрТЗ.КоличествоВладельцев);
		сОтвет.Вставить("second_hand", Истина);
		сОтвет.Вставить("vin", СтрТЗ.VIN);
		сОтвет.Вставить("color", СтрТЗ.КодЦвета);
		сОтвет.Вставить("specification", СтрТЗ.Модификация);
		сОтвет.Вставить("status", СтрТЗ.СтатусОбъявления);
		сОтвет.Вставить("condition", СтрТЗ.СостояниеАвтомобиля);
		сОтвет.Вставить("pts", СтрТЗ.ОригиналПТС);
		Если СтрТЗ.Опции.Количество() > 0 Тогда
			мОпций = Новый Массив;
			сСпрОпции = ПолучитьОпцииАвто();
			Для Каждого СтрОтция из СтрТЗ.Опции Цикл
				Если СтрОтция.Выбрана Тогда
					мОпций.Добавить(сСпрОпции[СтрОтция.Опция]);
				КонецЕсли;
			КонецЦикла;
			сОтвет.Вставить("option", мОпций);
		Иначе
			сОтвет.Вставить("option", Неопределено);
		КонецЕсли;
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	Renault_ФотографииАвтомобилей.Фотография,
		|	Renault_ФотографииАвтомобилей.Ракурс
		|ИЗ
		|	РегистрСведений.Renault_ФотографииАвтомобилей КАК Renault_ФотографииАвтомобилей
		|ГДЕ
		|	Renault_ФотографииАвтомобилей.Автомобиль = &Автомобиль
		|
		|УПОРЯДОЧИТЬ ПО
		|	Renault_ФотографииАвтомобилей.Ракурс.Код";
		Запрос.УстановитьПараметр("Автомобиль", СтрТЗ.Автомобиль);
		
		Результат = Запрос.Выполнить();
		Если Не Результат.Пустой() Тогда
			сСпрФото = ПолучитьРакурсыФотограцийАвто();
			
			мФото = Новый Массив;
			ВыборкаФото = Результат.Выбрать();
			Счетчик = 1;
			Пока ВыборкаФото.Следующий() Цикл 
				сФото = Новый Структура;
				сФото.Вставить("name", "Image"+Формат(Счетчик, "ЧГ=0")+".jpg");
				сФото.Вставить("base64", "data:image/jpg;base64,"+ Base64Строка(ВыборкаФото.Фотография.Фотография.Получить()));
				сфото.Вставить("position", сСпрФото[ВыборкаФото.Ракурс]);
				мФото.Добавить(сФото);
				Счетчик = Счетчик +1;
			КонецЦикла;
			сОтвет.Вставить("pictures",мФото);
		иначе
			сОтвет.Вставить("pictures",Неопределено);
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

Функция ПолучитьРакурсыФотограцийАвто ()
	сРакурсы = Новый Соответствие;
	сРакурсы.Вставить(Справочники.Renault_РакурсыФотографий.ФронтальнаяЧастьЛевыйБорт, 1);
	сРакурсы.Вставить(Справочники.Renault_РакурсыФотографий.ЗадняяЧастьПравыйБорт, 2);
	сРакурсы.Вставить(Справочники.Renault_РакурсыФотографий.Интерьер, 3);
	сРакурсы.Вставить(Справочники.Renault_РакурсыФотографий.ЗадниеСиденияОтделкаДверей, 4);
	сРакурсы.Вставить(Справочники.Renault_РакурсыФотографий.Колеса, 5);
	сРакурсы.Вставить(Справочники.Renault_РакурсыФотографий.Дополнительно, 6);
	сРакурсы.Вставить(Справочники.Renault_РакурсыФотографий.ФронтальнаяЧастьПравыйБорт, 11);
	сРакурсы.Вставить(Справочники.Renault_РакурсыФотографий.ЗадняяЧастьЛевыйБорт, 12);
	сРакурсы.Вставить(Справочники.Renault_РакурсыФотографий.ПравыйБорт, 13);
	сРакурсы.Вставить(Справочники.Renault_РакурсыФотографий.ЛевыйБорт, 14);
	сРакурсы.Вставить(Справочники.Renault_РакурсыФотографий.БагажноеОтделение, 15);
	
	Возврат сРакурсы;
КонецФункции

Функция ПолучитьОпцииАвто ()
	
	сОпции = Новый Соответствие;
	сОпции.Вставить(Справочники.Renault_Used_ОпцииАвтомобилей.ABS, 2);
	сОпции.Вставить(Справочники.Renault_Used_ОпцииАвтомобилей.ASR, 1);
	сОпции.Вставить(Справочники.Renault_Used_ОпцииАвтомобилей.ESP, 3);
	сОпции.Вставить(Справочники.Renault_Used_ОпцииАвтомобилей.ПодушкаБезопасностиВодителя, 17);
	сОпции.Вставить(Справочники.Renault_Used_ОпцииАвтомобилей.ПодушкаБезопасностиПассажира, 18);
	сОпции.Вставить(Справочники.Renault_Used_ОпцииАвтомобилей.ПодушкиБезопасностиОконные, 20);
	сОпции.Вставить(Справочники.Renault_Used_ОпцииАвтомобилей.Сигнализация, 40);
	сОпции.Вставить(Справочники.Renault_Used_ОпцииАвтомобилей.ЦентральныйЗамок, 38);
	сОпции.Вставить(Справочники.Renault_Used_ОпцииАвтомобилей.РегулировкаРуляПоВысоте, 117);
	сОпции.Вставить(Справочники.Renault_Used_ОпцииАвтомобилей.РегулировкаРуляПоВысотеиВылету, 118);
	сОпции.Вставить(Справочники.Renault_Used_ОпцииАвтомобилей.СПамятьюПоложения, 111);
	сОпции.Вставить(Справочники.Renault_Used_ОпцииАвтомобилей.Электрорегулировка, 110);
	сОпции.Вставить(Справочники.Renault_Used_ОпцииАвтомобилей.Задние, 144);
	сОпции.Вставить(Справочники.Renault_Used_ОпцииАвтомобилей.Передние, 143);
	сОпции.Вставить(Справочники.Renault_Used_ОпцииАвтомобилей.КлиматКонтроль1зонный, 81);
	сОпции.Вставить(Справочники.Renault_Used_ОпцииАвтомобилей.КлиматКонтроль2зонный, 82);
	сОпции.Вставить(Справочники.Renault_Used_ОпцииАвтомобилей.Кондиционер, 80);
	сОпции.Вставить(Справочники.Renault_Used_ОпцииАвтомобилей.БезУсилителя, 150);
	сОпции.Вставить(Справочники.Renault_Used_ОпцииАвтомобилей.Гидроусилитель, 151);
	сОпции.Вставить(Справочники.Renault_Used_ОпцииАвтомобилей.Электрогидроусилитель, 152);
	сОпции.Вставить(Справочники.Renault_Used_ОпцииАвтомобилей.Электроусилитель, 153);
	сОпции.Вставить(Справочники.Renault_Used_ОпцииАвтомобилей.БортовойКомпьютер, 94);
	сОпции.Вставить(Справочники.Renault_Used_ОпцииАвтомобилей.КруизКонтроль, 86);
	сОпции.Вставить(Справочники.Renault_Used_ОпцииАвтомобилей.Парктроники, 31);
	сОпции.Вставить(Справочники.Renault_Used_ОпцииАвтомобилей.ЭлектроприводЗеркал, 148);
	сОпции.Вставить(Справочники.Renault_Used_ОпцииАвтомобилей.Электростеклоподъемники, 142);
	сОпции.Вставить(Справочники.Renault_Used_ОпцииАвтомобилей.CD, 89);
	сОпции.Вставить(Справочники.Renault_Used_ОпцииАвтомобилей.DVD, 90);
	сОпции.Вставить(Справочники.Renault_Used_ОпцииАвтомобилей.КассетнаяМагнитола, 88);
	сОпции.Вставить(Справочники.Renault_Used_ОпцииАвтомобилей.AUX, 92);
	сОпции.Вставить(Справочники.Renault_Used_ОпцииАвтомобилей.USB, 91);
	сОпции.Вставить(Справочники.Renault_Used_ОпцииАвтомобилей.НавигационнаяСистема, 93);
	сОпции.Вставить(Справочники.Renault_Used_ОпцииАвтомобилей.БиксеноновыеФары, 99);
	сОпции.Вставить(Справочники.Renault_Used_ОпцииАвтомобилей.ГалогенныеФары, 97);
	сОпции.Вставить(Справочники.Renault_Used_ОпцииАвтомобилей.КсеноновыеФары, 98);
	сОпции.Вставить(Справочники.Renault_Used_ОпцииАвтомобилей.СветодиодныеФары, 100);
	сОпции.Вставить(Справочники.Renault_Used_ОпцииАвтомобилей.ДатчикДождя, 61);
	сОпции.Вставить(Справочники.Renault_Used_ОпцииАвтомобилей.ДатчикСвета, 62);
	сОпции.Вставить(Справочники.Renault_Used_ОпцииАвтомобилей.ОбогревЗеркал, 41);
	сОпции.Вставить(Справочники.Renault_Used_ОпцииАвтомобилей.ОмывателиФар, 103);
	сОпции.Вставить(Справочники.Renault_Used_ОпцииАвтомобилей.ВелюровыйСалон, 124);
	сОпции.Вставить(Справочники.Renault_Used_ОпцииАвтомобилей.КожаныйСалон, 125);
	сОпции.Вставить(Справочники.Renault_Used_ОпцииАвтомобилей.КомбинированСалон, 126);
	сОпции.Вставить(Справочники.Renault_Used_ОпцииАвтомобилей.ОбивкаСалонаТкань, 127);
	сОпции.Вставить(Справочники.Renault_Used_ОпцииАвтомобилей.СалонАлькантара, 128);
	сОпции.Вставить(Справочники.Renault_Used_ОпцииАвтомобилей.ЦветСалонаСветлый, 129);
	сОпции.Вставить(Справочники.Renault_Used_ОпцииАвтомобилей.ЦветСалонаТемный, 130);
	сОпции.Вставить(Справочники.Renault_Used_ОпцииАвтомобилей.ЛюкНаКрыше, 122);
	сОпции.Вставить(Справочники.Renault_Used_ОпцииАвтомобилей.ПодогревРуля, 42);
	сОпции.Вставить(Справочники.Renault_Used_ОпцииАвтомобилей.ПодогревСидений, 43);
	
	Возврат сОпции
КонецФункции



