Процедура ПриУстановкеНовогоКода(СтандартнаяОбработка, Префикс)
	Префикс = DMS_ОбщегоНазначенияСервер.ПолучитьПрефикс();
	//Если НЕ спПриУстановкеНовогоКода(ЭтотОбъект, СтандартнаяОбработка, Префикс) Тогда Возврат; КонецЕсли;
КонецПроцедуры

Процедура ПередЗаписью(Отказ)
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	ВычислитьСтатус();
	Если Статус <> Перечисления.Renault_СтатусыРазмещенияНаКаналах.Размещено
		и Статус <> Перечисления.Renault_СтатусыРазмещенияНаКаналах.Отправлено Тогда
		АктивностьОт = ТекущаяДата();
	КонецЕсли;

КонецПроцедуры   

Процедура ПриЗаписи(Отказ)
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
КонецПроцедуры

Процедура ВычислитьСтатус()
		
	Если Фотографии.Количество() = 0 Тогда
		Статус = Перечисления.Renault_СтатусыРазмещенияНаКаналах.ТребуетВводаФотографий;	
	ИначеЕсли ЦенаПродажи.Количество() = 0 Тогда
		Статус = Перечисления.Renault_СтатусыРазмещенияНаКаналах.ТребуетВводаЦеныПродажи;
	ИначеЕсли ЕстьНесогласованныеЦены() Тогда
		Статус = Перечисления.Renault_СтатусыРазмещенияНаКаналах.ТребуетСогласованияЦеныПродажи;
	ИначеЕсли Не ЗначениеЗаполнено(ДатаОтправкиНаКанал) Тогда
		Статус = Перечисления.Renault_СтатусыРазмещенияНаКаналах.ГотовоКОтправке;
	ИначеЕсли ЗначениеЗаполнено(ДатаОтправкиНаКанал) И НЕ ЕстьЗамечанияМодерации() и не ЗначениеЗаполнено(ДатаРазмещенияНаКанале) Тогда 
		Статус = Перечисления.Renault_СтатусыРазмещенияНаКаналах.Отправлено;
	ИначеЕсли ЕстьЗамечанияМодерации() и не ЗначениеЗаполнено(ДатаРазмещенияНаКанале) Тогда
		Статус = Перечисления.Renault_СтатусыРазмещенияНаКаналах.ТребуетсяПравка;
	ИначеЕсли ЗначениеЗаполнено(ДатаРазмещенияНаКанале) Тогда
		Статус = Перечисления.Renault_СтатусыРазмещенияНаКаналах.Размещено;
	КонецЕсли;
	
КонецПроцедуры

Функция ПроверитьСоответствиеСтандартамФотографии()
	
	Результат = Истина;
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Renault_КаналыПродажТребованияКФотографиям.Ракурс,
		|	Renault_КаналыПродажТребованияКФотографиям.Обязательный
		|ИЗ
		|	Справочник.Renault_КаналыПродаж.ТребованияКФотографиям КАК Renault_КаналыПродажТребованияКФотографиям
		|ГДЕ
		|	Renault_КаналыПродажТребованияКФотографиям.Обязательный = &Обязательный";
	
	Запрос.УстановитьПараметр("Обязательный", Истина);
	
	Требования = Запрос.Выполнить().Выгрузить();
	
	Для Каждого СтрокаТребования Из Требования Цикл 
		
		ФотоНайдено = Ложь;
		Для Каждого СтрокаФото Из Фотографии Цикл
			Если СтрокаФото.Ракурс = СтрокаТребования.Ракурс Тогда
				ФотоНайдено = Истина;
			КонецЕсли;
		КонецЦикла;
		
		Если Не ФотоНайдено Тогда
			Результат = Ложь;
			Прервать;
		КонецЕсли;
		
	КонецЦикла;
		
	Возврат Результат;
	
КонецФункции

Функция ЕстьНесогласованныеЦены()
	
	Для Каждого СТрока Из ЦенаПродажи Цикл
		Если Не ЗначениеЗаполнено(Строка.Согласовал) Тогда
			Возврат Истина;
		КонецЕсли;
	КонецЦикла;
	
	Возврат Ложь;
	
КонецФункции

Функция ЕстьЗамечанияМодерации()
	
	Для Каждого Строка Из ЗамечанияМодерации Цикл
		Если Не ЗначениеЗаполнено(Строка.ДатаОтработки) Тогда
			Возврат Истина;
		КонецЕсли;
	КонецЦикла;
	Возврат Ложь;
КонецФункции