
Процедура ОбновитьТаблицы() Экспорт
    СписокДокументов.Очистить();
    Товары.Очистить();

    Если Не ЗначениеЗаполнено(СкладКомпании) Тогда
        Возврат;
    КонецЕсли;

    Запрос = Новый Запрос;

    Запрос.УстановитьПараметр("СкладКомпании",         СкладКомпании);
    Запрос.УстановитьПараметр("ПодразделениеКомпании", СкладКомпании.Подразделение);
    Запрос.УстановитьПараметр("ВидСклада",             СкладКомпании.ВидСклада);

    Запрос.Текст = "ВЫБРАТЬ
                   |    ОстаткиТоваровОрдерныйСклад.Регистратор.ДокументОснование КАК ДокументОснование,
                   |    ОстаткиТоваровОрдерныйСклад.Номенклатура,
                   |    ОстаткиТоваровОрдерныйСклад.ХарактеристикаНоменклатуры,
                   |    СУММА(ОстаткиТоваровОрдерныйСклад.Количество) КАК Количество
                   |ПОМЕСТИТЬ ВТ_Перемещено
                   |ИЗ
                   |    РегистрНакопления.ОстаткиТоваровОрдерныйСклад КАК ОстаткиТоваровОрдерныйСклад
                   |        ЛЕВОЕ СОЕДИНЕНИЕ Документ.Корректировка КАК Корректировка
                   |        ПО ОстаткиТоваровОрдерныйСклад.Регистратор = Корректировка.ДокументОснование
                   |            И (Корректировка.Проведен)
                   |ГДЕ
                   |    (ОстаткиТоваровОрдерныйСклад.Регистратор.ДокументОснование ССЫЛКА Документ.ЗаказВнутренний
                   |            ИЛИ ОстаткиТоваровОрдерныйСклад.Регистратор.ДокументОснование ССЫЛКА Документ.ЗаказПокупателя)
                   |    И Корректировка.Ссылка ЕСТЬ NULL 
                   |
                   |СГРУППИРОВАТЬ ПО
                   |    ОстаткиТоваровОрдерныйСклад.Регистратор.ДокументОснование,
                   |    ОстаткиТоваровОрдерныйСклад.Номенклатура,
                   |    ОстаткиТоваровОрдерныйСклад.ХарактеристикаНоменклатуры
                   |;
                   |
                   |////////////////////////////////////////////////////////////////////////////////
                   |ВЫБРАТЬ
                   |    ЗаказыПокупателейОстатки.Заказ КАК Документ,
                   |    ЗаказыПокупателейОстатки.Заказ.ДокументОснование КАК ДокументОснование,
                   |    ЗаказыПокупателейОстатки.Номенклатура,
                   |    ЗаказыПокупателейОстатки.ХарактеристикаНоменклатуры,
                   |    СУММА(ЗаказыПокупателейОстатки.РезервОстаток) КАК Зарезервировано,
                   |    СУММА(ЕСТЬNULL(ВТ_Перемещено.Количество, 0)) КАК Перемещено
                   |ПОМЕСТИТЬ ВТ_ЗаказыПокупателейПодготовка
                   |ИЗ
                   |    РегистрНакопления.ЗаказыПокупателей.Остатки(, СкладКомпании = &СкладКомпании) КАК ЗаказыПокупателейОстатки
                   |        ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Перемещено КАК ВТ_Перемещено
                   |        ПО ЗаказыПокупателейОстатки.Заказ = ВТ_Перемещено.ДокументОснование
                   |            И ЗаказыПокупателейОстатки.ХарактеристикаНоменклатуры = ВТ_Перемещено.ХарактеристикаНоменклатуры
                   |            И ЗаказыПокупателейОстатки.Номенклатура = ВТ_Перемещено.Номенклатура
                   |
                   |СГРУППИРОВАТЬ ПО
                   |    ЗаказыПокупателейОстатки.Заказ,
                   |    ЗаказыПокупателейОстатки.Номенклатура,
                   |    ЗаказыПокупателейОстатки.ХарактеристикаНоменклатуры,
                   |    ЗаказыПокупателейОстатки.Заказ.ДокументОснование
                   |;
                   |
                   |////////////////////////////////////////////////////////////////////////////////
                   |ВЫБРАТЬ
                   |    ВТ_ЗаказыПокупателейПодготовка.Документ,
                   |    ВТ_ЗаказыПокупателейПодготовка.Номенклатура,
                   |    ВТ_ЗаказыПокупателейПодготовка.ХарактеристикаНоменклатуры,
                   |    ВТ_ЗаказыПокупателейПодготовка.Зарезервировано,
                   |    ВТ_ЗаказыПокупателейПодготовка.Перемещено,
                   |    МАКСИМУМ(ВЫБОР
                   |            КОГДА ВТ_ЗаказыПокупателейПодготовка.ДокументОснование ССЫЛКА Документ.ЗаказНаряд
                   |                ТОГДА ВЫРАЗИТЬ(ВТ_ЗаказыПокупателейПодготовка.ДокументОснование КАК Документ.ЗаказНаряд)
                   |            КОГДА НЕ ЗаказНаряд.Ссылка ЕСТЬ NULL 
                   |                ТОГДА ЗаказНаряд.Ссылка
                   |            КОГДА НЕ Renault_CRM_ЗаявкаНаСервисСчетаНаОплату.Ссылка.ЗаказНаряд ЕСТЬ NULL 
                   |                ТОГДА Renault_CRM_ЗаявкаНаСервисСчетаНаОплату.Ссылка.ЗаказНаряд
                   |            ИНАЧЕ ЗНАЧЕНИЕ(Документ.ЗаказНаряд.ПустаяСсылка)
                   |        КОНЕЦ) КАК ЗаказНаряд,
                   |    МАКСИМУМ(ВЫБОР
                   |            КОГДА ВТ_ЗаказыПокупателейПодготовка.ДокументОснование ССЫЛКА Документ.ЗаказНаряд
                   |                ТОГДА ЛОЖЬ
                   |            КОГДА НЕ ЗаказНаряд.Ссылка ЕСТЬ NULL 
                   |                ТОГДА ЛОЖЬ
                   |            КОГДА Renault_CRM_ЗаявкаНаСервисСчетаНаОплату.Ссылка ЕСТЬ NULL 
                   |                    И ВТ_ЗаказыПокупателейПодготовка.Документ ССЫЛКА Документ.ЗаказПокупателя
                   |                ТОГДА ИСТИНА
                   |            ИНАЧЕ ЛОЖЬ
                   |        КОНЕЦ) КАК ЭтоРеализация
                   |ПОМЕСТИТЬ ВТ_ЗаказыПокупателейПодготовка2
                   |ИЗ
                   |    ВТ_ЗаказыПокупателейПодготовка КАК ВТ_ЗаказыПокупателейПодготовка
                   |        ЛЕВОЕ СОЕДИНЕНИЕ Документ.Renault_CRM_ЗаявкаНаСервис.СчетаНаОплату КАК Renault_CRM_ЗаявкаНаСервисСчетаНаОплату
                   |        ПО ВТ_ЗаказыПокупателейПодготовка.ДокументОснование = Renault_CRM_ЗаявкаНаСервисСчетаНаОплату.СчетНаОплату
                   |        ЛЕВОЕ СОЕДИНЕНИЕ Документ.ЗаказНаряд КАК ЗаказНаряд
                   |        ПО ВТ_ЗаказыПокупателейПодготовка.Документ = ЗаказНаряд.ДокументОснование
                   |
                   |СГРУППИРОВАТЬ ПО
                   |    ВТ_ЗаказыПокупателейПодготовка.Документ,
                   |    ВТ_ЗаказыПокупателейПодготовка.Номенклатура,
                   |    ВТ_ЗаказыПокупателейПодготовка.ХарактеристикаНоменклатуры,
                   |    ВТ_ЗаказыПокупателейПодготовка.Зарезервировано,
                   |    ВТ_ЗаказыПокупателейПодготовка.Перемещено
                   |
                   |ИНДЕКСИРОВАТЬ ПО
                   |    ЗаказНаряд
                   |;
                   |
                   |////////////////////////////////////////////////////////////////////////////////
                   |ВЫБРАТЬ
                   |    ВТ_ЗаказыПокупателейПодготовка2.Документ,
                   |    ВТ_ЗаказыПокупателейПодготовка2.Номенклатура,
                   |    ВТ_ЗаказыПокупателейПодготовка2.ХарактеристикаНоменклатуры,
                   |    ВТ_ЗаказыПокупателейПодготовка2.Зарезервировано,
                   |    ВТ_ЗаказыПокупателейПодготовка2.Перемещено,
                   |    ВТ_ЗаказыПокупателейПодготовка2.ЗаказНаряд,
                   |    ВТ_ЗаказыПокупателейПодготовка2.ЭтоРеализация КАК ЭтоРеализация,
                   |    ВЫБОР
                   |        КОГДА Renault_ВидыРемонтаДопРеквизиты.ВидРемонта ЕСТЬ NULL 
                   |            ТОГДА ЛОЖЬ
                   |        ИНАЧЕ Renault_ВидыРемонтаДопРеквизиты.ГарантияЗавода
                   |    КОНЕЦ КАК ТипЗН
                   |ПОМЕСТИТЬ ВТ_ЗаказыПокупателей
                   |ИЗ
                   |    ВТ_ЗаказыПокупателейПодготовка2 КАК ВТ_ЗаказыПокупателейПодготовка2
                   |        ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.Renault_ВидыРемонтаДопРеквизиты КАК Renault_ВидыРемонтаДопРеквизиты
                   |        ПО ВТ_ЗаказыПокупателейПодготовка2.ЗаказНаряд.ВидРемонта = Renault_ВидыРемонтаДопРеквизиты.ВидРемонта
                   |
                   |ИНДЕКСИРОВАТЬ ПО
                   |    ЭтоРеализация
                   |;
                   |
                   |////////////////////////////////////////////////////////////////////////////////
                   |ВЫБРАТЬ
                   |    ЗаказыПоставщикамОстатки.ЗаказПоставщику КАК Документ,
                   |    ЗаказыПоставщикамОстатки.Номенклатура,
                   |    ЗаказыПоставщикамОстатки.ХарактеристикаНоменклатуры,
                   |    ЗаказыПоставщикамОстатки.ЗаказаноОстаток КАК Заказано,
                   |    ""К приемке от поставщика"" КАК Статус
                   |ПОМЕСТИТЬ ВТ_КПриемкеОтПоставщика
                   |ИЗ
                   |    РегистрНакопления.ЗаказыПоставщикам.Остатки(, ЗаказПоставщику.ПодразделениеКомпании = &ПодразделениеКомпании) КАК ЗаказыПоставщикамОстатки
                   |ГДЕ
                   |    ЗаказыПоставщикамОстатки.ЗаказаноОстаток > 0
                   |;
                   |
                   |////////////////////////////////////////////////////////////////////////////////
                   |ВЫБРАТЬ
                   |    ВТ_ЗаказыПокупателей.Документ,
                   |    ВТ_ЗаказыПокупателей.ЗаказНаряд,
                   |    ВТ_ЗаказыПокупателей.Номенклатура,
                   |    ВТ_ЗаказыПокупателей.ХарактеристикаНоменклатуры,
                   |    ВТ_ЗаказыПокупателей.Зарезервировано - ВТ_ЗаказыПокупателей.Перемещено КАК Количество,
                   |    ""К подбору"" КАК Статус,
                   |    ВТ_ЗаказыПокупателей.ЭтоРеализация,
                   |    ВТ_ЗаказыПокупателей.ТипЗН
                   |ПОМЕСТИТЬ ВТ_КПодбору
                   |ИЗ
                   |    ВТ_ЗаказыПокупателей КАК ВТ_ЗаказыПокупателей
                   |ГДЕ
                   |    (&ВидСклада = ЗНАЧЕНИЕ(Перечисление.ВидыСкладов.Ордерный)
                   |            ИЛИ &ВидСклада = ЗНАЧЕНИЕ(Перечисление.ВидыСкладов.Ячеистый))
                   |    И ВТ_ЗаказыПокупателей.Зарезервировано > ВТ_ЗаказыПокупателей.Перемещено
                   |    И НЕ ВТ_ЗаказыПокупателей.ЭтоРеализация
                   |    И НЕ ВТ_ЗаказыПокупателей.Документ ССЫЛКА Документ.ЗаказВнутренний
                   |;
                   |
                   |////////////////////////////////////////////////////////////////////////////////
                   |ВЫБРАТЬ
                   |    ВТ_ЗаказыПокупателей.Документ,
                   |    ВТ_ЗаказыПокупателей.ЗаказНаряд,
                   |    ВТ_ЗаказыПокупателей.Номенклатура,
                   |    ВТ_ЗаказыПокупателей.ХарактеристикаНоменклатуры,
                   |    ВТ_ЗаказыПокупателей.Зарезервировано - ВТ_ЗаказыПокупателей.Перемещено КАК Количество,
                   |    ""К подбору по реализации"" КАК Статус,
                   |    ВТ_ЗаказыПокупателей.ЭтоРеализация,
                   |    ВТ_ЗаказыПокупателей.ТипЗН
                   |ПОМЕСТИТЬ ВТ_КПодборуРеализация
                   |ИЗ
                   |    ВТ_ЗаказыПокупателей КАК ВТ_ЗаказыПокупателей
                   |ГДЕ
                   |    (&ВидСклада = ЗНАЧЕНИЕ(Перечисление.ВидыСкладов.Ордерный)
                   |            ИЛИ &ВидСклада = ЗНАЧЕНИЕ(Перечисление.ВидыСкладов.Ячеистый))
                   |    И ВТ_ЗаказыПокупателей.Зарезервировано > ВТ_ЗаказыПокупателей.Перемещено
                   |    И ВТ_ЗаказыПокупателей.ЭтоРеализация
                   |;
                   |
                   |////////////////////////////////////////////////////////////////////////////////
                   |ВЫБРАТЬ
                   |    ВТ_ЗаказыПокупателей.Документ,
                   |    ЗНАЧЕНИЕ(Документ.ЗаказНаряд.пустаяссылка) КАК ЗаказНаряд,
                   |    ВТ_ЗаказыПокупателей.Номенклатура,
                   |    ВТ_ЗаказыПокупателей.ХарактеристикаНоменклатуры,
                   |    ВТ_ЗаказыПокупателей.Зарезервировано - ВТ_ЗаказыПокупателей.Перемещено КАК Количество,
                   |    ""К подбору на перемещение"" КАК Статус,
                   |    ЛОЖЬ КАК ЭтоРеализация,
                   |    ВТ_ЗаказыПокупателей.ТипЗН
                   |ПОМЕСТИТЬ ВТ_КПодборуПеремещение
                   |ИЗ
                   |    ВТ_ЗаказыПокупателей КАК ВТ_ЗаказыПокупателей
                   |ГДЕ
                   |    (&ВидСклада = ЗНАЧЕНИЕ(Перечисление.ВидыСкладов.Ордерный)
                   |            ИЛИ &ВидСклада = ЗНАЧЕНИЕ(Перечисление.ВидыСкладов.Ячеистый))
                   |    И ВТ_ЗаказыПокупателей.Зарезервировано > ВТ_ЗаказыПокупателей.Перемещено
                   |    И НЕ ВТ_ЗаказыПокупателей.ЭтоРеализация
                   |    И ВТ_ЗаказыПокупателей.Документ ССЫЛКА Документ.ЗаказВнутренний
                   |;
                   |
                   |////////////////////////////////////////////////////////////////////////////////
                   |ВЫБРАТЬ
                   |    ВТ_ЗаказыПокупателей.Документ,
                   |    ЗНАЧЕНИЕ(Документ.ЗаказНаряд.ПустаяСсылка) КАК ЗаказНаряд,
                   |    ВТ_ЗаказыПокупателей.Номенклатура,
                   |    ВТ_ЗаказыПокупателей.ХарактеристикаНоменклатуры,
                   |    ВЫБОР
                   |        КОГДА &ВидСклада В (ЗНАЧЕНИЕ(Перечисление.ВидыСкладов.Ордерный), ЗНАЧЕНИЕ(Перечисление.ВидыСкладов.Ячеистый))
                   |            ТОГДА ВТ_ЗаказыПокупателей.Перемещено
                   |        ИНАЧЕ ВТ_ЗаказыПокупателей.Зарезервировано
                   |    КОНЕЦ КАК Количество,
                   |    ""К перемещению на другой склад"" КАК Статус,
                   |    ЛОЖЬ КАК ЭтоРеализация,
                   |    ВТ_ЗаказыПокупателей.ТипЗН
                   |ПОМЕСТИТЬ ВТ_КПеремещению
                   |ИЗ
                   |    ВТ_ЗаказыПокупателей КАК ВТ_ЗаказыПокупателей
                   |ГДЕ
                   |    ВЫБОР
                   |            КОГДА &ВидСклада В (ЗНАЧЕНИЕ(Перечисление.ВидыСкладов.Ордерный), ЗНАЧЕНИЕ(Перечисление.ВидыСкладов.Ячеистый))
                   |                ТОГДА ВТ_ЗаказыПокупателей.Перемещено
                   |            ИНАЧЕ ВТ_ЗаказыПокупателей.Зарезервировано
                   |        КОНЕЦ > 0
                   |    И НЕ ВТ_ЗаказыПокупателей.ЭтоРеализация
                   |    И ВТ_ЗаказыПокупателей.Документ ССЫЛКА Документ.ЗаказВнутренний
                   |;
                   |
                   |////////////////////////////////////////////////////////////////////////////////
                   |ВЫБРАТЬ
                   |    ВТ_ЗаказыПокупателей.Документ,
                   |    ВТ_ЗаказыПокупателей.ЗаказНаряд,
                   |    ВТ_ЗаказыПокупателей.Номенклатура,
                   |    ВТ_ЗаказыПокупателей.ХарактеристикаНоменклатуры,
                   |    ВЫБОР
                   |        КОГДА &ВидСклада В (ЗНАЧЕНИЕ(Перечисление.ВидыСкладов.Ордерный), ЗНАЧЕНИЕ(Перечисление.ВидыСкладов.Ячеистый))
                   |            ТОГДА ВЫБОР
                   |                    КОГДА ВТ_ЗаказыПокупателей.Перемещено > ВТ_ЗаказыПокупателей.Зарезервировано
                   |                        ТОГДА ВТ_ЗаказыПокупателей.Зарезервировано
                   |                    ИНАЧЕ ВТ_ЗаказыПокупателей.Перемещено
                   |                КОНЕЦ
                   |        ИНАЧЕ ВТ_ЗаказыПокупателей.Зарезервировано
                   |    КОНЕЦ КАК Количество,
                   |    ""К передаче"" КАК Статус,
                   |    ВТ_ЗаказыПокупателей.ЭтоРеализация,
                   |    ВТ_ЗаказыПокупателей.ТипЗН
                   |ПОМЕСТИТЬ ВТ_КПередаче
                   |ИЗ
                   |    ВТ_ЗаказыПокупателей КАК ВТ_ЗаказыПокупателей
                   |ГДЕ
                   |    ВЫБОР
                   |            КОГДА &ВидСклада В (ЗНАЧЕНИЕ(Перечисление.ВидыСкладов.Ордерный), ЗНАЧЕНИЕ(Перечисление.ВидыСкладов.Ячеистый))
                   |                ТОГДА ВТ_ЗаказыПокупателей.Перемещено
                   |            ИНАЧЕ ВТ_ЗаказыПокупателей.Зарезервировано
                   |        КОНЕЦ > 0
                   |    И НЕ ВТ_ЗаказыПокупателей.ЭтоРеализация
                   |    И НЕ ВТ_ЗаказыПокупателей.Документ ССЫЛКА Документ.ЗаказВнутренний
                   |;
                   |
                   |////////////////////////////////////////////////////////////////////////////////
                   |ВЫБРАТЬ
                   |    ВТ_ЗаказыПокупателей.Документ,
                   |    ВТ_ЗаказыПокупателей.ЗаказНаряд,
                   |    ВТ_ЗаказыПокупателей.Номенклатура,
                   |    ВТ_ЗаказыПокупателей.ХарактеристикаНоменклатуры,
                   |    ВЫБОР
                   |        КОГДА &ВидСклада В (ЗНАЧЕНИЕ(Перечисление.ВидыСкладов.Ордерный), ЗНАЧЕНИЕ(Перечисление.ВидыСкладов.Ячеистый))
                   |            ТОГДА ВЫБОР
                   |                    КОГДА ВТ_ЗаказыПокупателей.Перемещено > ВТ_ЗаказыПокупателей.Зарезервировано
                   |                        ТОГДА ВТ_ЗаказыПокупателей.Зарезервировано
                   |                    ИНАЧЕ ВТ_ЗаказыПокупателей.Перемещено
                   |                КОНЕЦ
                   |        ИНАЧЕ ВТ_ЗаказыПокупателей.Зарезервировано
                   |    КОНЕЦ КАК Количество,
                   |    ""К передаче по реализации"" КАК Статус,
                   |    ВТ_ЗаказыПокупателей.ЭтоРеализация,
                   |    ВТ_ЗаказыПокупателей.ТипЗН
                   |ПОМЕСТИТЬ ВТ_КПередачеРеализация
                   |ИЗ
                   |    ВТ_ЗаказыПокупателей КАК ВТ_ЗаказыПокупателей
                   |ГДЕ
                   |    ВЫБОР
                   |            КОГДА &ВидСклада В (ЗНАЧЕНИЕ(Перечисление.ВидыСкладов.Ордерный), ЗНАЧЕНИЕ(Перечисление.ВидыСкладов.Ячеистый))
                   |                ТОГДА ВТ_ЗаказыПокупателей.Перемещено
                   |            ИНАЧЕ ВТ_ЗаказыПокупателей.Зарезервировано
                   |        КОНЕЦ > 0
                   |    И ВТ_ЗаказыПокупателей.ЭтоРеализация
                   |;
                   |
                   |////////////////////////////////////////////////////////////////////////////////
                   |ВЫБРАТЬ
                   |    ТоварыВПроизводствеОстатки.ЗаказНаряд КАК Документ,
                   |    ТоварыВПроизводствеОстатки.ЗаказНаряд,
                   |    ТоварыВПроизводствеОстатки.Номенклатура,
                   |    ТоварыВПроизводствеОстатки.ХарактеристикаНоменклатуры,
                   |    ТоварыВПроизводствеОстатки.КоличествоОстаток КАК Количество,
                   |    ""К возврату"" КАК Статус,
                   |    ЛОЖЬ КАК ЭтоРеализация,
                   |    ВЫБОР
                   |        КОГДА Renault_ВидыРемонтаДопРеквизиты.ВидРемонта ЕСТЬ NULL 
                   |            ТОГДА ЛОЖЬ
                   |        ИНАЧЕ Renault_ВидыРемонтаДопРеквизиты.ГарантияЗавода
                   |    КОНЕЦ КАК ТипЗН
                   |ПОМЕСТИТЬ ВТ_КВозврату
                   |ИЗ
                   |    РегистрНакопления.ТоварыВПроизводстве.Остатки КАК ТоварыВПроизводствеОстатки
                   |        ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.Renault_ВидыРемонтаДопРеквизиты КАК Renault_ВидыРемонтаДопРеквизиты
                   |        ПО ТоварыВПроизводствеОстатки.ЗаказНаряд.ВидРемонта = Renault_ВидыРемонтаДопРеквизиты.ВидРемонта
                   |ГДЕ
                   |    ТоварыВПроизводствеОстатки.ЗаказНаряд.Состояние = ЗНАЧЕНИЕ(Справочник.ВидыСостоянийЗаказНарядов.Закрыт)
                   |    И ТоварыВПроизводствеОстатки.Цех.СкладКомпании = &СкладКомпании
                   |;
                   |
                   |////////////////////////////////////////////////////////////////////////////////
                   |ВЫБРАТЬ
                   |    ВЫРАЗИТЬ(ВЫРАЗИТЬ(ОстаткиТоваровОрдерныйСклад.Регистратор КАК Документ.ПриходныйСкладскойОрдер).ДокументОснование КАК Документ.ПоступлениеТоваров) КАК Документ,
                   |    ОстаткиТоваровОрдерныйСклад.Номенклатура,
                   |    ОстаткиТоваровОрдерныйСклад.ХарактеристикаНоменклатуры,
                   |    СУММА(ОстаткиТоваровОрдерныйСклад.Количество) КАК Размещено
                   |ПОМЕСТИТЬ ВТ_Размещено
                   |ИЗ
                   |    РегистрНакопления.ОстаткиТоваровОрдерныйСклад КАК ОстаткиТоваровОрдерныйСклад
                   |        ЛЕВОЕ СОЕДИНЕНИЕ Документ.Корректировка КАК Корректировка
                   |        ПО ОстаткиТоваровОрдерныйСклад.Регистратор = Корректировка.ДокументОснование
                   |            И (Корректировка.Проведен)
                   |        ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ПоступлениеТоваров КАК ПоступлениеТоваров
                   |        ПО ОстаткиТоваровОрдерныйСклад.Регистратор.ДокументОснование = ПоступлениеТоваров.Ссылка
                   |            И (ОстаткиТоваровОрдерныйСклад.Регистратор ССЫЛКА Документ.ПриходныйСкладскойОрдер)
                   |            И (ОстаткиТоваровОрдерныйСклад.СкладКомпании = &СкладКомпании)
                   |ГДЕ
                   |    Корректировка.Ссылка ЕСТЬ NULL 
                   |
                   |СГРУППИРОВАТЬ ПО
                   |    ОстаткиТоваровОрдерныйСклад.Номенклатура,
                   |    ОстаткиТоваровОрдерныйСклад.ХарактеристикаНоменклатуры,
                   |    ВЫРАЗИТЬ(ВЫРАЗИТЬ(ОстаткиТоваровОрдерныйСклад.Регистратор КАК Документ.ПриходныйСкладскойОрдер).ДокументОснование КАК Документ.ПоступлениеТоваров)
                   |
                   |ИНДЕКСИРОВАТЬ ПО
                   |    Документ
                   |;
                   |
                   |////////////////////////////////////////////////////////////////////////////////
                   |ВЫБРАТЬ
                   |    ПоступленияПодготовка.Документ,
                   |    ПоступленияПодготовка.Номенклатура,
                   |    ПоступленияПодготовка.ХарактеристикаНоменклатуры,
                   |    СУММА(ПоступленияПодготовка.Поступило) КАК Поступило
                   |ПОМЕСТИТЬ ВТ_Поступления
                   |ИЗ
                   |    (ВЫБРАТЬ
                   |        ВЫРАЗИТЬ(ОстаткиТоваровКомпании.Регистратор КАК Документ.ПоступлениеТоваров) КАК Документ,
                   |        ОстаткиТоваровКомпании.Номенклатура КАК Номенклатура,
                   |        ОстаткиТоваровКомпании.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
                   |        СУММА(ОстаткиТоваровКомпании.Количество) КАК Поступило
                   |    ИЗ
                   |        РегистрНакопления.ОстаткиТоваровКомпании КАК ОстаткиТоваровКомпании
                   |            ЛЕВОЕ СОЕДИНЕНИЕ Документ.Корректировка КАК Корректировка
                   |            ПО ОстаткиТоваровКомпании.Регистратор = Корректировка.ДокументОснование
                   |                И (Корректировка.Проведен)
                   |    ГДЕ
                   |        ОстаткиТоваровКомпании.СкладКомпании = &СкладКомпании
                   |        И ОстаткиТоваровКомпании.Регистратор ССЫЛКА Документ.ПоступлениеТоваров
                   |        И Корректировка.Ссылка ЕСТЬ NULL 
                   |    
                   |    СГРУППИРОВАТЬ ПО
                   |        ОстаткиТоваровКомпании.Номенклатура,
                   |        ОстаткиТоваровКомпании.ХарактеристикаНоменклатуры,
                   |        ВЫРАЗИТЬ(ОстаткиТоваровКомпании.Регистратор КАК Документ.ПоступлениеТоваров)
                   |    
                   |    ОБЪЕДИНИТЬ ВСЕ
                   |    
                   |    ВЫБРАТЬ
                   |        ВЫРАЗИТЬ(ОстаткиТоваровКомпании.Регистратор КАК Документ.КорректировкаПоступления).ДокументОснование,
                   |        ОстаткиТоваровКомпании.Номенклатура,
                   |        ОстаткиТоваровКомпании.ХарактеристикаНоменклатуры,
                   |        ОстаткиТоваровКомпании.Количество
                   |    ИЗ
                   |        РегистрНакопления.ОстаткиТоваровКомпании КАК ОстаткиТоваровКомпании
                   |            ЛЕВОЕ СОЕДИНЕНИЕ Документ.Корректировка КАК Корректировка
                   |            ПО ОстаткиТоваровКомпании.Регистратор = Корректировка.ДокументОснование
                   |                И (Корректировка.Проведен)
                   |    ГДЕ
                   |        ОстаткиТоваровКомпании.СкладКомпании = &СкладКомпании
                   |        И Корректировка.Ссылка ЕСТЬ NULL 
                   |        И ОстаткиТоваровКомпании.Регистратор ССЫЛКА Документ.КорректировкаПоступления) КАК ПоступленияПодготовка
                   |
                   |СГРУППИРОВАТЬ ПО
                   |    ПоступленияПодготовка.Документ,
                   |    ПоступленияПодготовка.Номенклатура,
                   |    ПоступленияПодготовка.ХарактеристикаНоменклатуры
                   |
                   |ИНДЕКСИРОВАТЬ ПО
                   |    ПоступленияПодготовка.Документ
                   |;
                   |
                   |////////////////////////////////////////////////////////////////////////////////
                   |ВЫБРАТЬ
                   |    ЕСТЬNULL(ВТ_Поступления.Документ, ВТ_Размещено.Документ) КАК Документ,
                   |    ЕСТЬNULL(ВТ_Поступления.Номенклатура, ВТ_Размещено.Номенклатура) КАК Номенклатура,
                   |    ЕСТЬNULL(ВТ_Поступления.ХарактеристикаНоменклатуры, ВТ_Размещено.ХарактеристикаНоменклатуры) КАК ХарактеристикаНоменклатуры,
                   |    ЕСТЬNULL(ВТ_Поступления.Поступило, 0) - ЕСТЬNULL(ВТ_Размещено.Размещено, 0) КАК Количество,
                   |    ""К размещению"" КАК Статус
                   |ПОМЕСТИТЬ ВТ_КРазмещению
                   |ИЗ
                   |    ВТ_Поступления КАК ВТ_Поступления
                   |        ПОЛНОЕ СОЕДИНЕНИЕ ВТ_Размещено КАК ВТ_Размещено
                   |        ПО ВТ_Поступления.Документ = ВТ_Размещено.Документ
                   |            И ВТ_Поступления.Номенклатура = ВТ_Размещено.Номенклатура
                   |            И ВТ_Поступления.ХарактеристикаНоменклатуры = ВТ_Размещено.ХарактеристикаНоменклатуры
                   |ГДЕ
                   |    &ВидСклада В (ЗНАЧЕНИЕ(Перечисление.ВидыСкладов.Ордерный), ЗНАЧЕНИЕ(Перечисление.ВидыСкладов.Ячеистый))
                   |;
                   |
                   |////////////////////////////////////////////////////////////////////////////////
                   |ВЫБРАТЬ
                   |    ВТ_КПодбору.Документ,
                   |    ВТ_КПодбору.ЗаказНаряд,
                   |    ВТ_КПодбору.Номенклатура,
                   |    ВТ_КПодбору.ХарактеристикаНоменклатуры,
                   |    ВТ_КПодбору.Количество,
                   |    ВТ_КПодбору.Статус,
                   |    ВТ_КПодбору.Номенклатура.Артикул КАК Артикул,
                   |    ВТ_КПодбору.ТипЗН
                   |ИЗ
                   |    ВТ_КПодбору КАК ВТ_КПодбору
                   |
                   |ОБЪЕДИНИТЬ ВСЕ
                   |
                   |ВЫБРАТЬ
                   |    ВТ_КПодборуРеализация.Документ,
                   |    ВТ_КПодборуРеализация.ЗаказНаряд,
                   |    ВТ_КПодборуРеализация.Номенклатура,
                   |    ВТ_КПодборуРеализация.ХарактеристикаНоменклатуры,
                   |    ВТ_КПодборуРеализация.Количество,
                   |    ВТ_КПодборуРеализация.Статус,
                   |    ВТ_КПодборуРеализация.Номенклатура.Артикул,
                   |    ВТ_КПодборуРеализация.ТипЗН
                   |ИЗ
                   |    ВТ_КПодборуРеализация КАК ВТ_КПодборуРеализация
                   |
                   |ОБЪЕДИНИТЬ ВСЕ
                   |
                   |ВЫБРАТЬ
                   |    ВТ_КПодборуПеремещение.Документ,
                   |    ВТ_КПодборуПеремещение.ЗаказНаряд,
                   |    ВТ_КПодборуПеремещение.Номенклатура,
                   |    ВТ_КПодборуПеремещение.ХарактеристикаНоменклатуры,
                   |    ВТ_КПодборуПеремещение.Количество,
                   |    ВТ_КПодборуПеремещение.Статус,
                   |    ВТ_КПодборуПеремещение.Номенклатура.Артикул,
                   |    ВТ_КПодборуПеремещение.ТипЗН
                   |ИЗ
                   |    ВТ_КПодборуПеремещение КАК ВТ_КПодборуПеремещение
                   |
                   |ОБЪЕДИНИТЬ ВСЕ
                   |
                   |ВЫБРАТЬ
                   |    ВТ_КПередаче.Документ,
                   |    ВТ_КПередаче.ЗаказНаряд,
                   |    ВТ_КПередаче.Номенклатура,
                   |    ВТ_КПередаче.ХарактеристикаНоменклатуры,
                   |    ВТ_КПередаче.Количество,
                   |    ВТ_КПередаче.Статус,
                   |    ВТ_КПередаче.Номенклатура.Артикул,
                   |    ВТ_КПередаче.ТипЗН
                   |ИЗ
                   |    ВТ_КПередаче КАК ВТ_КПередаче
                   |
                   |ОБЪЕДИНИТЬ ВСЕ
                   |
                   |ВЫБРАТЬ
                   |    ВТ_КВозврату.Документ,
                   |    ВТ_КВозврату.ЗаказНаряд,
                   |    ВТ_КВозврату.Номенклатура,
                   |    ВТ_КВозврату.ХарактеристикаНоменклатуры,
                   |    ВТ_КВозврату.Количество,
                   |    ВТ_КВозврату.Статус,
                   |    ВТ_КВозврату.Номенклатура.Артикул,
                   |    ВТ_КВозврату.ТипЗН
                   |ИЗ
                   |    ВТ_КВозврату КАК ВТ_КВозврату
                   |
                   |ОБЪЕДИНИТЬ ВСЕ
                   |
                   |ВЫБРАТЬ
                   |    ВТ_КПередачеРеализация.Документ,
                   |    ВТ_КПередачеРеализация.ЗаказНаряд,
                   |    ВТ_КПередачеРеализация.Номенклатура,
                   |    ВТ_КПередачеРеализация.ХарактеристикаНоменклатуры,
                   |    ВТ_КПередачеРеализация.Количество,
                   |    ВТ_КПередачеРеализация.Статус,
                   |    ВТ_КПередачеРеализация.Номенклатура.Артикул,
                   |    ВТ_КПередачеРеализация.ТипЗН
                   |ИЗ
                   |    ВТ_КПередачеРеализация КАК ВТ_КПередачеРеализация
                   |
                   |ОБЪЕДИНИТЬ ВСЕ
                   |
                   |ВЫБРАТЬ
                   |    ВТ_КПеремещению.Документ,
                   |    ВТ_КПеремещению.ЗаказНаряд,
                   |    ВТ_КПеремещению.Номенклатура,
                   |    ВТ_КПеремещению.ХарактеристикаНоменклатуры,
                   |    ВТ_КПеремещению.Количество,
                   |    ВТ_КПеремещению.Статус,
                   |    ВТ_КПеремещению.Номенклатура.Артикул,
                   |    ВТ_КПеремещению.ТипЗН
                   |ИЗ
                   |    ВТ_КПеремещению КАК ВТ_КПеремещению
                   |
                   |ОБЪЕДИНИТЬ ВСЕ
                   |
                   |ВЫБРАТЬ
                   |    ВТ_КПриемкеОтПоставщика.Документ,
                   |    ЗНАЧЕНИЕ(Документ.ЗаказНаряд.ПустаяСсылка),
                   |    ВТ_КПриемкеОтПоставщика.Номенклатура,
                   |    ВТ_КПриемкеОтПоставщика.ХарактеристикаНоменклатуры,
                   |    ВТ_КПриемкеОтПоставщика.Заказано,
                   |    ВТ_КПриемкеОтПоставщика.Статус,
                   |    ВТ_КПриемкеОтПоставщика.Номенклатура.Артикул,
                   |    ЛОЖЬ
                   |ИЗ
                   |    ВТ_КПриемкеОтПоставщика КАК ВТ_КПриемкеОтПоставщика
                   |
                   |ОБЪЕДИНИТЬ ВСЕ
                   |
                   |ВЫБРАТЬ
                   |    ВТ_КРазмещению.Документ,
                   |    ЗНАЧЕНИЕ(Документ.ЗаказНаряд.ПустаяСсылка),
                   |    ВТ_КРазмещению.Номенклатура,
                   |    ВТ_КРазмещению.ХарактеристикаНоменклатуры,
                   |    ВТ_КРазмещению.Количество,
                   |    ВТ_КРазмещению.Статус,
                   |    ВТ_КРазмещению.Номенклатура.Артикул,
                   |    ЛОЖЬ
                   |ИЗ
                   |    ВТ_КРазмещению КАК ВТ_КРазмещению
                   |;
                   |
                   |////////////////////////////////////////////////////////////////////////////////
                   |ВЫБРАТЬ РАЗЛИЧНЫЕ
                   |    ВТ_КПодбору.Документ КАК Документ,
                   |    ВТ_КПодбору.ЗаказНаряд КАК ЗаказНаряд,
                   |    ВТ_КПодбору.Статус КАК Статус,
                   |    ВТ_КПодбору.ЭтоРеализация,
                   |    ВТ_КПодбору.ТипЗН,
                   |    ВТ_КПодбору.Количество,
                   |    ВТ_КПодбору.Документ.Дата КАК Дата
                   |ИЗ
                   |    ВТ_КПодбору КАК ВТ_КПодбору
                   |
                   |ОБЪЕДИНИТЬ
                   |
                   |ВЫБРАТЬ РАЗЛИЧНЫЕ
                   |    ВТ_КПередаче.Документ,
                   |    ВТ_КПередаче.ЗаказНаряд,
                   |    ВТ_КПередаче.Статус,
                   |    ВТ_КПередаче.ЭтоРеализация,
                   |    ВТ_КПередаче.ТипЗН,
                   |    ВТ_КПередаче.Количество,
                   |    ВТ_КПередаче.Документ.Дата
                   |ИЗ
                   |    ВТ_КПередаче КАК ВТ_КПередаче
                   |
                   |ОБЪЕДИНИТЬ
                   |
                   |ВЫБРАТЬ
                   |    ВТ_КПодборуРеализация.Документ,
                   |    ВТ_КПодборуРеализация.ЗаказНаряд,
                   |    ВТ_КПодборуРеализация.Статус,
                   |    ВТ_КПодборуРеализация.ЭтоРеализация,
                   |    ВТ_КПодборуРеализация.ТипЗН,
                   |    ВТ_КПодборуРеализация.Количество,
                   |    ВТ_КПодборуРеализация.Документ.Дата
                   |ИЗ
                   |    ВТ_КПодборуРеализация КАК ВТ_КПодборуРеализация
                   |
                   |ОБЪЕДИНИТЬ
                   |
                   |ВЫБРАТЬ
                   |    ВТ_КПередачеРеализация.Документ,
                   |    ВТ_КПередачеРеализация.ЗаказНаряд,
                   |    ВТ_КПередачеРеализация.Статус,
                   |    ВТ_КПередачеРеализация.ЭтоРеализация,
                   |    ВТ_КПередачеРеализация.ТипЗН,
                   |    ВТ_КПередачеРеализация.Количество,
                   |    ВТ_КПередачеРеализация.Документ.Дата
                   |ИЗ
                   |    ВТ_КПередачеРеализация КАК ВТ_КПередачеРеализация
                   |
                   |ОБЪЕДИНИТЬ
                   |
                   |ВЫБРАТЬ
                   |    ВТ_КПодборуПеремещение.Документ,
                   |    ВТ_КПодборуПеремещение.ЗаказНаряд,
                   |    ВТ_КПодборуПеремещение.Статус,
                   |    ВТ_КПодборуПеремещение.ЭтоРеализация,
                   |    ВТ_КПодборуПеремещение.ТипЗН,
                   |    ВТ_КПодборуПеремещение.Количество,
                   |    ВТ_КПодборуПеремещение.Документ.Дата
                   |ИЗ
                   |    ВТ_КПодборуПеремещение КАК ВТ_КПодборуПеремещение
                   |
                   |ОБЪЕДИНИТЬ
                   |
                   |ВЫБРАТЬ
                   |    ВТ_КПеремещению.Документ,
                   |    ВТ_КПеремещению.ЗаказНаряд,
                   |    ВТ_КПеремещению.Статус,
                   |    ВТ_КПеремещению.ЭтоРеализация,
                   |    ВТ_КПеремещению.ТипЗН,
                   |    ВТ_КПеремещению.Количество,
                   |    ВТ_КПеремещению.Документ.Дата
                   |ИЗ
                   |    ВТ_КПеремещению КАК ВТ_КПеремещению
                   |
                   |ОБЪЕДИНИТЬ
                   |
                   |ВЫБРАТЬ
                   |    ВТ_КПриемкеОтПоставщика.Документ,
                   |    ЗНАЧЕНИЕ(Документ.ЗаказНаряд.ПустаяСсылка),
                   |    ВТ_КПриемкеОтПоставщика.Статус,
                   |    ЛОЖЬ,
                   |    ЛОЖЬ,
                   |    ВТ_КПриемкеОтПоставщика.Заказано,
                   |    ВТ_КПриемкеОтПоставщика.Документ.Дата
                   |ИЗ
                   |    ВТ_КПриемкеОтПоставщика КАК ВТ_КПриемкеОтПоставщика
                   |
                   |ОБЪЕДИНИТЬ
                   |
                   |ВЫБРАТЬ
                   |    ВТ_КРазмещению.Документ,
                   |    ЗНАЧЕНИЕ(Документ.ЗаказНаряд.ПустаяСсылка),
                   |    ВТ_КРазмещению.Статус,
                   |    ЛОЖЬ,
                   |    ЛОЖЬ,
                   |    ВТ_КРазмещению.Количество,
                   |    ВТ_КРазмещению.Документ.Дата
                   |ИЗ
                   |    ВТ_КРазмещению КАК ВТ_КРазмещению
                   |
                   |ОБЪЕДИНИТЬ ВСЕ
                   |
                   |ВЫБРАТЬ
                   |    ВТ_КВозврату.Документ,
                   |    ВТ_КВозврату.ЗаказНаряд,
                   |    ВТ_КВозврату.Статус,
                   |    ВТ_КВозврату.ЭтоРеализация,
                   |    ВТ_КВозврату.ТипЗН,
                   |    ВТ_КВозврату.Количество,
                   |    ВТ_КВозврату.Документ.Дата
                   |ИЗ
                   |    ВТ_КВозврату КАК ВТ_КВозврату
                   |
                   |УПОРЯДОЧИТЬ ПО
                   |    Дата
                   |АВТОУПОРЯДОЧИВАНИЕ";

    Пакет = Запрос.ВыполнитьПакет();
    Кол = Пакет.Количество();

	ДокументыТЗ = Пакет[Кол - 2].Выгрузить();
	ДокументыТЗ.Свернуть("Документ");
	ДокументыМасс = ДокументыТЗ.ВыгрузитьКолонку("Документ");
	
	// Подменяем док. корректировок на поступления
	
	ПоступленияКорректировки = Новый Соответствие;
	
	Для каждого Док Из ДокументыМасс Цикл
	
		Если ТипЗнч(Док) <> Тип("ДокументСсылка.КорректировкаПоступления") Тогда
			Продолжить;
		КонецЕсли;
		
		тДок = Док;
		Сч = 0;
		Пока ТипЗнч(тДок) <> Тип("ДокументСсылка.ПоступлениеТоваров") Цикл
			тДок = тДок.ДокументОснование;
			
			Сч = Сч + 1;
			Если Сч > 50 Тогда
				Прервать;
			КонецЕсли;
		КонецЦикла;
		
		ПоступленияКорректировки.Вставить(Док, тДок);
		
	КонецЦикла;
	
	ТоварыТЗ = Пакет[Кол - 2].Выгрузить();
	СписокДокументовТЗ = Пакет[Кол - 1].Выгрузить();	
	
	Для каждого КлючЗначение Из ПоступленияКорректировки Цикл
		
		Отбор = Новый Структура("Документ", КлючЗначение.Ключ);
		
		Для каждого стр Из ТоварыТЗ.НайтиСтроки(Отбор) Цикл
			стр.Документ = КлючЗначение.Значение;
		КонецЦикла;	
			
		Для каждого стр Из СписокДокументовТЗ.НайтиСтроки(Отбор) Цикл
			стр.Документ = КлючЗначение.Значение;
		КонецЦикла;	
		
	КонецЦикла;
	
	ТоварыТЗ.Свернуть("Документ, ЗаказНаряд, Номенклатура, ХарактеристикаНоменклатуры, Артикул, Статус", "Количество");
	СписокДокументовТЗ.Свернуть("Дата, Документ, ЗаказНаряд, Статус, ЭтоРеализация, ТипЗН", "Количество");
	
	// В результате свертки могут появится строки с нулевым или отрицательным количеством
	
	Запрос = Новый Запрос;
	
	Запрос.УстановитьПараметр("ТоварыТЗ", ТоварыТЗ);
	Запрос.УстановитьПараметр("СписокДокументовТЗ", СписокДокументовТЗ);

    Запрос.Текст = "ВЫБРАТЬ *  ПОМЕСТИТЬ ВТ_Товары ИЗ &ТоварыТЗ КАК ТоварыТЗ ГДЕ ТоварыТЗ.Количество > 0;
					|ВЫБРАТЬ * ПОМЕСТИТЬ ВТ_СписокДокументов ИЗ &СписокДокументовТЗ КАК СписокДокументовТЗ ГДЕ СписокДокументовТЗ.Количество > 0;
					|ВЫБРАТЬ * ИЗ ВТ_Товары; ВЫБРАТЬ * ИЗ ВТ_СписокДокументов";

    Результат = Запрос.ВыполнитьПакет();

    Товары.Загрузить(Результат[2].Выгрузить());
    СписокДокументов.Загрузить(Результат[3].Выгрузить());

КонецПроцедуры

