// Процедура - обработчик ввода на основании
Процедура ОбработкаЗаполнения(Основание) Экспорт
	
	Если НЕ дкОбработкаЗаполнения(ЭтотОбъект, Основание) Тогда Возврат; КонецЕсли;
	
	ТипОснования = ТипЗнч(Основание);
	Если ТипОснования = Тип("ДокументСсылка.ИзменениеПоказателейМаркетинговыхПрограмм") Тогда
		ЭтотОбъект.ХозОперация = Справочники.ХозОперации.КорректировкаПоказателейМаркетиновыхПрограмм;
 	Иначе
		ЭтотОбъект.ХозОперация = Справочники.ХозОперации.ИзменениеПоказателейМаркетиновыхПрограмм;
	КонецЕсли;
		
 	ЭтотОбъект.ДатаНачалаДействия = ТекущаяДата();
    
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, Режим)
	
	Движения.ПоказателиМаркетинговыхПрограмм.Очистить();
	
	Для Каждого ТекСтрокаСостав Из Состав Цикл
		Движение = Движения.ПоказателиМаркетинговыхПрограмм.Добавить();
		Движение.Период = ДатаНачалаДействия;
		Движение.МаркетинговаяПрограмма = ТекСтрокаСостав.МаркетинговаяПрограмма;
		Если обЗначениеНеЗаполнено(ТекСтрокаСостав.Автомобиль) Тогда
			Движение.Модель = ТекСтрокаСостав.Модель;
			Движение.ВариантКомплектации = ТекСтрокаСостав.ВариантКомплектации;
		Иначе	
			Движение.Автомобиль = ТекСтрокаСостав.Автомобиль;
 		КонецЕсли;
 		Движение.РазмерБонуса = ТекСтрокаСостав.РазмерБонуса;
		Движение.РазмерСкидки = ТекСтрокаСостав.РазмерСкидки;
		//Бондаренко++ 20241115
		Движение.РазмерПерепродажи = ТекСтрокаСостав.РазмерПерепродажи;
		//Бондаренко-- 20241115
		//Бондаренко++ 20250531
		Движение.РазмерБонусаРетро = ТекСтрокаСостав.РазмерБонусаРетро;
		Движение.РазмерБонусаТекущего = ТекСтрокаСостав.РазмерБонусаТекущего;
		//Бондаренко-- 20250531
		//Бондаренко-- 20250822
		Движение.УдержаниеКомпенсации = ТекСтрокаСостав.УдержаниеКомпенсации;  
		//Иванченко 20251105 ++
		Движение.Отменена = Отменена; 
		//Иванченко 20251105 --		
		//Бондаренко-- 20250822
	КонецЦикла;                      
 
КонецПроцедуры

Функция ОбработкаРеквизита(Имя,ТекСтрока=Неопределено,ЭтаФорма=Неопределено,ДопПараметры=Неопределено) Экспорт
	// ОБРАБОТКА РЕКВИЗИТОВ ДОКУМЕНТА 
 	Если Имя="Дата" Тогда		
		Рез=дкОбработкаРеквизита(ЭтотОбъект,Имя,ТекСтрока,ЭтаФорма,ДопПараметры);
 		Возврат Рез;
    ИначеЕсли Имя="Организация" Тогда
		Рез=дкОбработкаРеквизита(ЭтотОбъект,Имя,ТекСтрока,ЭтаФорма,ДопПараметры);
  		Возврат Рез;
 	ИначеЕсли Имя="ПодразделениеКомпании" Тогда
		Рез=дкОбработкаРеквизита(ЭтотОбъект,Имя,ТекСтрока,ЭтаФорма,ДопПараметры);
	ИначеЕсли Имя = "ПрограммаБрокерФинанс" Тогда
		Рез=дкОбработкаРеквизита(ЭтотОбъект,Имя,ТекСтрока,ЭтаФорма,ДопПараметры);
		Если НЕ обЗначениеНеЗаполнено(ПрограммаБрокерФинанс) Тогда
			Если НЕ обЗначениеНеЗаполнено(МаркетинговаяПрограмма) Тогда
				МаркетинговаяПрограмма = "";
 			КонецЕсли;
  		КонецЕсли;
		Возврат Рез;
	КонецЕсли;
КонецФункции	

//Бондаренко-- 20250522
 Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	ЭтоНовыйОбъект = Ложь;
	Попытка
	    ЭтоНовыйОбъект = ЭтотОбъект.ЭтоНовый();
 	Исключение
 	КонецПопытки; 
	Если ЭтоНовыйОбъект Тогда
		Попытка
 			ЭтотОбъект.СМ_Создатель = ПараметрыСеанса.Пользователь;
 		Исключение
		КонецПопытки;
		Попытка
 			ЭтотОбъект.СМ_ДатаСоздания = ТекущаяДата();
 		Исключение
 		КонецПопытки;
	КонецЕсли; 
	
	Для каждого Стр Из Состав Цикл
		Если ТипЗНЧ(Стр.МаркетинговаяПрограмма) = Тип("СправочникСсылка.ПрограммыБрокерФинанс") Тогда
			Если Стр.РазмерБонуса > 0 Тогда
				Если Стр.РазмерБонусаРетро > 0 Тогда
					СМГ_Сообщить("ОШИБКА! В строке "+Стр.НомерСтроки+
					" Размер бонуса в инвойсе след. авто = "+Стр.РазмерБонуса+
					" и Размер бонуса ретро. = "+Стр.РазмерБонусаРетро,СтатусСообщения.ОченьВажное);
					Отказ = Истина;
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;	
	
КонецПроцедуры
//Бондаренко-- 20250522  

 

	// Возвращает список возможных хозяйственных операций документа
// Возвращаемое значение: 
//  СписокЗначений. 
//  Строка списка: Значение - имя предопределенного элемента; 
//				   Представление - красивое его представление
// 				   "Помеченная" строка - ХО по умолчанию.
Функция ПолучитьСписокХозОпераций() Экспорт
	СписокХозОпераций = Новый СписокЗначений;
	СписокХозОпераций.Добавить("ИзменениеПоказателейМаркетиновыхПрограмм","Изменение показателей Маркетиновых программ");
	СписокХозОпераций.Добавить("КорректировкаПоказателейМаркетиновыхПрограмм","Корректировка показателей Маркетиновых программ");
	//Иванченко 20251105 ++
	СписокХозОпераций.Добавить("ОтменаДействияМаркетиновыхПрограмм", "Отмена действия Маркетинговых программ");
	//Иванченко 20251105 --
	Возврат СписокХозОпераций;
КонецФункции // ПолучитьСписокХозОпераций()


 



   