
&НаКлиенте
Процедура ОкруглитьВремяНачала()
	
	МинутаНачала = Минута(Объект.Начало);
	ЧасНачала = Час(Объект.Начало);
	Если МинутаНачала <= 15 Тогда
		МинутаНачала = 0
	ИначеЕсли МинутаНачала <= 45 Тогда
		МинутаНачала = 30
	Иначе
		МинутаНачала = 60;
	КонецЕсли;
	Если ЧасНачала < 6 Тогда
		ЧасНачала = 6;
		МинутаНачала = 0;
	КонецЕсли;
	Объект.Начало = Дата(1,1,1) + ЧасНачала*3600 + МинутаНачала*60
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Если НЕ ЗначениеЗаполнено(Объект.Ссылка) Тогда
		ОкруглитьВремяНачала();
		Объект.ВремяНапоминания = Объект.Начало - ВремяДоСобытия*3600;
	КонецЕсли;
	СтатусДокументаПриИзменении();
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	//Временно
	ВремяДоСобытия = 2; //Константы.CRM_ВремяДоСобытияДляНапоминаний.Получить();
	Если НЕ ЗначениеЗаполнено(Объект.Ссылка) Тогда
		Если Параметры.Свойство("ДатаНачала") Тогда
			Объект.Начало = Параметры.ДатаНачала;
			Объект.ДатаПроведения = Параметры.ДатаНачала;
		КонецЕсли;
		Если НЕ ЗначениеЗаполнено(Объект.ДатаПроведения) Тогда
			Объект.ДатаПроведения = ТекущаяДата()
		КонецЕсли;
		Если Параметры.Свойство("Автомобиль") Тогда
			Объект.Автомобиль = Параметры.Автомобиль;
		КонецЕсли;
		Если Параметры.Свойство("Клиент") Тогда
			Объект.Клиент = Параметры.Клиент;
		КонецЕсли;
		Если Параметры.Свойство("Менеджер") Тогда
			Объект.Менеджер = Параметры.Менеджер;
		КонецЕсли;
		Если Параметры.Свойство("РабочийЛист") Тогда
			Объект.РабочийЛист = Параметры.РабочийЛист;
		КонецЕсли;
		Если Параметры.Свойство("Отдел") тогда
			Объект.Отдел = Параметры.Отдел;
		КонецЕсли;
		Объект.Продолжительность = 20;
		Объект.Организация = ПараметрыСеанса.Организация;
		Объект.Подразделение = ПараметрыСеанса.ПодразделениеКомпании;
		//Организацию и подразделение - если не заполнены в пользователе - берем первые попавшиеся из справочника
		Если НЕ ЗначениеЗаполнено(Объект.Организация) Тогда
			Запрос = Новый Запрос;
			Запрос.Текст =
			"ВЫБРАТЬ ПЕРВЫЕ 1
			|	Организации.Ссылка
			|ИЗ
			|	Справочник.Организации КАК Организации
			|
			|УПОРЯДОЧИТЬ ПО
			|	Организации.Наименование";
			Выборка = Запрос.Выполнить().Выбрать();
			Если Выборка.Следующий() Тогда
				Объект.Организация = Выборка.Ссылка;
			КонецЕсли;
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = "В карточке пользователя не указана организация";
			Сообщение.Сообщить();
		КонецЕсли;
		Если НЕ ЗначениеЗаполнено(Объект.Организация) Тогда
			Запрос = Новый Запрос;
			Запрос.Текст =
			"ВЫБРАТЬ ПЕРВЫЕ 1
			|	ПодразделенияКомпании.Ссылка
			|ИЗ
			|	Справочник.ПодразделенияКомпании КАК ПодразделенияКомпании
			|
			|УПОРЯДОЧИТЬ ПО
			|	ПодразделенияКомпании.Наименование";
			Выборка = Запрос.Выполнить().Выбрать();
			Если Выборка.Следующий() Тогда
				Объект.Организация = Выборка.Ссылка;
			КонецЕсли;
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = "В карточке пользователя не указано подразделение";
			Сообщение.Сообщить();
		КонецЕсли;
		Объект.Маршрут = Справочники.CRM_МаршрутыТестДрайва.МаршрутПоУмолчанию;
		Объект.Автор = ПараметрыСеанса.Пользователь;
		Объект.ТипТестДрайва = Перечисления.CRM_ТипыТестДрайвов.ЧастноеЛицо;
		Объект.ВыдатьНапоминание = Истина;
		ОпределитьПользователяНапоминания();
	КонецЕсли;
	
	Если Объект.КодыКомментариев.Количество() > 0 Тогда
		Элементы.Анкета.Видимость = Ложь;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура НачалоРегулирование(Элемент, Направление, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	Объект.Начало = Объект.Начало + Направление*1800;
	ОкруглитьВремяНачала();
	ОпределитьВремяНапоминания()
	
КонецПроцедуры

&НаКлиенте
Процедура КлиентНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ОткрытьФорму("Обработка.CRM_РабочийСтол.Форма.ФормаВыбораКлиента", , ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбора(ВыбранноеЗначение, ИсточникВыбора)
	
	Если ИсточникВыбора.ИмяФормы = "Обработка.CRM_РабочийСтол.Форма.ФормаВыбораКлиента" Тогда
		Объект.Клиент = ВыбранноеЗначение
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Анкета(Команда)
	
	Форма = ПолучитьФорму("Документ.CRM_ЗаписьНаТестДрайв.Форма.ФормаАнкета", , ЭтаФорма);
	Если Форма.ОткрытьМодально() = Истина Тогда
		Если Форма.ОтказОтАнкетирования Тогда
			Объект.ОтказОтАнкетирования = Истина;
		Иначе
			Для Каждого Стр Из Форма.Анкета Цикл
				Если Стр.Плохо ИЛИ Стр.Хорошо ИЛИ Стр.Отлично Тогда
					СтрРезультат = Объект.КодыКомментариев.Добавить();
					СтрРезультат.Показатель = Стр.Показатель;
					Если Стр.Плохо Тогда
						СтрРезультат.Результат = ПредопределенноеЗначение("Перечисление.CRM_ОценкаУдовлетворенностиКлиента.Плохо");
					ИначеЕсли Стр.Хорошо Тогда
						СтрРезультат.Результат = ПредопределенноеЗначение("Перечисление.CRM_ОценкаУдовлетворенностиКлиента.Хорошо");
					КонецЕсли;
				КонецЕсли;
			КонецЦикла;
			Объект.КомментарийРезультата = Форма.Комментарий;
		КонецЕсли;
		Элементы.Анкета.Видимость = Ложь;
		Модифицированность = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СотрудникПриИзменении(Элемент)
	
	ОпределитьПользователяНапоминания()
	
КонецПроцедуры

&НаСервере
Процедура ОпределитьПользователяНапоминания()
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Менеджер", Объект.Менеджер);
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Пользователи.Ссылка
	|ИЗ
	|	Справочник.Пользователи КАК Пользователи
	|ГДЕ
	|	Пользователи.Сотрудник = &Менеджер
	|	И Пользователи.Сотрудник <> ЗНАЧЕНИЕ(Справочник.Сотрудники.ПустаяСсылка)";
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Объект.ПользовательНапоминания = Выборка.Ссылка;
	Иначе
		Объект.ПользовательНапоминания = Объект.Автор;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОпределитьВремяНапоминания()
	
	Объект.ВремяНапоминания = Объект.Начало - ВремяДоСобытия*3600;
	
КонецПроцедуры

&НаКлиенте
Процедура ПользовательНапоминанияПриИзменении(Элемент)
	
	Если НЕ ЗначениеЗаполнено(Объект.ПользовательНапоминания) Тогда
		ОпределитьПользователяНапоминания()
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВремяНапоминанияПриИзменении(Элемент)
	
	Если НЕ ЗначениеЗаполнено(Объект.ВремяНапоминания) ИЛИ Объект.ВремяНапоминания > Объект.Начало Тогда
		ОпределитьВремяНапоминания()
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура НачалоПриИзменении(Элемент)
	
	ОпределитьВремяНапоминания()
	
КонецПроцедуры

&НаКлиенте
Процедура ВыдатьНапоминаниеПриИзменении(Элемент)
	
	Элементы.ПользовательНапоминания.Доступность = Объект.ВыдатьНапоминание;
	Элементы.ВремяНапоминания.Доступность = Объект.ВыдатьНапоминание;
	
КонецПроцедуры

&НаКлиенте
Процедура ВыбратьМаршрут(Команда)
	
	ВвестиЗначение(Объект.Маршрут);
	
КонецПроцедуры

&НаКлиенте
Процедура СтатусДокументаПриИзменении()
		
	Элементы.ДосрочноеЗавершение.Видимость = 
		(Объект.СтатусДокумента = ПредопределенноеЗначение("Перечисление.СостоянияСобытий.ЗавершеноДосрочно") ИЛИ
		Объект.СтатусДокумента = ПредопределенноеЗначение("Перечисление.СостоянияСобытий.Отменено"));
	
КонецПроцедуры

&НаКлиенте
Процедура ИзмененияСтатуса(Команда)
	
	ОткрытьФорму("РегистрСведений.CRM_СтатусыТД.Форма.ФормаСпискаУпр", Новый Структура("ТестДрайв", Объект.Ссылка), ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ПерейтиВКонфигуратор(Команда)
	
	Если Модифицированность Тогда
		Если Вопрос("Перед переходом в конфигуратор необходимо сохранить изменения. Продолжить?", РежимДиалогаВопрос.ДаНет) = КодВозвратаДиалога.Нет Тогда
			Возврат
		КонецЕсли;
		Записать()
	КонецЕсли;
	Оповестить("ЗагрузитьВКонфигуратор", Объект.Автомобиль);
	Закрыть();
	
КонецПроцедуры

&НаСервере
Функция ЕстьПравоНаПодтверждениеТестДрайва()
	
	Возврат Renault_РаботаСПравамиПользователя.ЕстьПравоНаПодтверждениеДокументаТестДрайв(ПараметрыСеанса.Пользователь);
	//*//CRM_Сервер.ПроверитьПравоПользователя(ПланыВидовХарактеристик.ПраваИНастройки.ПравоНаПодтверждениеДокументаТестДрайв, ПараметрыСеанса.Пользователь);;
	
КонецФункции

&НаСервере
Функция ПолучитьСписокДоступныхСтатусов()
	
	СписокСтатусов = Новый СписокЗначений();
	
	СписокСтатусов.Добавить(Перечисления.CRM_СтатусыТестДрайва.Запланировано);
	СписокСтатусов.Добавить(Перечисления.CRM_СтатусыТестДрайва.Выполняется);
	
	Если ЕстьПравоНаПодтверждениеТестДрайва() Тогда
		
		СписокСтатусов.Добавить(Перечисления.CRM_СтатусыТестДрайва.Завершено);
		СписокСтатусов.Добавить(Перечисления.CRM_СтатусыТестДрайва.ЗавершеноДосрочно);
		СписокСтатусов.Добавить(Перечисления.CRM_СтатусыТестДрайва.Отменено);
		
	КонецЕсли;
	
	Возврат СписокСтатусов;
	
КонецФункции

&НаКлиенте
Процедура СтатусДокументаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	СписокСтатусов = ПолучитьСписокДоступныхСтатусов();
	
	ВыбранныйЭлемент = ВыбратьИзСписка(СписокСтатусов, Элемент, ДанныеВыбора);
	Если ВыбранныйЭлемент <> Неопределено Тогда
		Объект.СтатусДокумента = ВыбранныйЭлемент.Значение;
	КонецЕсли;
КонецПроцедуры
