&НаКлиенте
Процедура ПоказатьДвиженияДокумента(Документ, ТипРегистра, Регистр) Экспорт
	Если ЗначениеЗаполнено(Документ) Тогда
		Если ТипРегистра = "РегистрНакопления" Тогда
			ФормаСписка = РегистрыНакопления[Регистр].ПолучитьФормуСписка();
			ФормаСписка.ЭлементыФормы.РегистрНакопленияСписок.НастройкаОтбора.Регистратор.Доступность = Ложь;
		ИначеЕсли ТипРегистра = "РегистрСведений" Тогда
			ФормаСписка = РегистрыСведений[Регистр].ПолучитьФормуСписка();
			ФормаСписка.ЭлементыФормы.РегистрСведенийСписок.НастройкаОтбора.Регистратор.Доступность = Ложь;
		КонецЕсли;
		
		ФормаСписка.Отбор.Регистратор.ВидСравнения = ВидСравнения.Равно;
		ФормаСписка.Отбор.Регистратор.Значение = Документ;
		ФормаСписка.Отбор.Регистратор.Использование = Истина;		
		
		ФормаСписка.Открыть();
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Функция ПреобразоватьВНомерБСО(Номер) Экспорт
	СтрокаШаблон = "0000000000";
	
	НомерСтрока = Формат(Номер,"ЧГ=0");
	
	ДлинаНомерСтрока = СтрДлина(НомерСтрока);
	ДлинаСтрокаШаблон = СтрДлина(СтрокаШаблон);
	
	КоличествоНачальныхСимволов = ДлинаСтрокаШаблон - ДлинаНомерСтрока;
	
	НомерРезультат = Лев(СтрокаШаблон, КоличествоНачальныхСимволов)+НомерСтрока;
	
	Возврат НомерРезультат; 
КонецФункции

&НаСервере
Функция ЗначениеРеквизитаСущности(Сущность, Реквизит) Экспорт
	Возврат Сущность[Реквизит];	
КонецФункции

&НаСервере
Процедура ЗаполнитьЗначениямиПоУмолчанию(Объект) Экспорт
	Организация = ПараметрыСеанса.Организация;
	
	Если НЕ ЗначениеЗаполнено(Организация) Тогда
		Организация = Справочники.Организации.ОсновнаяОрганизация;	
	КонецЕсли;
	
	Подразделение = ПараметрыСеанса.ПодразделениеКомпании;
	
	Если НЕ ЗначениеЗаполнено(Подразделение) Тогда
		Подразделение =  Справочники.ПодразделенияКомпании.ОсновноеПодразделение;	
	КонецЕсли;
	
	Автор = ПараметрыСеанса.Пользователь;
	
	Объект.Автор = Автор;
	Объект.Организация = Организация;
	Объект.Подразделение = Подразделение;
	Объект.Дата = ТекущаяДата();
КонецПроцедуры



























