Процедура RenaultFlotte_ОбменКомментариями() Экспорт
	Попытка 	
		УстановитьПривилегированныйРежим(Истина);
		
		Прокси = RenaultFlotte_ОбщегоНазначения.ПолучитьПрокси();
		Сервер = СтрокаСоединенияИнформационнойБазы();
		ДатаПоследнейОтправки = Константы.RenaultFlotte_ДатаУспешнойОтправкиКомментариев.Получить();
		ДатаПоследнейЗагрузки = Константы.RenaultFlotte_ДатаУспешнойЗагрузкиКомментариев.Получить();
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	RenaultFlotte_ИсторияКомментариев.Период,
		|	RenaultFlotte_ИсторияКомментариев.Объект Как ИдОбъекта,
		|	RenaultFlotte_ИсторияКомментариев.Автор,
		|	RenaultFlotte_ИсторияКомментариев.Сообщение
		|ИЗ
		|	РегистрСведений.RenaultFlotte_ИсторияКомментариев КАК RenaultFlotte_ИсторияКомментариев
		|ГДЕ
		|	RenaultFlotte_ИсторияКомментариев.Период >= &Период";
		Запрос.УстановитьПараметр("Период", ДатаПоследнейОтправки);
		ТаблицаКомментарии = Запрос.Выполнить().Выгрузить();
		
		Если ТаблицаКомментарии.Количество() > 0 Тогда
			МассивТипов = Новый Массив;
			МассивТипов.Добавить(Тип("Строка"));
			МассивТипов.Добавить(Тип("УникальныйИдентификатор"));
			ОписаниеТипа = Новый ОписаниеТипов(МассивТипов);
			ТаблицаКомментарии.Колонки.ДОбавить("ИдАвтора", ОписаниеТипа);
			ТаблицаКомментарии.Колонки.ДОбавить("BIR", Новый ОписаниеТипов("Строка",,,,Новый КвалификаторыСтроки(20)));
			
			Для Каждого СтрокаТаблицы Из ТаблицаКомментарии Цикл
				СтрокаТаблицы.ИдАвтора = СтрокаТаблицы.Автор;
				Если ТипЗнч(СтрокаТаблицы.Автор) = Тип("СправочникСсылка.CRM_ДилерскиеЦентры") Тогда
					СтрокаТаблицы.ИдАвтора = СтрокаТаблицы.Автор.УникальныйИдентификатор();
					СтрокаТаблицы.BIR = СтрокаТаблицы.Автор.BIR;
				КонецЕсли;
			КонецЦикла;
			ТаблицаКомментарии.Колонки.Удалить("Автор");
			
			ТаблицаXDTO = СериализаторXDTO.ЗаписатьXDTO(ТаблицаКомментарии);	
			Прокси.PutComments(Сервер, ТаблицаXDTO);
			Константы.RenaultFlotte_ДатаУспешнойОтправкиКомментариев.Установить(ТекущаяУниверсальнаяДата());
		КонецЕсли;
		
		ВыборкаДилерскиеЦентры = Справочники.CRM_ДилерскиеЦентры.Выбрать();
		Пока ВыборкаДилерскиеЦентры.Следующий() Цикл
			ИдДилерскогоЦентра = ВыборкаДилерскиеЦентры.Ссылка.УникальныйИдентификатор();
			BIR = ВыборкаДилерскиеЦентры.BIR;
			Данные = Прокси.GetComments(Сервер, ИдДилерскогоЦентра, ДатаПоследнейЗагрузки, BIR);
			Сериализатор = Новый СериализаторXDTO(ФабрикаXDTO);
			ТаблицаДанных = СериализаторXDTO.ПрочитатьXDTO(Данные);
			МассивОбработанных = Новый Массив;
			
			Для Каждого Пакет из ТаблицаДанных Цикл
				ОбработатьПакет(Пакет, Прокси);
				МассивОбработанных.Добавить(Пакет.МоментВремени);			
			КонецЦикла;
			
			МассивОбработанныхОбъектXDTO = Сериализатор.ЗаписатьXDTO(МассивОбработанных);
			
			Прокси.ConfirmProcessingClient(МассивОбработанныхОбъектXDTO, ИдДилерскогоЦентра, BIR);
		КонецЦикла;
		
		Константы.RenaultFlotte_ДатаУспешнойЗагрузкиКомментариев.Установить(ТекущаяУниверсальнаяДата());
	Исключение
		Инфо = ИнформацияОбОшибке();
		ЗаписьЖурналаРегистрации(
		"КорпЗагрузкаДанных.ОбменКомментариями",
		УровеньЖурналаРегистрации.Ошибка,,,
		ПодробноеПредставлениеОшибки(Инфо));
		ВызватьИсключение;
	КонецПопытки;	
КонецПроцедуры

Процедура ОбработатьПакет(ДанныеСообщения, Прокси)
	
	ДвоичныеДанныеФайла = ДанныеСообщения.Данные.Получить();
	ИмяВременногоФайла = ПолучитьИмяВременногоФайла("xml");
	ДвоичныеДанныеФайла.Записать(ИмяВременногоФайла);
	ЧтениеXML = Новый ЧтениеXML;
	ЧтениеXML.ОткрытьФайл(ИмяВременногоФайла);
	ЧтениеXML.Прочитать();
 	ЧтениеXML.Прочитать(); // пропуск тэга Message
	Пока ЧтениеXML.ТипУзла = ТипУзлаXML.НачалоЭлемента Цикл
		ТипXDTO = Прокси.ФабрикаXDTO.Тип(ДанныеСообщения.ПространствоИменДанных, ЧтениеXML.Имя);
		ОбъектXDTO = Прокси.ФабрикаXDTO.ПрочитатьXML(ЧтениеXML, ТипXDTO);
		СтрокаДляВыполнения = ДанныеСообщения.ИмяКомандыОбработки + "(ОбъектXDTO);";
		Выполнить(СтрокаДляВыполнения);
	КонецЦикла;
	ЧтениеXML.Закрыть();
	УдалитьФайлы(ИмяВременногоФайла);

КонецПроцедуры

Процедура ЗагрузитьКомментарииКорпоративныеПродажи(ОбъектXDTO)
	
	ТаблицаКомментарий = СериализаторXDTO.ПрочитатьXDTO(ОбъектXDTO);
	
	Для Каждого СтрокаТаблицы из ТаблицаКомментарий Цикл 
		//BIR   = СтрокаТаблицы.BIR;
		//Автор = Справочники.CRM_ДилерскиеЦентры.НайтиПоРеквизиту("BIR",BIR);
		//Если Автор.Пустая() Тогда
		//	Автор = BIR;
		//КонецЕсли;
		
		Если ТипЗнч(СтрокаТаблицы.ИдАвтора) = Тип("Строка") Тогда
			Автор = СтрокаТаблицы.ИдАвтора;
		Иначе
			Автор = Справочники.CRM_ДилерскиеЦентры.ПолучитьСсылку(Новый УникальныйИдентификатор(СтрокаТаблицы.ИдАвтора));
		КонецЕсли;
		
		РегистрыСведений.RenaultFlotte_ИсторияКомментариев.ДобавитьКомментарий(
		СтрокаТаблицы.ИдОбъекта,
		СтрокаТаблицы.Сообщение,
		Автор,
		СтрокаТаблицы.Период);
		
	КонецЦикла;
	
КонецПроцедуры