#Область ОбработчикиСобытийФормыИЭлементов

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Попытка 
		Настройки = ХранилищеОбщихНастроек.Загрузить("ПомощникАвтобизнеса","ГрупповыеПроценки",,ПользователиИнформационнойБазы.ТекущийПользователь().Имя);
	Исключение
		Настройки = Новый СписокЗначений;
	КонецПопытки;
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	НомерЛиста=1;
	Начальнаястрока=1;
	ОбновитьНастройки(Неопределено);
КонецПроцедуры

&НаКлиенте
Процедура ФайлЗагрузкиНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	Оповещение=Новый ОписаниеОповещения("ФайлЗагрузкиВыбор",ЭтаФорма);
	Диалог = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	Диалог.Заголовок = "Выберите файл";
	Диалог.ПолноеИмяФайла = ""; 
	Диалог.Фильтр = "Файлы Excel (*.xls,*.xlsx)|*.xls;*.xlsx|XLSX (*.xlsx)|*.xlsx|XLS (*.xls)|*.xls"; 
    Диалог.МножественныйВыбор = Ложь;
	Диалог.Показать(Оповещение);
КонецПроцедуры

&НаКлиенте
Процедура ФайлЗагрузкиВыбор(Файлы, Доп) Экспорт
	Если Файлы=Неопределено или Файлы.Количество()=0 Тогда Возврат;КонецЕсли;
	ФайлЗагрузки = Файлы[0];
	
	ФайлНаДиске = Новый Файл(ФайлЗагрузки);
	Если НЕ ФайлНаДиске.Существует() Тогда	   
		Сообщить("Файл не существует!");	   
	КонецЕсли;
	
	Попытка	   
		Excel = Новый COMОбъект("Excel.Application");
		Excel.WorkBooks.Open(ФайлЗагрузки);	
		ExcelЛист = Excel.Sheets(НомерЛиста);	   
		ExcelЛист.Activate();
	Исключение	   
		Сообщить("Ошибка при открытии файла Excel. "+ОписаниеОшибки()); 
		Возврат;
	КонецПопытки;
	Если Заказ.ВысотаТаблицы>0 Тогда
		ОчиститьЗаказНаСервере(Заказ);
	КонецЕсли;
	Состояние("Чтение данных из документа Excel ...");
	Попытка
		xlLastCell = 11;   	
		ActiveCell = Excel.ActiveCell.SpecialCells(xlLastCell);   
		Строк = ActiveCell.Row;   
		Колонок = ActiveCell.Column + ActiveCell.Count - 1;
		Для КолНом = 1 По Колонок Цикл
			Заказ.Область("C"+КолНом).ШиринаКолонки=ExcelЛист.Columns(КолНом).ColumnWidth;
		КонецЦикла;
		
		МаксСтр=0;
		Для СтрНом = 1 По Строк Цикл
			Если (СтрНом-МаксСтр)>50 И МаксСтр>2 Тогда Прервать;КонецЕсли;
			СтрН=Формат(СтрНом,"ЧГ=");
			Для КолНом = 1 По Колонок Цикл
				Ячейка="R"+СтрН+"C"+КолНом;
				Текст=ExcelЛист.Cells(СтрНом,КолНом).Text;
				Если Не ПустаяСтрока(Текст) Тогда
					МаксСтр=СтрНом;
					Заказ.Область(Ячейка+":"+Ячейка).Текст = Текст;
				КонецЕсли;
			КонецЦикла;
		КонецЦикла;	
		Состояние("Чтение данных завершено ...");
	Исключение
		Сообщить(ОписаниеОшибки());
		Состояние();
	КонецПопытки;
	//Excel.WorkBooks.Close();   
    Excel.DisplayAlerts = 0;
    Excel.Quit();
    Excel.DisplayAlerts = 1;
	Excel = Неопределено;

КонецПроцедуры

&НаСервере
Процедура ОчиститьЗаказНаСервере(Заказ)
	Заказ.Очистить();
КонецПроцедуры

&НаКлиенте
Процедура КолонкаЦеныДляСравненияПриИзменении(Элемент)
	Элементы.ОтклонениеОтЦены.Доступность=КолонкаЦеныДляСравнения<>0;
КонецПроцедуры

&НаКлиенте
Процедура НачальнаяСтрокаПриИзменении(Элемент)
	Если НачальнаяСтрока>1 Тогда Заказ.ФиксацияСверху=НачальнаяСтрока-1;КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ЗагрузитьНастройки(Команда)
	Если Настройки.Количество()=0 Тогда
		Сообщить("Нет сохраненных настроек");
	Иначе
		Оповещение=Новый ОписаниеОповещения("ЗагрузкаНастройки",ЭтаФорма);
		ПараметрыФормы=Новый Структура("СписокЗначений,Групповой,ТекущаяСтрока,Заголовок",
		Настройки,Ложь,0,"Загрузить настройки");
		ОткрытьФорму(Объект.ВнешняяОбработка+".Nirax_ПомощникАвтобизнесаОбщий.Форма.ФормаСпискаУФ",
		ПараметрыФормы,ЭтаФорма,,ВариантОткрытияОкна.ОтдельноеОкно,,Оповещение,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузкаНастройки(Строка,Доп) Экспорт
	Если Строка<>Неопределено Тогда
		ИмяНастройки=Строка.Представление;
		ЗаполнитьЗначенияСвойств(ЭтаФорма,Строка.Значение);
		Элементы.ОтклонениеОтЦены.Доступность=КолонкаЦеныДляСравнения<>0;
		Если НачальнаяСтрока>1 Тогда Заказ.ФиксацияСверху=НачальнаяСтрока-1;КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаСервереБезКонтекста
Процедура СохранитьНастройкиНаСервере(Настройки)
	ХранилищеОбщихНастроек.Сохранить("ПомощникАвтобизнеса","ГрупповыеПроценки",Настройки,,ПользователиИнформационнойБазы.ТекущийПользователь().Имя);
КонецПроцедуры

&НаКлиенте
Процедура СохранитьНастройки(Команда)
	Оповещение=Новый ОписаниеОповещения("СохранениеНастройки",ЭтаФорма);
	ПоказатьВводСтроки(Оповещение, ИмяНастройки, "Введите имя настройки", 25);
КонецПроцедуры

&НаКлиенте
Процедура СохранениеНастройки(Строка,Доп) Экспорт
	Если Строка=Неопределено Тогда Возврат;КонецЕсли;
	СтрНастройки=Неопределено;
	Для Каждого Стр Из Настройки Цикл
		Если Стр.Представление=Строка Тогда
			СтрНастройки=Стр;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	
	Если СтрНастройки<>Неопределено Тогда
		ЕСли Строка <> ИмяНастройки Тогда
			Оповещение=Новый ОписаниеОповещения("СохранениеНастроек",ЭтаФорма,СтрНастройки);
			ПоказатьВопрос(Оповещение, "Настрока с именем: "+Строка+" уже существует. Перезаписать настройку?",	РежимДиалогаВопрос.ДаНет);
		Иначе
			СохранениеНастроек(КодВозвратаДиалога.Да,СтрНастройки);
		КонецЕсли;
	Иначе
		СтрНастройки=Настройки.Добавить(Неопределено,Строка);
		СохранениеНастроек(КодВозвратаДиалога.Да,СтрНастройки);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура СохранениеНастроек(Ответ,СтрНастройки) Экспорт
	Если Ответ=КодВозвратаДиалога.Да Тогда
		СтрНастройки.Значение=Новый Структура("ВыборНоменклатуры, ИспользоватьАналоги, ИспользоватьКомментарии,
		|КолонкаАртикула, КолонкаКоличества, КолонкаНаименования, КолонкаПроизводителя, КолонкаСрокаПоставки,
		|КолонкаЦеныДляСравнения, НачальнаяСтрока, НомерЛиста, ОкруглитьПриНеКратно, ОтклонениеОтЦены,
		|ОчиститьКорзину, ОшибкиВКорзину, ПриоритетАналогов, СрокПоставкиПоУмолчанию");
		ЗаполнитьЗначенияСвойств(СтрНастройки.Значение, ЭтаФорма);
		СохранитьНастройкиНаСервере(Настройки);
	КонецЕсли;
КонецПроцедуры

&НаСервере
Функция ЗаказВКорзинуНаСервере(Заказ,Настройка)
	
	Обработка = РеквизитФормыВЗначение("Объект");
	ответ=Обработка.ПроценкаЗаказа(Заказ,Настройка); 
	ЗначениеВДанныеФормы(Обработка.ЗаявкаНаОформление,Объект.ЗаявкаНаОформление);
	Возврат ответ;  
КонецФункции

&НаКлиенте
Процедура ЗаказВКорзину(Команда)
	ЕСли НЕ ЭтаФорма.ВладелецФормы.ИзменятьКорзину Тогда
		Сообщить("Корзина в режиме просмотра - переключите ее в режим изменения");
		Возврат;
	КонецЕсли;
	
	// Анализ возможности формирования приходной накладной
	Ошибка=?(НачальнаяСтрока = 0,"Начальная строка не должна быть равна нулю."+Символы.ПС,"")+
	?(КолонкаАртикула = 0,"Номер колонки артикула не должен быть равен нулю."+Символы.ПС,"")+
	?(КолонкаПроизводителя = 0,"Номер колонки производителя не должен быть равен нулю."+Символы.ПС,"")+
	?(КолонкаКоличества = 0,"Номер колонки количества не должен быть равен нулю."+Символы.ПС,"")+
	?(Заказ.ВысотаТаблицы < НачальнаяСтрока,"Нет данных в таблице заказа"+Символы.ПС,"");
	Если Ошибка<>"" Тогда 
		ПоказатьПредупреждение(,Ошибка);
		Возврат;
	КонецЕсли;
	Настройка=Новый Структура("ВыборНоменклатуры, ИспользоватьАналоги, ИспользоватьКомментарии,
	|КолонкаАртикула, КолонкаКоличества, КолонкаНаименования, КолонкаПроизводителя, КолонкаСрокаПоставки,
	|КолонкаЦеныДляСравнения, НачальнаяСтрока, НомерЛиста, ОкруглитьПриНеКратно, ОтклонениеОтЦены,
	|ОчиститьКорзину, ОшибкиВКорзину, ПриоритетАналогов, СрокПоставкиПоУмолчанию");
	ЗаполнитьЗначенияСвойств(Настройка, ЭтаФорма);
	Состояние("Выполняется поиск продукции у онлайн-поставщиков. Ждите...");
	
	// Если текущая заявка не корзина - делаем корзину - текущей
	Если ВладелецФормы.Объект.ТекущийЗК <> 0 Тогда
		УстановитьТекущейКорзину();
	ИначеЕсли ОчиститьКорзину Тогда
		ВладелецФормы.Объект.ЗаявкаНаОформление.Очистить();
	КонецЕсли;	
		
	Ошибка=ЗаказВКорзинуНаСервере(Заказ, Настройка);
	
	// Заполняем корзину и рассчитываем сумму и формируем заголовок
	Для Каждого Стр Из Объект.ЗаявкаНаОформление Цикл
		ЗаполнитьЗначенияСвойств(ВладелецФормы.Объект.ЗаявкаНаОформление.Добавить(),Стр);
	КонецЦикла;
	Объект.ЗаявкаНаОформление.Очистить();
	
	ВладелецФормы.Объект.ЗаказыКлиентов[0].Сумма = ВладелецФормы.Объект.ЗаявкаНаОформление.Итог("Всего");
	ВладелецФормы.Элементы.Страницы.ПодчиненныеЭлементы.СтрКорзина.Заголовок="Корзина ("
	+ Строка(ВладелецФормы.Объект.ЗаявкаНаОформление.Количество())+")";
	
	//Попытка
	//	СохранитьДанныеПоКорзине(ВладелецФормы.Объект, ВладелецФормы.ПользовательКорзины);
	//Исключение;
	//Конецпопытки;
	
	ВладелецФормы.Элементы.Страницы.ТекущаяСтраница = ВладелецФормы.Элементы.Страницы.ПодчиненныеЭлементы.СтрКорзина;
	ВладелецФормы.Активизировать();
КонецПроцедуры

&НаСервере
Процедура УстановитьТекущейКорзинуНаСервере(ТекущийЗК,Владелец)
	УстановитьПривилегированныйРежим(Истина);
	Данные=Объект.ЗаявкаНаОформление.Выгрузить();
	ХранилищеОбщихНастроек.Сохранить("ПомощникАвтобизнесаЗК",Строка(ТекущийЗК),Данные,,Владелец);
	Если Не ОчиститьКорзину Тогда
		Данные=ХранилищеОбщихНастроек.Загрузить("ПомощникАвтобизнесаЗК",Строка(0),,Владелец);
		Объект.ЗаявкаНаОформление.Загрузить(Данные);
	КонецЕсли;	
	УстановитьПривилегированныйРежим(Ложь);
КонецПроцедуры

&НаКлиенте
Процедура УстановитьТекущейКорзину()
	Объект.ЗаявкаНаОформление.Очистить();
	Для Каждого Стр Из ВладелецФормы.Объект.ЗаявкаНаОформление Цикл
		ЗаполнитьЗначенияСвойств(Объект.ЗаявкаНаОформление.Добавить(),Стр);
	КонецЦикла;
	
	УстановитьТекущейКорзинуНаСервере(ВладелецФормы.Объект.ТекущийЗК,ВладелецФормы.ПользовательКорзины);
	
	ВладелецФормы.Объект.ТекущийЗК=0;
	ВладелецФормы.Элементы.ЗаказыКлиентов.ТекущаяСтрока=0;
	ВладелецФормы.Объект.ЗаявкаНаОформление.Очистить();
	
	Если Не ОчиститьКорзину Тогда
		// Заполняем корзину 
		Для Каждого Стр Из Объект.ЗаявкаНаОформление Цикл
			ЗаполнитьЗначенияСвойств(ВладелецФормы.Объект.ЗаявкаНаОформление.Добавить(),Стр);
		КонецЦикла;
	КонецЕсли;
	Объект.ЗаявкаНаОформление.Очистить();
КонецПроцедуры

&НаСервере
Процедура СохранитьДанныеПоКорзине(ОбъектДанных,Владелец)
	УстановитьПривилегированныйРежим(Истина);
	Данные=ОбъектДанных.ЗаявкаНаОформление.Выгрузить();
	ХранилищеОбщихНастроек.Сохранить("ПомощникАвтобизнеса","ЗаявкаНаОформление",Данные,,Владелец);
	Данные=ОбъектДанных.ЗаказыКлиентов.Выгрузить();
	ХранилищеОбщихНастроек.Сохранить("ПомощникАвтобизнеса","ЗаказыКлиентов",Данные,,Владелец);
	УстановитьПривилегированныйРежим(Ложь);
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьНастройки(Команда)
	ЗаполнитьЗначенияСвойств(ЭтаФорма.Объект,ЭтаФорма.ВладелецФормы.Объект,
	"ЕстьНоменклатура,НДСПоУмолчанию,СП,УровеньЦенЕмекс,РеквизитНомераДляПоиска,ШаблонНомераДляПоиска,
	|ШаблонНаименования,ШаблонНаименованияП,Конфигурация, ИспользоватьСинонимы,
	|ВидНоменклатуры,ЦеноваяГруппа,БазоваяЕдиницаИзмерения, АртикулОчищать,ВнешняяОбработка");
КонецПроцедуры

#КонецОбласти
