
Процедура Приход(ДокументОбъект) Экспорт
	КодыМаркировки	= ДокументОбъект.КодыМаркировки;
	Товары			= ДокументОбъект.Товары;
	РазборСроки		= Обработки.ШтрихКоды.Создать();
	Для Каждого СтрокаМаркировки Из КодыМаркировки Цикл
		ПоискПозицииМаркировки = Товары.Найти(СтрокаМаркировки.ИдентификаторТовара,"ИдентификаторТовара");
		Если ПоискПозицииМаркировки <> Неопределено И ПоискПозицииМаркировки.Номенклатура.ДробноеСписание Тогда 
			СтрокаДвижения						= ДокументОбъект.Движения.УчетКоличестваМаркированнойПродукци.Добавить();
			СтрокаДвижения.ВидДвижения			= ВидДвиженияНакопления.Приход;
			СтрокаДвижения.Период				= ДокументОбъект.Дата;
			СтрокаДвижения.Номенклатура         = ПоискПозицииМаркировки.Номенклатура; 
			КодМаркировки						= СтрокаМаркировки.КодМаркировки;
			СтруктураQRКода						= РазборСроки.РазобратьСтрокуШтрихкодаGS1(КодМаркировки,Ложь,Истина);
			СтрокаДвижения.GTIN                 = СтруктураQRКода.ДанныеШтрихкода["01"].Значение;
			СтрокаДвижения.СерийныйНомер        = СтруктураQRКода.ДанныеШтрихкода["21"].Значение; 
			СтрокаДвижения.КодМаркировкиBase64  = СтрокаМаркировки.КодМаркировкиBase64;
			СтрокаДвижения.ЕдиницаИзмерения     = ПоискПозицииМаркировки.Номенклатура.БазоваяЕдиницаИзмерения;
			СтрокаДвижения.Количество           = ПоискПозицииМаркировки.Номенклатура.ОсновнаяЕдиницаИзмерения.Коэффициент * ПоискПозицииМаркировки.Количество; 
		КонецЕсли;
	КонецЦикла;	
КонецПроцедуры

Процедура Расход(ДокументОбъект) Экспорт 
	КодыМаркировки	= ДокументОбъект.КодыМаркировки;
	Товары			= ДокументОбъект.Товары;
	РазборСроки		= Обработки.ШтрихКоды.Создать();
	Для Каждого СтрокаМаркировки Из КодыМаркировки Цикл
		ПоискПозицииМаркировки = Товары.Найти(СтрокаМаркировки.ИдентификаторТовара,"ИдентификаторТовара");
		Если ПоискПозицииМаркировки <> Неопределено И ПоискПозицииМаркировки.Номенклатура.ДробноеСписание Тогда 
			СтрокаДвижения						= ДокументОбъект.Движения.УчетКоличестваМаркированнойПродукци.Добавить();
			СтрокаДвижения.ВидДвижения			= ВидДвиженияНакопления.Расход;
			СтрокаДвижения.Период				= ДокументОбъект.Дата;
			СтрокаДвижения.Номенклатура         = ПоискПозицииМаркировки.Номенклатура; 
			КодМаркировки						= СтрокаМаркировки.КодМаркировки;
			СтруктураQRКода						= РазборСроки.РазобратьСтрокуШтрихкодаGS1(КодМаркировки,Ложь,Истина);
			СтрокаДвижения.GTIN                 = СтруктураQRКода.ДанныеШтрихкода["01"].Значение;
			СтрокаДвижения.СерийныйНомер        = СтруктураQRКода.ДанныеШтрихкода["21"].Значение; 
			СтрокаДвижения.КодМаркировкиBase64  = СтрокаМаркировки.КодМаркировкиBase64;
			СтрокаДвижения.ЕдиницаИзмерения     = ПоискПозицииМаркировки.Номенклатура.БазоваяЕдиницаИзмерения;
			СтрокаДвижения.Количество           = ПоискПозицииМаркировки.Количество; 
		КонецЕсли;
	КонецЦикла;	
КонецПроцедуры