// <Описание функции>
//
// Параметры:
//  <Параметр1>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//  <Параметр2>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//
// Возвращаемое значение:
//   <Тип.Вид>   - <описание возвращаемого значения>
//
Функция ПолучитьИмяИБ() Экспорт
	ИмяИБ = "";
	СтрокаСоединения = СокрЛП(Врег(СтрокаСоединенияИнформационнойБазы()));
	Если Найти(СтрокаСоединения,"REF") > 0  Тогда
		ПодстрокиСтрокиСоединения  = обРазложитьСтрокуВМассивПодстрок(СтрокаСоединения,";");
		Попытка
			ИмяИБ = СокрЛП(ВРЕГ(ПодстрокиСтрокиСоединения[1]));
		Исключение
			//
		КонецПопытки;	
		ИмяИБ = СтрЗаменить(ИмяИБ,"REF=","");
		ИмяИБ = СтрЗаменить(ИмяИБ,"""","");
	Иначе	
		ПодстрокиСтрокиСоединения  = обРазложитьСтрокуВМассивПодстрок(СтрокаСоединения,"\");
		МаксЗначениеИндекса = ПодстрокиСтрокиСоединения.Количество()-1;
		Попытка
			ИмяИБ = СокрЛП(ВРЕГ(ПодстрокиСтрокиСоединения[МаксЗначениеИндекса]));
		Исключение
			//
		КонецПопытки;	
	КонецЕсли; 
	ИмяИБ = СтрЗаменить(ИмяИБ,"""","");
	
	Возврат ИмяИБ;
	
КонецФункции // ПолучитьИмяИБ()

Функция СкопироватьНаСервер(Категория,МояКартинка,Расширение,ОписаниеОшибки) Экспорт 
	
	ДвоичныеДанные = МояКартинка.Получить();
	// ТекНомер = 0;
	//Запрос = Новый Запрос;
	//Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	//|	НомерФайловВХранилищеСрезПоследних.Номер КАК Номер
	//|ИЗ
	//|	РегистрСведений.НомерФайловВХранилище.СрезПоследних(&ДатаТек, ) КАК НомерФайловВХранилищеСрезПоследних
	//|
	//|УПОРЯДОЧИТЬ ПО
	//|	Номер УБЫВ";
	//Запрос.УстановитьПараметр("ДатаТек",ТекущаяДата());			   
	//Результат = Запрос.Выполнить().Выбрать();
	//
	//Если Результат.Следующий() тогда
	//	ТекНомер = Результат.Номер + 1;
	//Иначе
	//	ТекНомер = 1;
	//КонецЕсли;
	
	ТекНомер = Строка(Новый УникальныйИдентификатор());
	
	Хранилише = Константы.ПустьКХранилищюСканов.Получить();
	ПутьПром = Категория;
	ИмяПапки = Формат(ТекущаяДата(),"ДФ=yyyy-MM");
	ИмяТекИБ = ПолучитьИмяИБ();
	ПолныйПуть = Хранилише+"\"+ИмяТекИБ+"\"+ПутьПром+"\"+ИмяПапки;
	КаталогНаДиске = Новый Файл(ПолныйПуть);
	Если  НЕ КаталогНаДиске.Существует() Тогда
		СоздатьКаталог(КаталогНаДиске.ПолноеИмя);
	КонецЕсли;	
	
	ИмяфайлаДляКопирования=Константы.ПрефиксБазы.Получить()+ТекНомер+Расширение;
	ИмяФайла = КаталогНаДиске.ПолноеИмя+"\"+ИмяфайлаДляКопирования;
	Если ПустаяСтрока(ИмяФайла) Тогда Возврат Неопределено; КонецЕсли;
	Попытка
		ДвоичныеДанные.Записать(ИмяФайла);
	Исключение
		ОписаниеОшибки = ОписаниеОшибки();
		Возврат Неопределено;
	КонецПопытки;
	
	Если Найти(",.BMP,.DIB,.RLE,.JPG,.JPEG,.TIF,.GIF,.PNG,.ICO,.WMF,.EMF,", "," + Врег(Расширение) + ",") > 0 Тогда
		
		ПолныйПутьКпрограмме = "C:\Program Files\ImageMagick\convert.exe";		
		ИмяФайлаПрограммыНаДиске = Новый Файл(ПолныйПутьКпрограмме);
		
		Если   ИмяФайлаПрограммыНаДиске.Существует() Тогда
			
			ИмяФайлаМиниатюры = КаталогНаДиске.ПолноеИмя+"\"+Константы.ПрефиксБазы.Получить()+ТекНомер+"_thumb"+Расширение;
			
			ИмяФайлаUTF = КаталогВременныхФайлов()+"tmpfile"+СокрЛП(СтрЗаменить(ТекущаяУниверсальнаяДатаВМиллисекундах(),Символы.НПП,""))+".jpg"; 
			КопироватьФайл(ИмяФайла,ИмяФайлаUTF);
			
			ИмяКоманды = """C:\Program Files\ImageMagick\convert.exe"""+" """+ИмяФайлаUTF+""" -thumbnail 250x200 "+ИмяФайлаМиниатюры;
			
			Попытка
				ОбщиеСервер.ВыполнитьКомандуНаСервере(ИмяКоманды,ОписаниеОшибки);
				УдалитьФайлы(ИмяФайлаUTF);
			Исключение
				ОписаниеОшибки = ОписаниеОшибки();
			КонецПопытки;	
			
		Иначе			
			ОписаниеОшибки = "ОШИБКА! Файл '"+ПолныйПутьКпрограмме+"' не существует.";			
		КонецЕсли; 
		
	КонецЕсли; 
	
	// Попытка
	//	МенеджерЗаписи = РегистрыСведений.НомерФайловВХранилище.СоздатьМенеджерЗаписи(); 
	//	МенеджерЗаписи.Период   = ТекущаяДата(); 
	//	МенеджерЗаписи.НомерИ = ТекНомер; 
	//	МенеджерЗаписи.Номер = ТекНомер; 
	//	МенеджерЗаписи.Записать(); 
	//Исключение
	//КонецПопытки;
	
	Возврат   ИмяФайла;
КонецФункции //СкопироватьНаСервер()	

Функция НайтиКорень(Элем) Экспорт 
	Если НЕ ЗначениеЗаполнено(Элем.Родитель) Тогда
		Возврат Элем;
	Иначе
		Возврат НайтиКорень(Элем.Родитель);
	КонецЕсли;
КонецФункции
 
Функция ПолучитьФайлИзХранилища (ИмяФайла) Экспорт
	Попытка
		ДвоичныеДанные = Новый ДвоичныеДанные(ИмяФайла) ;
		Хранилище = Новый ХранилищеЗначения (ДвоичныеДанные); 
		Возврат  Хранилище;
	Исключение
		Возврат ""; 
	КонецПопытки;	
	//ДвоичныеДанные = Новый ДвоичныеДанные(ИмяФайла) ;
	//Хранилище = Новый ХранилищеЗначения (ДвоичныеДанные); 
	//Возврат  ДвоичныеДанные.Получить();
	
КонецФункции 

Функция  ПроверкаФайлаVideocap () Экспорт 
	ФайлУстановки = Новый Файл(Константы.ПустьКХранилищюСканов.Получить() + "videocap5fullversetup.exe");
	
	Возврат ФайлУстановки.Существует();
	
КонецФункции	

Функция  УстановкаVideocap () Экспорт 
	
	Каталог = Константы.ПустьКХранилищюСканов.Получить();
	
	//ЗапуститьПриложение("videocap5fullversetup.exe", Каталог, Ложь);
	
	Видео = Новый ХранилищеЗначения (Новый ДвоичныеДанные(Каталог+"videocap5fullversetup.exe"));
	
	Возврат Видео; 
КонецФункции	

Функция УбратьЗапрещенныеСимволыВИменифайла (Имя) Экспорт 
	Имя = СтрЗаменить(Имя,"*",""); 
	Имя = СтрЗаменить(Имя,"|",""); 
	Имя = СтрЗаменить(Имя,"\",""); 
	Имя = СтрЗаменить(Имя,":",""); 
	Имя = СтрЗаменить(Имя,"""",""); 
	Имя = СтрЗаменить(Имя,"<",""); 
	Имя = СтрЗаменить(Имя,">",""); 
	Имя = СтрЗаменить(Имя,"?",""); 
	Имя = СтрЗаменить(Имя,"/",""); 
	Имя = СтрЗаменить(Имя,".",""); 
	
	Возврат Имя;
КонецФункции	

Процедура УдалитьФайлИзХранилища(АдресВременногоХранилища) Экспорт
	Попытка  
		УдалитьФайлы(АдресВременногоХранилища);
	Исключение
		Сообщить(ОписаниеОшибки());
	КонецПопытки;	
КонецПроцедуры

Процедура ВыполнитьКомандуНаСервере(ИмяКоманды,ОписаниеОшибки) Экспорт
	Попытка
		ЗапуститьПриложение(ИмяКоманды,,Истина);
	Исключение	
		ОписаниеОшибки = ОписаниеОшибки();
	КонецПопытки;	
КонецПроцедуры

Функция ПолучитьРасширениеФайла(ИмяФайла) Экспорт
	
	ПозицияПоследнейТочки = 0;
	РасширениеФайла = ИмяФайла;
	
	Пока 1 = 1 Цикл
		
		ПозицияПоследнейТочки = Найти(РасширениеФайла, ".");
		
		Если ПозицияПоследнейТочки = 0 Тогда
			
			Прервать;
			
		Иначе
			
			РасширениеФайла = Сред(РасширениеФайла, ПозицияПоследнейТочки + 1)
			
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат ?(РасширениеФайла = ИмяФайла, "", РасширениеФайла);
	
КонецФункции 

Функция ПолучитьОбрезанноеФото (Путь)  Экспорт 
	Расшир = ПолучитьРасширениеФайла(Путь);
	ИмяБезРасшир = СтрЗаменить(Путь,Расшир,"");
	
	Возврат ИмяБезРасшир + "_thumb"+Расшир;
	
	
КонецФункции	
//Гэндальф---

